{
  "work_id": "angel-beats",
  "count": 25,
  "characters": [
    {
      "id": "yuzuru-otonashi",
      "name": "Yuzuru Otonashi",
      "alt_names": [
        "音無結弦"
      ],
      "role": "protagonist",
      "description": "__Height:__ 176 cm  \n\nOtonashi lost his memory in an accident and thus thinks his life has no meaning. Things start to change for him as the story progresses. He is the main male protagonist of Angel Beats! Armaments Glock 19  \n\n~!In episode 7, Naoi is asked by Yuri to hypnotize him so he can regain his memories. This turns out successful revealing he had a very ill younger sister who was his sole reason for living. After her death, Otonashi decides to become a doctor to cure others who are ill like his sister and starts to study frantically. On his way to take an exam, his train crashes because of a snow storm. This hints that he died at that moment. However in episode 9, it is shown he survives the crash and starts helping the other few survivors as much as he can, since he was studying medicine. He and the survivors are stuck in a dark tunnel and it is only after 7 days that a rescue team arrives. A few minutes before losing all hope, Otonashi signs a paper to donate his organs (and inspires the other survivors to do the same). Otonashi dies soon after, just seconds before the rescue team arrived.  Over the course of the anime, he is the first of the SSS to try and understand Tenshi (Kanade). In the final episode, he confesses his love to her. However, it is revealed that Kanade's reason for coming to that world was she was unable to thank the person who let her live on - the person that donated their heart for a heart transplant.  Kanade reveals that she knew it was Otonashi all along, stating that she realized he did not have a heart in the very first episode when she stabbed him.  They embrace in Kanade's final moments, and she disappears from the world. Otonashi, overwhelmed by grief, screams out her name. !~\n\n~!In the last moments of the final episode, an Otonashi-like figure is walking through a city street. He passes by a figure resembling Kanade, who is humming \"My Song\" (the final song that Iwasawa sings before she disappears). As he walks by, he suddenly stops upon hearing it.  He turns around and walks after her, then runs and reaches out to touch her shoulder. The scene then fades to white, and the anime concludes. !~   \n\n~! In \"another epilogue,\" which is an alternate ending to the original ending of the anime; Otonashi is seen to have remained as the new student president. He faces another soul and inspires him to face up to their past. Though the episode is ambiguous, it is clear Otonashi had decided to remain behind the Purgatory whereas everyone has already left, as he stated in his final Dialogue with Kanade. !~",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24502-TJE8JeOERvj0.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24502
      },
      "rarity": "legendary"
    },
    {
      "id": "yuri-nakamura",
      "name": "Yuri Nakamura",
      "alt_names": [
        "仲村ゆり",
        "Yurippe"
      ],
      "role": "protagonist",
      "description": "__Height__: 165 cm\n\nYuri Nakamura is the founder and leader of the Afterlife-based school organization Shinda Sekai Sensen (SSS). She leads the campaign of the many students who fight against God, whom they blame for their cruel fates. \n\n~!She met [Hinata](https://anilist.co/character/24503/Hideki-Hinata) before Angel discovered him, and managed to convince him to form the SSS (Shinda Sekai Sensen) with her.!~\n\n~!When she was alive, she had three younger siblings, whom she tried to protect, but unfortunately died during a burglary in her house. It has not been revealed how exactly she died, though it is strongly implied that it was via a gun.!~",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22370-pNQxFEv1K7lS.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22370
      },
      "rarity": "legendary"
    },
    {
      "id": "kanade-tachibana",
      "name": "Kanade Tachibana",
      "alt_names": [
        "立華かなで",
        "Angel (天使‚ Tenshi)"
      ],
      "role": "protagonist",
      "description": "__Height__: 150 cm  \n\nKanade Tachibana is the Afterlife School's student council president. She is often referred to as \"Tenshi\" by the SSS, based on both Yuri's belief that she must be a representative of god and the SSS members not knowing her name initially. Though, they continue to called her as \"Tenshi\" after discovering her real name. Her position often puts her at odds with Yuri and the other SSS members as her responsibilities require her to suppress delinquency and disruptive activities. \n\nHer given name, Kanade, as described by Otonashi, literally means \"Playing music\".\n\nTenshi has a variety of self-defense skills at her disposal, which she calls \"Guard Skills\".   \n\n~! __Hand Sonic:__ Calls forth a blade on one hand or both. The blades are capable of slicing through steel. Kanade has shown several variations to its form:\n-  _Version 1:_ Regular shape, resembling a longsword. \n- _Version 2:_ A longer version than the previous, with a curved diamond shape on its tip. \n- _Version 3:_ Shaped like a traditional sai. \n-  _Version 4:_ A variation which is shaped like a lotus flower with no edges other than, perhaps, its petals. Apparently more of a bludgeoning weapon than a slicing one. Tenshi admits to have created it in her attempt to make her weapon \"cuter\". \n- _Version 5:_ Kanade's most recent variation of Hand Sonic. Is basically a pair of pincers secured on the arm by a blue gauntlet-like accessory. She created this version out of Otonashi's advice to make a more ruthless image.\n __Distortion:__ Distorts the path of bullets or any other projectiles around or away from her body.   \n__Delay:__ Creates a sort of after-image for close range. It is effective in dodging melee attacks by confusing the enemy into attacking elsewhere.  \n __Harmonics:__ Makes a clone of herself which is identical to her except the clone has blood-red eyes. Clones created through this ability have their own consciousness and have all the abilities of the original - including Harmonics itself. This ability is apparently sightly glitched, as her clones were shown to rebel against her to the extent of almost killing her.  \n __Absorb:__ A reverse of Harmonics. It allows Kanade to reintegrate Harmonics clones back into the original's body. However, since every clone has their own consciousness, using this poses some risks. The skill uses a command called timewait, which delays the execution. This was created by Yuri as a method of dealing with the clones.\n__Overdrive:__ A passive ability that gives her superhuman strength.   \n__Howling:__ Emits powerful high-frequency, high-amplitude sound-waves from crossed Hand Sonic blades, meant to make an enemy faint. Created by one of the Harmonics clones.   \n__Angel Wings:__ Sprouts wings from her back that can be used to slow descent and let her survive drops such as jumping from the roof of a building. Purely decorational, as she could survive the drop easily to begin with.   \n__Energy Blast:__ This unnamed technique produces a blue explosion that is shot out of her back in a vaguely angel wing-shaped blast. It was stated to be as powerful as a bomb by Naoi, after it demolished a mass of Shadows. !~ \n\n(Episode 13 spoilers)\n~! It is revealed that Kanade was the receiver of the donor heart from Otonashi. Her regret in life was her inability to thank the one who gave her the heart. After the credits, there is a short scene featuring what is assumed to be her and Otonashi reuniting in the real world !~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22369-zC7OgGbfO7b6.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22369
      },
      "rarity": "legendary"
    },
    {
      "id": "hideki-hinata",
      "name": "Hideki Hinata",
      "alt_names": [
        "日向秀樹"
      ],
      "role": "protagonist",
      "description": "Hinata is a bright young guy and everyone likes him for his kindness. He is very popular to new students as he has a helping attitude towards his juniors and newcomers at school. He is comedy relief in some situations and a pervert in others. He will always try to save his comrades if he can and is a reliable force in the team.\n\n~!He is the co-founder of SSS along with Yuri. Hinata is found by Yuri in the afterlife right after his death, and she kept harassing him because she was amused by his reaction. The reason why he nicknamed Yuri &quot;Yurippe&quot; is because she shares same name of his mother during the time he was alive.    In Episode 4, a hint from his past shows that he could have possibly died of drug abuse, though in Track Zero, it is revealed that his cause of death is getting hit by a truck.    When Yui wanted to get married, Hinata stepped up and proposed, seriously, that he wanted to get married to Yui so that she can be happy. This fulfilled Yui&#039;s desire and so she disappeared.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24503-aMw9BnXmEVrP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24503
      },
      "rarity": "legendary"
    },
    {
      "id": "yui-yoshioka",
      "name": "Yui Yoshioka",
      "alt_names": [
        "芳岡ユイ",
        "Yui-nyan"
      ],
      "role": "protagonist",
      "description": "Yui loves to play her guitar. She is a member of Iwasawa and Hisako's band. She is full of life and life of the band itself. She wants to become a pro-musician.    ~!After Iwasawa's disappearance in episode 3, Yui convinces Yuri and the other characters of letting her become the leader of Iwasawa's band. She then takes over guitar and vocals for the band.  Yui was the main focus in Episode 10. Otonashi had decided for her to disappear first in his and Angel's secret plan to help everyone move on by fulfilling any regret they had in life by giving them a chance to experience a normal youth.  In order to find more about Yui, Otonashi needed some time alone with her. It is revealed that when she was little, she was hit in the back by a car and had been paralyzed from the neck down since.  When asked what else she wanted to do when she couldn't move her body, she had wanted to perform a German Suplex, pass 5 people and score a goal in soccer, and hit a home run in baseball. Eventually, she's able to succeed in her first two goals with Otonashi's help, but after 3 days of attempting to hit a home run, Yui gladly gives up since she is satisfied that she was able to move and do activities every day.  When asked again if all the things she wanted to do when she couldn't move her body came true, she said she had wanted to get married since it was a woman's ultimate happiness. Sadly saying that no one wanted to marry her since she couldn't do anything with her paralyzed body, Hinata suddenly shows up and tells her that he would marry her, regardless of her handicap. Happily knowing this, Yui accepts her fate and disappears.!~  ~!* In the special opening credits focusing on Yui (and which doubles as Yui's audition performance), she is seen to play a Gibson SG. * It seems that she doesn't know Naoi as what she stated on Episode 08. * The song played during the scene where Hinata helped Yui to fulfill her last achievement (get married) was \"My most precious treasure\", which was later re-used in Episode 13 (Otonashi confessed his feelings towards Kanade), albeit with slight modifications and a different singer.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24515-4v85Z9CqCe0Y.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24515
      },
      "rarity": "legendary"
    },
    {
      "id": "ayato-naoi",
      "name": "Ayato Naoi",
      "alt_names": [
        "直井文人"
      ],
      "role": "protagonist",
      "description": "The Vice Student Council President.   ~!He became the Student Council President after Kanade got demoted, though becomes the Vice Student Council President again after Kanade is given her status as the Student Council President back.  Naoi was the son of a famous potter.  He had always lived in the shadow of his talented older brother, who was named heir to their family at a young age.  Naoi spent most of his time isolated in his room, until his brother died in an accident.  After his brother's death, Naoi was told that \"It was you who died,\" and thus he took on the role of his brother, undergoing strict training in order to live up to his brother's standards.  Naoi, however, could not compare to his brother, but he worked hard and eventually won an award.  He believed that he would continue to work with his father and eventually become the best potter in Japan.  However, his father was bedridden, and Naoi was forced to tend to his Father, and so was not able to continue working.  Naoi believed that his life was meaningless because he was always living for either his father or his brother.  Naoi then \"joins\" the Battlefront and still acts as the School Vice President. He seems to greatly admire Otonashi, and always listens to him, giving Otonashi the \"Older Brother\" role to Naoi. Naoi also seems to be younger than Otonashi and Yuri, which makes him an underclassman like Yui. He refers to Otonashi as \"Otonashi-san\" and the rest of the Battlefront he usually refers to them as \"You\" and \"Them\", showing respect to Otonashi but disrespect to the others.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b32458-LTnU8CCcCaOu.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 32458
      },
      "rarity": "legendary"
    },
    {
      "id": "takamatsu",
      "name": "Takamatsu",
      "alt_names": [
        "高松"
      ],
      "role": "supporting",
      "description": "Takamatsu is a very calm and composed kind of a guy. He dislikes commotion and wants to avoid trouble as much as possible. His character is mysterious.   ~!In Episode 5, it is revealed that he has a very well built muscular figure compare to his 'genius' looks  In Episode 11, he was eaten by the new enemy, \"Shadow\", and turned into an NPC. During that, he lost his glasses, which is something he never does. He is destined to remain in the world without a soul, performing daily tasks like other NPCs.  In Episode 13, he recovered from being an NPC because of his strong will as stated during the conversation of Yuri and Hinata.!~  ~!Takamatsu's weapons include a SIG SG 552 assault rifle and a Desert Eagle pistol, both of which availed him little in the events of episode 8.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/24504.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24504
      },
      "rarity": "epic"
    },
    {
      "id": "noda",
      "name": "Noda",
      "alt_names": [
        "野田"
      ],
      "role": "supporting",
      "description": "Noda is a self-reliant boy who executes the strategies formed by the SSS and fights with a halberd. He does not listen to anyone other than Yuri, whom he has adoration for, and is antagonistic to almost everyone else. He has a rivalry between Otonashi and himself. He is a complete idiot whose weakness is education. He is not afraid to kill or harm anyone who gets in Yuri's way.   ~!He appears to have a crush on Yuri because he is always trying to impress her, and even has a photograph of her to carry around.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/24505.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24505
      },
      "rarity": "epic"
    },
    {
      "id": "shiina",
      "name": "Shiina",
      "alt_names": [
        "椎名",
        "Shiinacchi",
        "C7"
      ],
      "role": "supporting",
      "description": "Shiina is a \"self-proclaimed female ninja\" who fights with traditional Japanese weapons such as dual-wielding kodachi and shuriken.  Shiina also wears the special uniform of the SSS, along with a long black scarf covering the bottom part of her face and her neck. Her skirt is slightly different from the usual, as it has two short slits which is probably to aid her in movement.  She usually puts up a tough and quiet front, but she is extremely fond of cute things, especially stuffed animals.   She is able to sense when danger is coming. She is very strict in her training and would continue with her training even when she is needed to do something else. Shiina's training mostly consist of balancing objects such as broomsticks, scissors and mops on her fingertip, sometimes balancing one on each of her fingers simultaneously while doing something else.   She also usually says the phrase \"how shallow-minded\" when she remarks on her colleagues' actions.   ~!It is revealed in Chapter 24 in Angel Beats: Heaven's Door that Shiina is from ancient Japan. She said she didn't make up a name for herself, so she went by her callsign C7. Yuri invented the name \"Shiina\" because of the simalarity of the pronunciation of C7. Her life was to train everyday on how to kill people.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/24506.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24506
      },
      "rarity": "epic"
    },
    {
      "id": "yusa",
      "name": "Yusa",
      "alt_names": [
        "遊佐"
      ],
      "role": "supporting",
      "description": "Yusa is a girl with long blond hair tied into two pigtails secured in place by a red ribbon each. Just like most of the members of the SSS, Yusa wears the standard uniform of the group. She also wears brown stockings and black loafers.  She is also seen wearing an earpiece with a microphone attached to it or carrying a walkie-talkie.   Yusa is an observer during the missions and her ability is transmitting information to help her team. She is a calm and gentle mannered girl. She also has a straight-forward and tsukkomi character. She doesn't show any emotion, and called scary by Hinata and Otonashi (in an omake). She also can't calm down without her headphone.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/24507.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24507
      },
      "rarity": "epic"
    },
    {
      "id": "fujimaki",
      "name": "Fujimaki",
      "alt_names": [
        "藤巻"
      ],
      "role": "supporting",
      "description": "Fujimaki is fight-holic and the 'bad-boy' of the anime. He has a snobbish attitude and picking up fights is in his blood. He's almost always seen carrying a wooden scabbard which contains a katana sword. He can't swim.   He is the member of the main force with the least screen time and even says himself that people would probably forget about him if he were to have disappeared.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/24508.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24508
      },
      "rarity": "epic"
    },
    {
      "id": "tk",
      "name": "TK",
      "alt_names": [
        "ティーケー"
      ],
      "role": "supporting",
      "description": "He is a mysterious character who speaks in nonsensical English phrases depending on the situation of the scene, though he does not know English fluently. He saves the team many times and does know some Japanese but rarely speaks it, and it seems he understands what the others say to him. And he is talented in almost anything (mostly in dancing). He was always seen dancing even though fighting his enemies. His real identity and his name are still unknown, so they identify him as \"TK\", a nickname he gave himself. One particular trait of his is his inability to remain still, as he is in constant movement whenever he is not doing anything at all (although at times he can be seen not in constant movement).",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24509-5PH1LI0pluva.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24509
      },
      "rarity": "epic"
    },
    {
      "id": "godan-matsushita",
      "name": "Godan Matsushita",
      "alt_names": [
        "松下護騨",
        "Matsushita 5th Dan"
      ],
      "role": "supporting",
      "description": "Matsushita is a Judo expert. He has a well-built body and narrow eyed, which earned him the reputation of being the 'Kuma-san' or Mr. Bear. He is a level '5 dan' in Judo.   ~!It is shown in episode 12 that after several days of training in the mountains Matsushita is no longer overweight.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/24510.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24510
      },
      "rarity": "epic"
    },
    {
      "id": "ooyama",
      "name": "Ooyama",
      "alt_names": [
        "大山"
      ],
      "role": "supporting",
      "description": "Ooyama is an ordinary school boy and unlike others, does not possess any angel ability like fighting skills or special powers. He is scared of fighting and is the shota-type guy of the anime.    ~!Before joining the SSS, Ooyama was Hinata's roommate, and was originally mistaken to be an NPC whom Hinata frequently talks to about his experiences with Yuri. However, when Ooyama began to show human emotion and worries about Hinata's well-being, Hinata realizes that Ooyama is actually a human. Ooyama is also the third person to join the SSS. !~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/24511.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24511
      },
      "rarity": "epic"
    },
    {
      "id": "masami-iwasawa",
      "name": "Masami Iwasawa",
      "alt_names": [
        "岩沢まさみ"
      ],
      "role": "supporting",
      "description": "Always giving a cool look, she is a talented vocalist and plays guitar. She formed a band in the Afterlife called Girls Dead Monster with her best friend Hisako. She also writes songs and composes music for her band. She is beautiful and has a warm heart.  The electric guitar that she is seen using is a Fender American Standard Stratocaster with the color of Sienna Sunburst.   ~! In Episode 3, it is revealed that she is brought up in a family where her father and mother keeps on having quarrels &amp; fights against one another. It lead her to a fear that keeps everything to herself, which made her become a lonely person.  It was until one day she hears a band, Sad Machine, that sang words she related to what she had experience through her life. That was then she decided to sing out to express herself - She found an acoustic guitar that was thrown away, which she picked up and got it fixed and used it to perform. She decided to leave home and continue to pursue her dream as a performer while also holding part time jobs  In the same episode, she revealed that she died in the hospital due to a stroke in her head that paralyzed her body - It was during the fights between her parents when a beer bottle hit her head by accident.  After singing her ballad during the concert, she accepts her fate and vanishes, leaving only her acoustic guitar behind. It was then the gang realized that they don't have to really obey what Angel says in order to enter another life, which they do not want.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24512-lXCO1P7u8RMO.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24512
      },
      "rarity": "epic"
    },
    {
      "id": "hisako",
      "name": "Hisako",
      "alt_names": [
        "ひさ子"
      ],
      "role": "supporting",
      "description": "She is the co-founder of the band with Iwasawa, and the band's guitarist. She is smart, energetic and loves to pick on Sekine. Mahjong is one of her other interests alongside music.\n~!It is implied that Hisako and Iwasawa harbored romantic feelings for one another, as they often blushed in each other’s presence and made gestures of affection towards one another. They once inadvertently led Angel to believe that they had sex when the latter walked in on the two in Hisako’s bedroom, to Hisako’s immense chagrin and Iwasawa’s oblivion at the situation!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24513-Ic4S0IrlPqSM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24513
      },
      "rarity": "epic"
    },
    {
      "id": "miyuki-irie",
      "name": "Miyuki Irie",
      "alt_names": [
        "入江みゆき"
      ],
      "role": "supporting",
      "description": "Irie is fond of ghost stories but has the worst of it when it comes to anything about ghosts. She is cute and enjoys everything as much as she can. She plays drums in Iwasawa and Hisako&#039;s band. She enjoys her time the most when Sekine is around.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24516-nDU14Vw4DjHK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24516
      },
      "rarity": "epic"
    },
    {
      "id": "shiori-sekine",
      "name": "Shiori Sekine",
      "alt_names": [
        "関根"
      ],
      "role": "supporting",
      "description": "Sekine and Irie are best friends and both are in the same band formed by Iwasawa and Hisako. She is the bassist. She is not a gifted musician like the rest of the band members but gives her best. Despite that, Hisako always acts as her senpai and teaches her &#039;dos and don&#039;ts&#039; in a band.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24517-o0aohkn3Uzig.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24517
      },
      "rarity": "epic"
    },
    {
      "id": "chaa",
      "name": "Chaa",
      "alt_names": [
        "チャー"
      ],
      "role": "supporting",
      "description": "Chaa supplies the weapons that the SSS uses. Despite looking much older, he is about the same age as Otonashi and the others attending the afterlife school.     ~!  In the light novel, it is written that Chaa was the one who discovered how to make weapons out of &quot;dirt&quot;(It was actually stone). We first see him when he tries to break into the principal&#039;s office, armed with a gun, but Kanade manages to subdue him. Later on, he duels with Yurippe, and after he loses, he joins the forming SSS. Chaa also mentions that Yurippe is similar to his wife.  !~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/24519.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24519
      },
      "rarity": "epic"
    },
    {
      "id": "takeyama",
      "name": "Takeyama",
      "alt_names": [
        "竹山",
        "Christ"
      ],
      "role": "supporting",
      "description": "A super genius hacker. Prefers to be called &quot;Christ.&quot;",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/32480.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 32480
      },
      "rarity": "epic"
    },
    {
      "id": "hatsune-otonashi",
      "name": "Hatsune Otonashi",
      "alt_names": [
        "音無初音"
      ],
      "role": "supporting",
      "description": "She is diagnosed with an unknown illness and has been bedridden for two years. Within this period, Otonashi (Yuzuru) acts as her guardian, usually visiting her to give her manga to read and to keep her company. Compared to her brother, Hatsune enjoys studying and hanging out with her friends. However, her sickness kept her from going outside. She is also gifted by her brother&#039;s love, who despite having a meager income out of part-time jobs still has enough money to bring her comic books which she enjoys reading. Her gestures of gratitude, in turn, reassures him.     ~!Upon her last request to go outside to see the decorations outside the hospital where she stayed, she passed away, clinging on to her brother&#039;s back on her final moments.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/32965.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 32965
      },
      "rarity": "epic"
    },
    {
      "id": "saitou",
      "name": "Saitou",
      "alt_names": [
        "斎藤",
        "Fish Saitou"
      ],
      "role": "supporting",
      "description": "Saitou is a member of the Guild.  He is proficient in fishing, as well as in weapons.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33065.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33065
      },
      "rarity": "epic"
    },
    {
      "id": "igarashi",
      "name": "Igarashi",
      "alt_names": [
        "五十嵐"
      ],
      "role": "supporting",
      "description": "He is a young man who was injured in the same train crash like Otonashi. Igarashi befriends Otonashi and the two work hard to save the people in the train wreck.   ~!When Otonashi decided to donate his organs, he motivated Igarashi to do so too, and soon everybody underground did that. His words of encouragement made Otonashi realize that he was somebody who helped others in his real life.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33498.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33498
      },
      "rarity": "epic"
    },
    {
      "id": "nazo-no-seinen",
      "name": "Nazo no Seinen",
      "alt_names": [
        "謎の青年",
        "Mysterious Boy"
      ],
      "role": "supporting",
      "description": "A mysterious boy that appears in episode 12.  ~!He was the one who stole the computers from the lab, and used Angel Player to send Shadows after the Battlefront. Apparently, he was programmed, by the developer of Angel Players, to appear when there was \"love in this world.\" He confronts Yuri, giving her the chance to make an important choice. !~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b34379-G9cAflRirdMQ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34379
      },
      "rarity": "epic"
    },
    {
      "id": "hitomi",
      "name": "Hitomi",
      "alt_names": [
        "ひとみ"
      ],
      "role": "supporting",
      "description": "Yuri&#039;s classmate in her dream world during Episode 12.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/38508.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38508
      },
      "rarity": "epic"
    }
  ],
  "updated_at": "2025-12-22T23:37:37.494Z"
}