{
  "work_id": "the-girl-who-leapt-through-time",
  "count": 9,
  "characters": [
    {
      "id": "makoto-konno",
      "name": "Makoto Konno",
      "alt_names": [
        "紺野真琴"
      ],
      "role": "protagonist",
      "description": "Makoto Konno is an ambivalent senior high school student still caught between that devilish question of &quot;Arts or Sciences?&quot; that her teachers require of her immediate academic future. She always sleeps in a few minutes too many, is remarkably clumsy, hates pop quizzes like every other high school student and never really makes an effort to brush her wayward hair.     About as average as can be, she spends the majority of her days after school hitting baseballs and playing catch with her best pals.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2530-cQj2vyKexS4n.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2530
      },
      "rarity": "epic"
    },
    {
      "id": "chiaki-mamiya",
      "name": "Chiaki Mamiya",
      "alt_names": [
        "間宮千昭"
      ],
      "role": "protagonist",
      "description": "Chiaki is one of Makoto&#039;s good friends that joins her and Kousuke in games of baseball after school.     ~!When Makoto attempts to stop Kousuke and his girlfriend from getting hit by a train, she encounters Chiaki, who has turned back time to prevent the accident. This reveals that Chiaki can leap through time as well. Chiaki tells Makoto that in the alternate future, Kousuke and his girlfriend were both killed in the accident. Chiaki then explains that he is from the future, and people in the future can leap through time.    Chiaki reveals that the reason Makoto can leap through time is because of the events that took place in the science lab; Makoto was startled by the mysterious figure (who is revealed to be Chiaki) which caused her to trip and fall onto the device that charged time-leaping abilities in his time.     Chiaki explains that the reason he came to the past was to see a certain painting, which happens to be the same painting Makoto&#039;s aunt has not yet finished restoring; this painting has been destroyed in the future. He laments that he will never get to see it because he used up his time-leaping abilities to save Kousuke, so not only can he not leap to the painting, he can&#039;t return home either. When Makoto asks him to wait until the painting is restored, he tells her that because he told her about his time-leaping abilities, he will disappear the next day.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2531-sTqtJZK2Hty5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2531
      },
      "rarity": "epic"
    },
    {
      "id": "kousuke-tsuda",
      "name": "Kousuke Tsuda",
      "alt_names": [
        "津田功介"
      ],
      "role": "protagonist",
      "description": "A good friend of Makoto.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2532-Q2hPxjjvG8ac.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2532
      },
      "rarity": "epic"
    },
    {
      "id": "yuri-hayakawa",
      "name": "Yuri Hayakawa",
      "alt_names": [
        "早川友梨"
      ],
      "role": "supporting",
      "description": "Makoto's friend.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16604-1Q7qdzroDssB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16604
      },
      "rarity": "rare"
    },
    {
      "id": "kaho-fujitani",
      "name": "Kaho Fujitani",
      "alt_names": [
        "藤谷果穂"
      ],
      "role": "supporting",
      "description": "Kaho Fujitani is one of Makoto's classmates at school. She's got a huge crush on Makoto's friend Kousuke, after Kaho's grandmother told her all about him and his kindness towards her.     ~!Upon hearing that Kaho confessed her feelings to Kousuke and was rejected, Makoto uses her abilities to return to the past, and she convinces Kousuke to invite Kaho and her two friends, who have been nagging her to confess, to come play baseball with them. Makoto's plan works perfectly, and Kousuke and Kaho end up dating.    Makoto later gets a text on her phone from Kousuke, telling her that he borrowed her bike to ride home with Kaho. Makoto remembers that her bike's brake is broken, and realizes Kousuke and Kaho are doomed to repeat Makoto's original death, when her bike's brakes fail going down a huge hill straight into a moving train.    Makoto attempts to call Kousuke and receives no reply, and races to the scene to stop Kosuke from running into the train. Her attempts ultimately fail, and Kousuke and Kaho are sent right into the train's path, exactly as Makoto did before her time leap. Chiaki, who reveals he can time leap as well, stops the accident and reverses it, but tells Makoto that in the alternate future, both Kousuke and Kaho are killed in the accident.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16605-B4QFfQBWIw7i.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16605
      },
      "rarity": "rare"
    },
    {
      "id": "miyuki-konno",
      "name": "Miyuki Konno",
      "alt_names": [
        "紺野美雪"
      ],
      "role": "supporting",
      "description": "Makoto's younger sister.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16631-8ajefFVFJEwZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16631
      },
      "rarity": "rare"
    },
    {
      "id": "fukushima-sensei",
      "name": "Fukushima-sensei",
      "alt_names": [
        "福島先生"
      ],
      "role": "supporting",
      "description": "One of the school's teachers.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22928-q6lh819iHNs3.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22928
      },
      "rarity": "rare"
    },
    {
      "id": "kazuko-yoshiyama",
      "name": "Kazuko Yoshiyama",
      "alt_names": [
        "芳山和子"
      ],
      "role": "supporting",
      "description": "Kazuko Yoshiyama, a third-year junior high school student, is cleaning the school science lab with her classmates, Kazuo Fukamachi and Gorō Asakura, when she smells a lavender-like scent and faints. After three days, strange events transpire around Kazuko, including the burning of Gorō's house after an earthquake. The next morning, at the exact moment of a car accident, Kazuko is transported 24 hours into the past. She relives the day and relates her strange experience to Kazuo and Gorō. They don't believe her at first, but they are convinced when she accurately predicts the earthquake and ensuing fire. Fukushima, their science teacher, explains Kazuko's new ability is called \"teleportation\"; and \"time-leap\", and to solve the riddle of her power she must leap back four days.\n\nIn the anime and Tokikake manga she is Makoto's aunt and takes on a supporting role.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24227-SeUayRsFNAzK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24227
      },
      "rarity": "rare"
    },
    {
      "id": "soujirou-takase",
      "name": "Soujirou Takase",
      "alt_names": [
        "高瀬宋次郎"
      ],
      "role": "supporting",
      "description": "Classmate of Makoto.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28922-Cw8Uv2q6vrs0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28922
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-26T03:44:38.653Z"
}