{
  "work_id": "land-of-the-lustrous",
  "count": 36,
  "characters": [
    {
      "id": "phosphophyllite",
      "name": "Phosphophyllite",
      "alt_names": [
        "フォスフォフィライト",
        "Phos",
        "Three-and-a-Half"
      ],
      "role": "protagonist",
      "description": "**Hardness**: 3.5 ~!(legs: 7; head: 5)!~\n\nThe main protagonist and the youngest gem when the story began. They're weak, brittle - not suited for battle - and their clumsiness makes them difficult to maintain any roles, even though they've always wanted to be useful. Phos' initial job was to make a natural history encyclopedia which they progressed very little on. They promised to help [Cinnabar](https://anilist.co/character/123384/Cinnabar) find a job suited for them as well.\n\nPhos is a young, overconfident, clumsy, and naive gem, who is the only one capable of getting away with talking back to [Kongou](https://anilist.co/character/123394/Kongou). Many gems describe them as lazy and useless due to their fragility and incompetence, although Phos does display a drive to help Sensei and the others, often held back by their low hardness. There is an underlying way of how Phos acts and speaks about themselves that hints at them taking the “useless” and “lazy” comments to heart, and impacting their self-esteem. These facts indicate that Phos may have something of an inferiority complex. They settle with what they can do and constantly state that they will try better next time. Phos displays a change of personality over the course of the series, mainly due to maturing, trauma, and outside influences. This is mainly due to the fact that the gems are not equipped to deal with trauma.\n\nPhosphophyllite wears a standard winter uniform and black shoes without socks, occasionally accompanied by long black gloves. Phos has mint-green features known by the gems and the Admirabilis as the Lunarians' favorite color. Their hair is short, originally just beneath the ears, but cut shorter in later chapters to imitate [Antarcticite](https://anilist.co/character/124307/Antarcticite)'s hairstyle.",
      "metadata": {
        "gender": "non-binary",
        "age": "300-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123385-ild8gXk13xcO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123385
      },
      "rarity": "epic"
    },
    {
      "id": "shinsha",
      "name": "Shinsha",
      "alt_names": [
        "シンシャ",
        "Cinnabar",
        "Cinna"
      ],
      "role": "supporting",
      "description": "**Hardness**: 2\n\nThe only gem who goes on night patrol. Due to their body producing Mercury (which is harmful to Gems and living things), they are isolated and ashamed of themselves. They hate fighting and hate to be seen.\n\nAccording to [Rutile](https://anilist.co/character/123399/Rutile), Cinnabar has an extraordinary amount of talent and combat ability but is too much to handle due to their uncontrollable poison. Cinnabar's silver poison gathers faint light at night, which keeps them awake and aware while night patrolling. According to [Kongou](https://anilist.co/character/123394/Kongou), the night patrol is something Cinnabar came up with by themself. They used to spend their time during the day in Hollow Cape, waiting for the Lunarians to take them since they thought they may at least be of use to them. They are knowledgeable about things other gems don't know about.\n\n[Phosphophyllite](https://anilist.co/character/123385/Phosphophyllite) was recommended by the gems to see Cinnabar for the encyclopedia. After accidentally hearing their secret and wish, Phos promises to help Cinnabar find a job more suited to them than night patrol, saying, \"a fun job only you can do.\" When encountering Phos each time, Cinnabar seems doubtful of their words and outwardly annoyed with them, even going so far as to run away at one point. But they are the only gem they regularly speak to. Although they try not to show it, they have a tiny sliver of hope that Phos will be able to fulfill their promise.\n\nCinnabar is able to pull out an abundant amount of mercury. They're able to manipulate it in the air, from a distance, and around them, as some mercury droplets constantly hover around them. They seem to not be in full control over it and sometimes release it without wanting to. The mercury allows them to stay up during the night due to its reflective properties shining light. The mercury is dubbed \"liquid poison\" by the other gems. It's known to damage both organic life and the gems. Often with spills, the area becomes inhabitable for a long time afterward, often looking dead after later observation. In terms of the gems, the mercury is known to damage surfaces it's exposed to and causes light to be blocked from reaching those parts, requiring the pieces to be removed.\n\n(Source: Houseki no Kuni Wiki, edited)",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123384-ZA5owNzNH4Y3.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123384
      },
      "rarity": "uncommon"
    },
    {
      "id": "alexandrite",
      "name": "Alexandrite",
      "alt_names": [
        "アレキサンドライト",
        "Alex",
        "Lexi",
        "Red Alex"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 8.5\n\nA gem who works an expert on The Lunarians. Alex is studious, especially in terms of information and literature relating to The Lunarians. They will pester the other Gems for details regarding any fights or encounters with the Lunarians, especially if there is a new type of Lunarian. When referred to with honorifics, they hate being called Alex-san, preferring the cuter Alex-chan. This is changed to Alexi or Lexi in the official English translation.\n\n~!They are one of the gems who accompanies Phos to the moon.!~",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123386-tNm2AZSCiWm8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123386
      },
      "rarity": "uncommon"
    },
    {
      "id": "amethyst-84",
      "name": "Amethyst 84",
      "alt_names": [
        "アメシスト84",
        "Eighty-Four",
        "Ame"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 7\n\nAmethyst are two twin Gems who mainly do patrol duty. They are individually named Eighty-Four and Thirty-Three. They're two in one and partnered with each other. According to Yellow Diamond, twin Gems will not break when they touch each other, as demonstrated when the twins bash their heads together, much to the chagrin of their observers. They are both great at swordplay and were recommended to train Phos for a short time.\n\nThe twins work in tandem for a lot of things, often talking at the same time or finishing each other's sentences. No one really cares which is which anymore, including themselves.\n\n~!Later, Eighty-Four switches their hairstyle to deceive Phos in order to go to the moon in Thirty-Three's place. On the moon, Eighty-Four has learned to become more of their own individual and serves as an assistant scientist there. They seem to be highly interested in more of the psychological aspects in the science field.!~",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123387-aA7x3KmucK1N.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123387
      },
      "rarity": "uncommon"
    },
    {
      "id": "benitoite",
      "name": "Benitoite",
      "alt_names": [
        "ベニトアイト",
        "Benito",
        "ベニト"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 6.5\n\nA sensible and earnest gem who mainly does patrol duty. They're somewhat timid and has a hard time saying \"no.\" They're insecure about their lack of individuality.\n\n~!Benito is one of the gems who accompanies Phos to the moon. They reveal that the reason they wanted to go is to become special, as they think they're too average and normal.!~",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123388-HJoHr1h2IpfO.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123388
      },
      "rarity": "uncommon"
    },
    {
      "id": "bort",
      "name": "Bort",
      "alt_names": [
        "ボルツ",
        "Bortz"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 10\n\nOne of the gems mainly on patrol duty. A diamond-class Gem whose hardness and toughness is top level, they are a calm yet ruthless warrior and \"battle maniac.\"\n\nBort excels at battles and is obsessed with combat. They are an efficient and analytic fighter, often pointing out the flaws in the other Gems in a blunt and straightforward manner. This causes them to be seen as cold and scary to the other Gems, but also causes Bort to be respected, looked up to, and seen as reliable.\n\nDespite their harsh personality, Bort does have a softer side, in rare moments displaying a sense of humor and a reluctance to hit cute things.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123389-fMHLobcWf8lL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123389
      },
      "rarity": "uncommon"
    },
    {
      "id": "diamond",
      "name": "Diamond",
      "alt_names": [
        "ダイヤモンド",
        "Dia",
        "Didi"
      ],
      "role": "supporting",
      "description": "**Hardness**: 10\n\nOne of the gems who focuses on patrol duty. Despite their high offensive power, their toughness is second-rate and easily broken. The other gems consider them lovely and a top fashion model.\n\nDiamond has a clear, colorless scheme yet their gem's characteristic gives them high light dispersion, thus creating rainbow reflections. They are very sparkly and blinding. They sparkle and glow even during the night, though they seem to be able to dampen it by covering part of it up. Their hair is a fluffy short-medium bob, with thick eyebrows and eyelashes. They wear either a winter or summer uniform depending on the season. They also wear standard black shoes with small bows. Like a diamond, they always wore white opera gloves with thigh-high socks.\n\n~!On the Moon, they wear feminine and frilly outfits that often resemble dresses with puffy skirts.!~\n\nDiamond is very friendly, kind, and gentle. They appear to be relatively calm during a battle, even when their situation isn't good. However, they are actually insecure and frustrated with their current body which, though being the hardest, shatters easily. They dislike being compared to [Bort](https://anilist.co/character/123389/Bort), although they admire their younger sibling a lot. They are perceptive regarding gems' inner feelings and relationships, though [Cinnabar](https://anilist.co/character/123384/Cinnabar) accuses them of seeing everything as some kind of romance. Despite their more gentle nature, they're very stubborn and tend to fight until they shatter in battle. From Bort's point of view, Diamond is extremely reckless.\n\n~!When separated from Bort on the Moon, Diamond seems to display fear at the mention of Bort, signifying that there was more hostility in treatment from Bort towards Diamond and their feelings. [Phosphophyllite](https://anilist.co/character/123385/Phosphophyllite) eventually uses this to take advantage of Diamond in threatening to bring Bort to the Moon so they comply in assisting with destroying the Earth gems. Diamond mentions that they would like to turn that \"little nuisance (Bort) into dust\". Invading Earth proper, Diamond is immediately angry at Bort for their unwillingness to fight and their kindness towards Cinnabar. When they're able to shatter them, Diamond is darkly satisfied with their pyrrhic victory even as both Bort and Diamond fall to pieces.!~\n\n(Source: Houseki no Kuni Wiki, edited)",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123390-JpK1cECeWCEo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123390
      },
      "rarity": "uncommon"
    },
    {
      "id": "euclase",
      "name": "Euclase",
      "alt_names": [
        "ユークレース",
        "Euc"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 7.5\n\nA kindly and knowledgeable elder gem who does patrol duty, secretary work, strategy planning, and other odd jobs. They're kind, intellectual, and extremely perceptive. They have a strong sense of responsibility and often worry over the others.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123391-4P6AdAbk9iUe.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123391
      },
      "rarity": "uncommon"
    },
    {
      "id": "goshenite",
      "name": "Goshenite",
      "alt_names": [
        "ゴーシェナイト",
        "Goshe",
        "ゴーシェ"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 7.5\n\nGoshenite is gentle, kind to everyone, and always has a worried expression. They're partners with Morganite in battle.\n\n~!Goshe, along with Morganite, is taken to the moon shortly after Phos loses their head and begins their 102-year rest. (Approximately 20 years after).!~",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/123392-6zXVJsdkH2J1.png",
          "type": "portrait",
          "source": "AniList"
        },
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209248-e6uqhtDE9Xhr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123392
      },
      "rarity": "uncommon"
    },
    {
      "id": "jade",
      "name": "Jade",
      "alt_names": [
        "ジュード",
        "Chairman",
        "議長",
        "Gichou"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 7\n\nA very serious gem who mainly works as Sensei's spokesperson. Jade is a responsible person who mostly just wants to help their partner, Euclase.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/123393-3kmyVO2LDT5d.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123393
      },
      "rarity": "uncommon"
    },
    {
      "id": "kongou",
      "name": "Kongou",
      "alt_names": [
        "金剛",
        "Adamant"
      ],
      "role": "supporting",
      "description": "**Hardness:** Unknown\n\nKongou is the teacher of the lustrous. He has a vast amount of knowledge and has the power to drive away the lunarians with a single attack.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123394-RYb2wD26uHH2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123394
      },
      "rarity": "uncommon"
    },
    {
      "id": "morganite",
      "name": "Morganite",
      "alt_names": [
        "モルガナイト",
        "Morga",
        "モルガ"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 7.5\n\nA gem on patrol duty with their partner Goshenite. Morganite is always overconfident, brashly makes decisions, and loves to tease Phos.\n\n~!Morga, along with Goshenite, is taken to the moon a few years after Phos loses their head and is asleep for 102 years.!~",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123395-G6ib64ccSc78.png",
          "type": "portrait",
          "source": "AniList"
        },
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209245-nv130GZPuVbw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123395
      },
      "rarity": "uncommon"
    },
    {
      "id": "neptunite",
      "name": "Neptunite",
      "alt_names": [
        "ネプチュナイト",
        "Nepchii",
        "Nepti"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 5.5\n\nA reserved, quiet gem who mainly does patrol duty with their partner, Benito.\n\nNeptunite has a very sharp tongue and believes that people should face the truth head-on, regardless of how it makes them feel. Other Gems comment that Nepti is also very difficult to read in terms of both their mood and combat movements. New Morganite even remarks that not knowing what Neptunite is saying is part of their charm.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123396-9K5e1J7434s6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123396
      },
      "rarity": "uncommon"
    },
    {
      "id": "obsidian",
      "name": "Obsidian",
      "alt_names": [
        "オブシディアン"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 5\n\nA gem in charge of weapon production. Energetic and bubbly, Obsidian is very dedicated to their job and will make others weapons without hesitation if requested to.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123397-ThqOcPRNxN40.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123397
      },
      "rarity": "uncommon"
    },
    {
      "id": "red-beryl",
      "name": "Red Beryl",
      "alt_names": [
        "レッドベリル"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 7.5\n\nA passionate and dedicated gem who works as a tailor and fashion stylist for the others. They're in charge of textile and clothing. Their style is very frilly, cute, and feminine.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/123398-8oaoyuJw7dMo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123398
      },
      "rarity": "uncommon"
    },
    {
      "id": "rutile",
      "name": "Rutile",
      "alt_names": [
        "ルチル"
      ],
      "role": "supporting",
      "description": "**Hardness**: 6\n\nRutile is one of the gems and works as a doctor. They repair cracked or broken gems and handle the management of herbs, pastes, powders, and other medical remedies. Rutile is always found at work or sleeping on one of the sides of the halls surrounded by cupboards, boxes, and herbs. They are the partner of the unstable [Padparadscha](https://anilist.co/character/124485/Padparadscha), whose body is actively being maintained. Besides repairs, they are responsible for carrying out regular physical checkups and applying powder and saltwater resin to their bodies.\n\nRutile takes their job very seriously. They are known to stay up all night if needed to put a gem back together. As a result, they are often tired and known to take naps during the day. They have also been shown to be a bit eccentric and sarcastic, and to take great pride in their job and research, whether dissecting animals or studying the physical composition of gems' bodies. They don't take well to having their medical authority questioned. Even so, they still become easily embarrassed when pestered about things like love.\n\nAs the gem's doctor, Rutile is one of the more frequently seen characters who are more knowledgeable about the gems' health and bodies, often providing explanations for how they work. Rutile explains the nature of the gems and how they have microscopic organisms called inclusions within their bodies which allow them to move and make them basically immortal. They state that even if a gem is broken, ground to dust, and scattered into the bottom of the ocean, this is simply suspended animation and the gem could be revived if put back together.\n\nThey are very close to Padparadscha, their former partner, despite nowadays being unable to spend time with them. Hundreds of thousands of failed operations to fix them have not made them lose hope. They believe they cannot be called a doctor if they cannot solve Padparadscha's condition. They are extremely dedicated, bordering on obsessed with this task.\n\n~!Rutile's mental state was broken after losing Padparadscha. They have become more impulsive and feral in nature, their hair unkempt and falling straight down. Seeing Padparadscha whole and awake seemed to be unchanging of this nature, as Rutile attempts to attack Padparadscha along with [Phosphophyllite](https://anilist.co/character/123385/Phosphophyllite) and [Yellow Diamond](https://anilist.co/character/123400/Yellow-Diamond). This has lead to Rutile becoming unable. When Padparadscha returned themself, Rutile clung onto the piece of Padparadscha that was given as a \"gift\" to repair them.!~\n\n(Source: Houseki no Kuni Wiki, edited)",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123399-0qOAnNWCrhCo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123399
      },
      "rarity": "uncommon"
    },
    {
      "id": "yellow-diamond",
      "name": "Yellow Diamond",
      "alt_names": [
        "イエローダイヤモンド",
        "Yellow",
        "イエロー"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 10\n\nThe oldest gem, who mostly does patrol duty. Yellow is portrayed as cheerful yet mature, but struggles with low self-esteem and feels responsible for all of their siblings.\n\n~!They are one of the gems who accompanies Phos to the moon.!~\n\n~!During their time on the moon, Yellow gradually becomes more and more mentally unstable, and eventually even begins to suffer from delusions, thinking of themselves as a Lunarian and becoming distressed whenever they realize they're really a gem.!~",
      "metadata": {
        "gender": "non-binary",
        "age": "3597-3919",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123400-RDGUEopzSghD.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123400
      },
      "rarity": "uncommon"
    },
    {
      "id": "zircon",
      "name": "Zircon",
      "alt_names": [
        "ジルコン"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 7.5\n\nOne of the gems mainly doing patrol duty. Zircon is the second youngest after Phos.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/123401-sHdEX3rbfy1J.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123401
      },
      "rarity": "uncommon"
    },
    {
      "id": "hemimorphite",
      "name": "Hemimorphite",
      "alt_names": [
        "ヘミモルファイト"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 5\n\nA gem who mainly does patrol duty. They're partnered with Watermelon Tourmaline.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/123994-8vykOE2wG2ih.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123994
      },
      "rarity": "uncommon"
    },
    {
      "id": "watermelon-tourmaline",
      "name": "Watermelon Tourmaline",
      "alt_names": [
        "ウォーターメロントルマリン",
        "Watermelon"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 7.5\n\nAn energetic and excited gem who mainly does patrol duty. They're partners with Hemimorphite. Watermelon is described as always having their head in the clouds.\n\nWatermelon Tourmaline is able to produce an electrical charge. They are capable of releasing this charge as an attack. It appears effective against Lunarians and doesn't seem to effect nearby Gems.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/123995-pxlVh6dEymqn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123995
      },
      "rarity": "uncommon"
    },
    {
      "id": "sphene",
      "name": "Sphene",
      "alt_names": [
        "スフェン"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 5\n\nA sweet, calm, and dedicated elder gem in charge of crafting. They're partnered with Peridot.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/123996-wE2J7GP6cqL8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123996
      },
      "rarity": "uncommon"
    },
    {
      "id": "peridot",
      "name": "Peridot",
      "alt_names": [
        "ペリドット"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 6.5\n\nOne of the elder gems. They're in charge of paper production and are currently partnered with Sphene.\n\nPeridot seems to be very mature and wise. Hemimorphite describes them as 'smart and imperturbable'. When they lost their partner Blue Zoisite, they could not think about anything else. However with time they began to forget them and finally could accept it. They are also known to be a little obsessed over making paper.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/123997-Bi05mAcsnSXp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123997
      },
      "rarity": "uncommon"
    },
    {
      "id": "aculeatus",
      "name": "Aculeatus",
      "alt_names": [
        "アクレアツス",
        "Aculeasis"
      ],
      "role": "supporting",
      "description": "Brother to Ventricosus, ruler of the admirabilis.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124215-vAgMCXZKvRxp.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124215
      },
      "rarity": "uncommon"
    },
    {
      "id": "ventricosus",
      "name": "Ventricosus",
      "alt_names": [
        "ウェントリコスス",
        "King",
        "The Ruler"
      ],
      "role": "supporting",
      "description": "Ruler of the sea and its inhabitants - the admirabilis.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124216-qWMQQh6fDdE8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124216
      },
      "rarity": "uncommon"
    },
    {
      "id": "antarcticite",
      "name": "Antarcticite",
      "alt_names": [
        "アンタークチサイト",
        "Antarc"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 3\n\nAntarcticite is one of the Gems who mainly does patrol duty and some other work specifically in winter. Due to their gem characteristic, they 'sleep' in liquid form during above room-temperature, and re-crystallize when the temperature drops. The colder the temperature, the harder they become.\nA perfectionist and quite formal (as well as somewhat apathetic), but also spoiled towards Adamant-sensei. They love to hug them, but are embarrassed when anyone finds out.\n\nAntarc is very blunt, and judgmental, but deep down is emotional and kind. But, after hearing Phos' story, they let them become their partner, though they are not used to working in a group.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124307-alL2hGgMlrr4.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124307
      },
      "rarity": "uncommon"
    },
    {
      "id": "padparadscha",
      "name": "Padparadscha",
      "alt_names": [
        "パパラチア"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 9\n\nPadparadscha is one of the Gems who mainly does patrol duty, but is currently inactive. They were born with an incomplete torso, which affects their consciousness. They're the partner of Rutile who also maintains their health. Very easygoing, but knows a lot more than what they let on. Wants the other gems to stop worrying about them, and would like to sleep in order not to burden anyone.\n\n(Source: Houseki no Kuni Wikia)",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124485-s6k08cCJp9q4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124485
      },
      "rarity": "uncommon"
    },
    {
      "id": "cairngorm",
      "name": "Cairngorm",
      "alt_names": [
        "カンゴーム"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 7\n\nThey seem to be very tough and strict. They act harsh towards Phos, however, they had shown some compassion after Phos had a breakdown and had confused Cairngorm for Antarcticite. Later, Cairngorm begins to act much kinder and gentle towards Phos, and becomes rather protective of them. \n\n~!When Phos lost their head to the lunarians, Cairngorm even offered their former partner, Lapis Lazuli's head, to Phos. When Kongo seemed unsure of this, Cairngorm even began to offer their own head to Phos.!~\n\n~!Later in the manga, Aechmea questiones Cairngorm's dedication to Phos and upon examining the Gem closely, he discoveres that their eyes still contain traces of Ghost Quartz which are affecting Cairngorm's behavior. After Cairngorm breaks under Ghost's influence, Aechmea understands that Cairngorm wants Ghost Quartz removed from their eyes. With Ghost Quartz's influence removed, Cairngorm's behavior changes drastically. They remove their powder, they don't react when Phos offers to give back Lapis's head, and they refuse to join Phos' expedition back to Earth. They also seem to have formed a close relationship with Aechmea, which leads to them becoming Aechmea's \"wife\" during a ceremony known by the Moon People as \"the wedding\".!~",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124600-Xjo2fbmBg9aX.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124600
      },
      "rarity": "uncommon"
    },
    {
      "id": "ghost-quartz",
      "name": "Ghost Quartz",
      "alt_names": [
        "ゴースト・クォーツ",
        "Ghost",
        "ゴースト"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 7\n\nOne of the Gems. They work as a librarian and take part in patrol duty. They are also in charge of long-term recovery facilities located on the fourth floor. Their weapon of choice is a sickle. Lapis Lazuli was Ghost's former teammate and in charge of the library until they were taken by the Lunarians, leaving only their head; Ghost was placed in charge of the library afterwards.\n\nQuiet and calm, Ghost is very insecure about themselves, thinking that their fallen partner, Lapis, was much better than them. Ghost speaks of Lapis in high regards, referring to them as smart and organized, and maintaining the library as if they will return soon. Because of Ghost's double structure, two personalities inhabit their body, the other being Cairngorm who's very different from Ghost. Ghost describes Cairngorm as violent and brash, but they both equally respected and followed Lapis.\n\n~!Ghost temporarily teamed up with Phos, but during their first fight, Ghost Quartz was chipped off of the underlying Cairngorm by the Lunarians and was taken to the moon, leaving only Cairngorm behind. In Ghost's final moments, it's given a clearer picture of Ghost's attitude towards Cairngorm, calling them rude, violent, selfish, and annoying. However, Ghost then entrusts Cairngorm to protect Phos after they're gone.!~\n\n(Source: Houseki no Kuni Wiki, edited)",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b128723-qvf6UFfqDNCd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 128723
      },
      "rarity": "uncommon"
    },
    {
      "id": "lapis-lazuli",
      "name": "Lapis Lazuli",
      "alt_names": [
        "ラピス・ラズリ"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 5\n\nOne of the Gems. They were the head of the Library, a position now taken up by their former partner Ghost Quartz after Lapis was taken by the Lunarians. Upon being taken, only their head was able to be retrieved.\n\nLapis had a charming, leader-like personality. They had keen observation and great deductive thinking skills, and because of that had great confidence in themselves. Euclase remarks that Lapis was extremely smart and pleasant to talk to, but was more eager to use their skills to satisfy their intellectual curiosity rather than for the benefit of others. This meant they could be quite manipulative at times. Cairngorm remarks that they could 'quietly conceal secrets for centuries' and were 'surprisingly deceiving'.\n\n~!Lapis's aforementioned head would then go on to be the substitute for Phosphophyllite's after they lose theirs to the Lunarians. After their head is first attached to Phos, Lapis appears in Phos' dream as an apparition of some sort. Lapis implies that this dream-like apparition is being caused by them leaving a 'message' to their inclusions to give to the next gem who hosts their head. They explain to Phos that they also wanted to understand the Lunarians, but by trying to rationalize their illogical actions during a battle, they were shot by arrows causing them to lose their head and be taken to the Moon. Attaching Lapis's head influences Phos's personality, as the two personalities seem to mix. Phos inherits Lapis's deductive abilities and becomes attentive to details and able to strategize more. The bottling emotions remains and becomes worse as Lapis’s personalities adds a more secretive and manipulative nature to Phos.!~\n\n(Source: Houseki no Kuni Wiki, edited)",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130062-I2OyNEt7SgWS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130062
      },
      "rarity": "uncommon"
    },
    {
      "id": "aechmea",
      "name": "Aechmea",
      "alt_names": [
        "エクメア",
        "Prince Aechmea",
        "Prince"
      ],
      "role": "supporting",
      "description": "~! Aechmea is the leader of the Lunarians. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b133785-DaJ1SbPXlyDL.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133785
      },
      "rarity": "uncommon"
    },
    {
      "id": "amethyst-33",
      "name": "Amethyst 33",
      "alt_names": [
        "アメシスト33",
        "Thirty-Three"
      ],
      "role": "supporting",
      "description": "__Hardness:__ 7\n\nAmethyst are two twin Gems who mainly do patrol duty. They are individually named Eighty-Four and Thirty-Three. They're two in one and partnered with each other. According to Yellow Diamond, twin Gems will not break when they touch each other, as demonstrated when the twins bash their heads together, much to the chagrin of their observers. They are both great at swordplay and were recommended to train Phos for a short time.\n\nThe twins work in tandem for a lot of things, often talking at the same time or finishing each other's sentences. No one really cares which is which anymore, including themselves.\n\n~!Later, Thirty-Three expresses to Phos that they want to go to the moon with them to practice independence from their twin. Unknown to them, however, Eighty-Four overheard and later switched their hairstyle to deceive Phos, and went to the moon in Thirty-Three's place.\n\nAmethyst 33 has recently learned to cope with their twin leaving, and believes after 200 years that they are alright. They think 84 is doing alright as well, and still feels connected to them.!~",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209228-NcapXYM9sXam.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209228
      },
      "rarity": "uncommon"
    },
    {
      "id": "semi",
      "name": "Semi",
      "alt_names": [
        "蝉",
        "Cicada"
      ],
      "role": "supporting",
      "description": "A Lunarian with a soft personality. Although somewhat unintelligent and clumsy, Cicada is friendly, upbeat, and cares a lot about Phos and the other gems.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209246-RNxWbjdJTz3M.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209246
      },
      "rarity": "uncommon"
    },
    {
      "id": "barbata",
      "name": "Barbata",
      "alt_names": [],
      "role": "supporting",
      "description": "~! The possible lead scientist of the Lunarians, known as the \"tech supervisor\" to Aechmea. Barbata has a great love for the culinary arts, and is one of the best cooks on the moon. They generally seem to be a relaxed individual that prefers to go at their own pace. Barbata is incredibly smart and observant, as well as empathetic and friendly.  !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209247-or5wkVz2ItGp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209247
      },
      "rarity": "uncommon"
    },
    {
      "id": "ayumu",
      "name": "Ayumu",
      "alt_names": [],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b285150-nNoQE5MpIwmZ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 285150
      },
      "rarity": "uncommon"
    },
    {
      "id": "heliodor",
      "name": "Heliodor",
      "alt_names": [
        "ヘリオドール"
      ],
      "role": "supporting",
      "description": "**Hardness:** 7.5\n\nHeliodor is one of the Gems who presumably did patrol duty in the past. They are currently a captive on the Moon.\n\nHeliodor was taken by the Lunarians prior to the beginning of the story. Morganite and Goshenite fought a new model of the Lunarians which uses Gems as weapons. They see pieces of Heliodor turned into arrowheads and fight in order to collect them back piece by piece.",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 318408
      },
      "rarity": "uncommon"
    },
    {
      "id": "pebble",
      "name": "Pebble",
      "alt_names": [
        "小石"
      ],
      "role": "supporting",
      "description": "~!Pebble is a new type of rock-based lifeform that was born some time after Phosphophyllite prayed the Lunarians away into nothingness. Since meeting Phos, the two have become kindred spirits.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b331316-3dJkNxaYS1Fn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 331316
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-24T03:37:07.073Z"
}