{
  "work_id": "sword-art-online-ii",
  "count": 45,
  "characters": [
    {
      "id": "kazuto-kirigaya",
      "name": "Kazuto Kirigaya",
      "alt_names": [
        "桐ヶ谷和人",
        "Kirito (キリト)",
        "The Black Swordsman",
        "Papa (パパ)",
        "Daddy"
      ],
      "role": "protagonist",
      "description": "__Height:__ 172 cm\n__Weapon(s) of choice:__ Anneal Blade (1st Level), Queen's Knightblade (9th Level), Elucidator (50th level) and Dark Repulser (forged by Lisbeth)\n\nKirito is a \"solo\" player, a player who hasn't joined a guild and usually works alone. He is also one of the very few people to have had the privilege to play in the beta testing period of Sword Art Online. His game alias, Kirito, is created by taking the syllables of the first and last Kanji of his real last and first names respectively: (Kirigaya Kazuto). \n\nIn the real world, he lives with his mother and younger sister in a family of 3.  When Kayaba announced the start of the death game, he is surprised, but unlike everyone else he quickly gets over it and accepts it to an extent. He invited his friend Klein to go with him but Klein had to find his friends in the game. He was invited to join them but he declined as he couldn't take the pressure of protecting them even with his beta testing knowledge of the game.",
      "metadata": {
        "gender": "male",
        "age": "14-18",
        "dateOfBirth": "2008-10-07"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36765-BnLbXg0Tzzh9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36765
      },
      "rarity": "legendary"
    },
    {
      "id": "asuna-yuuki",
      "name": "Asuna Yuuki",
      "alt_names": [
        "結城明日奈",
        "アスナ",
        "Berserker Healer (バーサクヒーラー)",
        "Lightning Flash (閃光)",
        "Mama (ママ)",
        "Erika (エリカ)"
      ],
      "role": "protagonist",
      "description": "__Height:__ 160-168 cm\n__Weapons of choice:__ Wind Fleuret (1st Floor), Lambent Light (Forged by Lisbeth)\n\nAsuna is a friend of Kirito and is a sub-leader of the guild Knights of the Blood (KoB), a medium-sized guild of about thirty players, also called the strongest guild in Aincrad. Being one of the few girls that are in SAO, and even more so that she's extremely pretty, she receives many invitations and proposals. She is a skilled player earning the title \"Lightning Flash\" for her extraordinary sword skill that is lightning fast. Her game alias is the same as her real world name.",
      "metadata": {
        "gender": "female",
        "age": "15-19",
        "dateOfBirth": "2007-09-30"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36828-j5ib0adAzGMx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36828
      },
      "rarity": "legendary"
    },
    {
      "id": "shino-asada",
      "name": "Shino Asada",
      "alt_names": [
        "朝田詩乃",
        "Sinon (シノン)",
        "Hecate"
      ],
      "role": "protagonist",
      "description": "Shino is a skilled VRMMO player. She goes by the name Sinon in *Gun Gale Online* and *Alfheim Online*. She is nicknamed Hecate, after her gun PGM Ultima Ratio Hecate II, a .50 caliber anti-material rare sniper rifle. She is one of the main characters of volumes five and six and first female player that [Kirito](https://anilist.co/character/36765/Kazuto-Kirigaya) meets in *GGO*. She plays *GGO* to overcome her trauma concerning guns. Calm and cool are the two words that best describe Sinon's personality. In battle and most of the time in the game, she keeps a cool head that actually makes other female players admire her. However, Sinon has a violent temper once angered something that is best seen with her interactions with Kirito. It is actually said that Kirito is the first one to make her extremely angry. Despite all this, Sinon, while may be hard to approach, is generally a friendly person and doesn't mind helping others.    ~!She becomes a Cait Sith archer in *ALO* where she is capable of hitting targets from 200m away despite her bow being limited to 100m.!~",
      "metadata": {
        "gender": "female",
        "age": "16-17",
        "dateOfBirth": "2009-08-21"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b55147-1fCU8lONEuZQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 55147
      },
      "rarity": "legendary"
    },
    {
      "id": "yuuki-konno",
      "name": "Yuuki Konno",
      "alt_names": [
        "紺野木綿季",
        "Zekken (絶剣)",
        "Absolute Sword",
        "Yuuki (ユウキ)"
      ],
      "role": "protagonist",
      "description": "She is a new player who appears in ALO in volume 7, she leads the Sleeping Knights and quickly becomes known as one of the strongest in the game winning 67 straight matches.    ~!Her guild the Sleeping Knights is a group of terminally ill patients who play using the FullDive Technology MediCuboid, Yuuki's disease is AIDS which she obtained through a bad blood transfer she received as a child due to dystocia, the disease took form when she was bullied in school after it was known she was a carrier; she was then later taken to the hospital where she lived the next 3 years in the new medical FullDive Technology called MediCuboid; it is due to this that her experience in the VR world exceeds even the survivors of SAO, and for this reason even makes her a match for Kirito when he is not Dual wielding.  She quickly becomes friends with Asuna due to the reason that she looks similiar to her elder twin sister who died one year prior to her meeting with Asuna.!~",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": "2010-05-23"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64523-LPeAiw8Yx517.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64523
      },
      "rarity": "legendary"
    },
    {
      "id": "ryoutarou-tsuboi",
      "name": "Ryoutarou Tsuboi",
      "alt_names": [
        "壷井遼太郎",
        "Klein"
      ],
      "role": "supporting",
      "description": "A friendly player that meets Kirito at the start of the game and quickly befriends and learns from him. He and Kirito later separate because he has friends who were also new to the game so he couldn't leave them. He survives for the past two years and managed to protect his friends the whole time, something Kirito regretted not doing. He is a katana user and the leader of the small guild Fuurinkazan who participates in the boss battles.  As one of the few people close to Kirito, he always keeps him in check and wants Kirito to survive the game.  He chose the Salamader race on ALO   \n\n~! In the side story Caliber, he fell in love at first sight with the girl on the cage named Freyja and agreed that he will help her find her tribe's treasure which is a hammer, though the decision still remains to be a team's decision. The team said yes on Caliber and it turned out that the girl they saved was Thor. It was revealed that Thor disguised as a beautiful girl to get close to Giant King Þrym and retrieve his hammer. Thor defeated Giant King Þrym and that stopped the medallion from being corrupted and ending the quest. !~",
      "metadata": {
        "gender": "male",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36830-41SWIDvhqOo4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36830
      },
      "rarity": "rare"
    },
    {
      "id": "suguha-kirigaya",
      "name": "Suguha Kirigaya",
      "alt_names": [
        "桐ヶ谷直葉",
        "Leafa",
        "Sugu",
        "Lyfa"
      ],
      "role": "supporting",
      "description": "[Kazuto](https://anilist.co/character/36765)'s sister in the real world. She is 15 years old and in her third year of junior high, as well as a member of the Kendou club. She's a diligent worker and has been practicing Kendou for 8 years.    ~!In the VRMMO game *Alfheim Online*, she is known as Leafa, a Sylph fairy. She stumbled onto Kazuto by accident one night and decided to travel with him to the World Tree. She eventually fell in love with him because he showed that he really loves playing VR games as if living in it and is very honest in everything. In the real world she slowly got closer to her brother (actually a cousin) but because they're family and because he already got [Asuna](https://anilist.co/character/36828) as a girlfriend she decided to give up on him and fall in love with Kazuto instead. But soon afterwards she realized that they're the same person. After being convinced by Kazuto to have a fierce duel which ended up in them flying in each others' arms, she decided to help Kazuto in rescuing Asuna.!~",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": "2009-04-19"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36831-JfyFU7gPPVmr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36831
      },
      "rarity": "rare"
    },
    {
      "id": "keiko-ayano",
      "name": "Keiko Ayano",
      "alt_names": [
        "綾野珪子",
        "Silica (シリカ)"
      ],
      "role": "supporting",
      "description": "She is a middle level dagger user. She is a very cheerful and sweet girl. She has a very rare familiar, a feathery dragon that she named Pina after her cat in the real world. She treasured Pina a lot and was the reason she survived in the game. Aside from being a female player, she is also a Beast Tamer and thus perceived as an idol amongst the middle level players. She received endless invitations from parties and guilds who wanted an idol player to join them to get more fame. Because of the attention she got, she became overly proud of herself and left a party one time after a misunderstanding. She got surrounded by monsters and lost Pina in the end. She was then rescued by Kirito who was passing by and helped her to resurrect the dead familiar.",
      "metadata": {
        "gender": "female",
        "age": "12-15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b37681-GDtOAN6NiJ9M.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37681
      },
      "rarity": "rare"
    },
    {
      "id": "yui",
      "name": "Yui",
      "alt_names": [
        "ユイ"
      ],
      "role": "supporting",
      "description": "A young and cheerful girl with long black hair who looks no older than 10 years old. [Kirito](https://anilist.co/character/36765) and [Asuna](https://anilist.co/character/36828) found her in a forest on the 22nd floor of Aincrad. ~!Her true identity is actually a players' self-regulation program for mental maintenance, Mental Health Counseling Program or MHCP. After being forbidden by the game master [Akihiko Kayaba](https://anilist.co/character/36829) to come close to the players at the beginning of the death game, she was flooded with errors and broke down. In the process she became an AI that possesses actual intelligence. When the Cardinal system governing *Sword Art Online* decided to erase her, Kirito turned her into a tear shaped crystal pendant. He actually converted her to a part of environmental data for the client program and was saved to his NerveGear's local memory.!~  ~!In *ALfheim Online*, she was able to return to her normal form because ALO was based on a copy of the SAO server. She supports Kirito there as a Navigation Pixie. Kirito and Asuna still treat her as their daughter.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43892-Ig6ZMdUbQDO2.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43892
      },
      "rarity": "rare"
    },
    {
      "id": "rika-shinozaki",
      "name": "Rika Shinozaki",
      "alt_names": [
        "篠崎里香",
        "Lis (リズ)",
        "Lisbeth (リズベット)"
      ],
      "role": "supporting",
      "description": "A mace wielder that runs a blacksmith shop in Aincrad on the 48th floor. She made [Asuna](https://anilist.co/character/36828)’s rapier ‘Lament Light’ and one day got a request from [Kirito](https://anilist.co/character/36765) to make him a sword with similar or better quality than his one handed long sword ‘Elucidator’ that he got from a monster drop. She told him that if she had the right materials she could make weapons that would break any sword, so they formed a party and went on a journey to find the material she needed. Because of that journey she came to the conclusion that she felt lonely and yearned for warmth. In ALO she is Leprechaun race blacksmith. \n\n~!She comes to realize that she loves Kirito but after finding out that the one Asuna had feelings for was in fact Kirito she decided to give up on him despite how she feels so Asuna could express her feelings, however during the moments after Kirito's victory and SAO's announcement that the game has been cleared she shouts at the top of her lungs that she loves Kirito and that she will meet him again in the real world, which after the ALO incident she actually does, going to school with him and Asuna.!~",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": "2007-05-18"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43906-15QwTm2ZFDse.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43906
      },
      "rarity": "rare"
    },
    {
      "id": "kyouko-yuuki",
      "name": "Kyouko Yuuki",
      "alt_names": [],
      "role": "supporting",
      "description": "She is Asuna&#039;s mother, she hates FullDive programs after her daughter was trapped in one for 2 years. She is strictly with Asuna as she decides her daughters future and gets angry very fast.    She once tried a FullDive program but she logged off in just a few minutes saying that she was dizzy.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/49085.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 49085
      },
      "rarity": "rare"
    },
    {
      "id": "andrew-gilbert-mills",
      "name": "Andrew Gilbert Mills",
      "alt_names": [
        "アンドリュー・ギルバート・ミルズ",
        "エギル",
        "Agil"
      ],
      "role": "supporting",
      "description": "__Height:__ 180cm\n\nA merchant stationed at city Algate, located at the 50th floor of Aincrad. His shop motto is \"Buy cheap and sell cheap\". He is a very strong axe-wielding warrior in the frontlines.  Kirito sometimes stays in his shop as sort of a disaster shelter, which he gets annoyed with but later ignores as Asuna also visits, which results in some publicity for his shop.   \n\n~!In the real world he is married and owns a Bar called Dicey Cafe!~   \n\n~!In the side story Aria in the Starless Night, he is among the few players who participated in the first floor boss fight and supported Kirito when he knew of the latter's status as a beta tester and later called a Beater. !~   \n\n~!Upon returning to the real world he helps Kirito implement Kayaba's \"seed\" which allows VR games to be easier accessed throughout the world, also vastly decreasing the large licensing cost that companies would pay in servers.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/54099.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 54099
      },
      "rarity": "rare"
    },
    {
      "id": "vassago-casals",
      "name": "Vassago Casals",
      "alt_names": [
        "ヴァサゴ・カザルス",
        "プー",
        "PoH"
      ],
      "role": "supporting",
      "description": "Leader and founder of the red guild \"Laughing Coffin\", known for his large knife and catch phrase \"It's show time.\"  His guild was later destroyed by other players in SAO, but his whereabouts are missing. He is presumed to be alive because he wasn't listed as one of the dead players.  \n\n(Source: SAO Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b70683-5ATgLAHphZtc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70683
      },
      "rarity": "rare"
    },
    {
      "id": "shouichi-shinkawa",
      "name": "Shouichi Shinkawa",
      "alt_names": [
        "新川昌一",
        "Red-Eyed XaXa",
        "Death Gun"
      ],
      "role": "supporting",
      "description": "One of the top members in the red guild Laughing Coffin. He was a master of the Estoc Thorn Sword that was bathed in the color of red. He holds a grudge against [Kirito](https://anilist.co/character/36765) and the clearers that defeated Laughing Coffin in the anti-PK raid. He was also partners with Johnny Black, and together served as a combination where they poisoned and killed.   ~!After his release from *Sword Art Online*, through the recommendation of his brother [Kyouji](https://anilist.co/character/73151), he began to play *Gun Gale Online*. The two looked to another Laughing Coffin member and began to plot a ingenious plan to kill players in both the virtual world and the real world. He enters the Bullet of Bullets tournament under the name Sterben to prove his \"true\" killing ability to the rest of the world. He would stun people with special shells from his L115A3 Silent Assasin sniper rifle and then get up close to shoot them with his Death Gun, a 7.62 X 25 handgun. While he commited the kill in-game, his brother and the other Laughing Coffin member would inject the players in the real world with a syringe that stopped the heart. They had obtained the address by hiding under a Metamaterial Optical Camouflage while they watched the other players type their real addresses during the BoB registration process. His plans were foiled by Kirito and [Sinon](https://anilist.co/character/55147), and eventually goes to prison after the incident had passed.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b70685-gujlpmSzLQLm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70685
      },
      "rarity": "rare"
    },
    {
      "id": "atsushi-kanamoto",
      "name": "Atsushi Kanamoto",
      "alt_names": [
        "金本敦",
        "Johnny Black (ジョニー・ブラック)"
      ],
      "role": "supporting",
      "description": "Johnny Black was a survivor of Sword Art Online, he's a member of the infamous red guild Laughing Coffin and is partnered with Xaxa. He is well known for using poisons and such in battles.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b70687-Au0xDfoUoBGy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70687
      },
      "rarity": "rare"
    },
    {
      "id": "seijirou-kikuoka",
      "name": "Seijirou Kikuoka",
      "alt_names": [
        "菊岡誠二郎",
        "Chrysheight"
      ],
      "role": "supporting",
      "description": "Seijirou Kikuoka is a member of the Ministry of Internal Affairs and Communications, Technology, Second Separated Advanced Network Division, or «Virtual Division». He uses the nickname «Chrysheight» in «ALfheim Online»",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72205-ghU8EMYyo96L.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72205
      },
      "rarity": "rare"
    },
    {
      "id": "alicia-rue",
      "name": "Alicia Rue",
      "alt_names": [
        "アリシャ・ルー"
      ],
      "role": "supporting",
      "description": "Alicia Rue is the leader of the Cait Sith. She was elected by popular vote. She is also training her dark magic capable of using Moonlight Mirror. She forms an alliance with the Sylphs to finish the Conquer the World Tree Quest.    ~!During the meeting with Sylph , the groups are attacked by Salamanders lead by General Eugene. Kirito dives in to save the day and fights off Eugene although Kirito has inferior equipment.  Later, along with Sylph reinforcements, she aid Kirito's ascension of the World Tree after using collected funds to purchase armor of at least Ancient grade for all of her warriors.!~ (Source: SAO Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72901-nw8klNK66XFl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72901
      },
      "rarity": "rare"
    },
    {
      "id": "eugene",
      "name": "Eugene",
      "alt_names": [
        "ユージン"
      ],
      "role": "supporting",
      "description": "General Eugene is the head of the Salamander armed forces.   ~!He was considered the strongest player in ALfheim Online until he was defeated by Kirito during the Conference of the Lords.!~ (Source: SAO Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72903-sydZD4sXrDTw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72903
      },
      "rarity": "rare"
    },
    {
      "id": "sigurd",
      "name": "Sigurd",
      "alt_names": [
        "シグルド"
      ],
      "role": "supporting",
      "description": "Sigurd is a Sylph warrior in the VRMMORPG «ALfheim Online». He lost to Lyfa in the Sylph tournament yet he still retained high ambitions to hold power among the Sylph. He later tries to betray the Sylph to the Salamander. He is later caught and exiled by Sakuya, after the botched assassination attempt.   (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72905-IgRbCfHOLSCh.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72905
      },
      "rarity": "rare"
    },
    {
      "id": "kyouji-shinkawa",
      "name": "Kyouji Shinkawa",
      "alt_names": [
        "新川恭二",
        "Spiegel (シュピーゲル)",
        "Richter (リヒター)"
      ],
      "role": "supporting",
      "description": "Kyouji is a player of the American produced VRMMORPG Gun Gale Online. He uses the AGI powered character Spiegel. He is Asada Shino's friend and the one introduced her to GGO.    ~!He is a son of the director of a hospital. He later develops a hatred towards Zekushido, as well as other STR-oriented players, for destroying Spiegel's development by suggesting AGI as the way to power provoking him to boost AGI, but being unable to wield heavy guns due to his lack in STR. He also later develops a stalker attachment towards Shino, resulting in him attempting a homicide and suicide together with her, only to be foiled by Kirito, almost being killed in the process. He also played the role of Death Gun when Zenkushido and Usujiro Takaro were killed. In the end, he and his brother were arrested by the police.!~ (Source: SAO Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/73151.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 73151
      },
      "rarity": "rare"
    },
    {
      "id": "sakuya",
      "name": "Sakuya",
      "alt_names": [
        "サクヤ"
      ],
      "role": "supporting",
      "description": "Leader of the Sylph race and an exceptional swordswoman. She was elected as the leader of the Sylph race by popular vote (80% voice of the vote). Her statistics are not very high due to her status as a Lord not allowing her to do much training. Despite her low stats, she is a formidable opponent in the Sylph dueling tournaments.    ~!During a meeting with the Cait Sith, she is attacked by Salamanders led by General Eugene. At the same moment, Kirito flies in to challenge the intruder to a duel. After Kirito wins the battle, she attempts to seduce him along with Alicia Rue. Lyfa smothers their attempt, saying that he is accompanying her to the World Tree. At the end of the arc, Lady Sakuya leads a combined force of Cait Sith and Sylph against the World Tree in an attempt to aid Kirito along his journey.!~ (Source: SAO Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/73811.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 73811
      },
      "rarity": "rare"
    },
    {
      "id": "natsuki-aki",
      "name": "Natsuki Aki",
      "alt_names": [
        "安岐ナツキ"
      ],
      "role": "supporting",
      "description": "is a nurse who works for the Japan Ground Self-Defense Force (JGSDF) and was assigned by Kikuoka Seijirou to oversee Kirigaya Kazuto's medical condition at «Chiyoda Hospital» when he was hospitalized as well as during his rehabilitation. She is later assigned to watch over Kazuto during the «Death Gun» incident and after Kazuto is injected with succinylcholine.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b136729-FGgchmrKc2u9.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 136729
      },
      "rarity": "rare"
    },
    {
      "id": "dyne",
      "name": "Dyne",
      "alt_names": [
        "ダイン"
      ],
      "role": "supporting",
      "description": "Dyne is a player in the VRMMO game, Gun Gale Online. He is the leader of a PvP (anti-personnel) squadron that primarily targets weaker low-risk opponents.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b187242-cW8Ypl0hAT3G.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 187242
      },
      "rarity": "rare"
    },
    {
      "id": "pale-rider",
      "name": "Pale Rider",
      "alt_names": [
        "ペイルライダー"
      ],
      "role": "supporting",
      "description": "Pale Rider was one of the participants of the third Bullet of Bullets(BoB) tournament in the Gun Gale Online. Pale Rider was a STR-type player, who had three dimensional mobility.\nPale Rider was a tall, skinny male who wore blue and white camouflage clothing. Due to his black helmet, his face could not be seen. Pale Rider used an ArmaLite AR17 Shotgun.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b187243-7xo6BtzF9rpt.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 187243
      },
      "rarity": "rare"
    },
    {
      "id": "behemoth",
      "name": "Behemoth",
      "alt_names": [
        "ベヒモス"
      ],
      "role": "supporting",
      "description": "A high-ranked mercenary player in the VRMMO, Gun Gale Online, who is usually hired as a bodyguard for player groups with money but no perseverance. Behemoth uses a heavy GE M134 Minigun as his weapon of choice.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b187244-MslFtyAhnRKg.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 187244
      },
      "rarity": "rare"
    },
    {
      "id": "nori",
      "name": "Nori",
      "alt_names": [
        "ノリ"
      ],
      "role": "supporting",
      "description": "She is a medium-range, damage-dealer member of the Sleeping Knights, a guild of terminally ill patients who met in Serene Garden and played various virtual reality games as a form of palliative care. Nori had played a variety of virtual reality games, until the guild eventually arrived to ALfheim Online, where Nori chose to be a Spriggan.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212207-a6NcnlEq9jai.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212207
      },
      "rarity": "rare"
    },
    {
      "id": "freyja",
      "name": "Freyja",
      "alt_names": [
        "フレイヤ"
      ],
      "role": "supporting",
      "description": "An Npc that appears in the scalibur sword plot, being locked up and being Klein who falls in love with her and frees her",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212614-YqDMMY8R5lJh.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212614
      },
      "rarity": "rare"
    },
    {
      "id": "thrym",
      "name": "Thrym",
      "alt_names": [
        "スリュム"
      ],
      "role": "supporting",
      "description": "is an NPC that appears in ALfheim Online. He is the king of the Frost Giants and the main antagonist of the Caliber Arc.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212616-5ED8q3KKmy9L.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212616
      },
      "rarity": "rare"
    },
    {
      "id": "siune",
      "name": "Siune",
      "alt_names": [
        "シウネ",
        "An Si-eun"
      ],
      "role": "supporting",
      "description": "She was the second sub-leader of the Sleeping Knights, a guild of terminally ill patients who met in Serene Garden and played various virtual reality games as a form of palliative care. An Si-eun had played a variety of virtual reality games, including Insect Site, until the guild eventually arrived to ALfheim Online, where An Si-eun chose to be an Undine.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212618-mOeHTkAfnksH.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212618
      },
      "rarity": "rare"
    },
    {
      "id": "tecchi",
      "name": "Tecchi",
      "alt_names": [
        "テッチ"
      ],
      "role": "supporting",
      "description": "He is a close-range, tank-build member of the Sleeping Knights, a guild of terminally ill patients who met in Serene Garden and played various virtual reality games as a form of palliative care. Tecchi had played a variety of virtual reality games, until the guild eventually arrived to ALfheim Online, where Tecchi chose to be a Gnome.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212619-cKHBwja5exTi.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212619
      },
      "rarity": "rare"
    },
    {
      "id": "talken",
      "name": "Talken",
      "alt_names": [
        "タルケン"
      ],
      "role": "supporting",
      "description": "He is a medium-range, damage-dealer member of the Sleeping Knights, a guild of terminally ill patients who met in Serene Garden and played various virtual reality games as a form of palliative care. Talken had played a variety of virtual reality games, until the guild eventually arrived to ALfheim Online, where Talken chose to be a Leprechaun.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212620-2VtxFaIZjaNP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212620
      },
      "rarity": "rare"
    },
    {
      "id": "jun",
      "name": "Jun",
      "alt_names": [
        "ジュン"
      ],
      "role": "supporting",
      "description": "He is a close-range tank-build swordsman member of the Sleeping Knights, a guild of terminally ill patients who met in Serene Garden and played various virtual reality games as a form of palliative care. Jun had played a variety of virtual reality games, until the guild eventually arrived to ALfheim Online, where Jun chose to be a Salamander.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212621-oaBRcdKJrh2c.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212621
      },
      "rarity": "rare"
    },
    {
      "id": "yamikaze",
      "name": "Yamikaze",
      "alt_names": [
        "闇風",
        "Dark wind"
      ],
      "role": "supporting",
      "description": "Is an AGI-type player in Gun Gale Online and a participant in the 2nd and 3rd Bullet of Bullets.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212622-i4cVdiTHhXuI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212622
      },
      "rarity": "rare"
    },
    {
      "id": "verdandi",
      "name": "Verdandi",
      "alt_names": [
        "ベルザンディ"
      ],
      "role": "supporting",
      "description": "NPC that are part of the Excalibur mission.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212646-RFhVrxp9nUIm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212646
      },
      "rarity": "rare"
    },
    {
      "id": "skuld",
      "name": "Skuld",
      "alt_names": [
        "スクルド"
      ],
      "role": "supporting",
      "description": "She is one of the NPCs that are part of the Excalibur mission.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212679-1M4lXCvCsDy6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212679
      },
      "rarity": "rare"
    },
    {
      "id": "urd",
      "name": "Urd",
      "alt_names": [
        "ウルズ",
        "Lake Queen"
      ],
      "role": "supporting",
      "description": "It is an NPC that appears in one of the missions of ALfheim Online which consists of rescuing the Holy Sword Excalibur from Þrymheimr. She is friends with the Evil-type animal creatures that inhabit Jötunheimr.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212691-Gq4vtNYKRQqZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212691
      },
      "rarity": "rare"
    },
    {
      "id": "pina",
      "name": "Pina",
      "alt_names": [
        "ピナ"
      ],
      "role": "supporting",
      "description": "is Silica's Feathered Little Dragon and the first known monster to be tamed in Sword Art Online. It understands Silica's commands and will protect her in any way it can, as it is her «Tamed Monster». It is also present in ALfheim Online as her Cait Sith familiar.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212810-jHVw3QgmELu9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212810
      },
      "rarity": "rare"
    },
    {
      "id": "kurahashi",
      "name": "Kurahashi",
      "alt_names": [
        "倉橋"
      ],
      "role": "supporting",
      "description": "He is in charge of the long-term care department at the Yokohama Kōhoku General Hospital and was Konno Yuuki's doctor since she was little. He had been helping her overcome her human immunodeficiency virus (HIV) and was the one who persuaded her to use the Medicuboid",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212915-EKf3VoX2uTcN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212915
      },
      "rarity": "rare"
    },
    {
      "id": "endou",
      "name": "Endou",
      "alt_names": [
        "遠藤"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b213209-21cGOSK1Q2No.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 213209
      },
      "rarity": "rare"
    },
    {
      "id": "ginrou",
      "name": "Ginrou",
      "alt_names": [
        "ギンロウ"
      ],
      "role": "supporting",
      "description": "He is a member of Dyne's PvP (anti-personnel) squad that targets weaker, low-risk opponents. Ginrou's evasion skills in face-to-face combat is known to be above average",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b213210-rvGjswsvQqay.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 213210
      },
      "rarity": "rare"
    },
    {
      "id": "avatar-buyer",
      "name": "Avatar Buyer",
      "alt_names": [
        "アバターバイヤー"
      ],
      "role": "supporting",
      "description": "A GGO player dedicated to purchasing skins from new players",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b213211-rLh5QKpPgBqV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 213211
      },
      "rarity": "rare"
    },
    {
      "id": "tamotsu-shigemura",
      "name": "Tamotsu Shigemura",
      "alt_names": [
        "茂村保",
        "XeXeeD",
        "Zexceed",
        "ゼクシード"
      ],
      "role": "minor",
      "description": "He is a Gun Gale Online player who ranked first in the second Bullet of Bullets tournament.",
      "metadata": {
        "gender": "male",
        "age": "26",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212626-TnTFuf2g69JM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212626
      },
      "rarity": "common"
    },
    {
      "id": "aiko-konno",
      "name": "Aiko Konno",
      "alt_names": [
        "紺野藍子"
      ],
      "role": "minor",
      "description": "She is the older sister of [Yuuki Konno](https://anilist.co/character/64523). She is the founder of the Sleeping Knights Guild, a group of terminally ill patients who play VRMMOs.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212627-ElSNIBAESczE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212627
      },
      "rarity": "common"
    },
    {
      "id": "juushi-x",
      "name": "Juushi X",
      "alt_names": [
        "銃士X",
        "Musketeer X"
      ],
      "role": "minor",
      "description": "A player in the VRMMO game, Gun Gale Online, and a participant in the 3rd Bullet of Bullets. She is one of the four players in the finals of the tournament who had not participated in the finals of the previous two tournaments.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b247629-IybGY7DguHeW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 247629
      },
      "rarity": "common"
    },
    {
      "id": "akiyo-sada",
      "name": "Akiyo Sada",
      "alt_names": [
        "佐田明代"
      ],
      "role": "minor",
      "description": "Housekeeper working for the Yuuki family",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b247631-KFWd0IryHM4s.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 247631
      },
      "rarity": "common"
    },
    {
      "id": "shishi-ou-richie",
      "name": "Shishi Ou Richie",
      "alt_names": [
        "獅子王リッチー",
        "Lion King Richie",
        "TatekomoRichie (立てこもリッチー)"
      ],
      "role": "minor",
      "description": "Richie participated in the 2nd Bullet of Bullets tournament, during which he occupied the highest point in the area and used his machine gun to keep other players away. However, Richie had to withdraw after running out of ammunition.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b247633-lkbknbXz6455.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 247633
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-23T05:30:06.199Z"
}