{
  "work_id": "golden-kamuy",
  "count": 15,
  "characters": [
    {
      "id": "yoshitake-shiraishi",
      "name": "Yoshitake Shiraishi",
      "alt_names": [
        "白石由竹",
        "Escape King (脱獄王)",
        "Scat King"
      ],
      "role": "protagonist",
      "description": "One of the Abashiri Convicts who travels with Sugimoto's Group. \n\nShiraishi is carefree and goofy, and prefers to sneak his way out of trouble. He is also rather immature. Most of the time, Shiraishi lacks seriousness and prefers to spend time on frivolous pursuits like gambling or eating rather than looking for the gold. He also likes pretty women; his backstory involves him searching for a woman he fell in love with through a sloppy drawing.\n\nShiraishi has a roguish personality. Because he lacks strength, he prefers to flee danger but is confident in his ability to escape any bond. He tends to keep his calm when in danger as a result and given time, can psychologically dominate his guards and manipulate them.\n\nShiraishi is based on the real life figure _Yoshie Shiratori_ who is known for having escaped from prison at least four times.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124699-dcZaqPHKkT8D.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124699
      },
      "rarity": "epic"
    },
    {
      "id": "asirpa",
      "name": "Asirpa",
      "alt_names": [
        "アシㇼパ",
        "Ekasiotompuy",
        "Asuko Kochoube (小蝶辺明日子)",
        "Beloved child of the Ainu",
        "Ainu woman for a new era"
      ],
      "role": "protagonist",
      "description": "Asirpa is an Ainu girl who finds Sugimoto when he is attacked by a bear. Her father was one of the Ainu killed by the Japanese who stole the Ainu gold. Her Japanese name is Asuko Kochoube (小蝶辺明日子).\n\nFrom a young age, Asirpa was trained by her father to become a hunter. As such, she possesses many skills that are necessary for a successful hunter: trapping, poison brewing, knowledge of traditional medicine, archery, deep knowledge of Hokkaido's flora and fauna, harsh winter survival. Asirpa is also a great cook and can prepare many traditional Ainu dishes from the animals she hunts, along with what she forages in the forest.",
      "metadata": {
        "gender": "female",
        "age": "12-16",
        "dateOfBirth": "1895-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124701-PecnElfoJlP1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124701
      },
      "rarity": "epic"
    },
    {
      "id": "saichi-sugimoto",
      "name": "Saichi Sugimoto",
      "alt_names": [
        "杉元佐一",
        "Sugimoto the Immortal (不死身の杉元)",
        "Vagrant Boy (ノラ坊)"
      ],
      "role": "protagonist",
      "description": "__Likes:__ Dried persimmons, salted brains, animals\n__Dislikes:__ Ikanago no kugini, locust tsukudani, bugs\n\nA demobilized soldier who survived the Russo-Japanese War in 1904. He served in the 1st Division of the Imperial Japanese Army and fought in the battle of 203 Hill. He was feared for his savage fighting style and amazing toughness on the battle field, and was known as \"Immortal Sugimoto\". He decides to make money to save his dead comrade Toraji's wife.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124704-bndQyaj7X9dv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124704
      },
      "rarity": "epic"
    },
    {
      "id": "hyakunosuke-ogata",
      "name": "Hyakunosuke Ogata",
      "alt_names": [
        "尾形百之助",
        "Ogata the Wildcat (山猫尾形)"
      ],
      "role": "supporting",
      "description": "Ogata is the former Superior Private of the 7th Division and a member of Hijikata's Group. Loyal only to himself, Ogata is pursuing the gold for his own reason, unknown to anyone.\n\nOgata is analytical and coldblooded, a proud sniper who is used to examining things from afar and evaluating circumstances in order to best take advantage of them. Even when at a disadvantage, he keeps his nerve and takes the most efficient course of action. He is also known for his marksmanship, a skill he honed since his childhood. He is ruthless and doesn't hesitate to kill, although he is aware that wanton slaughter is counterproductive, and would rather escape a fight he can't win than throw himself into it impulsively.\n\nOn the surface, Ogata is capable of acting amiable and polite; in order to achieve his goals, he can lie and deceive others. He is prone to caustic remarks and may openly look down on some people. Ogata also likes to snark about any perceived absurdity and incompetence, especially if it comes to warfare and keeping one's gun safe. Although he is generally emotionless and indifferent to others, Ogata seems to be a very proud man who doesn't like to be doubted. If challenged, he would attempt to do a task that someone says would be difficult for him. He has a habit of slicking his hair back, as well as exhaling through his nose when praised.\n\n~!Ogata can speak Russian, something which seems to be a secret or not well known, as Koito was surprised to hear him speak the language.!~\n\n(Source: Golden Kamuy Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125440-k6UjjqZYsJa7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125440
      },
      "rarity": "uncommon"
    },
    {
      "id": "genjirou-tanigaki",
      "name": "Genjirou Tanigaki",
      "alt_names": [
        "谷垣源次郎",
        "Ani Matagi",
        "Bear Cub"
      ],
      "role": "supporting",
      "description": "The Private First Class of the 7th Division and a Matagi of Tohoku. He seems to have a frail and low self-esteem, being shown to cry easily under heavy criticism.\n\nTanigaki is a Japanese man from Akita, around the age of Sugimoto and the Nikaidou twins, with a muscular body and body hair. He has dark brown eyes, short, black hair, a thin beard along his jawline, and thick eyebrows. Since his and Nihei Tetsuzou's fight against Sugimoto's group, he has a little scar on his right cheek from a wound caused by Sugimoto's knife.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125441-H9SKYRPP5ex6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125441
      },
      "rarity": "uncommon"
    },
    {
      "id": "tokushirou-tsurumi",
      "name": "Tokushirou Tsurumi",
      "alt_names": [
        "鶴見篤四郎",
        "Grim Reaper",
        "Tsurumi-chuui",
        "Lieutenant Tsurumi (鶴見中尉)"
      ],
      "role": "supporting",
      "description": "__Likes:__ Japanese sweets (Wagashi)\n__Dislikes:__ Alcohol\n\nLeader of the 7th Division and one of the antagonists of the series.\n\nTsurumi has an unpredictable, mildly histrionic and erratic behaviour. However, In the past, Tsurumi was normal and was even a brave Japanese officer who fought at the front during the Russo-Japanese war.\n\nReceiving a shrapnel in the head and the general bitterness at the poor treatment his division has received after the war has made Tsurumi psychotic and violent, though some of his manipulative tendencies may have been present even before the injury. He is prone to threatening people and personally inflicting physical injury on his enemies but hides his brutal tendencies under a veneer of sophistication and sympathy. He also genuinely admires the macabre work of Edogai and develops a friendship with him. Tsurumi never becomes angry, but coldly manifests his rage with a brutal gesture, perhaps due to his brain damage.\n\nTsurumi aims to take over Hokkaido and is very ruthless in his methods. He kills anyone in his way or threatens his plan. He seems to still hold the men under his command in high regard but hates traitors. He has shown a level of care for his subordinates as seen when he tries to get Nikaidou to eat his food and provide prosthetic limbs for him.\n\nTsurumi is also a very charismatic and manipulative man that can sway the minds of other people with a powerful and explosive speech. As a result, he is not above lying to other people if it is to get what he desires, such as loyal and strong followers.",
      "metadata": {
        "gender": "male",
        "age": "41",
        "dateOfBirth": "1866-12-25"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125442-m8IVnzFOZOTS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125442
      },
      "rarity": "uncommon"
    },
    {
      "id": "tatsuma-ushiyama",
      "name": "Tatsuma Ushiyama",
      "alt_names": [
        "牛山辰馬",
        "Ushiyama the Undefeated (不敗の牛山)",
        "Professor Penis (チンポ先生)",
        "Obencho (オベンチョ)"
      ],
      "role": "supporting",
      "description": "One of the Abashiri Convicts. Ushiyama is a pragmatic and serious criminal. Aiming to steal the Ainu gold, Ushiyama is focused on his mission and always threads with prudence, regularly offering reasonable advice to Hijikata.\n\nHe is also a womanizer. Ushiyama lusts after any beautiful woman he comes across and is very direct when he solicits sex. It is his main way of distracting himself. He claims that in a relationship, a man's penis is the most important factor, but says that it has to be \"gentlemanly\".\n\nAs a judoka, Ushiyama relishes fights and challenges. When he met Sugimoto, he was impressed favorably by his strength and befriended him. He likes to fight and had a great time clashing with Sugimoto, being disappointed when it was interrupted. Ushiyama is confident in his fighting prowess to the point he will challenge a (weakened) bear in combat and even briefly taunts it about spreading his legend among bears when he forces it to flee.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125443-BjYabzuHcntF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125443
      },
      "rarity": "uncommon"
    },
    {
      "id": "toshizou-hijikata",
      "name": "Toshizou Hijikata",
      "alt_names": [
        "土方歳三",
        "Demon Vice Commander of the Shinsengumi",
        "Merciless Vice-Commander (鬼の副長)",
        "Baragaki (バラガキ)"
      ],
      "role": "supporting",
      "description": "Hijikata is the vice-commander of the Shinsengumi and leader of his group. Despite being emprisoned for decades, he remains energetic and optimistic.\n\nHijikata is very ambitious despite his old age and plans to take over Hokkaido and create his own country in defiance of Japan. To do so, he takes swift and decisive action to search for the gold. As a former Shinsengumi, Hijikata is ruthless and doesn't hesitate to kill his opponents. Always smiling, Hijikata is flamboyant and regularly boasts about his ambitions and prowess despite his age. He is civil toward people but merciless against his enemies, always shouting to his men to kill every opponent. Hijikata considers that in battle, the best soldiers are those ready to die fighting.\n\n(Source: Golden Kamuy Wiki)",
      "metadata": {
        "gender": "male",
        "age": "72",
        "dateOfBirth": "1835-05-31"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125422-SZKtAOvAYiN1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125422
      },
      "rarity": "uncommon"
    },
    {
      "id": "otonoshin-koito",
      "name": "Otonoshin Koito",
      "alt_names": [
        "鯉登音之進",
        "コイトオトノシン"
      ],
      "role": "supporting",
      "description": "Koito Otonoshin is a Second Lieutenant of the 7th Division.\n\nKoito is a tall, dark-skinned man with dark hair. He has his side part slicked down to the left. His eyebrows are usually furrowed, with two larger sections towards the center, and furrow wrinkles up his forehead. His eyes are black, thin, and have deep eye bags.\n\nBecause Koito is from the Satsuma Province, which is located in the southern tip of Japan, his dialect slips out sometimes. This often happens when he is excited or nervous. However, this dialect cannot be understood by most Japanese speakers.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b128971-Q0eIaHh0QffS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 128971
      },
      "rarity": "uncommon"
    },
    {
      "id": "kiroranke",
      "name": "Kiroranke",
      "alt_names": [
        "キロランケ",
        "Yulbars",
        "ユルバルス",
        "Юлбарс",
        "Philip",
        "フィリップ"
      ],
      "role": "supporting",
      "description": "An Ainu and an old friend of Asirpa's father.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129247-0UERXeEojRPd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129247
      },
      "rarity": "uncommon"
    },
    {
      "id": "inkarmat",
      "name": "Inkarmat",
      "alt_names": [
        "インカㇻマッ",
        " Ikaktar Cironnup",
        "Trickster Fox"
      ],
      "role": "supporting",
      "description": "__Likes:__ Rabbit meat\n__Dislikes:__ Dogs\n\nInkarmat is a mysterious Ainu fortune-teller who meets Asirpa during her travels. She claims to know something important about Asirpa and her father.\n\nInkarmat is a sly and cunning woman, oftentimes using people's perceptions against them and using quick deduction and the knowledge that she holds to make her 'predictions'. She enjoys fortune telling, and may even find it to be a source of comfort, as she drops the jawbone many times before the Abashiri Prison break to try and reassure herself of the fate of Asirpa's father. She certainly enjoys using it as a source of income, since she can easily swindle people out of their money and have enough left over to spend it on lavish things for herself and later on for meals for Tanigaki and Chikapasi.\n\nThough her methods may be outlandish and far too fox-like to some, Inkarmat has been shown to care deeply about the fate of the Ainu people, and wants to make sure that Asirpa is taken care of. Despite her being somewhat selfish and self-serving, she has also shown fierce loyalty to those few she has attached herself to.\n\nInkarmat was born in Hokkaido, in the Saru district. She first met Asirpa's father in Otaru while she was wandering around as an orphan. She claims that she was the one who taught him about Ainu culture, instead of Asirpa's mother, but he must have forgotten about her since she was a child. She left Otaru after Asirpa's father got married, predicting she would not meet him again because she will die in eastern Hokkaido. Before she left, Asirpa's father gave Inkarmat the outfit she currently wears, which is a memento from his mother.\n\n(Source: Golden Kamuy Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129249-OP27S9l6sgLM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129249
      },
      "rarity": "uncommon"
    },
    {
      "id": "shinpachi-nagakura",
      "name": "Shinpachi Nagakura",
      "alt_names": [
        "永倉新八",
        "Gamushin",
        "ガムシン"
      ],
      "role": "supporting",
      "description": "Nagakura Shinpachi is a member of Hijikata's Group and regarded as the best swordsman in the Shinsengumi.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/125426-xu4Yk9eiU4m4.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125426
      },
      "rarity": "uncommon"
    },
    {
      "id": "tetsuzou-nihei",
      "name": "Tetsuzou Nihei",
      "alt_names": [
        "二瓶鉄造",
        "The Hunter Who Gives Hibernating Bears Bad Dreams"
      ],
      "role": "supporting",
      "description": "Tetsuzou Nihei was a hunter and one of the Abashiri Convicts. He owns a dog named Ryu.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n125438-65jGTIEU5b3M.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125438
      },
      "rarity": "uncommon"
    },
    {
      "id": "youhei-nikaidou",
      "name": "Youhei Nikaidou",
      "alt_names": [
        "二階堂洋平"
      ],
      "role": "supporting",
      "description": "Younger twin brother of Kouhei Nikaidou and a member of the 7th Division. \n~!He was killed by Saichi Sugimoto and had his intestines taken to cover up his escape. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n125439-xkqrty3jfsoH.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125439
      },
      "rarity": "uncommon"
    },
    {
      "id": "kouhei-nikaidou",
      "name": "Kouhei Nikaidou",
      "alt_names": [
        "二階堂浩平"
      ],
      "role": "supporting",
      "description": "Kouhei Nikaidou is the Private First Class of the 7th Division and Youhei's older twin brother.\n\nLike his brother, he has a well accented face with a thin, pointed nose. His eyes have the rounded shape of black color equal to his hair cut very short. He is seen wearing the uniform of his ward.\n\n~!After the death of his twin brother Youhei, Nikaidou became focused on revenge against Sugimoto. \nHe seems to have a strong craving for morphine as just the mere mention of it was able to get his full attention.!~\n\n~!Kouhei loses a multitude of his body parts throughout the story. He lost:\nHis left ear to a bear when hunting for Tanigaki,\nhis right ear when Tsurumi cut it off after catching him following said hunt,\nhis right leg to Hijikata's ambush inside Edogai's house as well as\nhis right hand when he tried to shoot Sugimoto after his failed ambush in Abashiri Prison.\n\nHe gets prosthetic limbs for his leg and hand made by Narizou Arisaka. The prosthetic limb has a hidden gun in it. \n!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127291-psZhyuLcN9SK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127291
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-24T23:16:09.302Z"
}