{
  "work_id": "inuyasha",
  "count": 15,
  "characters": [
    {
      "id": "inuyasha",
      "name": "Inuyasha",
      "alt_names": [
        "犬夜叉"
      ],
      "role": "protagonist",
      "description": "__Birthday:__ Unconfirmed \n__Birthplace:__ Western Japan, equal to Toyama  \n__Height:__ 167 cm  \n__Weapons:__ claws, sword-Tessaiga  \n__Attacks:__ Claws-Sankountessou, Hijinkessou. Tessaiga- Kaze no Kizu, Bakuryuuha, Kongousoha, and Meido Zangetsuha.   \n__Family:__ Izayoi (mom), InuTaisho (dad), and Sesshoumaru (half-brother).  \n\nThe male protagonist, a hybrid of a youkai-dog and a human, a half-demon (\"han'yo\" in Japanese). He wields the Tessaiga (pronounced \"Tetsaiga\" in the American dub), a supernatural sword made from one of his deceased father's fangs. This sword, when properly wielded, can destroy one hundred demons with a single swing, and has further powers which are revealed as the story progresses. It is also a source of which hatred exists between Inuyasha and his brother Sesshomaru, a full youkai dog demon, being that Inuyasha can wield the Tessaiga and Sesshomaru can not. Inuyasha has a tendency for massive regeneration and can recover from injuries which would be fatal for any average human. This ability is likely derived from his youkai powers (Example: Episode 5, when Kagome brings medicine from her time). On the night of the new moon each month, Inuyasha will change into a normal human with black hair, brown eyes, and loses his yokai power during this time. Prior to meeting his current companions, he would conceal himself during this time. Inuyasha loves Kikyo, and still does, but things get complicated when he starts to develop feelings of love for Kagome. He has mastered different abilities for his sword including the red tessaiga that can destroy barriers and also learning the backlash wave which hurls an opponents demonic energy right back at it.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1353-xsZhvfi7IFzT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1353
      },
      "rarity": "epic"
    },
    {
      "id": "kagome-higurashi",
      "name": "Kagome Higurashi",
      "alt_names": [
        "日暮かごめ",
        "Aome"
      ],
      "role": "protagonist",
      "description": "__Height:__ 157.5 cm (5'1\")   \n__Weight:__ 49 kg  \n\nThe female protagonist and a third year middle school student. In the tradition of many Rumiko Takahashi heroines (Lum, Akane Tendo, Kyoko Otonashi), Kagome can be extremely sweet, but can also become very dangerous when provoked. \n\nInuYasha wears a special bead necklace (known as the Beads of Subjugation) which only responds to Kagome's command: when she yells \"Sit!\" (\"Osuwari!\") (Often \"Sit, boy!\" in the dub) InuYasha is thrown to the ground. The necklace was placed upon him due to his dangerous attitude when he was unsealed. \nAs the series continues, Kagome uses the necklace less and less. It is scarcely used by this point in time, and is purely comedic relief when it is. \n\n~!She is the reincarnation of a priestess 50 years ago, named Kikyo, the previous protector of the shikon no tama.!~\n\nAs fate would have it, Kagome also develops feelings of strong love for InuYasha. This relationship proves to be a driving point of the series. In the series, Kagome becomes a powerful miko (not really a miko).",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1354-PuUTCSX7UzKA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1354
      },
      "rarity": "epic"
    },
    {
      "id": "sango",
      "name": "Sango",
      "alt_names": [
        "珊瑚"
      ],
      "role": "protagonist",
      "description": "__Height:__ 165 cm\n\nSango is a youkai slayer  who hails from a village of professional yōkai slayers. The only member of Inuyasha's group to have no supernatural powers, Sango instead wields the Hiraikotsu, a massive boomerang made of yōkai bones, in addition to a broad repertoire of tools and tricks for battling yōkai. Sango is also a victim of Naraku's evil schemes; her family was killed and her entire village destroyed by Naraku's yōkai so that Naraku could then blame Inuyasha and manipulate Sango into trying to kill him. When his plot failed, Naraku used a shard of the Shikon Jewel to revive and control her little brother Kohaku, forcing him to fight Inuyasha and company, and using him as a means by which to manipulate Sango. She seeks vengeance against Naraku, but her primary goal is to rescue Kohaku from Naraku's influence and somehow save his life, although currently it's uncertain if she will be able to do so as Kohaku's life is tied to the jewel shard. She has obvious feelings towards Miroku, although she is offended by his constant groping and lechery.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1355-zPTmTwhMXQbt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1355
      },
      "rarity": "epic"
    },
    {
      "id": "miroku",
      "name": "Miroku",
      "alt_names": [
        "弥勒",
        "Houshi",
        "Monk"
      ],
      "role": "protagonist",
      "description": "A Buddhist 'houshi,' or low-ranking, itinerant monk, Miroku traveled the countryside performing services such as exorcisms and yōkai exterminations to earn his living. He suffers from a hereditary curse originally inflicted upon his grandfather Miyatsu (also a Buddhist monk) by Naraku, who exploited Miyatsu's weakness for attractive women by taking the shape of one, and reflected one of Miyatsu's ofuda back to pierce the palm of his right hand (it appears to be his left hand in the English language manga where right and left are reversed). The hole in his hand became a kazāna (air void or \"wind tunnel\") which sucks in anything not nailed down, regardless of mass. Miroku uses the kazāna as a powerful weapon against yōkai, but as he grows older, the kazāna grows inevitably larger, and if the curse is not broken by Naraku's death, it will grow too large to control and consume Miroku himself - the same fate his grandfather and his father have already met. Probably as a result of this, Miroku takes a hedonistic approach to life which is uncharacteristic of a proper monk; he is a talented con artist who does not hesitate to invent fictitious supernatural menaces which he can then offer to combat in return for food and shelter, and like his grandfather he has a distinct weakness for pretty women. He makes a point of asking every attractive woman he meets if she will bear his child, claiming that he wants to be sure of an heir to continue his pursuit of Naraku if he dies, and his hands have a seemingly uncontrollable habit of wandering - something which often gets him soundly thumped by Sango, the favorite subject of his groping. However, in spite of his less-than-saintly behavior, Miroku proves to have a core of deep spirituality and, as a result, impressive spiritual powers. (\"Miroku\" is Japanese for Maitreya.)",
      "metadata": {
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1356-rLhVHJzPY0Mp.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1356
      },
      "rarity": "epic"
    },
    {
      "id": "shippo",
      "name": "Shippo",
      "alt_names": [
        "七宝"
      ],
      "role": "protagonist",
      "description": "An orphaned young yōkai-fox (kitsune) whose father was killed by the Thunder Brothers, Hiten and Manten. He wanted to avenge his father so he helped Kagome and Inuyasha. He was the first character in the story to join InuYasha and Kagome in their travels as a group. Shippo can shape shift, but his forms are temporary, often incomplete and ineffective, and he is usually given away by his telltale tail. His other noteworthy abilities are turning into a wooden horse that can fly, leaving a trail of yelping mushrooms and acorns, illusionary tricks with toys like his giant spinning top attack, using his race's notable fox fire magic (which rarely seems to work properly), and making things like leaves or himself multiply. He tends to be naively observant and often makes pointed and cheeky comments directed towards InuYasha, earning him a retaliatory bonk on the head for his unnecessary \"advice\". InuYasha and Kagome serve as older sibling figures to Shippo. Shippo and Kirara (when she is in her kitten form) are the smallest members of InuYasha's group, with Shippo being the youngest. Because he so small and light, whenever the group is traveling anywhere Shippo is almost always seen riding on someone's shoulder, on Kirara's back, in Kagome's arms, or in the basket on Kagome's bike; he is rarely seen walking or running.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1357-q81pBzC7ynld.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1357
      },
      "rarity": "epic"
    },
    {
      "id": "sesshoumaru",
      "name": "Sesshoumaru",
      "alt_names": [
        "殺生丸"
      ],
      "role": "supporting",
      "description": "Inuyasha's older half-brother. Unlike Inuyasha, Sesshoumaru is a full-blooded dog-demon and is contemptuous of InuYasha for being a half-demon and for consorting with humans. He is a very powerful demon who seems to have no true equal when it comes to raw power; although given the chance in volume twenty-three, he could not defeat Naraku. Although fandom refers to him as the Lord of the Western Lands, this title appears at no point in the manga. Takahashi also stated that Sesshoumaru has no permanent home. Unlike almost every other demon in the world of InuYasha, he has no interest in possessing even one shard of the Shikon Jewel  Sesshoumaru first appears in search of the sword called Tessaiga, created from their father Inu-no-Taisho's fang, which has the power to kill a hundred yōkai with one swing. However, Inu-no-Taisho left Tessaiga to Inuyasha, and Sesshoumaru instead inherited the Tenseiga, a sword which cannot harm the living, but can bring the dead back to life. Inu-no-Taisho did this in the hopes that Sesshoumaru would learn compassion. Considering Tenseiga useless to him, Sesshoumaru battles Inuyasha several times for possession of Tessaiga, and when Tessaiga is broken by a bite from Naraku's incarnation Goshinki, Sesshoumaru has Goshinki's fangs forged into the evil blade Tokijin, which only he is powerful enough to control. Initially, Sesshoumaru is ruthless and cruel in his pursuit of Tessaiga and his dealings with his brother.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1358-oR7bIGfc5pnX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1358
      },
      "rarity": "uncommon"
    },
    {
      "id": "kikyou",
      "name": "Kikyou",
      "alt_names": [
        "桔梗",
        "Miko"
      ],
      "role": "supporting",
      "description": "__Height:__ 169 cm\n\nA shrine maiden who loved InuYasha and was killed by Naraku (disguised as Inuyasha) who made the two fight fifty years prior (in InuYasha's time) to the story's start. She is brought back to life by the ogress Urasue. Although she looks alive, her body is still \"dead,\" and she must ingest the souls of the dead to move.    ~!Her body (an authentic one) is made of mud and leaves and hosts a portion of Kagome's soul. Still under the impression that Inuyasha had betrayed her, she tried to kill him and drag him to hell upon her reunion with him. However, after learning from her sister Kaede that Naraku was behind her death and that he had turned her and Inuyasha against each other, she decides to dedicate her time in the earthly realm to kill him.  Though she acts cold towards Inuyasha and in numerous times implies that they were through, she still has feelings for him, and at the begining of the series displays jealousy towards her reincarnation, Kagome. Though, instead of acting on her feelings and jealousy, she distances herself from Inuyasha and his group and continues to pursue Naraku alone. And during her journey, she gradually casts away her bitterness and returns to her older compassionate self. She ends up saving Kohaku and Miroku's lives, and in the end dies peacefully in arms of InuYasha after being attacked by Naraku.!~",
      "metadata": {
        "gender": "female",
        "age": "17-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1359-AFczK1HRd3ub.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1359
      },
      "rarity": "uncommon"
    },
    {
      "id": "kaede",
      "name": "Kaede",
      "alt_names": [
        "楓"
      ],
      "role": "supporting",
      "description": "A shrine maiden and sister of Kikyo who protected the village for fifty years after her sister's death. She is the first to recognize Kagome as the reincarnation of her sister. She often shares advice and knowledge about demons and other spiritual anomalies with InuYasha's group, and is well-respected and held in high regards by Kagome, Sango, Shippō, Miroku, and even InuYasha himself sometimes. Not surprisingly considering his temperament, InuYasha is easily annoyed with her, though will listen to her when necessary. A common misconception is that she lost her right eye during the time InuYasha attacked the village to capture the sacred jewel. In the two-part anime flashback episodes \"The Tragic Love Song of Destiny\" it is revealed that she loses her eye during a yokai attack. Her sister Kikyo, coming to the realization that her feelings for InuYasha have lessened her spiritual powers, is unable to properly protect Kaede during the attack, resulting in the loss of her eye. (\"Kaede\" means \"maple tree.\")",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1360-nvgYPaUEMeG6.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1360
      },
      "rarity": "uncommon"
    },
    {
      "id": "myoga",
      "name": "Myoga",
      "alt_names": [
        "冥加"
      ],
      "role": "supporting",
      "description": "A yokai-flea who is InuYasha&#039;s source of information. He usually runs away from dangerous situations. He was initially charged with protecting the remains/gravesite of InuYasha&#039;s father which held the Tessaiga. The Grave was hidden inside the black pearl in InuYasha&#039;s right eye and was opened during his first run-in with his elder brother, Sesshoumaru. Myoga also enjoys drinking yokai blood, and actually saves InuYasha&#039;s life at one point by drinking the poison out of his blood. Because of that, he often gets slapped by InuYasha (and sometimes by Kagome too), but never dies from it since he&#039;s immortal.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1361-qz5kWP3aFK9M.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1361
      },
      "rarity": "uncommon"
    },
    {
      "id": "totosai",
      "name": "Totosai",
      "alt_names": [
        "刀々斎",
        "Totousai"
      ],
      "role": "supporting",
      "description": "An elderly blacksmith and a friend of Inu-no-Taishou (InuYasha and Sesshoumaru's father) who forged the Tessaiga and the Tenseiga. He rarely appears unless to repair the damaged swords or instruct InuYasha in hidden powers within the Tessaiga. Tōtōsai can breathe fire and wields a giant forging hammer. He also is transported by a three eyed ox which can fly. (\"Totosai\" means \"sword purification.\")",
      "metadata": {
        "gender": "male",
        "age": "Older then 200 years",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/1362.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1362
      },
      "rarity": "uncommon"
    },
    {
      "id": "hachiemon",
      "name": "Hachiemon",
      "alt_names": [
        "八衛門",
        "Hachi"
      ],
      "role": "supporting",
      "description": "A congenial shape-shifting youkai who has befriended Miroku. Hachi's natural appearance is a yokai-tanuki (Raccoon-Dog). Hachi is short for Hachiemon. Once took the form of Miroku to sell fake seals and get away with the ladies. But when Miroku catches him, he is being assaulted by a spirit haunting a cave. Hachi sometimes acts as the transportation for InuYasha's group, and would risk his life to take them into the heart of enemy territory or ship them out of danger when it's necessary.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1363-Y7kRvDaEWe1W.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1363
      },
      "rarity": "uncommon"
    },
    {
      "id": "jaken",
      "name": "Jaken",
      "alt_names": [
        "邪見"
      ],
      "role": "supporting",
      "description": "A yōkai who is Sesshōmaru's servant: not especially powerful but extremely loyal, he is usually a comical character. Sesshōmaru typically responds to Jaken's failures or more annoying behavior with a sound beating, but Jaken believes this is Sesshomaru's right and never wavers in his loyalty. Jaken started following him in the first place after being captivated by his power and majesty when he slayed a threatening demon, saving Jaken's life (this was incidental; Sesshomaru killed the demon simply because it was in his way. Note: these events were related ONLY in the anime). (\"Jaken\" means \"meanness\" or \"unkindness\".)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1364-4Y3v1IMEAwIg.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1364
      },
      "rarity": "uncommon"
    },
    {
      "id": "rin",
      "name": "Rin",
      "alt_names": [
        "りん"
      ],
      "role": "supporting",
      "description": "An orphan girl who discovers Sesshomaru in the woods after he is recuperating from a battle with InuYasha. Mute after the trauma of seeing her family killed by bandits, she lived on the dubious charity of a small village, mostly fending for herself. Although Sesshoumaru snubs her efforts to care for him, she continues to bring him food and water, and is disproportionately happy when he inquires idly about the injuries she received at the hands of the villagers, a reaction he does not understand. As Sesshoumaru prepares to leave the area, he smells Rin's blood and follows the scent to discover that she has been killed by wolves; moved by a combination of curiosity about the sword's abilities and pity for the girl, he revived her with Tenseiga. She now follows him with fanatical loyalty (to Jaken's great consternation) and has regained her ability to speak. Sesshomaru comes to her aid when she's in danger. (\"Rin\" means \"cold\")",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1365-C5r2sPW8PwA8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1365
      },
      "rarity": "uncommon"
    },
    {
      "id": "kohaku",
      "name": "Kohaku",
      "alt_names": [
        "琥珀"
      ],
      "role": "supporting",
      "description": "Sango's younger brother who was once under the control of Naraku. When Naraku disguised himself as Kagewaki Hitomi, the son of a lord, he used Lord Hitomi's father to call upon Sango and the demon slayers to slay a false demon. Kohaku was made to turn against his companions, killing his father and all the demon slayers, Sango surviving only by sheer luck. Kohaku was killed that night also by the castle guards, only to be later resurrected by Naraku as an amnesiac puppet. After several encounters with Sango and her friends, he began to recover his painful memories and sought to secretly find a way to destroy Naraku while still maintaining the illusion of being a puppet and later forming an alliance with Kagura. For a while Kohaku accompanied Kikyou with the intention of assisting her in carrying out Midoriko's will. Around the time of Kikyou's death, however, he was saved from Byakuya by Sesshomaru, and currently travels with Sesshomaru, Jaken, and Rin. (\"Kohaku\" means \"amber.\")",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1366-Fac3MafjvAaJ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1366
      },
      "rarity": "uncommon"
    },
    {
      "id": "naraku",
      "name": "Naraku",
      "alt_names": [
        "奈落"
      ],
      "role": "supporting",
      "description": "The main antagonist, Naraku (literally means &quot;underworld&quot;, or &quot;hell&quot;) is responsible for nearly every character&rsquo;s suffering throughout the series. He is a han&#039;yō that originated from a bandit named Onigumo (&quot;Demon Spider&quot;). Naraku&#039;s main goal is to collect all of the shards of the Shikon no Tama in order to become a full Youkai.His platonic love for Kikyo is what drove him to kill Kikyo and seal Inuyasha on the tree and basic reason to became a demon.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/1367.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1367
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-26T08:22:02.988Z"
}