{
  "id": "wotakoi-love-is-hard-for-otaku",
  "type": "anime",
  "title": "Wotakoi: Love is Hard for Otaku",
  "alt_titles": [
    "Wotaku ni Koi wa Muzukashii",
    "ヲタクに恋は難しい"
  ],
  "source": "AniList",
  "source_id": 99578,
  "description": "Having slept through all four of her alarms, the energetic Narumi Momose finds herself running late for her first day of work at a new office. As she races to catch her train, she makes a promise to herself that none of her coworkers will find out about her dark secret: that she is an otaku and a fujoshi. Her plan goes instantly awry, though, when she runs into Hirotaka Nifuji, an old friend from middle school. Although she tries to keep her secret by inviting him out for drinks after work, her cover is blown when he casually asks her whether or not she will be attending the upcoming Summer Comiket. Luckily for her, the only witnesses—Hanako Koyanagi and Tarou Kabakura—are otaku as well.\n\nLater that night, the pair go out for drinks so that they can catch up after all the years apart. After Narumi complains about her previous boyfriend breaking up with her because he refused to date a fujoshi, Hirotaka suggests that she try dating a fellow otaku, specifically himself. He makes a solemn promise to always be there for her, to support her, and to help her farm for rare drops in Monster Hunter. Blown away by the proposal, Narumi agrees immediately. Thus the two otaku start dating, and their adorably awkward romance begins.\n\n(Source: MAL Rewrite)",
  "metadata": {
    "format": "TV",
    "status": "FINISHED",
    "startDate": "2018-04-13",
    "endDate": "2018-06-22",
    "genres": [
      "Comedy",
      "Romance",
      "Slice of Life"
    ],
    "averageScore": 78,
    "popularity": 294301,
    "episodes": 11
  },
  "images": [
    {
      "url": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/medium/nx99578-oO5KChtfhzln.png",
      "type": "cover",
      "source": "AniList"
    },
    {
      "url": "https://s4.anilist.co/file/anilistcdn/media/anime/banner/99578-8orFGgDq7NS8.jpg",
      "type": "banner",
      "source": "AniList"
    }
  ],
  "external_ids": {
    "anilist": 99578
  },
  "tags": [
    "Otaku Culture",
    "Primarily Adult Cast",
    "Josei",
    "Office Lady",
    "Female Protagonist",
    "Video Games",
    "Work",
    "Episodic",
    "Male Protagonist",
    "Urban",
    "Kuudere",
    "Heterosexual",
    "Ensemble Cast"
  ],
  "updated_at": "2025-12-24T12:32:46.568Z",
  "created_at": "2025-12-22T21:21:22.448Z",
  "enriched": false
}