{
  "id": "love-chunibyo-other-delusions",
  "type": "anime",
  "title": "Love, Chunibyo & Other Delusions",
  "alt_titles": [
    "Chuunibyou demo Koi ga Shitai!",
    "中二病でも恋がしたい!"
  ],
  "source": "AniList",
  "source_id": 14741,
  "description": "Everybody has had that stage in their life where they have thought themselves to be special, different from the masses of ordinary humans. They might go as far as seeing themselves capable of wielding mystical powers, or maybe even believe themselves to have descended from a fantasy realm. This \"disease\" is known as \"chuunibyou\" and is often the source of some of the most embarrassing moments of a person's life.\n\nFor Yuuta Togashi, the scars that his chuunibyou has left behind are still fresh. Having posed as the \"Dark Flame Master\" during his middle school years, he looks back at those times with extreme embarrassment, so much so that he decides to attend a high school far away where nobody will recognize him. Putting his dark history behind him, he longs to live a normal high school life.\n\nUnfortunately, he hasn't escaped his past yet: enter Rikka Takanashi, Yuuta's new classmate and self-declared vessel of the \"Wicked Eye.\" As this eccentric young girl crashes into Yuuta's life, his dream of an ordinary, chuunibyou-free life quickly crumbles away. In this hilarious and heartwarming story of a boy who just wants to leave his embarrassing memories behind, the delusions of old are far from a thing of the past.\n\n(Source: MAL Rewrite)",
  "metadata": {
    "format": "TV",
    "status": "FINISHED",
    "startDate": "2012-10-04",
    "endDate": "2012-12-20",
    "genres": [
      "Comedy",
      "Drama",
      "Romance",
      "Slice of Life"
    ],
    "averageScore": 75,
    "popularity": 314964,
    "episodes": 12
  },
  "images": [
    {
      "url": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/medium/bx14741-CGXEIeUe2roA.jpg",
      "type": "cover",
      "source": "AniList"
    },
    {
      "url": "https://s4.anilist.co/file/anilistcdn/media/anime/banner/14741-7RMdUd7tVfSu.jpg",
      "type": "banner",
      "source": "AniList"
    }
  ],
  "external_ids": {
    "anilist": 14741
  },
  "tags": [
    "Chuunibyou",
    "Coming of Age",
    "Primarily Teen Cast",
    "School",
    "Disability",
    "School Club",
    "Heterosexual",
    "Slapstick",
    "Female Protagonist",
    "Male Protagonist",
    "CGI"
  ],
  "updated_at": "2025-12-23T03:07:39.213Z",
  "created_at": "2025-12-22T21:17:41.671Z",
  "enriched": false
}