{
  "work_id": "maid-sama",
  "count": 15,
  "characters": [
    {
      "id": "takumi-usui",
      "name": "Takumi Usui",
      "alt_names": [
        "碓氷拓海"
      ],
      "role": "protagonist",
      "description": "__Height:__ 186 cm\n\nOne of the most popular boys at Seika High, Usui appears to take little interest in anything and prefers to observe things as they unfold, though proves to be extraordinarily talented in numerous areas.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14523-yFjXVeK6c6IE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14523
      },
      "rarity": "epic"
    },
    {
      "id": "misaki-ayuzawa",
      "name": "Misaki Ayuzawa",
      "alt_names": [
        "鮎沢美咲",
        "Kaichou",
        "Misa",
        "Devil President"
      ],
      "role": "protagonist",
      "description": "__Height:__ 165 cm \n\nMisaki is the heroine of Kaichou wa Maid-sama!. She lives alone with her mother and her younger sister Suzuna, because her father abandoned them, leaving them with a huge debt. \n~!She then meets Usui, who discovers her working as a maid at the maid café. Misaki thinks Usui will tell the whole school about her working there. Instead, he keeps it a secret under one condition: Misaki has to be his personal maid for the day in order to stay the student council president and keep her part-time job hidden from everyone else.!~   ~!In the manga Usui and Misaki start dating.!~  Anime only:  ~!Ayuzawa is confused as to Usui's true feelings the whole series, but in the final episode, they both confess to each other and kiss. !~",
      "metadata": {
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14941-qh15JS5cEQDL.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14941
      },
      "rarity": "epic"
    },
    {
      "id": "aoi-hyoudou",
      "name": "Aoi Hyoudou",
      "alt_names": [
        "兵藤葵"
      ],
      "role": "supporting",
      "description": "__Height:__ 153 cm \n\nSatsuki's nephew, the son of Satsuki's older brother, and a junior high school student who enjoys dressing like a girl. He likes \"cute things\", and being the center of attention.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16614-kYZByrhYdCJe.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16614
      },
      "rarity": "uncommon"
    },
    {
      "id": "shouichirou-yukimura",
      "name": "Shouichirou Yukimura",
      "alt_names": [
        "幸村祥一郎"
      ],
      "role": "supporting",
      "description": "__Height__: 164 cm  \n\nThe Vice President of the Student Council, Shouichirou Yukimura tries to help Misaki where he can, and enjoys office routine. At first, he, like the rest of the student council, is fearful of Misaki, but he eventually comes to be on fairly close terms with her and Usui.     Yukimura is hard-working, earnest, and capable of doing most administrative work, but is not athletic in the least, especially in comparison to Misaki and Usui. His gentle, almost feminine demeanor and slight stature make him appear somewhat weak, a fact he is sensitive about. He&#039;s both terrified and awed of Usui, after Usui kisses him as a &quot;reward for his hardwork&quot; (a ruse to restore Misaki&#039;s confidence). Yukimura has a seven-year-old sister named Rui.",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/19286.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 19286
      },
      "rarity": "uncommon"
    },
    {
      "id": "hinata-shintani",
      "name": "Hinata Shintani",
      "alt_names": [
        "深谷陽向",
        "You-kun"
      ],
      "role": "supporting",
      "description": "**Height:** 177 cm   \n**Debut:** Chapter 21\n\nHe is Misaki-chan's childhood friend. He can eat anything and still be hungry. He works at a gas station. \n\n ~!Misaki-chan is Hinata's first love since elementary school, which was when Misaki-chan didn't hate guys. Eventually, after winning the cake eating contest, he finds out that Misaki works in the maid cafe. !~",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b19985-sHzQhMUrLHvJ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 19985
      },
      "rarity": "uncommon"
    },
    {
      "id": "soutarou-kanou",
      "name": "Soutarou Kanou",
      "alt_names": [
        "叶爽太郎"
      ],
      "role": "supporting",
      "description": "**Height:** 182 cm \n\nA withdrawn male student who is initially against Misaki as the student council President because of her aspirations of increasing the female population of Seika High.   ~!In order to sabotage her presidency, Kanou tries to hypnotize Misaki, Usui, and the student council with his pupil-less eyes (one of the very few, random supernatural aspects of the series) into ruining Misaki’s reputation. It is revealed that his gynophobic attitude comes from his mother abandoning his family when he was young and his father warning him to be wary of women, and after failing to hypnotize Misaki, she punishes him by assigning him to work closely with his female classmates during the school's cultural festival, in hopes of forcing him to get over his fear. The punishment is ultimately successful, and he slowly becomes friendlier with Misaki and the rest of his female peers, as well as with Yukimura. Though he runs against Misaki during her re-election as President, he opposes using underhanded means to gain victory, remains on good terms with her, and is genuinely surprised when he realizes his supporters weren't aware of the extent of all that Misaki had accomplished, asking them \"didn't you guys already know that the student council president is an incredible person?\"!~  (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27667-mHj9LXkj4jyu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27667
      },
      "rarity": "uncommon"
    },
    {
      "id": "tora-igarashi",
      "name": "Tora Igarashi",
      "alt_names": [
        "五十嵐虎"
      ],
      "role": "supporting",
      "description": "**Height:** 180 cm \n\nThe Student Council President at Miyabigaoka High School, he initially appears as a gentleman who marvels at Misaki and the changes she has brought to Seika High, offering her a chance to come to Miyabigaoka with an exceptional loan.   ~!He is quickly revealed to be a lecherous young man who has become bored with the women surrounding him, who are easily submissive because of his wealth. He enjoys causing drama around him and he thinks that money can buy anything. Misaki's strong will and outright rejection of his monetary bribe to have her join the Miyabigaoka Student Council captures his interest. It is later revealed that Tora has some ties to or knowledge of Usui's past or background, which he may be exploiting to some as of yet unknown end.!~ (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27717-SUpDLRWbi5Hm.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27717
      },
      "rarity": "uncommon"
    },
    {
      "id": "kanade-maki",
      "name": "Kanade Maki",
      "alt_names": [
        "真木奏"
      ],
      "role": "supporting",
      "description": "**Height:** 178 cm\n\nThe Vice President of the Student Council at Miyabigaoka High.  ~!He and Igarashi attempt to buy out Caf&eacute; Latte and change it into a butler caf&eacute;. Misaki, Usui, and the Caf&eacute; Latte staff are able to prevent him from realizing his plans through a competition.!~    (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27718-txH0amJZuXw1.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27718
      },
      "rarity": "uncommon"
    },
    {
      "id": "sakura-hanazono",
      "name": "Sakura Hanazono",
      "alt_names": [
        "花園さくら"
      ],
      "role": "supporting",
      "description": "**Height:** 156 cm \n\nA good friend of Misaki&#039;s and one of the few female students at Seika High, Sakura is friendly and cheerful and, like the rest of the girls, relies on Misaki for protection from the wild behaviour of the boys.   ~!She is quite popular amongst the boys, but frequently rejects their confessions; in particular, she&rsquo;s rejected ex-rugby captain Masaru Gouda (剛田将, Gōda Masaru) one hundred times. According to Shizuko, Sakura falls in love without carefully considering what the person is really like, as exampled by her persistent feelings for the two-faced, womanising singer Kuuga of a popular band from nearby Yumesaki High.!~  She has high respect for Misaki and despite her constant happy and tolerant attitude, defends Misaki when Kuuga insults her. (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27719-7XSgfp9mdivy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27719
      },
      "rarity": "uncommon"
    },
    {
      "id": "shizuko-kaga",
      "name": "Shizuko Kaga",
      "alt_names": [
        "加賀しず子"
      ],
      "role": "supporting",
      "description": "**Height:** 158 cm \n\nOne of Misaki and Sakura&rsquo;s friends, a sensible and intelligent girl who often spends lunchtime with them. Shizuko is a member of the flower arranging club and is good at math, but isn&rsquo;t very good at physical activities. She has an older brother in university and a younger sister in junior high school; according to Sakura, the three of them look very alike.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27913-6Vvo2kLaJG8i.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27913
      },
      "rarity": "uncommon"
    },
    {
      "id": "nagisa-tsuwamono",
      "name": "Nagisa Tsuwamono",
      "alt_names": [
        "兵藤なぎさ"
      ],
      "role": "supporting",
      "description": "__Height:__ 162 cm \n\nSatsuki’s younger sister and Aoi's aunt, Nagisa is the manager of a beach house known as “Ocean House.”    ~!She asks for Satsuki and her employees to come and work at her beach house during the summer since her shop is not as popular as she would like. Nagisa is somewhat tough on Aoi for trying to dress like a girl because her older brother sent Aoi to her beach house to become more masculine. !~  (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27914-DsTYeRH3Wugz.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27914
      },
      "rarity": "uncommon"
    },
    {
      "id": "suzuna-ayuzawa",
      "name": "Suzuna Ayuzawa",
      "alt_names": [
        "鮎沢 紗奈",
        "Cheese-chan"
      ],
      "role": "supporting",
      "description": "Misaki&#039;s younger sister. She is very apathetic and shows little to no emotion. She does not work at any part time jobs and appears to be in middle school. In the anime, she often enters magazine contests and always seems to win food prizes. Her first appearance occurs late in the manga, while she is a frequent recurring character in the anime.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27982-hXLAj8WvJvMT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27982
      },
      "rarity": "uncommon"
    },
    {
      "id": "minako-ayuzawa",
      "name": "Minako Ayuzawa",
      "alt_names": [
        "鮎沢美奈子"
      ],
      "role": "supporting",
      "description": "Misaki&#039;s mother. She appears to be somewhat sickly, but does her best to support Misaki and Suzuna by working as a nurse at the hospital. Although she is grateful that Misaki is helping her with their financial problems, she also wants nothing more than for Misaki to have more fun and go out more often as a high school teenager. She becomes acquainted with Usui at the train station in chapter 35 and sees him as a very gentle person and the exact opposite of her husband.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27984-gSN5NS3b4GXB.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27984
      },
      "rarity": "uncommon"
    },
    {
      "id": "satsuki-hyoudou",
      "name": "Satsuki Hyoudou",
      "alt_names": [
        "兵藤さつき",
        "Manager"
      ],
      "role": "supporting",
      "description": "**Height:** 158 cm\n\nThe manager of Café Latte and Misaki’s boss; a 30-year-old woman who has a tendency to voice out her fantasies. She is a cheerful woman who enjoys her job because it allows her to make others happy. She is very understanding of Misaki’s circumstances, knowing that Misaki does not particularly enjoy working at a maid café, and is perceptive of other people’s feelings. Satsuki also ends up hiring Usui as a part-time cook, much to Misaki’s chagrin. \n\n(Source: Wikipedia)",
      "metadata": {
        "age": "30",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28084-Tkv7U0EsQZQj.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28084
      },
      "rarity": "uncommon"
    },
    {
      "id": "honoka",
      "name": "Honoka",
      "alt_names": [
        "ほのか"
      ],
      "role": "supporting",
      "description": "**Height:** 157 cm \n\nAn employee at Café Latte. She can become somewhat maniacal about getting in character for her job and criticizes Misaki for her initial resistance to acting parts outside of her comfort range, as well as for being ashamed of working at Maid Latte and hiding it from her peers.\n\n(Source: Wikipedia)",
      "metadata": {
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28085-iImFhcFF7TTl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28085
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-25T19:40:58.083Z"
}