{
  "work_id": "spice-and-wolf",
  "count": 8,
  "characters": [
    {
      "id": "holo",
      "name": "Holo",
      "alt_names": [
        "ホロ",
        "Wise Wolf of Yoitsu"
      ],
      "role": "protagonist",
      "description": "__Height:__ 160 cm (5'2)\n\nHolo is a wolf harvest deity originally from a land in the north known as Yoitsu. She made a promise with men from a town called Pasloe where she would ensure the town would have good wheat harvests year after year. However, as time went on, the townspeople slowly started to forsake Holo and did not rely on her as they once did. As such, Holo escapes from town in Lawrence's wagon and started traveling with him to see how much the world has changed since she has been in Pasloe. Holo has chosen the form of a girl younger than Lawrence, though she still retains her large white-tipped wolf tail, and ears. Her true form is that of a very large wolf which many people revered and feared.  \n\nShe refers to herself as the \"Wise Wolf of Yoitsu\" (ヨイツの賢狼). She is typically very haughty and self-sufficient, though due to her isolation for hundreds of years in Pasloe, she gradually feels very lonely, and sometimes shows a more fragile side of herself. She relies on Lawrence for company as she fears loneliness, which is something that Lawrence is very aware of and tries to comfort her in his own way. Holo is also very aware of the different time spans that she and Lawrence have, as a human lifespan is like a blink of an eye for her kind. Holo is quite scared of that fact, but hides it with jokes. She has a peculiar way of speaking, modeled after that of the oiran high-class courtesans. She is fond of delicious food and alcohol, but especially loves apples. She takes pride in her tail and takes special care of it, constantly combing and maintaining it.  \n\nConcerning the spelling of Holo's name, Yen Press has stated that they \"were instructed that the proper spelling of the character's name is indeed Holo\" by the Japanese licensor.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7373-1BH0gELuZmHD.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7373
      },
      "rarity": "epic"
    },
    {
      "id": "kraft-lawrence",
      "name": "Kraft Lawrence",
      "alt_names": [
        "クラフト・ロレンス"
      ],
      "role": "protagonist",
      "description": "__Height:__ 178 cm (5'10'') \n\nKraft Lawrence is a twenty-five-year-old traveling peddler who goes from town to town buying and selling various things in order to make a living. When he was twelve, he became an apprentice to a merchant relative, and set out on his own at eighteen. His goal in life is to gather enough money to start his own shop, and he has already been traveling for seven years while gaining experience in the trade. He meets Holo one night and eventually agrees to her traveling with him. She helps him by providing her wisdom which helps to increase his profits and get him out of jams. Lawrence usually goes by his surname, only some who have known him for a long time, like Jakob Tarantino, the master of his guild, call him by his first name Kraft in the novel.",
      "metadata": {
        "gender": "male",
        "age": "25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7374-XeKVCsoW129T.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7374
      },
      "rarity": "epic"
    },
    {
      "id": "chloe",
      "name": "Chloe",
      "alt_names": [
        "クロエ"
      ],
      "role": "supporting",
      "description": "Chloe is a villager of Pasroe and has known Lawrence for a long time. In fact, Lawrence taught her how to be a merchant. Despite still not knowing how she should feel about him, she respects him as her teacher. She is an anime-original character, meaning she does not exist in the manga/light novel version of Spice and Wolf.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7375-Fl8ZYFMB1MPP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7375
      },
      "rarity": "rare"
    },
    {
      "id": "nora-arendt",
      "name": "Nora Arendt",
      "alt_names": [
        "ノーラ・アレント",
        "Norah",
        "The Fairy"
      ],
      "role": "supporting",
      "description": "She is a skilled shepherdess from a church-town named Lubinheigen. Her companion in this profession is a well-trained sheep dog named Enekk.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7376-Hc7DpDQj6I31.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7376
      },
      "rarity": "rare"
    },
    {
      "id": "zheren",
      "name": "Zheren",
      "alt_names": [
        "ゼーレン"
      ],
      "role": "supporting",
      "description": "A mysterious merchant that Lawrence and Holo meet on their journey when they visit a monastery. He suggests a &quot;get rich quick&quot; scheme to Lawrence involving reminted coins.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17825-ZmfXoh0lbcYc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17825
      },
      "rarity": "rare"
    },
    {
      "id": "marhait-liechten",
      "name": "Marhait Liechten",
      "alt_names": [
        "リヒテン・マールハイト"
      ],
      "role": "supporting",
      "description": "The manager of the large Pattio branch of the Milone Company. He is a calm, cool, and collected man who speaks very politely.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24360-eyCHMvYkycJJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24360
      },
      "rarity": "rare"
    },
    {
      "id": "marten-liebert",
      "name": "Marten Liebert",
      "alt_names": [
        "マーティン・リーベルト"
      ],
      "role": "supporting",
      "description": "He is a business worker for Hans Lemerio.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n129255-4kL9jW5mAEkE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129255
      },
      "rarity": "rare"
    },
    {
      "id": "hans-remelio",
      "name": "Hans Remelio",
      "alt_names": [
        "ハンス・レメリオ",
        "Hans Remerio"
      ],
      "role": "supporting",
      "description": "Hans Remelio is the head of his Remelio Trading Company that was heading towards bankruptcy when first met by Lawrence and Holo.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b330869-F01vxAkcxP1i.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 330869
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-25T23:35:57.554Z"
}