{
  "work_id": "baccano",
  "count": 15,
  "characters": [
    {
      "id": "firo-prochainezo",
      "name": "Firo Prochainezo",
      "alt_names": [
        "フィーロ・プロシェンツォ"
      ],
      "role": "protagonist",
      "description": "The youngest executive of Manhattan's Martillo Family Camorra. Firo is surprisingly friendly, humorous and compassionate, but he is a skilled fighter and can be ruthless or even vengeful towards those who bring harm to the people he cares about. He became a complete immortal in November 1930 after accidentally drinking Szilard Quates' immortality elixir. In the same year he falls in love with Ennis, and despite the fact that she initially is unsure of her affection due to her underdeveloped emotional capabilities, they live together as roommates and gradually she reciprocates Firo's feelings.\n\n~!Firo has unconscious issues with femininity due to a childhood incident wherein he was mistaken for a girl and nearly molested. His complex about being called girly suggests a lingering stigma, but this does not mean he dislikes women—on the contrary, he treats them with chivalry, never harming them and considering any man who does so as scum. He is also shy when it comes to romance and refrains from taking the initiative even when his feelings are obvious, as shown with his relationship with Ennis. All of these traits can be traced back to the incident from his childhood, making it one of the most formative events of his life.!~\n\n~!Firo marries Ennis in the early 1980s and the two honeymoon aboard the yacht ship Entrance in 2002.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3061-axD9fnmXVXcu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3061
      },
      "rarity": "legendary"
    },
    {
      "id": "ennis",
      "name": "Ennis",
      "alt_names": [
        "エニス"
      ],
      "role": "protagonist",
      "description": "Szilard's homunculus, though not his first creation. She was created to unthinkingly execute his every command; recently, however, she has been gaining emotions as well as independent thought, as a result of 'devouring' an alchemist threatening Szilard's life.\n\n~!She later helps Firo, giving him the necessary knowledge to destroy Szilard, and afterwards moves in with him as his roommate.!~\n\n~!Ennis eventually reciprocates Firo's feelings, marrying him in the 1980s and taking his surname 'Prochainezo'; two decades later, the couple honeymoon aboard the cruise ship Entrance in 2002, with Czeslaw tagging along.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3060-KACYVWNbbN12.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3060
      },
      "rarity": "legendary"
    },
    {
      "id": "maiza-avaro",
      "name": "Maiza Avaro",
      "alt_names": [
        "マイザー・アヴァーロ"
      ],
      "role": "protagonist",
      "description": "Bookkeeper of the Martillo family and one of the Advena Avis immortals. His younger brother, Gretto, was one of the first to be \"devoured\" for knowledge of the elixir's recipe.   ~!In the 1970s, he leaves his post as bookkeeper to Firo and along with Czes begins searching for the rest immortals to inform them of Szilard's death.!~ (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3498-nCCeiqkLIJv0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3498
      },
      "rarity": "legendary"
    },
    {
      "id": "luck-gandor",
      "name": "Luck Gandor",
      "alt_names": [
        "ラック・ガンドール"
      ],
      "role": "protagonist",
      "description": "Intelligent executive of the Mafia Gandor Family. The third of the brothers and childhood friend of Firo, having grown up in the same apartment block.  Although he and his brothers lead the Gandor family, Luck's close ties with Firo makes the Gandors allies of the Martillo Family. He is always calm and level-headed, preferring to resort to violence only when necessary. When that time approaches, he does not hesitate to eliminate his opponent while still maintaining his calm demeanor. Sometimes with a faint smile on his face, which according to Firo, is just a pretense to look cool. Luck intentionally pretends to be ruthless because he believes that he is not suited to be a mafia.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3873-McB0RQvD2Ohi.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3873
      },
      "rarity": "legendary"
    },
    {
      "id": "jacuzzi-splot",
      "name": "Jacuzzi Splot",
      "alt_names": [
        "ジャグジー・スプロット"
      ],
      "role": "protagonist",
      "description": "A crybaby who is nonetheless capable of exceptional courage and leadership ability when the situation calls for it. At first, Jacuzzi seems almost cripplingly shy, even with a tendency to stutter in front of strangers. However, when his loved ones are in danger, he will summon the strength to face his problems directly, even though he&#039;ll continue to cry. After a member of his gang was killed, Jacuzzi robbed a record number of neighborhood stores, clutching a machine gun as tears stream down his face. Jacuzzi went out and received his &quot;sword tattoo&quot; on his face when Nice, his romantic partner, was injured in an explosives accident, so that they would both be similarly marked.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3500-YEmpuaayWHua.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3500
      },
      "rarity": "legendary"
    },
    {
      "id": "ladd-russo",
      "name": "Ladd Russo",
      "alt_names": [
        "ラッド・ルッソ"
      ],
      "role": "protagonist",
      "description": "Ladd is a sadistic hit-man for the Russo family. His love for acts of violence truly shows in the maniacal glee he exhibits while fighting or killing. He is exceptionally skilled in hand-to-hand combat—particularly boxing—and the use of firearms. He is most happy while killing people that think they will never die and by seeing dead people or hearing gunfights. Ladd is deeply in love with his fiancée, Lua, although he expresses it through a passionate promise to kill her someday.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3065-rxICaoOWugo4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3065
      },
      "rarity": "legendary"
    },
    {
      "id": "czesaw-meyer",
      "name": "Czesław Meyer",
      "alt_names": [
        "チェスワフ・メイエル",
        "Czes"
      ],
      "role": "protagonist",
      "description": "The youngest Advenna Avis immortal. His guardian, Ferment, tortured him to test the limits of immortality. Czeslaw manages to devour Ferment, ending his suffering. Unfortunately, he learns from Fermet's memories that he was simply being tortured for Femet's own self-satisfaction. As a result, Czeslaw becomes paranoid and trusts no one, making it his mission to devour other immortals before they can devour him.  In the 1930's it appears he cares little for the lives of others, even requesting that a large group of people be killed so he could find an immortal among them. However, after meeting Isaac and Miria and being forgiven by Maiza, he stops hunting other immortals and moves in with Ennis and Firo.   ~!In the 1970's, he begins searching for the rest of the Advenna Avis immortals with Maiza to inform them of Szilard's death. In 2001 they find Elmer in a secluded European village. They return to New York while Elmer, Sylvie and Nile head to Japan to search for Denkuro.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3063-zkwLabVw5Pi9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3063
      },
      "rarity": "legendary"
    },
    {
      "id": "isaac-dian",
      "name": "Isaac Dian",
      "alt_names": [
        "アイザック・ディアン"
      ],
      "role": "protagonist",
      "description": "Issac Dian forms one half of the bumbling thief couple, who seem to cross into everybody's story in one way or another. He's in love with Miria, and they've robbed everything and anything, from doors to the entire Genoard household. He's completely clueless, super eccentric and happy-go-lucky to the point you can't stop laughing from his bold and sometimes completely weird actions.  \n\nHe has a cameo appearance in Durarara!!",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3662-JfGk5fakHCKI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3662
      },
      "rarity": "legendary"
    },
    {
      "id": "miria-harvent",
      "name": "Miria Harvent",
      "alt_names": [
        "ミリア・ハーヴェント"
      ],
      "role": "protagonist",
      "description": "Another eccentric thief, she is the partner and lover of Isaac Dian. Miria wholeheartedly believes and supports everything Isaac says, often even going so far as to mimic his body language. Together they appear extremely stupid, whimsical and oblivious, but they have great affection for the people they meet, whom they always make a big impression on and always believe the best of them.  \n\nShe has a cameo appearance in Durarara!!",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3796-iIdhldOILjda.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3796
      },
      "rarity": "legendary"
    },
    {
      "id": "claire-stanfield",
      "name": "Claire Stanfield",
      "alt_names": [
        "クレア・スタンフィールド"
      ],
      "role": "protagonist",
      "description": "The youngest train conductor for the Flying Pussy Foot, he tells Miria and Isaac the story of the dreaded \"Rail-Tracer\", a story about a brutish beast that causes passengers in a train to disappear one by one. He also seems to be the only one who knows how to stop the Rail Tracer...   ~!It is later revealed he was raised with the Gandor brothers, and is considered part of their family, as well as being the Rail Tracer aforementioned. He works as an assassin under the name of 'Vino' (he is called Vino because he completely destroys his victims making them look like they have been drenched in wine \"Vino is Italian for wine\") . He proposes to Chane on their first meeting and promises to find her again. He later does so, in the OVA.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5756-AO4dD0LGz4fm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5756
      },
      "rarity": "legendary"
    },
    {
      "id": "chane-laforet",
      "name": "Chane Laforet",
      "alt_names": [
        "シャーネ・ラフォレット"
      ],
      "role": "protagonist",
      "description": "The beautiful, dagger wielding daughter of Huey Laforet. Although her father is one of the original immortals who had been aboard the Advena Avis in 1711, she is actually mortal.   Chane is thoroughly devoted and at a young age, she requested that Huey remove her voice so that she would be unable to reveal his secrets to anyone.   ~!In 1931, Chane boarded the Flying Pussyfoot as part of the terrorist group that wished to use its passengers as hostages, in order to negotiate Huey's release from prison. Chane did not approve of the terrorists' methods, and knew they only wished to obtain Huey in order to gain access to his secrets about Immortality. She also knew that at some point, the group planned to betray and kill her. Yet, she went along with their plans in order to see how much they would be able to accomplish.   While aboard the Flying Pussyfoot, Chane has a run-in with the sadistic assassin Ladd Russo, from the Russo Mafia Family. They engage in a fierce battle, where Chane's fighting skills impress and delight Ladd. The fight is eventually interrupted by the \"Rail Tracer,\" who takes a liking to Chane and proposes to her. The proposal shocks the young girl as it is the first time someone has ever professed love to her. At the Rail Tracer's request, she engraves her reply to him into the train's roof.  After the events aboard the Flying Pussyfoot, Chane is taken in and cared for by Jacuzzi Splot and his gang. Their kindness confuses Chane, who does not understand why they went out of their way to help her as she is a stranger and member of the terrorist group.   While in their company, she is kidnapped by Graham Spector who mistakes her for Eve Genoard. At Graham's warehouse, she surprises the young man and his gang by attacking him with her daggers, thus revealing to them that she is not Eve. Her battle skills impress Graham, who begins to get excited at the prospect of fighting her. However, Jacuzzi interrupts the fight as he intends to rescue Chane. It does not take long before Nice Holystone and the rest of Jacuzzi's gang also show up to help both Jacuzzi and Chane. Chane is dumbfounded by their actions, and is shocked even more when the Rail Tracer also shows up to her aid.  Once again, the Rail Tracer, who is in fact Claire Stanfield (aka. Vino), an assassin for the Gandor family, confesses his love and says that she does not have to fall in love with him right away, but asks her if they could start out as friends and she could try to. She agrees. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7092-9RMcy0pi1RXL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7092
      },
      "rarity": "legendary"
    },
    {
      "id": "nice-holystone",
      "name": "Nice Holystone",
      "alt_names": [
        "ニース・ホーリーストーン"
      ],
      "role": "supporting",
      "description": "Nice Holystone is a bomb enthusiast and the girlfriend of Jacuzzi Splot. She co-leads Jacuzzi's Gang.\n\nNice's skin is marred by scars (on the right side of her face and across her arms) thanks to an accident in her youth. She covers her empty right eye socket with an eye patch, and wears glasses due to the damage incurred to her left eye. \n\nIn contrast to her odd and intimidating appearance, Nice is exceedingly polite when she speaks with everyone—except for Jacuzzi, with whom she speaks casually at his request. Her first love has been explosions from a young age and she is always excited at the prospect of experimenting with them or otherwise utilizing them.\n\nShe is crafty and plans ahead, going so far as to hide a cherry bomb in her empty eye socket in case of emergencies. Nice only truly lets loose when she is not accompanied by Jacuzzi.\n\nNice loves Jacuzzi, and is very considerate of his feelings; she exhibits great patience with him in general. Still, romance is not her forte; their first kiss on the Flying Pussyfoot left her flushed and embarrassed. She will take a leadership role when Jacuzzi is emotionally distraught or otherwise incapacitated and has the respect of all the gang members, some even considering her more of a leader than Jacuzzi.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3499-GeUh1Bwj7mjR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3499
      },
      "rarity": "rare"
    },
    {
      "id": "lua-klein",
      "name": "Lua Klein",
      "alt_names": [
        "ルーア・クライン",
        "Dollface"
      ],
      "role": "supporting",
      "description": "Ladd's lover and fiancée. She is fair-haired and beautiful, despite sporting a somewhat vacant (albeit serene) expression. She is completely devoted to Ladd and is likely a masochist, as she seems to take pleasure in his promise that he will be the one to kill her.  She is completely devoted to Ladd, who says that \"after everyone else, the last one he will kill will be her\". She was present on the Flying Pussyfoot incident, where Ladd sacrificed a hand to save her.  Lua is very calm and gentlewoman-like, and her love for Ladd is pure as she would put her life in danger for his sake.   ~!In the original light novels, Ladd mentions to Firo while in jail that Lua enjoys putting together blank jigsaw puzzles and painting a picture on them once they are completed. However, she breaks them and blankly laughs at them afterwords.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3062-BLjK9ioAU5Do.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3062
      },
      "rarity": "rare"
    },
    {
      "id": "szilard-quates",
      "name": "Szilard Quates",
      "alt_names": [
        "セラード・クェーツ"
      ],
      "role": "supporting",
      "description": "200 years old immortal alchemy teacher wanting to know what he could not know. Doing anything in his will to get it.  A seemingly geriatric alchemist who gains immortality during the 1711 incident aboard the Advena Avis. After the incident he desires to know the formula of the immortality elixir. As he is unable to claim it, he spends the next 230 years attempting to discover it.  He is an apathetic, violent man who will go to any means to achieve his objectives.   ~!Firo devours him later in order to protect Ennis.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3059-rxOZMykCiKDS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3059
      },
      "rarity": "rare"
    },
    {
      "id": "barnes",
      "name": "Barnes",
      "alt_names": [
        "バーンズ"
      ],
      "role": "supporting",
      "description": "The incomplete immortal responsible for overseeing and managing the blenders (chemists) who work on Szilard Quates' infamous Cure-All Elixir.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b330018-buZRVtUgjYIc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 330018
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-25T14:49:25.492Z"
}