{
  "work_id": "black-butler",
  "count": 15,
  "characters": [
    {
      "id": "sebastian-michaelis",
      "name": "Sebastian Michaelis",
      "alt_names": [
        "セバスチャン・ミカエリス",
        "Black",
        "Sebas-chan",
        "Bassy",
        "Sebby"
      ],
      "role": "protagonist",
      "description": "__Height:__ 185 cm (6'1\")  \n__Race:__ Demon\n\nSebastian Michaelis is the series' antihero. He is the butler of the Phantomhive household and acts as Ciel's bodyguard, two jobs he is completely devoted to.  He is highly skilled in any area and handles every task, no matter how impossible it is as well as any problem that arises from the errors of the other staff with ease, stating it is only natural as the butler to the Phantomhive family. This is due to the fact he is a demon bound by a Faustian contract to abide by Ciel's will.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b10863-DsfonbP2CATa.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10863
      },
      "rarity": "epic"
    },
    {
      "id": "ciel-phantomhive",
      "name": "Ciel Phantomhive",
      "alt_names": [
        "シエル・ファントムハイヴ",
        "Smile",
        "Young Master",
        "Bocchan",
        "The Queen's Watchdog",
        "Earl"
      ],
      "role": "protagonist",
      "description": "__Race__: Human\n__Height__: 152 cm (5\") ~ 158 cm (5'2\")  \n__Afiliation__: Phantomhive Family, Faustian Contract, Funtom Company  \n__Occupation__: Earl of Phantomhive, Watchdog of the Queen  \n__Know Relatives__:  ~!Vincent Phantomhive (father, deceased), Rachel Phantomhive (mother, deceased), \"Ciel Phantomhive\" (twin brother), Angelina Durless (aunt, deceased), Frances Midford (aunt), Edward Midford (cousin), Elizabeth Midford (cousin, fiancée), Clause (uncle)!~  \n\nThe Phantomhive family has, for years, been well known for making toys and sweets for small children. However, they are also the Queen's watchdogs; the Phantomhive family keeps an eye on black market dealings in ways that Scotland Yard isn't able to. Ciel Phantomhive is the heir to this legacy.  Earl Ciel Phantomhive is the business-savvy, twelve-year-old (later thirteen-year-old) head of the English Phantomhive noble family, taking over after the deaths of his parents, Lord Vincent and Lady Rachel Phantomhive. He also runs Funtom Company, which manufactures toys and sweets, and later adds a food branch after winning a Royal Warrant. His right eye, which is usually covered with a black eyepatch, bears a pentacle sign of the Faustian contract which binds the demon Sebastian Michaelis to his will. He also has a brand burnt into his back from when he was sold as a slave after his house was burnt down. Ciel is engaged to his cousin, Elizabeth Middleford. He sees her as an important friend and someone he needs to protect. His parents were killed and his mansion was set ablaze on his birthday, a reason why he does not like to celebrate the occasion. This tragedy causes him to not want to lose anyone important again. Despite his young age, he runs the family company and, as such, is quite busy much of the time though he still finds time to go out investigating dubious legal matters.   \n\nThroughout the series, Ciel's height has been used as a tool of mockery due to his short stature. He grows by 6 cm in the second season, but still remains shorter than the other characters, thus continuing the comical relief. Sebastian enjoys teasing Ciel about this fact. In the manga he does not grow taller.  The young earl is far more composed and mature than would be expected. He remains distant from others, aloof, preferring to spend his time on work for the company.  He is oftentimes selfish and not able to fully empathize with people. However, he does express occasional concern for the well-being of those close to him.  As a side note, Ciel seems to enjoy drinking tea a lot (he is adept at distinguishing between them as well) and sweet desserts. He has asthma (inherited from his mother) and dislikes being around cats because they trigger his allergies.",
      "metadata": {
        "gender": "male",
        "age": "12-13",
        "dateOfBirth": "1875-12-14"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12531-b481ILDutM4p.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12531
      },
      "rarity": "epic"
    },
    {
      "id": "grell-sutcliff",
      "name": "Grell Sutcliff",
      "alt_names": [
        "グレル・サトクリフ"
      ],
      "role": "supporting",
      "description": "__Height:__ 175 cm (5'9\")  \n\nGrell is Madam Red's somewhat ineffectual butler. Mostly, she tends to hang around the edges of the scene, fretting over the socially unacceptable things that her mistress continually gets up to. When something is not up to Madam Red's exacting standards, she takes it out on Grell whether or not it's actually her fault. Her tea is said to be far inferior to Sebastian's. Meek, easily scandalized, and highly nervous, Grell's personality is entirely at odds with her mistress's. As a result, the other characters tend to either ignore or walk all over her.   ~!This mild personality is entirely a facade. Grell's true identity is that of a death god; one with a true personality just as flamboyant as Madam Red's, perhaps even more so. The real Grell is a cheerful sadist who enjoys flirting and bloody murder, sometimes at the same time. She meets Madam Red during a night where she murders one of her patients and is attracted to her--both because her favorite color is red and because of her issues regarding childbirth. (Grell confesses to her that she, too, wishes that she could bear a child. But is unable to, being biologically male.) Grell refers to herself with feminine pronouns and has more than a passing interest in Sebastian; at one point she compares the two of them to Romeo and Juliet during their battle (leaving Sebastian horrified). Though having an interest in Sebastian, it was stated that Grell's 'true love' is William. Overall, she appears to have a tenuous grasp on sanity at best, switching from childish irritation to murderous rage at the drop of a hat. Like a typical death god, Grell possesses a scythe; however, she had it transformed into a chainsaw because she considered a regular scythe to be old-fashioned. Grell explains that her scythe is capable of cutting through anything; when it cuts through a person, it divides their soul and their memories, thus resulting in that person's memories playing before their eyes.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12960-TU6by6WTq5By.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12960
      },
      "rarity": "uncommon"
    },
    {
      "id": "mey-rin",
      "name": "Mey-Rin",
      "alt_names": [
        "メイリン",
        "Meilin",
        "Mei-Rin Meirin",
        "May Linn"
      ],
      "role": "supporting",
      "description": "__Height__: 165 cm (5'5\")\n\nThe glasses-wearing maid of the Phantomhive household. Mey-Rin is enthusiastic about her job but extremely bad at it (her main fault being clumsy.) She adds too much soap while washing clothes, trips and shatters the good china, and is generally a gigantic klutz. When asked to do an important task, she stutters and panics, which only adds to her natural clumsiness. She owns a pair of glasses that do nothing to improve her clumsiness. However, she refuses to purchase a new pair as they are the first thing Ciel bought for her. It's implied that she has a crush on Sebastian as she is even clumsier when Sebastian is watching. Her glasses cover up her eyes and her maid outfit doesn't show the fact that Mey-Rin is actually quite pretty.   ~!In episode 21 of the anime, it was indicated that Mey-Rin was previously an assassin before Sebastian took her in as the maid of Phantomhive household. She used to be a sniper who did not use a scope, due to her sharp far-sighted vision caused by her ill-fitting glasses. She is also physically fit as she can use a sniper rifle like a handgun and keeps hundreds loaded at once to decrease reload time. It was also revealed in chapter 33 of the manga that she has the same background.!~  (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14952-8VoSzSodSMdO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14952
      },
      "rarity": "uncommon"
    },
    {
      "id": "finnian",
      "name": "Finnian",
      "alt_names": [
        "フィニアン",
        "Finny"
      ],
      "role": "supporting",
      "description": "__Height__: 163 cm (5'4\")\n\nFinnian often called Finny, is Phantomhive household gardener. However, it seems every time he tends to the garden it is killed through an accident caused by his clumsiness and overenthusiastic pruning or not noticing that the pesticide container is leaking. In fact, if left to his own devices, he's stated that he'd like to make the garden into the shape of a giant robot.   He is portrayed as an innocent, child-like character, but is dubbed an idiot by Sebastian. But his combination of tears, innocent looks, and willful ignorance of anything that doesn't fall into his cheerful worldview makes Finny probably the most successful of the servants at wheedling favors and money out of Sebastian. He is very carefree and is almost always seen with a happy smile on his face.    ~!Finnian displays feats of superhuman strength, which he tries to suppress from fear of hurting others and risk of sabotaging his work. The sequence S-012 are tattooed to the back of his neck and are covered by his straw hat. He works as a gardener to spend as much time as possible outside because he was not able to do so before, and explains that he loves working for Ciel because he does not give him injections, kill his friends or lock him in a cage. He was experimented on as a scientific/medical test subject to increase physical strength before the events of the story until he was rescued by Ciel.!~    ~!He seems to have feelings for Angela because her kindness and beauty until he saw her true dominatrix personality.!~",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14953-vnd5tQps1Pd6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14953
      },
      "rarity": "uncommon"
    },
    {
      "id": "bardroy",
      "name": "Bardroy",
      "alt_names": [
        "バルドロイ",
        "Bard"
      ],
      "role": "supporting",
      "description": "Bardroy, usually referred to as Bard, is the household cook of American descent. Bard gruffly treats everything as though it's a military exercise, often referring to troops, enemies, and weaponry when he goes off into one of his many long-winded speeches about what it truly means to appreciate the culinary arts. He rarely produces anything edible as he uses weaponry such as a series of flamethrowers, each more extravagant than the last to cook and believes cooking is an art requiring explosions. Sebastian believes anything he creates is made up of charcoal and carcinogens. It's unknown if the food he produces is actually edible.    ~!Bardroy Was a Former Soldier who was left at the Battlefield and is Hired By Sebastian. !~    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14954-VIwQsXyKGxOG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14954
      },
      "rarity": "uncommon"
    },
    {
      "id": "tanaka",
      "name": "Tanaka",
      "alt_names": [
        "タナカ"
      ],
      "role": "supporting",
      "description": "The steward of the Phantomhive household. No one actually knows what Tanaka does around the house, save for sit around and drink tea. His reaction to any situation, no matter how strange, is to merely smile, take a sip of his tea, and chuckle. In other words, he&#039;s a bit of an enigma.    Most of the time he is in what is known as a chibi form. It is said he can only revert back to Normal Tanaka for a few minutes before reverting back to his small form.     ~!  It seems Tanaka served Ciel&#039;s parents as well. When Lord and Lady Phantomhive were murdered, the young Ciel ran to Tanaka, who warned him away. Tanaka was then stabbed by an unseen assailant...!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/14955.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14955
      },
      "rarity": "uncommon"
    },
    {
      "id": "angelina-durless",
      "name": "Angelina Durless",
      "alt_names": [
        "アンジェリーナ･ダレス",
        "Madame Red (マダム・レッド)",
        "Ann"
      ],
      "role": "supporting",
      "description": "__Height__: 168 cm (5'7\")  \n\nAngelina is the widow of the late Baron Barnett, the queen of high society (which has nicknamed her \"Madam Red\" due to the color of her hair and clothes), and Ciel's aunt. When she's not invading Ciel's home in London unannounced or flirting with her many admirers, she actually makes a living as a rare, female doctor. She appears to serve mostly female and child patients. Though childless herself, she's told Ciel in the past that she considers him her own son, and appears to have been keeping watch over him since he reappeared after the fire. She has her own butler, Grell, and is constantly reprimanding him to be more like Sebastian.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/14956.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14956
      },
      "rarity": "uncommon"
    },
    {
      "id": "undertaker",
      "name": "Undertaker",
      "alt_names": [
        "葬儀屋",
        "アンダーテイカー"
      ],
      "role": "supporting",
      "description": "Known only by his profession, the Undertaker is a mysterious man whose scarred face is never fully visible beneath his long hair and crooked top hat. He occasionally provides information to Ciel. While he finds Ciel amusing and enjoys helping him out, he has nothing but disdain for the Queen. He tends to punctuate his words with sweeping gestures and creepy giggles and seems to spend a good deal of time inside of coffins. He also likes to hear jokes and ask people to tell him for exchanging information.   __In the anime:__  ~!He is revealed to be a Shinigami, one that William respects highly and is ranked in Management Level. Though he is legendary and retired, he still can access the Shinigami Library and alter the books.!~   __In the Manga:__  ~! In chapter 35, a manga panel showed that he is somehow linked to a person with a name, Claudia P. His scythe is akin to that of the stereotypical Grim Reaper scythe. In chapter 59 of manga, during the Ship arc, he is shown to use Japanese Grave markers (Sotoba) as weapons. In chapter 60 of the manga it has been confirmed by Grell that he was a Shinigami. He is now retired and bored, so he creates zombies out of curiosity. Also, this is the first time you can see his eyes. In chapter 82 of manga, it is revealed that he was, in fact, the principal.!~  \n(Source: Devil's Food Cake Site and Wikipedia.)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14957-OUduj1a2m4eC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14957
      },
      "rarity": "uncommon"
    },
    {
      "id": "lau",
      "name": "Lau",
      "alt_names": [
        "劉"
      ],
      "role": "supporting",
      "description": "Lau is originally introduced as the branch manager of a profitable Chinese trading company's English operations, and an acquaintance of both Ciel and Madam Red. But despite his odd friendship with Ciel, it seems that Lau is in a dubiously legal business himself: his real business is opium, and he runs an opium den that appears to be very well-off. Though he's aware that Ciel technically has some measure of power over such illegal businesses, his response to Ciel's threat to shut him down is merely to cheerfully comment that if that happens, he'll find another way to make a profit. Most of Lau's personal history remains unknown at this point, but he's very familiar with Ciel and far more powerful than he pretends: before anyone else notices, he somehow incapacitates the guards to a mansion that Ciel and the others are sneaking into.  Lau is a cheerful enigma. It's a rare occurrence indeed that he wears an expression other than a highly amused smile, even when engaging in dangerous investigations. He enjoys making Ciel's life interesting-- though not, perhaps, in the way that Ciel would like-- by dropping in at odd hours for a cup of tea or to watch Ciel track down a murderer. He has a tendency to refer to people by their titles (Earl for Ciel and Butler for Sebastian). Nothing seems to phase him. He's also quite good at acting like he knows more than he does, and uses this to his own benefit in various situations.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/14958.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14958
      },
      "rarity": "uncommon"
    },
    {
      "id": "elizabeth-midford",
      "name": "Elizabeth Midford",
      "alt_names": [
        "エリザベス・ミッドフォード",
        "Lizzie",
        "Elizabeth Ethel Cordelia Midford"
      ],
      "role": "supporting",
      "description": "__Height__: 157 cm (5'2\") - 162 cm (5'3\") (Season 2)\n\nElizabeth (who demands to be called by the more affectionate \"Lizzie\") is Ciel's cousin and fiancée. She is the daughter of Ciel's aunt, Frances, and her husband, Marquis Midford.\n\nLizzie is strong-willed and cheerful, with a fondness for cute things. She has known Ciel since childhood, and the two appear to have been very close. Despite this childhood connection, though, Ciel has not told her the circumstances of his parents' deaths and his own disappearance. Lizzie takes this in stride, not pestering him for information and continues to attempt to restore the close friendship. She ran away from home to see Ciel at least once, in spite of her mother's fearsome personality— she may just be the only person in the series not at all terrified of the Marchioness. Her hobby, much to Ciel's chagrin, is to make everything and everybody \"cute\"; this involves everything from decorating the mansion with hearts and sparkly bunnies to putting old men in dresses (\"just like Marie Antoinette!\").\n\n~!In the manga, Lizzie is shown to be an excellent swordswoman. Ciel was unaware of Lizzie's skills because she hid her talent out of fear it would make her seem less \"cute\". The reason she knows how to fight is because her father, Marquis Alexis Midford, is the head of the British knights. Her father, mother and brother also all know how to wield a sword, and she carries on the family tradition.!~",
      "metadata": {
        "gender": "female",
        "age": "13-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14959-2laidx8k0blk.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14959
      },
      "rarity": "uncommon"
    },
    {
      "id": "soma-asman-kadar",
      "name": "Soma Asman Kadar",
      "alt_names": [
        "ソーマ・アスマン・カダール"
      ],
      "role": "supporting",
      "description": "The 26th child of the King of Bengal, Soma came to England with his butler, Agni, in search of a missing servant from his household. When he was young, he received a palace, complete with attendants, from his parents. Among those servants was a woman named Meena, a cook, who he came to see as an older sister. However, one day, Meena disappeared from the palace, leaving Soma devastated.   ~!After the disaster in London, both he and Agni are seen in London, passing out the curry bread Sebastian taught them to make to hungry survivors.!~  Circumstances surrounding Meena's disappearance causes Soma to take his search for her to England, where he accidentally runs into Ciel and Sebastian in the East End. Though originally he orders Agni to fight on the side of the Indian thugs (calling them his \"brethren\") against Sebastian, when he hears that Ciel did nothing to provoke the thugs, he switches sides for the sake of honor. After the fight, he follows Ciel back to the Phantomhive manor and proceeds to make himself at home. He claims that as an acquaintance of his, under the customs of his home country, Ciel is now required to entertain Soma as a guest.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16733-qUb2tB4NXIDo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16733
      },
      "rarity": "uncommon"
    },
    {
      "id": "agni",
      "name": "Agni",
      "alt_names": [
        "アグニ",
        "Arshad Satyendra Iyer",
        "Curry no Kami"
      ],
      "role": "supporting",
      "description": "Soma's highly-dedicated butler, Agni comes with his master to England in search of Meena. Agni is a master at Indian cooking, and has even shown some skill in landscaping (turning the bushes in the Phantomhive Manor's garden into topiary elephants, for instance). But even more impressive than his cooking skills is his martial arts ability. When he and Soma meet Ciel and Sebastian, Soma orders the butlers to fight. In a move that surprises even Sebastian, Agni proceeds to give the demon a run for his money. In battle, he attacks his enemy's marmam, or pressure points, which can result in paralysis or death. In addition, his right hand has been blessed by the goddess Kali, giving him enhanced strength.",
      "metadata": {
        "gender": "male",
        "age": "31",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16735-chd0v1o0IBky.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16735
      },
      "rarity": "uncommon"
    },
    {
      "id": "vincent-phantomhive",
      "name": "Vincent Phantomhive",
      "alt_names": [
        "ヴィンセント・ファントムハイヴ",
        "Queen's Watchdog"
      ],
      "role": "supporting",
      "description": "He was the head of the Phantomhive family and handsome enough to attract the attention of both Rachel and her sister Angelina, though he favored the older, more refined sister. It's because of his compliments on her red hair that Angelina originally began wearing red. Though he appears in several flashbacks, his face is never shown. He and Rachel were killed on Ciel's tenth birthday.   ~!Vincent was a handsome, well-dressed man with short, dark hair, a mole under his left eye and a kind smile. He bares a vague resemblance to Sebastian Michaelis.  When alive, he was shown to be exceptionally kind and welcoming. This was demonstrated when he noticed that Angelina is self-conscious of her red hair and he made a point to compliment it. He also welcomed Baron Kelvin in to his home, and always took a minute to spare a greeting and a kind word, while others of his social status looked on with disdain. People were shown to have been easily drawn to him, as Angelina fell in love with him easily, and as a child, Ciel accompanied Vincent whenever he could, even when still recovering from being ill.  He was a loving father and his family was always very important to him.  However, he was just as capable as Ciel at manipulating individuals, and Baron Kelvin took note of him and his acquaintances as being \"evil noblemen.\" It is shown that Undertaker was acquainted with the Phantomhive family when Vincent was the head. Another is shown in chapter 75 when he gets a \"German dog\" which he had a bet with.  Vincent was the head of the Phantomhive household and acted as Queen Victoria's watchdog, both titles that Ciel later took over. Tanaka has shown to have worked for the Phantomhive family at least since Vincent's time.  Sometime while he was alive, he hosted a variety of parties that many others nobles attended. When Baron Kelvin attended one of these parties, it is the first time that he encountered Ciel, and he made a continued effort to network with Vincent after that. While Vincent was kind, the others were not, causing Baron Kelvin to believe he had to be more \"beautiful\" to be accepted by their social circle. As a result, Vincent is indirectly part of the reason for Baron Kelvin's obsession with undergoing plastic surgery and with Ciel.  On Ciel's tenth birthday, Vincent and his wife were killed in a fire, his son was kidnapped, and his manor was burnt to the ground. It seems that the reason for this was related to his work as the queen's watchdog and his control over the underworld. In the anime, his death is directly attributed to Queen Victoria.!~",
      "metadata": {
        "gender": "male",
        "age": "34",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16736-YM9WCiptrJJ0.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16736
      },
      "rarity": "uncommon"
    },
    {
      "id": "rachel-phantomhive",
      "name": "Rachel Phantomhive",
      "alt_names": [
        "レイチェル・ファントムハイヴ"
      ],
      "role": "supporting",
      "description": "Ciel's mother was patient and kind, with an elegant kind of poise occasionally shattered by her propensity to tease her younger sister into being more self-confident. She cared deeply for Angelina and took care of her after her accident. Everything points to her having been a good wife and loving mother, though as with her husband, not much is known about her, though her face is visible in flashbacks.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/16737.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16737
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-25T16:19:25.960Z"
}