{
  "work_id": "jojos-bizarre-adventure-part-4-diamond-is-unbreakable",
  "count": 15,
  "characters": [
    {
      "id": "jousuke-higashikata",
      "name": "Jousuke Higashikata",
      "alt_names": [
        "東方仗助",
        "JoJo",
        "Josuke Higashikata"
      ],
      "role": "protagonist",
      "description": "__Height:__ 185 cm\n__Nationality:__ Japanese\n\nJosuke is the illegitimate son of Jotaro's grandfather, Joseph Joestar. He is a caring, popular, and slightly naive teenager. Inspired by his police officer grandfather's (on his mother's side) sense of justice, he isn't afraid to fight for those in need. He is confronted by Jotaro with the need to eradicate evil Stand users from his hometown, Morioh. He refuses at first, believing that it is not any of his business. However, he quickly changes his mind when his policeman grandfather is killed by a criminal Stand user. With a vow paralleling that of Peter Parker, Josuke decides to deliver justice to evil Stand users in his grandfather's place.  Josuke is nice to people and says \"Mister\" and \"Miss\" like a normal, polite young man... until someone pisses him off (which isn't very hard to do). The easiest way to do that is to mock his hair, which makes Josuke angry and explosively violent. Josuke grew up with his single mother, never knowing his father Joseph Joestar. Josuke is crafty and has a sneaky streak for money, which is shown multiple times in the story. Nevertheless, he is a dependable and friendly person who is always willing to protect people who need it.\n\nJosuke's Stand power, Crazy Diamond, is a melee Stand with short range (3m). Crazy Diamond has the ability of \"restoration\". It can repair damage (by returning an object to a previous state) and by extension heal injuries (apart from Josuke's own injuries). It is limited in that it cannot revive the dead. It can, however, restore an item to its raw materials (e.g., a table can be restored to timbers). This ability allows Crazy Diamond to perform a range of interesting feats, including trapping the enemy (by restoring pieces of a broken crate around the target) and tracking (e.g., restoring a torn piece of clothing so that it will seek out what it came from and reattach). Its restoration ability often \"malfunctions\" when Josuke is angry, causing the object to be improperly put back together. The Stand's name is a reference to Pink Floyd's song, \"Shine On You Crazy Diamond\".",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": "1983-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13085-CkmgXL7SSLxL.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13085
      },
      "rarity": "epic"
    },
    {
      "id": "yoshikage-kira",
      "name": "Yoshikage Kira",
      "alt_names": [
        "吉良吉影"
      ],
      "role": "protagonist",
      "description": "**Height:** 175 cm (5'9\")\n\nKira is a man who longs for a simple life, and doesn't wish to be bothered. Although he reveals many talents, this yearning shows in his dislike of coming in first, as the cast eventually realizes. He becomes quite bothered when someone disrupts his \"simplicity\", and goes to extreme lengths to get it back. He keeps a collection of his own fingernail clippings, and believes when they grow quickly he has trouble. Kira also has a bizarre fetish for the female hand, stemming from an erotic fascination with the hands of the Mona Lisa. Unfortunately, his desire has never extended to the rest of the female person. This results in his murdering women in order to acquire their (severed) hands as \"girlfriends\"—when one \"girlfriend\" begins to decay, he goes off in search of a replacement.  Originally, Kira murdered his victims by stabbing them so viciously they were left with horrific back wounds (their hideous nature is implied by the fact that the reader is never actually shown Reimi's wound). However, his Stand, Killer Queen, eventually awoke from his desire to leave no evidence behind of his killings—hence its ability to make its victims completely disintegrate. He now lets Killer Queen annihilate his victims (except for his \"girlfriend\"-hands), letting everyone else think that the victims have simply gone missing. Even if the number of missing attracts attention (as it eventually does), no one would have any reason to suspect that Kira was involved.",
      "metadata": {
        "gender": "male",
        "age": "33",
        "dateOfBirth": "1966-01-30"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12055-eCEkIVV4qoCu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12055
      },
      "rarity": "epic"
    },
    {
      "id": "joutarou-kuujou",
      "name": "Joutarou Kuujou",
      "alt_names": [
        "空条承太郎",
        "JoJo",
        "Qtaro",
        "Professor Kuujou",
        "Jotaro Kujo"
      ],
      "role": "protagonist",
      "description": "**Height:** 195 cm (6'5\")\n__Occupation:__ Student, Marine Explorer, Oceanographer\n__Nationality:__ Japanese \n\nJoutarou is Holly Kujo's son and Joseph Joestar's grandson. In Part 3, he has a recognizable attire of a blue trenchcoat-length school uniform jacket with yellow chains on the collar. He also wears a trademark hat which, while torn in the back, often seems to blend with his hair. When Joutarou first appears, he turned himself in to the police because he believes his Stand is an evil spirit possessing him. After he is released from jail, and learns what his Stand is, Joutarou gets used to Star Platinum -- a fierce, muscular, vaguely Aztec-looking spirit with \"the precision of a machine\" and the ability to destroy virtually anything with a sledgehammer barrage of fists. He has a very tough exterior, and is even rather rough and delinquent, but he also is very dedicated, intense, and loyal. He is very intelligent, but usually lets his (or Star Platinum's) fists do the talking with the enemy, even though he often has to rely on his wits to deal with stand users' attacks. He is also known for a quick and short temper. His catchphrase is \"Yare yare daze.\" It generally relates of being bored or exasperation. In Part 3, he is the main target of Dio, who realizes that Joutarou is his greatest threat.\n\nOne of the strongest stands in the JoJo universe; Star Platinum possesses super human senses, strength, stamina, accuracy and speed. It can see for great distances and at great magnifications. The Star tarot card that Star Platinum is named after symbolizes hope. Like other physically powerful stands, Star Platinum suffers from a narrow range of activity. It can only be active within a 2-3 meter radius from Joutarou. ~!It is similar to Dio's The World stand, and, it turns out, can likewise be used to stop time, but that ability is only revealed in Joutarou's epic battle with Dio Brando when Dio was about to drop a steamroller on him.!~\n\nIn the sixth story arc Stone Ocean, Joutarou becomes an oceanologist, moves to the United States, eventually marries, and his daughter, Jolyne inherits the potential to wield Stand powers.",
      "metadata": {
        "gender": "male",
        "age": "17-40",
        "dateOfBirth": "1970-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4003-gWDSEGbeOAll.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4003
      },
      "rarity": "epic"
    },
    {
      "id": "rohan-kishibe",
      "name": "Rohan Kishibe",
      "alt_names": [
        "岸辺露伴"
      ],
      "role": "protagonist",
      "description": "Rohan is a mangaka that first appears as an antagonist to Koichi and Toshizaku when they go to his house for an autograph. After they try to sneak a peek of the new issue of his manga he uses his stand Heaven's Door to make neither of them able to attack him. Then he reads their memories and in doing so finds out about Josuke, Okuyasu and everyone else in the story so far, but only according to how Koichi sees them. Then he decides to use them as materials for his manga. After using Koichi as his personal \"Inspiration\" Okuyasu and Josuke find out about where Koichi has been going by following him. They defeat him and leave him in the hospital for a while.\n\nIn the Jojolands Universe he appears as rich japanese who owns a Villa on Hawai'i Island and as a second antagonist who fight with Jodio, Dragona, Paco and Usagi.\nFurthermore, he saves in his safe the diamond which Jodio and his group want to steal and two Lava Rocks.",
      "metadata": {
        "gender": "male",
        "age": "20-27",
        "dateOfBirth": "1979-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12659-hgT3g7q7oHnU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12659
      },
      "rarity": "epic"
    },
    {
      "id": "kouichi-hirose",
      "name": "Kouichi Hirose",
      "alt_names": [
        "広瀬康一",
        "Koichi Hirose"
      ],
      "role": "protagonist",
      "description": "An ally and classmate who meets Josuke when Jotaro is searching for him, resulting in the two becoming quick friends. His stand is Echoes, which has three distinct forms, or Acts (Koichi can only call upon one at any given time).",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24496-h2oMSeBxyYUc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24496
      },
      "rarity": "epic"
    },
    {
      "id": "okuyasu-nijimura",
      "name": "Okuyasu Nijimura",
      "alt_names": [
        "虹村億泰"
      ],
      "role": "protagonist",
      "description": "Okuyasu isn't exactly the brightest character in the Jojo story, and tended to rely on his elder brother Keicho to make hard decisions. After his brother died, he sought revenge against the User of Red Hot Chili Pepper, Akira Otoishi. During this time and the following events surrounding Yoshikage Kira, he became fast friends with Josuke and Koichi. \n\nOkuyasu tends to be jealous of Koichi's relationship with Yukako, and enjoys Tonio's cooking. He also befriends Shigechi, after doing battle with his Harvest with Josuke. \n\n~!This friendship is why he became further enraged when Shigechi was killed by Yoshikage Kira. !~\n\n~!Okuyasu's father is a bizarre creature, mutated by Dio's spores when Okuyasu was only 7. He rather dislikes Rohan because of what Rohan tried to do to him when they first met.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n28991-IYMZXahuCel5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28991
      },
      "rarity": "epic"
    },
    {
      "id": "joseph-joestar",
      "name": "Joseph Joestar",
      "alt_names": [
        "ジョセフ・ジョースター",
        "JoJo",
        "Josef Joestar",
        "Mr. Joestar",
        "Old Man",
        "Geezer"
      ],
      "role": "supporting",
      "description": "__Height__: 195 cm (6'5\")\n\nJoseph Joestar begins as a young Englishman in New York, with his grandmother Erina. However, an attack by Straits and the disappearance of Robert Edward O Speedwagon soon involve him in the greater chain of events.",
      "metadata": {
        "gender": "male",
        "age": "18-78",
        "dateOfBirth": "1920-09-27"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6356-RImEfUfHpC58.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6356
      },
      "rarity": "common"
    },
    {
      "id": "mikitaka-hasekura",
      "name": "Mikitaka Hasekura",
      "alt_names": [
        "支倉 未起隆",
        "Nu Mikitakazo Nshi"
      ],
      "role": "supporting",
      "description": "Mikitaka first appears in chapter 378 (I Am An Alien! 1). He claims he&#039;s a 216 year old alien from the Mclon system looking for a planet for his people to live in. His job is piloting a space shuttle and his hobby is raising small pets. He possesses the ability to assume any physical form he desires. Although he can take a form vastly smaller than his normal mass, and can separate himself into several components in the process, it is not known if he can take on a much larger form. On the negative side, if exposed to a siren or similar sound, he suffers a painful rash until the sound stops. It was never revealed in the manga whether Mikitaka is a delusional stand user activated by the Arrow or truly an extraterrestrial life-form (he gives his full name as Nu Mikitakazo Nshi). According to JOJO!A-GO-GO artbook, his stand&#039;s name is Earth, Wind And Fire.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n24819-8CoXToPvxsQ2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24819
      },
      "rarity": "common"
    },
    {
      "id": "shigekiyo-yanguu",
      "name": "Shigekiyo Yanguu",
      "alt_names": [
        "矢安宮重清",
        "Shigechi (重ちー)",
        "Fatty"
      ],
      "role": "supporting",
      "description": "A side character in Diamond is Unbreakable. Shigechi is a short and stocky teenage boy. Apparently bald, his crown is textured by short spikes, and he has thick, drooping earlobes. He has small, high eyebrows, and youthful features. His teeth are misaligned, and he is missing his left maxillary central incisor.\n\nIntroduced as a kid using his Stand, Harvest, to collect money throughout the town, Shigechi befriends Josuke Higashikata and Okuyasu Nijimura.\n~!He is soon killed by Yoshikage Kira, prompting Josuke Higashikata and his friend's search for the murderer.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b42156-SsAthsaHBPBv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42156
      },
      "rarity": "common"
    },
    {
      "id": "akira-otoishi",
      "name": "Akira Otoishi",
      "alt_names": [
        "音石明"
      ],
      "role": "supporting",
      "description": "Akira was one of the many people Keicho Nijimura shot with the Bow and Arrow while trying to find a stand user capable of killing his mutated father. Akira was one the many lucky ones to develop a stand after which point he became interested in them and how to create them. To further his goal on studying them he needed the Bow and Arrow which he forcefully took from Keicho leading to Keicho&#039;s death. From there on he tormented several people, among them Josuke while trying to improve in the use of his guitar skills.\n\n(Source: JoJo's Bizarre Adventure Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n42157-AGCzIoYgewvb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42157
      },
      "rarity": "common"
    },
    {
      "id": "yukako-yamagishi",
      "name": "Yukako Yamagishi",
      "alt_names": [
        "山岸由花子"
      ],
      "role": "supporting",
      "description": "__Height:__ 167 cm\n\nYukako is a student in love with Koichi Hirose. At first she was very aggressive in her affections towards him, jealously attacking what she believed were potential rivals in love and even going so far as to kidnap him and threaten his life should he not return her feelings and not appreciate her efforts to \"change him into a better person\" – she had picked up false rumors that he was insufferable, false rumors that were spread by Josuke and Okuyasu in order to help Koichi in turning her away from him; unfortunately for them, their measures had the opposite effect.   Later in the story, Yukako, still lovestruck, seemed to have learned from her mistake in trying to force Koichi. Unhappy about her unrequited love she made use of the services offered by Aya Tsuji's beauty enhancing Cinderella stand, which rendered her into a bewitchingly attractive woman in the eyes of Koichi - for a price and a certain time limit, during which she was to use a special lipstick in order to uphold the \"magic\" i.e. the stand's power.    ~!The stand allowed her to grow closer to Koichi, who, after some trials and tribulations, warmed up to her and willingly became her boyfriend. !~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b42158-fJjH6bfIV03m.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42158
      },
      "rarity": "common"
    },
    {
      "id": "keichou-nijimura",
      "name": "Keichou Nijimura",
      "alt_names": [
        "虹村形兆"
      ],
      "role": "supporting",
      "description": "A minor antagonist featured in the fourth part of JoJo's Bizarre Adventure, Diamond is Unbreakable, specifically in the \"The Nijimura Brothers\" story arc. Keicho is Okuyasu's older brother. He is the first in Morioh to possess the Bow and Arrow and liberally creates Stand users in hopes one of them can kill his monstrous father. Keicho himself is a Stand User and his Stand is the miniature army, Bad Company.\n\n~!After his fight with Josuke Higashikata, he dies from being electrically fried by Akira Otoishi's stand, Red Hot Chili Pepper!~",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n76724-IipZygmaW04t.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 76724
      },
      "rarity": "common"
    },
    {
      "id": "reimi-sugimoto",
      "name": "Reimi  Sugimoto",
      "alt_names": [
        "杉本鈴美"
      ],
      "role": "supporting",
      "description": "Reimi Sugimoto is Yoshikage Kira's first victim, and as a ghost, chose to stay on Earth in hope of finding someone to help her bring Kira to justice.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90167-PoLUdRHftmDj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90167
      },
      "rarity": "common"
    },
    {
      "id": "tomoko-higashikata",
      "name": "Tomoko Higashikata",
      "alt_names": [
        "東方朋子"
      ],
      "role": "supporting",
      "description": "She is the single mother of [Josuke Higashikata](https://anilist.co/character/13085/Jousuke-Higashikata).\n\nA single mother and teacher, Tomoko is known to show a strong temperament, disliking it when guys try to hit on her (as she still loves Joseph) and she gets annoyed quite easily. She also seems to be mildly perceptive, noticing that the seal on her milk that Angelo had given her was broken. Despite her sharp temperament, she is mostly a kind person, particularly to her family and friends.",
      "metadata": {
        "gender": "female",
        "age": "37",
        "dateOfBirth": "1962-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130127-cffPGDGsZaUT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130127
      },
      "rarity": "common"
    },
    {
      "id": "terunosuke-miyamoto",
      "name": "Terunosuke Miyamoto",
      "alt_names": [
        "宮本輝之輔",
        "Enigma Boy"
      ],
      "role": "supporting",
      "description": "Terunosuke is a man of average height and slim build. He has skin of a medium tone, light eyes, and light hair that is styled in a criss-cross pattern, framing his face and curling upwards at its ends.\n\nHe wears a long, light coat closed to the end of his chest. Underneath is a dark top wrapped in three ornate belts and fitted dark pants. The inside of his coat has the word \"ENIGMA\" printed at its bottom.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130128-01TBHWQgRjPv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130128
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-25T23:13:15.381Z"
}