{
  "work_id": "bakemonogatari",
  "count": 14,
  "characters": [
    {
      "id": "koyomi-araragi",
      "name": "Koyomi Araragi",
      "alt_names": [
        "阿良々木暦",
        "Arararagi",
        "Koyomin",
        "Koyokoyo",
        "Devil Boy",
        "Kind Monster Sir",
        "Monstieur"
      ],
      "role": "protagonist",
      "description": "__Height:__ 165 cm   \n\nA third year high school student who is close to failing every class except math. He is a laid-back person whose only real friend at school is [Tsubasa Hanekawa](https://anilist.co/character/22055/Tsubasa-Hanekawa). Due to events prior to Kizumonogatari and Bakemonogatari, Koyomi avoided having friends and seemed to have lost faith and trust in people and himself.\n\n~!During spring break, he gave [Kiss-Shot](https://anilist.co/character/23602/Shinobu-Oshino) his blood and became a vampire. Although [Meme Oshino](https://anilist.co/character/22552/Meme-Oshino) helped him become human again, there are a few lingering side effects; he can see in the dark and far distances, and he heals faster than the average human. He is still scared of morning sunlight even though it no longer has any effect on him.!~",
      "metadata": {
        "gender": "male",
        "age": "17-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22036-Ed3CjwPlDLp4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22036
      },
      "rarity": "legendary"
    },
    {
      "id": "hitagi-senjougahara",
      "name": "Hitagi Senjougahara",
      "alt_names": [
        "戦場ヶ原ひたぎ",
        "Tsundere-chan",
        "Gahara-san"
      ],
      "role": "protagonist",
      "description": "__Height:__ 165 cm\n\nHitagi, the main female character, is a weak-looking girl with an \"incurable disease\". She is in the same class as [Koyomi](https://anilist.co/character/22036/Koyomi-Araragi), but he has almost never heard her speak. When she was in the first year of high school, she encountered a mysterious crab, after which she became weightless. Ever since, she has avoided contact with everyone else, threatening everyone who discovers her secret. She called herself a tsundere and always speaks in an abusive style.\n\n~!At the end of Mayoi Snail, she admits that she loves Koyomi, and subsequently enters into a relationship with him.!~\n\n~!After the events in Tsukihi Phoenix, she overcame all of her trauma, and became a rather cheerful and normal girl. She starts calling Araragi with a cute nickname, chuckling at small things and sending e-mails full of Emojis, although her sharp tongue is still there, but toned down.!~\n\n~!Hitagi has told Hanekawa that she suffers from an Electra Complex (when a girl has intense sexual attraction towards her father). Whether this was a joke or a sincere admission has remained unrevealed!~",
      "metadata": {
        "gender": "female",
        "age": "17-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22037-sY7GWSKYr2Nl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22037
      },
      "rarity": "legendary"
    },
    {
      "id": "mayoi-hachikuji",
      "name": "Mayoi Hachikuji",
      "alt_names": [
        "八九寺真宵",
        "Lost Snail"
      ],
      "role": "protagonist",
      "description": "Mayoi is a fifth-grade elementary school girl. She always carries a big backpack, wears a hairband, and sports ponytails.    ~!Ten years ago she was involved in a traffic accident and died because of it. After that she became a ghost and considers herself a \"lost snail\". She will unwillingly cause the people around her to become lost and unable to find their way home. The only people who can see her are people who don't want to go home in the first place. However, after [Araragi](https://anilist.co/character/22036/Koyomi-Araragi) and [Senjougahara](https://anilist.co/character/22037/Hitagi-Senjougahara) help her find the home she was looking for, she changed from an \"earthbound spirit\" to a \"wandering spirit\", a fact that she considers to be a bonus, as well as granting her to be free to wander wherever she desires. At the end of Nisemonogatari, she said goodbye to Koyomi, implying that she will not be seeing him again, which will be the basis of the next story, Mayoi Jiangshi. Her family name before her parents got divorced was Tsunade.!~",
      "metadata": {
        "gender": "female",
        "age": "11",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22052-beyfl4AyMGhn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22052
      },
      "rarity": "legendary"
    },
    {
      "id": "suruga-kanbaru",
      "name": "Suruga Kanbaru",
      "alt_names": [
        "神原駿河",
        "Suruga Gaen",
        "Ruga",
        "Gaen's Legacy"
      ],
      "role": "protagonist",
      "description": "Suruga, the main character of Suruga Monkey, is [Koyomi](https://anilist.co/character/22036/Koyomi-Araragi)'s underclassman, ace of the school's basketball team and one of [Hitagi](https://anilist.co/character/22037/Hitagi-Senjougahara)'s acquaintances from back in junior high school. Immediately after she entered senior high school, she became aware of Hitagi's secret and was threatened by her, just like Koyomi was. She's an admitted lesbian, fujoshi, lolicon and masochist. \n\n~!Back in elementary school, she inherited what she thought was a Monkey's Paw but was actually a Rainy Devil from her mother. She started stalking Koyomi after she discovered he was dating Hitagi. She becomes friends with Koyomi and Hitagi after Koyomi rids her of the Rainy Devil.!~ She also has been growing her hair longer since. Her next story was revealed to be Suruga Devil.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/22054-n6Jsvp80bUhD.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22054
      },
      "rarity": "legendary"
    },
    {
      "id": "nadeko-sengoku",
      "name": "Nadeko Sengoku",
      "alt_names": [
        "千石撫子"
      ],
      "role": "protagonist",
      "description": "__Height:__ 153 cm \n\nNadeko, the main character of Nadeko Snake, is [Tsukihi](https://anilist.co/character/24195/Tsukihi-Araragi)’s friend back in elementary school. She always wears a waist pouch, always casts her eyes downward, has her bangs covering her eyes, has a shy personality, and can be easily amused. [Koyomi](https://anilist.co/character/22036/Koyomi-Araragi) played with her a lot whenever she visited his house after being invited by his sisters. She refers to Koyomi as Koyomi onii-chan and appears to have feelings for him.   ~!She was cursed two times by a classmate who liked the boy she rejected, and the rejected boy. While the first one is banished, Koyomi is forced to battle the second to keep it from killing Nadeko.!~ She's quite protective of her hair (particularly her forelocks) thinking that it's her place to guard more than her panties. When she finally combed her forelocks aside in Nisemonogatari, Koyomi commented that she has a glare just like a serpent, probably foreshadowing the story of Nadeko Medusa.\n\nIn Nademonogatari, ~!Nadeko gains a power to draw, create, and then materialize shikigami, making her useful in the eyes of [Izuko Gaen](https://anilist.co/character/87115/Izuko-Gaen) and gets offered a job, thanks to [Yotsugi Ononoki](https://anilist.co/character/57499/Yotsugi-Ononoki)!~",
      "metadata": {
        "gender": "female",
        "age": "13-14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22050-RUw3vyGYdr9W.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22050
      },
      "rarity": "legendary"
    },
    {
      "id": "tsubasa-hanekawa",
      "name": "Tsubasa Hanekawa",
      "alt_names": [
        "羽川翼",
        "Class Rep-chan"
      ],
      "role": "protagonist",
      "description": "__Height__: 158 cm\n\nShe styles her hair into two braids and ties them with a hair ribbon that has a cat design. She is always seen dressed in the uniform of Naoetsu Private High School, even outside of school days, and is rarely seen on any other type of clothing, except for a set of sleepwear which she wore during Tsubasa Cat Arc.  Hanekawa Tsubasa is [Araragi](https://anilist.co/character/22036/Koyomi-Araragi)'s classmate and the class president. Araragi describes her as \"the class president of all class presidents\". Her catchphrase is \"I don’t know everything, I just know what I know\". Hanekawa currently lives with her stepfather and stepmother.\n\nHanekawa Family's Past:  ~!Her biological mother was 17 years old when she got pregnant, the biological father is unknown because she apparently had many lovers. Before she gave birth to Tsubasa, she married another man who was a \"workaholic\". Right after giving birth, Tsubasa's biological mother commited suicide. The workaholic stepfather, unable to raise a child, remarried again to a woman who is Tsubasa's current mother. The workaholic father soon died from overwork and the current mother married another man who is now Tsubasa's current father. !~  Hanekawa Story's overview in Nekomonogatari/Bakemonogatari:  \n\n~!Prior to the beginning of Bakemonogatari, Hanekawa was possessed by the mischievous spirit of a dead cat during Golden Week due to stress over her family. The matter was eventually resolved with the help of Shinobu at the cost of some of Hanekawa's memories, but the problem emerged again right before the school festival because of different stress. Araragi was told by Hanekawa's bakeneko form that she has feelings for him.  In 'Tsubasa Tiger' (Nekomonogatari: Shiro), on her way to school, she met a tiger spirit which spoke to her. Soon buildings important to Hanekawa began to mysteriously burn down and 'Black Hanekawa' (her bakeneko form) began to take over her body every time she slept. The inevitable showdown was afoot and led to some surprising events.  'Tsubasa Tiger' is written from the perspective of Hanekawa rather than Araragi.!~",
      "metadata": {
        "gender": "female",
        "age": "17-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22055-EaTsy30ihdgb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22055
      },
      "rarity": "legendary"
    },
    {
      "id": "meme-oshino",
      "name": "Meme Oshino",
      "alt_names": [
        "忍野メメ"
      ],
      "role": "supporting",
      "description": "Meme is a middle-aged man who lives in an abandoned building. Being an expert in apparitions field, he solves [Koyomi](https://anilist.co/character/22036/Koyomi-Araragi) and others' problems. Although he sometimes expects compensation, he does not require it always and seems to help those in need from good nature. Due to his vast knowledge of supernatural studies and general oddities, he serves as Araragi's informant during his stay in the city. Meme is a graduate of Shinto studies in college, although he never pursued the career of being a Shinto priest. Despite that, he is perfectly capable to accomplish spiritual works of a Shinto priest, such as exorcising entities and solving paranormal mysteries. He occasionally wears a Priest's outfit, as seen with the session with [Senjougahara](https://anilist.co/character/22037/Hitagi-Senjougahara) and the heavy crab. Meme's other notable accessories include an earring on his right ear and a necklace, both consisting of an inverted cross.",
      "metadata": {
        "gender": "male",
        "age": "30",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22552-CZz1T3AjRyVd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22552
      },
      "rarity": "epic"
    },
    {
      "id": "shinobu-oshino",
      "name": "Shinobu Oshino",
      "alt_names": [
        "忍野忍",
        "Kiss-Shot Acerola-Orion Heart-Under-Blade (キスショット・アセロラオリオン・ハートアンダーブレード)",
        "Tekketsu ni shite Nekketsu ni shite Reiketsu no Kyuuketsuki (鉄血にして熱血にして冷血の吸血鬼)",
        "The Iron-blooded‚ Hot-blooded‚ Cold-blooded Vampire",
        "Beautiful Princess",
        "Acerola",
        "Laura"
      ],
      "role": "supporting",
      "description": "A girl who lives with [Oshino Meme](https://anilist.co/character/22552/Meme-Oshino) in an abandoned building. She loves donuts from the Mister Donut chain. At the beginning of Hitagi Crab, she was renamed \"Shinobu\" by Meme, who suggested that the name Shinobu (忍), comprised of a heart (心) under a blade (刃), matched her original persona.\n\n~!She appears to be an eight year old girl, but was originally a beautiful vampire who had lived for more than 500 years. After the events of Koyomi Vamp, she was left in a weakened condition with no powers or traces of her original personality, and therefore had to abandon her \"Kiss-Shot Acerola-Orion Heart-Under-Blade\" name. Prior to being a vampire, she was a princess of unparalleled beauty. She was referred to as \"Princess Beauty\" or \"Acerola\" during this time, the latter being her original name. Eventually, she was turned into a vampire by Deathtopia Virtuoso Suicide-Master to save her from the curse of beauty.!~",
      "metadata": {
        "gender": "female",
        "age": "598-599",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23602-Z4MDNYcoAWZu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23602
      },
      "rarity": "epic"
    },
    {
      "id": "karen-araragi",
      "name": "Karen Araragi",
      "alt_names": [
        "阿良々木火憐"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm \n \nKaren, the main character of Karen Bee, is one of [Koyomi](https://anilist.co/character/22036/Koyomi-Araragi)'s sisters. She is older than [Tsukihi](https://anilist.co/character/24195/Tsukihi-Araragi) and always doing outdoor activities. Despite being younger, Karen is taller than Koyomi, much to Koyomi's dismay.    \n\n~!In Karen Bee, her hot-headed personality and her habit of acting before thinking lead her to be stung by a bee which leads to being poisoned with a terrible fever that lasted for 3 days. Like [Hitagi](https://anilist.co/character/22037/Hitagi-Senjougahara), she refused any help from anyone which eventually leads to her and Koyomi fighting each other. Later it was revealed that it was set up by [Kaiki](https://anilist.co/character/53641/Deishuu-Kaiki). Karen and Tsukihi are nicknamed Tsuga no Ki Nichū no Fire Sisters (栂の木二中のファイヤーシスターズ, lit. Fire Sisters of Tsuga no Ki 2nd Junior High). It was revealed that the reason she and Tsukihi found boyfriends was so that Koyomi would become jealous. They found boyfriends in Koyomi's image with Karen's boyfriend being shorter than her. She and Tsukihi also thought that Koyomi's girlfriend was [Tsubasa](https://anilist.co/character/22055/Tsubasa-Hanekawa). Koyomi, Karen and Tsukihi's parents were revealed to be police officers. !~",
      "metadata": {
        "gender": "female",
        "age": "14-15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n24194-SZwAIpP4IDum.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24194
      },
      "rarity": "epic"
    },
    {
      "id": "tsukihi-araragi",
      "name": "Tsukihi Araragi",
      "alt_names": [
        "阿良々木月火",
        "Rara-chan"
      ],
      "role": "supporting",
      "description": "__Height:__ 156 cm   \n\nTsukihi, the main character of Tsukihi Phoenix, is one of [Koyomi](https://anilist.co/character/22036/Koyomi-Araragi)'s sisters. She's the youngest of Araragi family. Unlike her sister, [Karen](https://anilist.co/character/24194/Karen-Araragi), she is always doing indoor activities. Contrary to her personality, she constantly changes her hair style and is short-tempered to the point that Koyomi describes her as having hysteria.    ~!She is actually the reincarnation of a phoenix and has been since before she was even born. The phoenix entered the baby's body when it was still in the womb and by now both beings' minds have become one. She is immortal and the only thing that end her life is a natural death from old age. It was hinted that [Kaiki](https://anilist.co/character/53641/Deishuu-Kaiki) was the one who sent [Kagenui](https://anilist.co/character/57501/Yozuru-Kagenui) and [Ononoki](https://anilist.co/character/57499/Yotsugi-Ononoki) to go after Tsukihi. Tsukihi and Karen are nicknamed Tsuga no Ki Nichū no Fire Sisters (栂の木二中のファイヤーシスターズ). It was revealed that the reason she and Karen found boyfriends was so that Koyomi would become jealous. They found boyfriends in Koyomi's image with Tsukihi's boyfriend being taller than her. She and Karen also thought that Koyomi's girlfriend was [Tsubasa](https://anilist.co/character/22055/Tsubasa-Hanekawa). Koyomi, Karen and Tsukihi's parents were revealed to be police officers. !~",
      "metadata": {
        "gender": "female",
        "age": "13-14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/24195-iKisWgh6a4kl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24195
      },
      "rarity": "epic"
    },
    {
      "id": "senjougahara-no-chichi",
      "name": "Senjougahara no Chichi",
      "alt_names": [
        "戦場ヶ原の父"
      ],
      "role": "supporting",
      "description": "The father of Hitagi Senjougahara. He is often working due to being in debt after he and Hitagi's mother split. Upon noticing that Hitagi is more cheerful after being with Koyomi Araragi, he is happy that she is able to enjoy herself once again and thankful for Koyomi.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n32509-kL0oRf1Gplfb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 32509
      },
      "rarity": "epic"
    },
    {
      "id": "dramaturgy",
      "name": "Dramaturgy",
      "alt_names": [
        "ドラマツルギー"
      ],
      "role": "minor",
      "description": "Dramaturgy is a giant man over 2 meters tall and carries two flamberge swords. He is the one who took Kiss-shot's right leg. It's implied he may be German in Tsubasa Sleeping. He is also a Vietnam War veteran.   ~!Even though he is a vampire hunter, he is a vampire himself!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b42362-tf2uLWPrv2AO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42362
      },
      "rarity": "rare"
    },
    {
      "id": "episode",
      "name": "Episode",
      "alt_names": [
        "エピソード",
        "Sode"
      ],
      "role": "minor",
      "description": "A young vampire hunter who wields a giant cross as a weapon. He stole Kiss-Shot's left leg. Despite his physical appearance, he's only 6 years old. Episode often says, \"Gotta love it,\" or, \"That's hilarious,\" as a catchphrase. He has an aggressive and arrogant personality, and has a tendency to get carried away when fighting. ~!Episode is a half-vampire, he doesn't belong to humans or vampires; due to this, he is spiteful towards both sides.!~",
      "metadata": {
        "gender": "male",
        "age": "6",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b42363-SqGCv9gBmJbM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42363
      },
      "rarity": "rare"
    },
    {
      "id": "guillotine-cutter",
      "name": "Guillotine Cutter",
      "alt_names": [
        "ギロチンカッター",
        "Guillotinecutter"
      ],
      "role": "minor",
      "description": "Guillotine Cutter is the archbishop of a new religion he created in which believes that he is god. He is one of the three vampire hunters with Episode and Dramaturgy, who  ~!stole both of Kiss-shot's arms.!~   ~!After he was defeated by Araragi, he attempts to slay a full-powered Kiss-Shot but is killed and consumed.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42364-DetrilF9Os35.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42364
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T00:10:29.389Z"
}