{
  "work_id": "angels-of-death",
  "count": 7,
  "characters": [
    {
      "id": "rachel-gardner",
      "name": "Rachel Gardner",
      "alt_names": [
        "レイチェル・ガードナー",
        "Ray"
      ],
      "role": "protagonist",
      "description": "__Height:__ 156cm (5'1\")\n\nAn amnesiac little girl who finds herself in a mysterious building. Being very calm and collected, she's often described as being extraordinarily dull but painfully honest, with some even remarking that she resembles a porcelain doll due to her difficulty in visibly expressing emotions and always having a strange, blank stare regardless of her mood. She's fixated on the idea of God, often overthinking her relation and worth to him, as well as projecting his will onto various events in her life, even desiring punishment and death once she labels herself a sinner.\n\n~!She exhibits a strange obsession with desiring \"ideal\" things, often stitching them together in order to make them \"hers\" and panicking if they don't meet her criteria, regardless of whether they are objects, people, or dead animals.!~\n\n~!Ultimately revealed to be the master of floor B1, which is modeled after her family home, although filled with absurd traps. A number of items have been added to it by Danny, such as toys and fake flowers.!~\n\n~!Her obsession with sewing things together stems from an unspecified mental health issue affecting her ability to feel empathy. Following an incident in which she stitched together a dead puppy's corpse, her parents' arguments escalated, with each of them blaming the other for Ray becoming the way she is.!~",
      "metadata": {
        "gender": "female",
        "age": "13",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123327-sCoETT0pFslx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123327
      },
      "rarity": "epic"
    },
    {
      "id": "isaac-foster",
      "name": "Isaac Foster",
      "alt_names": [
        "アイザック・フォスター",
        "Zack"
      ],
      "role": "protagonist",
      "description": "__Height:__ 186 cm (6'1\")\n\nAn illiterate serial killer in charge of floor B6, the lowest in the building. He despises liars and dishonesty above all else and sees himself as a monster. His favourite weapon is a scythe, which was given to him by Gray. He seems to have unnaturally strong destructive tendencies, going into a frenzy whenever he's allowed to let loose, as was the case with him destroying Eddie's graveyard on floor B4. Due to his tendency to speak his mind and being brutally honest, he swears very frequently.\n\nEver since he was a child, he sympathized with the villains of slasher films. Due to his strange behavior, his mother's partner attempted to burn him alive, forcing Zack to cover up his burns with bandages for the rest of his life. Soon after, he would be sent into an illegal orphanage, where his apparent insensitivity to death and pain would cause the owners to use him as an errand boy, disposing of other children's corpses and being forced to eat garbage. After escaping the orphanage and killing the owners, filled with a newfound hatred for people who see him as a \"tool\", he would go on to briefly live together with a blind old man who took him in on a whim - however, following the old man's death at the hands of a mugger, he would go back to living on the streets and killing those unlucky enough to run into him at night. \n\nAt some point, Gray would scout him out and get him involved in his project.",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123328-NZApzipm9Qwy.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123328
      },
      "rarity": "epic"
    },
    {
      "id": "edward-mason",
      "name": "Edward Mason",
      "alt_names": [
        "エドワード・メイソン",
        "Eddie",
        "エディ"
      ],
      "role": "supporting",
      "description": "__Height:__ 154cm (5'0\")\n\nMaster of floor B4. A very immature gravedigger who's grown infatuated with Rachel after seeing her documents, often seen obsessed with the idea of giving her the most beautiful burial and grave he can. He despises Zack for his lack of subtlety and finesse.\n\nBorn into a family that had been graveyard workers for generations, Eddie would pour all his heart into it, with creating beautiful graves quickly becoming his one true passion. He was always appreciated by his father, who'd often remark that he's the best worker in the family.\nDespite that, due to being the third sibling - with one younger brother and two older ones - he'd always receive hand-me-downs from his older brothers, and would eventually be forced to give up his belongings to his younger brother (even boots which he purchased with his own money), thus never truly having anything of his own. He'd even be told that the family pets - which he not only loved, but took great care of - belonged to everyone and not him alone. Even when he had to bury the family's pet bird which his oldest brother killed in a fit of rage, he still felt like it wasn't \"his\" - only when he was forced to put down and bury the family cat would his heart find peace, leading to him developing an obsession with making things \"his\" by burying them in graves of his own making.\n\nHis oldest brother, Albert, developed severe anger issues that went untreated, prompting him to destroy items around the house and harm the family pets. In order to avoid that, Eddie would often let his brother use him as a punching bag, believing that if he endures his abuse, they would all be safe - however, he could never bring himself to hate his brother or tell his parents about what was going on, with his obsessive devotion to grave-digging eventually worsening and becoming a way to cope with both his own mental problems and the physical harm his brother would inflict.\n\n~!At some point, he had grown closer to a little girl of similar age to him, who would often accompany him during his grave-digging at night, but refused to talk about herself despite wearing tattered clothes and being covered in bandages, prompting Eddie's concern. Soo after, as Albert's condition worsened and his abuse became much worse, Eddie's psyche would reach its breaking point, with him opting to kill and bury all the family pets so that they would never be hurt by his brother ever again. At the same time, the girl he had befriended arrived once again, revealing that she had run away from an abusive foster family and had nowhere to go. Seeing that she's suffering, Eddie would put her out of her misery with his own hands, later burying her in a grave of his own making, happy that she was not only free from abuse, but also, became truly \"his\".!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123329-imTHDGz2crno.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123329
      },
      "rarity": "rare"
    },
    {
      "id": "daniel-dickens",
      "name": "Daniel Dickens",
      "alt_names": [
        "ダニエル・ディケンズ",
        "Danny",
        "Doctor Danny"
      ],
      "role": "supporting",
      "description": "__Height:__ 179 cm (5'10\")\n\nA psychiatrist in charge of floor B5 who claims to have been Ray's counselor. Despite his gentle facade, he hides a much more sinister persona.\n\nHe was born without his right eye, alienating him from other kids and adults alike. Despite his mother's mental health gradually declining as a result of seeing him struggle to fit in and blaming herself for his imperfection, he constantly attempted to show his affection towards her by staring into her empty, despair-filled eyes, eventually leading her to take her own life. Since then, he developed an obsession with people's eyes, chasing the same sort of despair and emptiness he'd seen in his mother's stare. \nWhen he worked in the same prison as Cathy and Lucy, he'd collect prisoners' eyeballs. His fixation would reach its peak the moment he met Ray - considering her eyes the most beautiful ones he's ever seen, he wishes to remain by Ray's side forever, going to extreme lengths to keep her in his care.\n\n~!Prompted by his strange attraction to Ray, he was the one to decorate her floor of the building, not only replicating her family home, but also bringing her toys, stuffed animals, fake flowers, and even a music box that was given to her by her parents back when they were a happy family.!~\n\nHe has a quirk of swapping out his regular prosthetic eye for one with a double iris whenever he gets excited.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123330-GRuT68iao3oj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123330
      },
      "rarity": "rare"
    },
    {
      "id": "catherine-ward",
      "name": "Catherine Ward",
      "alt_names": [
        "キャサリン・ワード",
        "キャシー",
        "Cathy",
        "Executioner",
        "The Condemner"
      ],
      "role": "supporting",
      "description": "__Height:__ 176cm (5'8\"); 166cm (5'4\") without boots\n\nAn ex-prison guard in charge of floor B3 of the building, thoroughly devoted to her role as a self-proclaimed judge and executioner, guided by her twisted sense of justice. A cheerful and sassy sadomasochist who enjoys torturing those sent to her using elaborate traps and challenges in order to create a game show-like spectacle for her own entertainment. She views Zack as an exemplary sinner, attempting to punish him thoroughly for her amusement, and tends to disregard Ray as \"dull\" despite her initial interest in her.\n\nAs the only child of a respected family of doctors, she attended a prestigious all-girls' school, where many other students initially idolized her and admired her beauty. However, after her parents committed malpractice and were murdered by a relative of their patient, a number of rumors began circulating, leading to her schoolmates heavily ostracizing her.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123331-azGiX9eeiOi4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123331
      },
      "rarity": "rare"
    },
    {
      "id": "abraham-gray",
      "name": "Abraham Gray",
      "alt_names": [
        "エイブラハム・グレイ",
        "The Reverend"
      ],
      "role": "supporting",
      "description": "An extremely eloquent and stern elderly priest residing in a cathedral on floor B2. He attempts to make Ray doubt her choices and beliefs, being deeply obsessed with exploring what religious beliefs truly mean to people.\nHe's also proficient in using illusions and hallucinogenic drugs (which, as Ray remarks, make him give off a strange, sweet scent) in order to lead his subjects into a state of mania and expose their true selves.\n\nWhile not much is known about his past, he had apparently always shown a keen interest in studying what makes people believe in God and follow a religion. At some point he had become a reverend in a small town's church, gaining many followers thanks to his mesmerizing speeches and strange ability to learn their true nature (secretly derived from his proficiency with hallucinogenic drugs). After his curiosity reached its peak, he would come up with the idea of an experiment in which he'd use a group of ruthless, self-righteous serial killers - which he'd call his \"Angels\" - in order to determine what is it that makes people - whom he'd call his \"Sacrifices\" - religious.\n\nShortly after, Danny and Cathy visited him, having heard of him from a prisoner who was a religious fanatic. With the two fulfilling his critera of \"Angels\", he would recruit them to be part of his experiments. At some point in time, he would take in Eddie and Zack the same way, even giving Zack a scythe to encourage him to join.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127275-fp0lxGMSgwaP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127275
      },
      "rarity": "rare"
    },
    {
      "id": "wakai-onna",
      "name": "Wakai Onna",
      "alt_names": [
        "若い女"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 331872
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-25T03:14:45.131Z"
}