{
  "work_id": "toradora",
  "count": 25,
  "characters": [
    {
      "id": "taiga-aisaka",
      "name": "Taiga Aisaka",
      "alt_names": [
        "逢坂大河",
        "Palmtop Tiger"
      ],
      "role": "protagonist",
      "description": "__Height:__ 145 cm\n\nTaiga is a girl in Ryuuji's class. She has a well-regulated and beautiful appearance though is unable to stomach company from others. Due to her often snapping at others in brutal ways and her short stature, she is given the nickname \"Palmtop Tiger\". Her under-developed body and the added nickname has given her a complex which in turn serves to give her a negative attitude and facial expression. Essentially, Taiga gets upset easily and is considerably clumsy. She is also brutally honest, typically when she is lashing out at someone. Due to her cute looks (described as a doll by Ryuuji), she often gets confessions of love by boys, but she turns down every one of them, including Yūsaku Kitamura (which she later regrets).\n\nDespite coming from a well-to-do family, her life with them is very difficult because of various problems. Her father's business went bankrupt and he ran away, leaving Taiga in the care of her mother who was already remarried and had a new family of her own. Taiga has difficulty getting along with her step-father and half-sibling and since then, she has taken to living on her own. Since she came from a privileged household, she does not know how to do any domestic chores. When she meets Ryuuji and learns of his domestic talents, she ends up relying on Ryuuji to clean up after her. Aside from sleeping in her own house, and going to school, she spends most of her time at Ryuuji's house; so much so that she is considered a member of his family. At the beginning of the story, she is infatuated with his best friend Yūsaku Kitamura and gets nervous every time he appears around her. Due to this, Taiga and Ryuuji team up to help each other get into a relationship with each other's best friend.  \n\n~!Though she treats Ryuuji badly at first, her feelings begin to change as she spends more time with him. They later become a couple.!~",
      "metadata": {
        "gender": "female",
        "age": "17-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12064-7PDN3ylIeAZn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12064
      },
      "rarity": "legendary"
    },
    {
      "id": "ryuuji-takasu",
      "name": "Ryuuji Takasu",
      "alt_names": [
        "高須竜児",
        "Ryuu-chan",
        "Taka-chan"
      ],
      "role": "protagonist",
      "description": "__Height:__ 172 cm (5'7\")\n\nThe series' main protagonist, Ryūji is a seventeen-year-old high school student in his second year, class 2-C. Due to biological inheritance, his sanpaku eyes make him look like an intimidating delinquent and causes many misunderstandings. He lives in a fatherless family with just his mother, and due to this, Ryūji has learned to be self-sufficient. He is good at cooking and keeps everything in his house clean (to the point of obsession), and also excels at sewing. He holds a crush on Minori Kushieda, a girl in his class. He has a pet, parakeet named \"Inko-chan\" (\"inko\" literally means \"parakeet\" in Japanese). Ryūji often helps Taiga with domestic chores which she is unable to perform. At school, he is known as \"the only person able to stop the palmtop tiger\", referring to Taiga's nickname. Due to the misunderstandings of his look, he tends to look down on himself and lacks self-confidence. Despite this, he is rather calm in most situations. He is responsible, smart and has great grades, even when compared to Yūsaku Kitamura, his best friend. He is dense when it comes to girls' feelings, especially about things between him, Taiga, Minori and Ami. His feelings and relationship to Taiga begin to change as he spends more time with her throughout the series.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12295-d45uTNeJHuus.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12295
      },
      "rarity": "legendary"
    },
    {
      "id": "minori-kushieda",
      "name": "Minori Kushieda",
      "alt_names": [
        "櫛枝実乃梨",
        "Minorin"
      ],
      "role": "protagonist",
      "description": "__Height:__ 163 cm\n\nMinori is a girl in Ryuuji's class, and is a close friend to Taiga. She is also known by the pet name \"Minorin\". In contrast to the negative Taiga, Minori is always smiling and cheerful, but is also a natural airhead, though it is suggested that her airhead ways may be a facade. She is very athletic and is the captain of the girl's softball club at school, though at the same time she holds many part-time jobs. She is a glutton when it comes to food, but is also constantly combating dieting. \n\n~!Toward the end of the anime, she reveals that she also likes Ryuuji but has given up on him in order to let Ryuuji and Taiga be together.!~",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12305-AdKOcp0az9mq.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12305
      },
      "rarity": "legendary"
    },
    {
      "id": "yuusaku-kitamura",
      "name": "Yuusaku Kitamura",
      "alt_names": [
        "北村祐作",
        "Maruo"
      ],
      "role": "protagonist",
      "description": "Yuusaku is a male student in Ryuuji's class, and is his best friend. He is the vice-president of the student council, the class representative, and captain of the boy's softball club at school. Yuusaku wears glasses, and has a diligent personality. He thinks he is poor at talking to girls, though Ryuuji observes otherwise. During his time as the vice-president of the student council, he eventually falls in love with the student council president, Sumire Kanou. A running gag is that he will appear out of nowhere behind Taiga and Ryuuji when they are discussing a \"plan of attack\" to get their crushes. Like Minori, he has an unusual personality, but oftentimes it is an expression of his friendship and appreciation.    ~!Yuusaku also had feelings for Taiga, but was rejected straight away.!~",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12306-Nb1orOh4UkpT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12306
      },
      "rarity": "legendary"
    },
    {
      "id": "ami-kawashima",
      "name": "Ami Kawashima",
      "alt_names": [
        "川嶋亜美",
        "Amin",
        "Bakachi",
        "Stupid Chihuahua"
      ],
      "role": "protagonist",
      "description": "__Height:__ 165 cm\n\nAmi is Yuusaku's childhood friend who transfers into his class midway through their second year of high school. She is very beautiful and even works as a model, though after she transfers school, she temporarily stops modeling. However, she still continues to go to the gym readily and maintains a slim figure. She is always kind and generous towards others, though this is merely a deception. In truth, she is arrogant and will not hesitate to use others for her own benefit. During her first meeting with Taiga, Ami showed her true colors, but the tables were turned when Taiga threw a counterattack back at her. Since then, Ami and Taiga have been enemies, though Ami still sometimes envies Taiga since she can always be honest. It's hinted at, mostly through her childhood friend Yuusaku, that she's like this because she hasn't really known any other life than her modeling, which is part of the reason she moved to their hometown to attend school there.  Which is why, through her affiliations with Taiga and Ryuuji, Ami eventually develops more of a \"middle ground\" personality, signified with her losing her temper and taking out her frustrations on a stalker fan. While this doesn't mean that she automatically becomes friends with Taiga, the two of them also meet halfway to some extent, thus running into arguments far less frequently. She can still be somewhat manipulative and mischievous, but her \"gravure airhead\" personality is almost entirely abandoned for a more outspoken one, and she's even helped out her newfound friends, including Taiga, on occasion. At some point, she even showed some interest in Ryuuji. \n\n~!Ami is also the first one to realize that Taiga and Ryuuji have feelings for each other, and is constantly hinting Ryuuji to pursue Taiga.!~",
      "metadata": {
        "gender": "female",
        "age": "17-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13725-Vk30kjvVT82z.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13725
      },
      "rarity": "legendary"
    },
    {
      "id": "yasuko-takasu",
      "name": "Yasuko Takasu",
      "alt_names": [
        "高須泰子",
        "Mirano",
        "Ya-chan"
      ],
      "role": "supporting",
      "description": "Yasuko is [Ryuuji](https://anilist.co/character/12295)'s thirty-three-year-old mother, though she refers to herself as eternally twenty-three. Soon after Ryūji was born, her husband died which left her to raise her son by herself. She works at a hostess bar named Bishamonten Kuni where she goes by the name \"Mirano\" and single-handedly supports her two-member family financially. However, she has a childish personality and since she works, she entrusts the household chores to Ryuuji. She instantly takes a liking to [Taiga](https://anilist.co/character/12064) and already regards her as a member of her family. (Source: Wikipedia)   \n\n~!Later in the show, Yasuko reveals that Ryuuji's father didn't die. He basically abandoned the two of them, leaving Yasuko to raise their son by herself.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12307-MfkPmovIGCm9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12307
      },
      "rarity": "epic"
    },
    {
      "id": "yuri-koigakubo",
      "name": "Yuri Koigakubo",
      "alt_names": [
        "恋ヶ窪ゆり"
      ],
      "role": "supporting",
      "description": "Yuri is the twenty-nine-year-old homeroom teacher of Ryūji's class (though she turns thirty in the fifth volume of the light novels). She likes to do things at her own pace and is timid towards Taiga's way of speaking out. Since her twenties are almost over, Yuri is in a hurry to get married soon and she even tries to dress well so as to be able to get into a relationship quicker. After she becomes thirty without getting married, she develops a twisted and depressed personality, which does not help that when Taiga talks about her, she emphases her single status.  She is fairly concerned over the well-being and grades of her students and tries her best to help them. During the Winter, she banned Haruta from Christmas Activities to get him to study for exams.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16402-hNoi2ydS82X6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16402
      },
      "rarity": "epic"
    },
    {
      "id": "sumire-kanou",
      "name": "Sumire Kanou",
      "alt_names": [
        "狩野すみれ"
      ],
      "role": "supporting",
      "description": "Sumire is the student council president and always manages to get the top grades in school; she is in fact a scholarship student and has horrible eyesight. She has a strong-minded personality which she depends on to be a figure those will follow. Her younger sister is Sakura and her parents own a supermarket. Sumire likes Yuusaku and as a result is the object of an one-sided hostility from Taiga.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/16833.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16833
      },
      "rarity": "epic"
    },
    {
      "id": "inko-chan",
      "name": "Inko-chan",
      "alt_names": [
        "インコちゃん"
      ],
      "role": "supporting",
      "description": "Ryuuji Takasu's parakeet. Her name is Japanese for parakeet. Though apparently healthy, she sometimes looks sickly. Despite struggling to say her simple name (a running gag throughout the series), she has a good understanding of human speech and can interact with her owners and pronounce words much more difficult than her name. She seems to be mentally inept.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17059-fy0NnkTih1s5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17059
      },
      "rarity": "epic"
    },
    {
      "id": "maya-kihara",
      "name": "Maya Kihara",
      "alt_names": [
        "木原麻耶"
      ],
      "role": "supporting",
      "description": "Maya is a female student in Ryūji's class who often hangs out with Nanako. She is a kogal. She has a crush on Yūsaku, and she circuitously opposes the idea of Taiga and Yūsaku being a couple, although she wants Taiga and Ryūji to be together.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/17319.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17319
      },
      "rarity": "epic"
    },
    {
      "id": "kouji-haruta",
      "name": "Kouji Haruta",
      "alt_names": [
        "春田浩次"
      ],
      "role": "supporting",
      "description": "Kōji is a male student in Ryūji's class who has long hair and is on good terms with him. He is regarded as a class 'idiot' and that opinion is deepened by his poor school marks and overly energetic behavior. His childish pranks often target Taiga and he has been the victim of her violent outbursts.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17823-EI5fCOcNDeX4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17823
      },
      "rarity": "epic"
    },
    {
      "id": "hisamitsu-noto",
      "name": "Hisamitsu Noto",
      "alt_names": [
        "能登久光"
      ],
      "role": "supporting",
      "description": "Hisamitsu is a male student in Ryuuji's class who wears glasses. He was also in Ryuuji's class the previous year and is on good terms with him. Noto begins to develop feelings for Maya Kihara which become more apparent following an argument they had during the class winter ski trip.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b19153-A8q9ieU9kEkr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 19153
      },
      "rarity": "epic"
    },
    {
      "id": "nanako-kashii",
      "name": "Nanako Kashii",
      "alt_names": [
        "香椎奈々子"
      ],
      "role": "supporting",
      "description": "Nanako is a female student in Ryūji's class who often hangs out with Maya and Ami.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/19863.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 19863
      },
      "rarity": "epic"
    },
    {
      "id": "sakura-kanou",
      "name": "Sakura Kanou",
      "alt_names": [
        "狩野さくら"
      ],
      "role": "supporting",
      "description": "Sakura is Sumire&#039;s younger sister who attends the same high school as Sumire though her grades are horrible. She can unconsciously flirt with people, and like her sister, she hates snakes.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b20339-uWCbCCDItfRE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 20339
      },
      "rarity": "epic"
    },
    {
      "id": "sena-hamada",
      "name": "Sena Hamada",
      "alt_names": [
        "濱田瀬奈"
      ],
      "role": "supporting",
      "description": "A 3rd Grade junior in an art university. Lives alone in an apartment. Meets with Haruta right after breaking up with her boyfriend, Ryousuke. Without knowing anything about Ryousuke, she plans of reuniting with the help of Haruta.    First appears briefly in novel vol.9 along with Haruta when Takasu and Taiga are selling chocolates. (and in anime EP23 relatively) Her main story is told in novel Spin-off vol.2 &quot;Let&#039;s go to Gunma when it&#039;s spring! (春になったら群馬に行こう！)&quot; chapter.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/24011.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24011
      },
      "rarity": "epic"
    },
    {
      "id": "kuroma",
      "name": "Kuroma",
      "alt_names": [
        "黒間"
      ],
      "role": "supporting",
      "description": "Gym teacher at Takasu's school.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/41719.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 41719
      },
      "rarity": "epic"
    },
    {
      "id": "rikurou-aisaka",
      "name": "Rikurou Aisaka",
      "alt_names": [
        "逢坂陸郎"
      ],
      "role": "supporting",
      "description": "Taiga's father,  shown for the first time in chapter 12. He threatens to stop giving Taiga her living expenses if she continues to ignore his calls. He tries to re-unite with his estranged daughter after a separation with his newest (and much younger) wife, admitting it was wrong to let her go.   ~!During their short stint, he tells Ryuuji's mom that they are moving away to a bigger place together. A few episodes later in the middle of the season, he promises to come to the Cultural Festival to watch Taiga perform in her class's Wrestling Show and to see her perform in the pageant. He ends up being a no-show (after an embarrassing intro where Taiga and Ami both ask him to speak up and greet the crowd), sending Ryuuji a text message to tell Taiga that he had important business and they couldn't move in together. This leaves Ryuuji and Minori to pick up the pieces as Taiga tries to act as though she would be fine on her own.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62271-MiZao9vPmJ6E.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62271
      },
      "rarity": "epic"
    },
    {
      "id": "yuriko-mitsui",
      "name": "Yuriko Mitsui",
      "alt_names": [
        "光井百合子"
      ],
      "role": "supporting",
      "description": "Mitsui Yuriko, A student from class 1-A who was a contestant of the Ohashi high school culture festival.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b80707-cCyeNEIvLzJi.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 80707
      },
      "rarity": "epic"
    },
    {
      "id": "kouta-tomiie",
      "name": "Kouta Tomiie",
      "alt_names": [
        "富家幸太"
      ],
      "role": "supporting",
      "description": "Kota Tomiie is a first-year student and he works as a secretary for the student council.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b80709-ckqi7MJoCF5c.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 80709
      },
      "rarity": "epic"
    },
    {
      "id": "inage",
      "name": "Inage",
      "alt_names": [
        "稲毛"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b80711-jktVmzKJZcOn.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 80711
      },
      "rarity": "epic"
    },
    {
      "id": "murase",
      "name": "Murase",
      "alt_names": [
        "村瀬"
      ],
      "role": "supporting",
      "description": "Murase is a male student in Class 2-A who also works as the secretary in the student council.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b80713-x3JnQ3RlNpYs.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 80713
      },
      "rarity": "epic"
    },
    {
      "id": "yuu-aisaka",
      "name": "Yuu Aisaka",
      "alt_names": [
        "逢坂ゆう",
        "Taiga's Mother (大河母)",
        "Taiga Haha"
      ],
      "role": "supporting",
      "description": "Taiga Aisaka's mother.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b80715-bZMZqDGaujKK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 80715
      },
      "rarity": "epic"
    },
    {
      "id": "seiji-takasu",
      "name": "Seiji Takasu",
      "alt_names": [
        "高須清児"
      ],
      "role": "supporting",
      "description": "Ryuuji's Grandfather.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b80717-Aov5Bg3Dwy7X.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 80717
      },
      "rarity": "epic"
    },
    {
      "id": "sonoko-takasu",
      "name": "Sonoko Takasu",
      "alt_names": [
        "高須園子"
      ],
      "role": "supporting",
      "description": "Ryuuji's Grandmother.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b80719-iQW5mWDmuzBP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 80719
      },
      "rarity": "epic"
    },
    {
      "id": "stalker-otoko",
      "name": "Stalker Otoko",
      "alt_names": [
        "ストーカー男",
        "Stalker Man"
      ],
      "role": "supporting",
      "description": "The stalker of Ami Kawashima.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b86597-fSJgfgSkJvmS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86597
      },
      "rarity": "epic"
    }
  ],
  "updated_at": "2025-12-23T06:04:21.262Z"
}