{
  "work_id": "the-breaker",
  "count": 15,
  "characters": [
    {
      "id": "shi-woon-yi",
      "name": "Shi-Woon Yi",
      "alt_names": [
        "이시운",
        "Shioon"
      ],
      "role": "protagonist",
      "description": "A weak cowardly boy who is constantly being bullied until he encounters his new teacher using martial arts to defend himself. Shi-Woon begs him to teach him. After several instances where the cowardly boy shows he has heart and will fight with all his might, he becomes Chun-Woo's pupil.   ~!He was given the Illwallsidan (One Moon Divine Dan) by Shi-Ho that forcefully increases Ki, and, had it not been for Goo-Moon-Ryong's help, would have died due to large of amount of Ki his body could not contain. Due to ingesting the pill, Shi-Woon now possess quick healing abilities, greater stamina and physical ability. Though the main effect of the pill is the extremely large amount of Ki he now holds in his body, seemingly giving him endless stamina and great strength in martial arts techniques. However initially, Shi-Woon's body is not yet able to take the strain of the great amount of Ki he suddenly possesses and when summoning too much strength would harm him.  Over the course of the first series, he shows that he has an affinity for learning martial arts, as he was able to perform a high level technique, Lightning Steps, after being shown only once. He was also able to align his Ki with external movements, allowing him to use Spirit Breaking Strike within a week. These abilities usually takes months, if not years, for high level Murim to learn and perfect, proving that Shi-Woon may have hidden talents yet to be fully realized. Due to his master's intent of removing him from the Murim world and not suffering the same pain he felt on his master's sacrifice, Chun-Woo destroyed his Ki-center, effectively taking away his ability to do martial arts. Shi-Woon later wakes up in a hospital and learns that after he became unconscious, Chun-Woo disappeared with the other Black Forest members and So-Sul, having only left behind a cell phone with video tutorials on his techniques for Shi-Woon. A few weeks later, Shi-Woon is at school and adjusting back to life before he met Chun-Woo and the others. News has spread of his beating of Chang-Ho and he was being challenged by others for the top spot. On his way through the school exit, he is greeted by a large number of men in black suits led by Gyu-Bum who tells him that he has become the new Head of the Sun-Woo Clan, as he is now in possession of the Phoenix Medallion( given to him by So-Sul in chapter 37 of Breaker) and that a new Murim world awaits him. !~  ~!The Breaker: New Waves  No longer a member of the martial arts world of Murim, Shi-Woon Yi is supposed to return to his normal life. However, he was given a medallion from So-Sul that names him as the new leader of the Sun-Woo clan. The Sun-Woo clan elders send Jin-Ie Kwon as protection for Shi-Woon, and to make him accept the position of head of the clan so they can make him their puppet. Shi-Woon is confronted by several individuals with grudges against his master. Despite having a shattered ki center, Shi-Woon chooses to fight in order to protect the reputation of his master.The Elder of the Sun-Woo Clan Jae-Kyu Kwon , realizing that Shi-Woon will not be a willing puppet for them, orders Jin-Ie to kill him, but she spares his life. Not wanting to cause trouble for Jin-Ie, Shi-Woon goes into hiding, hoping the Sun-Woo clan will believe he is dead. Shi-Woon encounters difficulties, however, when he starts getting attacked  by the S.U.C. (Soldiers Under Command), an organization of individuals claiming to be \"disciples\" of the Nine Arts Dragon. They claim that in order to fullfil Goomoonryong's will, they must eliminate his \"first student\", Shi-Woon since he is the only \"official\" disciple to Goomoonryong. Believing that they are going against his master's beliefs and teachings, Shi-Woon tries to fight them but struggles. He encounters a mysterious homeless man named Bae Seung-Jae who gives him a special medicine that, when consumed, allows Shi-Woon's body to produce Ki for a limited period of time despite his shattered Ki center. With it, Shi-Woon is able to utilize his old techniques and defeat several of his attackers from S.U.C. Told repeatedly that there is no way to fix his shattered Ki center, Shi-Woon resolves to find a way to get stronger.It is recently revealed in New Waves that Shi-Woon does have skills for martial arts, the reason being that he is able to possess a great amount of Ki due to Goo-Moon-Ryong expanding his Meridians (channels of Ki that is stored in the Ki Center) to an abnormally large extent, allowing him to possess the amount of Ki equal to Master class martial artists.!~ (Source: Wikipedia, The Breaker: New Waves chapter 32,35-36, and 43)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/21562.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21562
      },
      "rarity": "epic"
    },
    {
      "id": "chun-woo-han",
      "name": "Chun-Woo Han",
      "alt_names": [
        "한천우",
        "Seunseng-nim",
        "Goomoonryong"
      ],
      "role": "protagonist",
      "description": "Teacher who has mastered 9 styles of martial arts. With a mysterious past who seems to hold a grudge for the martial artists federation relating to the death of his master.  At the beginning of the story he seems to be a perverted middle aged man who came to the school going undercover as a teacher. After Shioon discovering his martial art skills, shioon bribes him with a video clip. Continuing Chun woo discovers Shioon's hidden potential and teaches foot and arm techiniques.As the story progresses, he shows more of his past and growing relationship with his new disciple.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/21563.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21563
      },
      "rarity": "epic"
    },
    {
      "id": "shi-ho-lee",
      "name": "Shi-Ho Lee",
      "alt_names": [
        "이시호"
      ],
      "role": "protagonist",
      "description": "A very attractive woman who uses her sex appeal to make people (especially men) do as she wishes. She can be very manipulative when she wants, making the likes of Alex carry out jobs which she would prefer not to do. Chun-Woo once claimed that there has never been a person that she has targeted that hadn't been taken in by her. She was a member of the Chun-Nyu-Moon (Heavenly Maiden Skill) and is very skilled at administering drugs, and has a in-depth knowledge of the human body and Ki system. With this knowledge, she has the ability to transfer Ki from one person to another. She drives a Mini Cooper S as her personal vehicle.   ~!Her own fighting skills are also high level, as she was able to escape capture after meeting Won-Jae Hyun and held her own when fighting alongside Chun-Woo against the Alliance.  She died in the hands on Chun-Woo on the top of the Alliance HQ after jumping in front of a gun aimed at Chun-Woo. She was used as a bargaining chip to make Chun-Woo hand over the Black Heaven and Earth Technique when gravely injured, but during the commotion was shot once again unnoticed by a sniper. She was in love with Chun-Woo and saw Yoon-Ji as a rival, always interfering with his attempts to date her.!~   (Source: Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n29296-IRQyT1vKHVn8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29296
      },
      "rarity": "epic"
    },
    {
      "id": "un-wol",
      "name": "Un-Wol",
      "alt_names": [
        "은월"
      ],
      "role": "protagonist",
      "description": "He was the master of Chun-Woo Han and Ryuji. After achieving the Black Origin Threshold the Martial Arts Alliance banished him to a life of meditation and solitude in a cave while he tried to figure out a way to solve the problem of this technique. He was always calm and composed, and did not hold a grudge against the elders that exiled him. Despite almost never showing emotions, he is very caring as he expelled Ryuji as a disciple and killed himself to protect both Ryuji and Chun-Woo Han respectively. He is also very moral, as he told off Chun-Woo Han when his student made the wrong choices in using martial arts to hurt others.  \n\n(Source: The Breaker wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/38085.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38085
      },
      "rarity": "epic"
    },
    {
      "id": "sae-hie",
      "name": "Sae-Hie",
      "alt_names": [
        "세희"
      ],
      "role": "supporting",
      "description": "Childhood friend of Shi-Woon.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29427-kyiHLRLtDTMV.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29427
      },
      "rarity": "uncommon"
    },
    {
      "id": "chang-ho",
      "name": "Chang-Ho",
      "alt_names": [
        "창호"
      ],
      "role": "supporting",
      "description": "He is a first year student at Nine Dragons High School. He along with other students used to bully Shi-Woon Yi. He has extremely short hair and narrow eyes with very small pupils. He often has a nasty sneer on his face. Because he had previously been punched in the face by an enraged Shi-Woon, he is missing the two front teeth of his upper jaw.  \n\n(Source: The Breaker Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29431.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29431
      },
      "rarity": "uncommon"
    },
    {
      "id": "ji-shi-yoon",
      "name": "Ji-Shi Yoon",
      "alt_names": [],
      "role": "supporting",
      "description": "Teacher who become Won's girlfriend.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29432
      },
      "rarity": "uncommon"
    },
    {
      "id": "so-sul-woo",
      "name": "So-Sul Woo",
      "alt_names": [
        "우소설"
      ],
      "role": "supporting",
      "description": "Jang So-Sul / Sun-Woo So-Sul is the former head of the Sun-Woo Clan, like her father. So-Sul is small and has a weak frame due to her unique body condition which makes her seem younger than she really is (a fact that greatly annoys her as Shi-Woon treats her like a little child). In the beginning, she cannot talk due to her unique condition; whenever she does, she is come over with a coughing seizure. But due to Shi-Woon Yi administrating his blood to her as a remedy and then massaging her body, she can now talk more due the vast amount of ki in Shi-Woon's blood.  Despite her appearance, and even her age (15 Years Old), she is incredibly mature, a trait that is shown in her almost aristocratic style of speech and her self-denial of a teenage lifestyle. She appears to be calm even when there is danger although it was revealed that she was afraid since she saw the same things in nightmares and was scared. She seems to be shy and the type that does not show her true desires and always acts as though she is forced to things that she actually wants to do, like when she played with Shi-Woon in the sand making castles.  \n\n(Source: The Breaker Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29697-KnLqfGiZM83J.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29697
      },
      "rarity": "uncommon"
    },
    {
      "id": "so-chun-hyuk",
      "name": "So-Chun Hyuk",
      "alt_names": [
        "혁소천"
      ],
      "role": "supporting",
      "description": "So-Chun Hyuk is the Assistant-Leader of the \"Heavenly Way School\" and a martial arts prodigy in the Murim world. He is one of the many characters in the series who start out as an antagonist to Shi-Woon, but later become an ally to him. He is the adopted brother of Jang Joon-Ho.  \n\n(Source: The Breaker Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29698.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29698
      },
      "rarity": "uncommon"
    },
    {
      "id": "won-jae-hyun",
      "name": "Won-Jae Hyun",
      "alt_names": [],
      "role": "supporting",
      "description": "He is a member of the Martial Arts Alliance and head of the One Moon School. His school has a large pharmaceutical company as a front for its existence. He is also Shi-Ho Lee's ex-boyfriend. Throughout the series he constantly tried to help and win the affection of Shi-Ho who he still loves.    ~!After Shi-Ho's death at the conclusion of The Breaker, he took her body and placed it in a special chamber as he works to bring her back from her comatose state.!~ (Source: The Breaker Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/34222.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34222
      },
      "rarity": "uncommon"
    },
    {
      "id": "mun-gi-man",
      "name": "Mun-Gi Man",
      "alt_names": [],
      "role": "supporting",
      "description": "He bears the title of \"Northern Black Star\" and is a member of the Four Supernovas. He also considers Shi-Woon Yi an ally.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b38080-Yv08IwnIQb0H.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38080
      },
      "rarity": "uncommon"
    },
    {
      "id": "alex",
      "name": "Alex",
      "alt_names": [],
      "role": "supporting",
      "description": "A member of the Black Forest Defense Group and a world-class porter. Although his martial arts skills are limited, he is described as a \"God\" when driving, which was proven when he was able to get a very far distance when being pursued by the Torrent Clan during the Sosul incident while driving a broken down, slow car. He is infatuated with Shi-Ho, and she often uses this to manipulate him into doing her bidding. He drives a Lamborghini Murcielago as his personal vehicle.  ~!He is also able to pilot a helicopter.!~  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/38082.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38082
      },
      "rarity": "uncommon"
    },
    {
      "id": "kang-sung",
      "name": "Kang-Sung",
      "alt_names": [
        "강성",
        "Sam-Mun-Ryong (Three Arts Dragon)"
      ],
      "role": "supporting",
      "description": "Kang-Sung, also known as Sammoonryong (lit. Three Arts Dragon), is the curent chief of the Martial Arts Alliance. It is unknown how powerful Kang-Sung really is even with the title of Sammoonryong. Others say he did not pursue the title of Goomoonryong because of obligations to lead his clan.  He is a calm and righteous man who has his own beliefs that differ from Gi-Joo Song, Hyun-Tae, and the previous Alliance Chief. Though Goomoonryong killed his master and Gi-Joo, he doesn't believe in revenge. He initially admires Goomoonryong and tries his best to understand him, despite the fact that the Chief and his own master deemed him as their enemy. He is loyal to the Alliance and greatly values the traditions of the Murim, so when Goomoonryong mocks the relationship between master and student, he considers it as the last straw and is ready to fight him.  \n\n(Source: The Breaker Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b38083-i2kTCAdqU1bl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38083
      },
      "rarity": "uncommon"
    },
    {
      "id": "joon-ho-jang",
      "name": "Joon-Ho Jang",
      "alt_names": [],
      "role": "supporting",
      "description": "He is So-Chun Hyuk's so-called \"adopted brother\" who discovered Shi-Woon Yi. He has a great sense of respect and honor, therefore doesn't bow before others when he is told to, but he bows deep when he expresses his respect for the other person. He is also shown to be the type who would avoid conflicts whenever possible. This however does not apply when he can help others by confronting the danger itself. He is not very interested in the Murim's politics and just follows the orders given to him.  \n\n(Source: The Breaker Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/38084.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38084
      },
      "rarity": "uncommon"
    },
    {
      "id": "mrs-yi",
      "name": "Mrs Yi",
      "alt_names": [],
      "role": "supporting",
      "description": "She had a stained relationship with her son and neglected him for work. After Shioon is rushed to the hospital, she blames herself for not protected him and starts paying more attention to her son.    In New Waves she becomes a CEO of the company where she works.   she lost her husband and Shioon&#039;s father",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/41114.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 41114
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-25T14:33:06.940Z"
}