{
  "work_id": "blade-of-the-immortal",
  "count": 15,
  "characters": [
    {
      "id": "manji",
      "name": "Manji",
      "alt_names": [
        "万次",
        "卍",
        "Hundred Man Killer",
        "Mister Twelve Blades"
      ],
      "role": "protagonist",
      "description": "Manji is the protagonist of the Japanese manga series Blade of the Immortal. In the story, he's known infamously both as the \"Hundred Man Killer\" for the number of men he's killed by the beginning of the series, and \"Mister Twelve Blades\" for the number of weapons he carries. He is most easily identified by the manji symbol he wears from which he derives his name and the scars across his face, and as the title of the manga implies, he's been given immortality by the means of the Kessen-chu, which prevent him (for the most part) from dying.\n\n~!Little is known about Manji's background except that he once served under a local daimyo, unknowingly enforcing his brutal rule on the locals until he found out his lord was corrupt and killed him. For that, he was hunted as an outlaw. He was later nicknamed \"Killer of 100\" after the number of police officers he killed.!~\n\n(Source: Wikipedia, boti.fandom.com)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4907-0QU5nZC8K0kc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4907
      },
      "rarity": "epic"
    },
    {
      "id": "rin-asano",
      "name": "Rin Asano",
      "alt_names": [
        "浅野凛"
      ],
      "role": "protagonist",
      "description": "The sole survivor of an Ittō-ryū massacre at Anotsu's hand and heir to her father's sword school, the \"Mutenichi-ryū\". She has mediocre swordsmanship skills but an intense desire to avenge the brutal death of her family. To aid in this quest, she hires Manji as a bodyguard. It is worth noting that she kisses a sleeping Manji in the fourteenth volume and has shown on numerous occasions that she develops feelings towards him. They are as of now largely unreciprocated.   At the beginning of the series she is portrayed as somebody who is trying to act mature, but is still very childish - as the series progresses she steadily \"grows up\" and loses much of her naivety. Rin is constantly torn by doubt over the righteousness and validity of her mission and fears becoming a hypocrite as Anotsu claims that she is more like the Ittō-ryū, especially when he remarks that she chose to use throwing knives instead of a sword like the \"Mutenichi-ryū\" teaches.   Rin has three weapons, a Chinese sword named Kutoneshirika which she carries in a Toju (purse-like scabbard of sorts), a Tantō type dagger and a set of small throwing daggers named Ogunchu (Golden Wasps). Even though she is only mediocre in terms of fighting ability, Rin is still more skilled with weapons than most women of that time period and the fact that she carries a small arsenal of weapons with her makes her somewhat unique.   ~! When she encounters Anotsu in Kaga, she realizes she cannot defeat him and winds up traveling with him. She thinks if he starts to trust her, she might get the chance to kill him. But Anotsu is no fool and is fully aware of what she is doing, despite this he allows her presence. She has since left his company, vowing that she will eventually kill him; yet she will stand back for the time being and watch how the events unfold.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4937-ZdWu0O1GhDCp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4937
      },
      "rarity": "epic"
    },
    {
      "id": "kagehisa-anotsu",
      "name": "Kagehisa Anotsu",
      "alt_names": [
        "天津影久"
      ],
      "role": "protagonist",
      "description": "He is the leader of the Itto-ryu and an equal of Manji. This emotionally cold young man has prodigious skill with the sword, and leads the Itto-ryu. He runs Itto-ryu in order to form a dojo dedicated not to form and rules, but to the simple test of superior lethality. He was brought up by his abusive grandfather (a swordsman disgraced by the Asano dojo -the dojo of Rin‘s family). Anotsu is as pragmatic and shrewd as he is deadly, although he isn't as inhuman as originally believed. He even allows Rin to live after she attacks him. He has two weapons. The first, his main weapon, is a Nepalese-based axe named Kabutsuchi (Head Hammer). The other is his rarely used sword of the same name.   (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5175-zPuE6NZZMD7Y.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5175
      },
      "rarity": "epic"
    },
    {
      "id": "taito-magatsu",
      "name": "Taito Magatsu",
      "alt_names": [
        "凶戴斗"
      ],
      "role": "protagonist",
      "description": "Among the Ittō-ryū&#039;s finest swordsmen. Of peasant origin, he became a swordsman to avenge his sister, who was killed as a child by a samurai. Taito is one of the few swordsmen who has fought Manji and survived. He has also fought by Manji&#039;s side as well. He can be considered a kenshi, a swordsman who is not from the samurai class. His lover of sorts, a prostitute named O-ren was killed by Shira. He quit the Ittō-ryū, although he is still friends with Anotsu. He ends up following Manji around due to the fact he knows Shira is after Manji. Although they argue a lot, Manji and Taito have a relatively friendly relationship. In the end Manji allows Taito to find Shira, and despite how much Shira wants to kill Manji, he lets Taito take him. Eventually Shira loses the one hand he had left to Taito and presumably falls to his death. Later concerned by something Shira said, Taito goes to meet up with Anotsu and eventually rejoins the Ittō-ryū. Taito&#039;s weapon is a gladius-like triple-sectioned sword named Grand Turk. The main blade is a gladius, the second is a smaller, shorter sword hidden in the handle, the last is a spear-head like dagger hidden within the second blade. The sword is curiously missing a sword guard. First appears in Conquest part 1, first named in Fanatic part 1.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b10360-f0AswyV1vaAt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10360
      },
      "rarity": "epic"
    },
    {
      "id": "makie-otono-tachibana",
      "name": "Makie Otono-Tachibana",
      "alt_names": [
        "乙橘槇絵"
      ],
      "role": "protagonist",
      "description": "Master swordswoman and in love with Anotsu. Said to be Anotsu's match and saved his life with her deadly abilities when they were children. Born into a samurai family, Makie and her mother were disowned and cast away from the family by her father, Harukawa, when Makie's older brother committed seppuku after Makie was revealed to have inherited the family's famed talent and he was unable to defeat her in combat. She initially chose the path of the sword to avenge her mother's disgrace, but ended up becoming a geisha when Anotsu bought her freedom because she neither had the nerve to become a prostitute like her mother nor commit herself completely to becoming a swordfighter because she does not have the nerve to kill when her concentration in battle is broken. Defeats but does not kill Manji, apparently turning her back on Anotsu. Later found living alone, having bound her hand in an attempt to destroy her own skill in combat after her father's humiliating death. She reappears in Last Blood, having followed Anotsu since he left Shirakawa when she realized his body was weakening, and destroys the men under Iriya who were pursuing Anotsu. After Iriya's death, she leaves with Anotsu and Magatsu. As said by Anotsu, she is the only one that can beat him. Her weapon, a double bladed three-section-staff, is named Haru-no-Okina (Old Man of Spring). She conceals her weapon in a hollowed-out shamisen, a mandolin-like instrument. She first appears in Dreamsong Part 1.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b10485-4pzfODEssOxj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10485
      },
      "rarity": "epic"
    },
    {
      "id": "hyakurin",
      "name": "Hyakurin",
      "alt_names": [
        "百淋"
      ],
      "role": "protagonist",
      "description": "A female assassin and a lieutenant in the Mugai-ryū. Hyakurin was the wife of an abusive samurai, Hayakawa Kakōsai Genkei, who was obsessed with trying to gain fame by training Matsuhiko, their sickly son, to become a strong swordsman. She later kills her husband to avenge the death of her son by his father's hand and is then arrested and sentenced to death. Her case came to the attention of Kagimura who subsequently recruited her into Mugai-ryū. Hyakurin's most unusual physical trait is her blonde hair (concealed frequently under a wig), which she maintains by bleaching it with a strong chemical as a compulsive desire to remove bloodstains from it. While her skills with a sword are unremarkable, she has an extensive knowledge of poisons. This knowledge carries over into her choice of weaponry, a collapsible wrist mounted crossbow with poisoned bolts named Burafuma (Little Steps). The crossbow also possesses two blades such that when the weapon is collapsed, Hyakurin can use it to stab her opponents. After volume 11, Beasts, her skills are impeded after having her arm broken. She later becomes pregnant and ends up \"retired\" from the Mugai-ryū because a deal between Habaki and Giichi when Giichi earns his freedom. She has no desire to keep the child because she believes she will be reminded of Shinriji's death and the faces of the Ittō-ryū men who raped her. She first appears in Dark Shadows part 1.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b10486-V1eAzgqI55RX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10486
      },
      "rarity": "epic"
    },
    {
      "id": "giichi",
      "name": "Giichi",
      "alt_names": [
        "偽一"
      ],
      "role": "supporting",
      "description": "A highly skilled Mugai-ryū killer. Little is known about his past or reasons for being sentenced to death, though it&#039;s suggested that it might involve his sick son, Tojiro, who suddenly dies. Giichi is also one of the most skilled fighters in the series, having killed a total of 59 Ittō-ryū swordsmen on his own. Of the Mugai-ryū, he is the only member who manages to garner enough kills to earn his freedom. He works closely with Kagimura Habaki and cares for the other Mugai-ryū, attempting to buy Hyakurin&#039;s freedom as well, unsuccessfully. He disappears when Habaki dissolves the Mugai-ryū and is later found living in among the burakumin by Rin and Hyakurin, where he provides Rin with information concerning Manji&#039;s whereabouts. Now a broken man, he deliberately distances himself from Hyakurin to keep her from suffering any more pain and is aware of her pregnancy - when she tries to kill her baby, he stops her and persuades her to carry the child to term and allow him to raise the baby after it is born.    He uses a unique weapon which resembles an oversized bladed handcuff attached to a length of chain. The weapon, Kanetsura&#039;s Mito-no-Kami (Guardian of the Three Paths), was adapted from a thresher or similar farming implement, and allows him to sever or entangle limbs, necks and weapons from a distance. It is hard to block as the handcuff like action will wrap it around what it hits, but is broken by Manji in Volume 14: Last Blood. Giichi&#039;s first appearance is in Dark Shadows part 1.    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12886-4LSc0IrRWefg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12886
      },
      "rarity": "uncommon"
    },
    {
      "id": "doa-yoshino",
      "name": "Doa Yoshino",
      "alt_names": [
        "吉乃瞳阿"
      ],
      "role": "supporting",
      "description": "Ittō-ryū swordswoman who is quite small. Her primary weapon is an odd knife which is fashioned from a spearhead. She appears in the later chapters as one of Ittō-ryū&#039;s new recruits. Doa always travels with her friend Isaku and the two have developed complementary fighting styles. This usually consists of Doa providing the offense with her speed and dagger, while Isaku provides the defense with his armored arms. Her tendency to jump right into battle with little to no provocation often lands her and Isaku in trouble. She ends up befriending Asano Rin. She and Isaku are both originally from Hokkaido, where Doa lived defending Ainu land from Samurai who attempted to take it by force, despite the fact she is not Ainu herself. She previously went by the names &quot;Kuichiru&quot; and &quot;Towa&quot;.\n\n(Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12887-PNDCGUIoXfxU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12887
      },
      "rarity": "uncommon"
    },
    {
      "id": "isaku-yasonokami",
      "name": "Isaku Yasonokami",
      "alt_names": [
        "八苑狼夷作"
      ],
      "role": "supporting",
      "description": "Ittō-ryū member of great height (over 1.90 meters/6&#039;2&quot; tall). Unlike most members of the Ittō-ryū, Isaku has no weapons to speak of, instead he wears various piece of armor and tends to act defensively. He is also Doa&#039;s best friend and the two always travel together. Isaku often finds himself rescuing Doa, apologizing for her and keeping her from killing others (usually by picking her up and running away). He and Doa have also developed complementary fighting styles, with Isaku acting as the defense and Doa as the offense. He ends up befriending Asano Rin. Is also Christian and was the son of a Christian priest. He is not incredibly intelligent, but is kindhearted. He has been cutted in two as a result of the experiments in Habaki&#039;s compound, only to be reassembled by Doa - he has had similar regenerative abilities to Manji, but lost them after some time has passed.    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12888-WGPdsUTo0IGt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12888
      },
      "rarity": "uncommon"
    },
    {
      "id": "sori",
      "name": "Sori",
      "alt_names": [
        "宗理"
      ],
      "role": "supporting",
      "description": "A high-ranking spy and ninja obsessed with art, driven into political intrigue in order to gain access to European art, which is contraband in that period. Master Sōri has a daughter named Tatsu and is a childhood friend of the Asano clan. Rin goes to him hoping he will be another sword against Ittō-ryū. He refuses to offer any help at first but is soon able to provide Rin with thirty ryō. He later assists Manji after he is injured, and informs him about who is behind the Mugai-ryū. Also hires Magatsu to watch over his daughter while he is away painting, and is later revealed that may have greater interest in Magatsu (to which Manji notes after his conversation with Magatsu in volume 12, Autumn Frost). He first appears in Genius part 1.    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n12891-ijij1XsgA2FI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12891
      },
      "rarity": "uncommon"
    },
    {
      "id": "kagimura-habaki",
      "name": "Kagimura Habaki",
      "alt_names": [
        "吐釣群"
      ],
      "role": "supporting",
      "description": "The leader of the Shogun's Banshu samurai, the Bangashira, and secret leader of the Mugai-ryū. He simultaneously invites the Ittō-ryū to become an official sword school while directing the Mugai-ryū against it. Kagimura also masterminded and took part in the massacre that occurred during a feast welcoming the Ittō-ryū into the Banshu. Abayama's comments imply that he is incredibly skilled with a sword, as evidenced by his attack on Manji in Trickster, volume 15. He first appears in Dark Shadows part 1.   (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14215-bZ8bhUcj2k5j.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14215
      },
      "rarity": "uncommon"
    },
    {
      "id": "sabato-kuroi",
      "name": "Sabato Kuroi",
      "alt_names": [
        "黒衣鯖人"
      ],
      "role": "supporting",
      "description": "Skilled pupil of Anotsu Saburō (Anotsu Kagehisa's grandfather) and master Ittō-ryū swordsman. Along with his skills with a sword, Kuroi has several quirks, which includes poetry referencing Black Sabbath appearing whenever he does. In addition, Kuroi is so obsessed with ageless beauty that he used taxidermy to preserve the heads of his former wife and Rin's mother, and mounted them on his shoulders. Along with his sword skills, Kuroi uses two shuriken referred to as Karasu, or \"The Crow.\" He first appears in Conquest part 1 and is later killed by Manji in Conquest part 3. Kuroi Sabato's is inspired by the band Black Sabbath; Kuroi Sabato roughly translates into Black Sabbath from Japanese. Kuroi is a direct translation to the color black. Sabato when romanized, can be taken as \"Sabbath.\" Black Sabbath is one of Hiroaki Samura's favorite bands.   (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/14516.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14516
      },
      "rarity": "uncommon"
    },
    {
      "id": "shira",
      "name": "Shira",
      "alt_names": [
        "尸良"
      ],
      "role": "supporting",
      "description": "A cold-blooded killer in the Mugai-ryū. He&#039;s responsible for the death of Magatsu Taito&#039;s close friend, O-Ren. Shira&#039;s a sadistic psychopath who derives sexual pleasure in the torture and murder of his victims, particularly young women.\n\n(Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b15566-J8aXKnpFxf6y.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15566
      },
      "rarity": "uncommon"
    },
    {
      "id": "araya-kawakami",
      "name": "Araya Kawakami",
      "alt_names": [
        "川上新夜"
      ],
      "role": "supporting",
      "description": "An Ittō-ryū swordsman living as a mask-maker. Determined to conceal his past from his son, Renzo, he is also the man who led the rape of Rin's mother. He first appears in On Silent Wings part 1, and is later killed by Manji in On Silent Wings part 6. Renzo then attacks Manji in rage, Manji feigning death. Renzo then makes an assumption his father had a sordid past with Rin at his father's burial, when Rin says, hypothetically, that there are some reasons past incidents shouldn't be brought up, as the blissful ignorance is better than the lifetime of shame. He appears in On Silent Wings (I-VI).",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n19391-kwRHVCWEoTYd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 19391
      },
      "rarity": "uncommon"
    },
    {
      "id": "iriya",
      "name": "Iriya",
      "alt_names": [],
      "role": "supporting",
      "description": "A member of the sword school  Shingyoto-Ryū in the mountains of Kaga. The school was supposed to merge with the Itto-Ryū, but was ordered by the government to kill Anotsu Kagehisa during the merger meeting. He is in love with Hisoka, the granddaughter of the school&#039;s head, Kensui. After the destruction of the school and the death of both Hisoka and Kensui, the remainder of the students gather together to hunt Kagehisa down. Iriya is first introduced in Secrets Part I, and is killed by Kagehisa in Last Blood Part 4/5.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n21534-hgeQDx6y5p4Y.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21534
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-26T09:49:19.326Z"
}