{
  "work_id": "bleach-thousand-year-blood-war",
  "count": 15,
  "characters": [
    {
      "id": "ichigo-kurosaki",
      "name": "Ichigo Kurosaki",
      "alt_names": [
        "黒崎一護",
        "Ichi-nii",
        "Substitute Soul Reaper",
        "Itsygo",
        "Ryoka Boy"
      ],
      "role": "protagonist",
      "description": "__Race:__ Human \n__Height:__ 181 cm (5'11\")\n__Zanpakutou:__ [Zangetsu](https://anilist.co/character/911/Zangetsu)\n__Relatives:__ [Isshin Kurosaki](https://anilist.co/character/2553/Isshin-Kurosaki) (father), [Masaki Kurosaki](https://anilist.co/character/22849/Masaki-Kurosaki) (mother, deceased), [Yuzu Kurosaki](https://anilist.co/character/1096/Yuzu-Kurosaki) and [Karin Kurosaki](https://anilist.co/character/4018/Karin-Kurosaki) (younger sisters)  \n\nIchigo Kurosaki is an orange haired teenager who lives in Karakura Town, being a capable student at his High School. But, more importantly, he's a Substitute Soul Reaper.\n\nEver since he was young, Ichigo has been able to see spirits, to the point where he could not tell the living from the dead. Due to this oddity, he would end up meeting [Rukia Kuchiki](https://anilist.co/character/6/Rukia-Kuchiki), a Soul Reaper. Soon after, once a hollow appeared and threatened his family, he recklessly fought back against it, forcing Rukia to save him by taking the blow of it's attack. Seeing Ichigo's determination to protect his family, Rukia offered to temporarily turn him into a Soul Reaper by piercing his chest with her Zanpakutou and transferring half of her power to him. Ichigo goes through with it, allowing him to make short work of the Hollow, and forcing him to fulfill Rukia's role as a Soul Reaper until she can regain her powers.\n\nBeing stubborn, short-tempered, strong-willed, and impulsive, Ichigo often claims not to care about what other people think about him, and attempts to maintain a detached and \"cool\" image. He generally keeps his face set in a near-permanent scowl, with his eyebrows drawn together. His outspoken, hot-headed demeanor is a trait Ichigo himself has acknowledged, and if somebody picks a fight with him, he cannot help fighting back. Ichigo's resolve in battle can waver at times, which can impede his fighting prowess, and he tends to go into a state of depression and self-loathing when he loses a major fight or lets a friend down. Despite what he lets on, he is genuinely compassionate and empathetic towards others, and doesn't mind helping others when they become upset, or need the support. He is always willing to fight to protect those he cares for, no matter what it is he would be fighting against.",
      "metadata": {
        "gender": "male",
        "age": "15-29",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5-a7bkJgjhhigE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5
      },
      "rarity": "legendary"
    },
    {
      "id": "uryuu-ishida",
      "name": "Uryuu Ishida",
      "alt_names": [
        "石田雨竜",
        "Prinz von Licht",
        "Megane-kun"
      ],
      "role": "protagonist",
      "description": "__Species:__ Human (Quincy)  \n__Height:__ 171 cm (5'7\") - 177 cm (5'9\")\n__Spirit Weapon:__ Heilig Bogen\n__Relatives:__ [Ryuuken Ishida](https://anilist.co/character/1083/Ryuuken-Ishida) (father), [Souken Ishida](https://anilist.co/character/22844/Souken-Ishida) (Grandfather, deceased) [Kanae Katagiri](https://anilist.co/character/85235/Kanae-Katagiri) (Mother, deceased)\n\nUryuu is a friend of [Ichigo Kurosaki](https://anilist.co/character/5/Ichigo-Kurosaki) and one of the last surviving Quincy. Uryuu is generally shy and quiet, but tries harder to act cool when other people are around. In addition, he also has a tendency to say things with characteristic drama. Uryuu operates on a moral ethic known as the \"Pride of the Quincy\" and has a strong sense of justice. He has also shown to be very chivalrous, stating that he enacts justice on men who abuse or treat women badly. Uryuu also has a tendency to not use lethal force in battle, especially if he can win without doing so. Instead, he will simply incapacitate his opponent.  Uryuu does not hold his father, Ryuuken Ishida, in high respect; he calls his father by his given name which is considered very rude in Japanese society\n\nHis favorite food is homemade mackerel miso stew. The television program he likes is Don Kanonji's \"Bura-Rei.\"",
      "metadata": {
        "gender": "male",
        "age": "15-27",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b564-a6LJitrjSfKC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 564
      },
      "rarity": "legendary"
    },
    {
      "id": "rukia-kuchiki",
      "name": "Rukia Kuchiki",
      "alt_names": [
        "朽木ルキア"
      ],
      "role": "supporting",
      "description": "__Race:__ Shinigami\n__Height:__ 144 cm (4'8\")  \n__Rank:__ Lieutenant of the 13th Division\n__Relatives:__ [Byakuya Kuchiki](https://anilist.co/character/907) (Adoptive Brother/Brother-in-law)\n__Zanpakutou:__ [Sode no Shirayuki](https://anilist.co/character/24524/Sode-no-Shirayuki)\n\nRukia is a Soul Reaper from the Soul Society who met and saved [Ichigo Kurosaki's](https://anilist.co/character/5/Ichigo-Kurosaki) life by lending him her spiritual power. After saving him, she is forced to temporarily remain in the human world, using a gigai given to her by [Kisuke Urahara](https://anilist.co/character/210/Kisuke-Urahara) until she can regain her strength and return to the Soul Society. She chooses to live with Ichigo in order to keep an eye on him and have a place to stay. She is also the Lieutenant of the 13th Division of the Gotei 13, serving under Squad Captain [Juushirou Ukitake](https://anilist.co/character/2682/Juushirou-Ukitake).\n\nInitially born into a lower class, Rukia retains her modesty, despite being an adopted member of a noble bloodline. She is graceful and \"clean\", yet is willing to talk to ordinary people. However, her cool and lone demeanor often forces her to hide her personal troubles, even from those close to her. Because of her never opening up her heart, she has difficulty making friends. She can also act like a bit of a tomboy at times, wanting to show others that she's tough and getting aggressive towards others when they insult her. Rukia is clueless about the ways of the modern Human World, often making misconceptions and struggling with the simplest of things like opening a juice box. She likes to climb up to high places and loves everything rabbit-themed, becoming quite sensitive when someone insults her obsession with them. People often have difficulty understanding her drawings, which are typically rabbit-like, and doesn't like it when people complain about their quality.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6-25WoBeWMZXBc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6
      },
      "rarity": "rare"
    },
    {
      "id": "orihime-inoue",
      "name": "Orihime Inoue",
      "alt_names": [
        "井上織姫",
        "Hime"
      ],
      "role": "supporting",
      "description": "__Height:__ 157 cm (5'2\")\n\nOrihime Inoue is a teenage girl who lives by herself in Karakura Town, being a close friend of [Ichigo Kurosaki](https://anilist.co/character/5/Ichigo-Kurosaki). \n\nOrihime is alot of things, being friendly, kind, sensitive, and humorous in her own way. She comes off as naive and rather clueless, which is at odds with her exceptionally high marks in school. Although, apparently she is hopeless when it comes to technology. She is also notorious for cooking up and eating strange food at home, although she also likes some normal food. Her favorite food is red bean paste, and she likes putting butter on sweet potatoes. Orihime has a tendency to rush into situations without thinking, sometimes leading to embarrassing consequences, plus she has an overactive imagination and can get carried away thinking of implausible scenarios. Orihime has also demonstrated that she is perceptive, mostly when it comes to Ichigo Kurosaki, who she is deeply in love with. \n\nPreviously, she had lived with her older brother, [Sora](https://anilist.co/character/27739/Sora-Inoue), who was fifteen years older than her. She and her brother were raised by a drunk father and an unfaithful mother, who always argued and beat their children. It is unknown if her parents are still alive. When Sora turned eighteen, he ran away with Orihime, who was three years old, and raised her since. For six years, Orihime and Sora lived in harmony despite the fact that Orihime was bullied in school because of her long hair. One day, Sora gave Orihime a pair of hairpins. However, Orihime refused to wear them because she said they were childish. On the same day, Sora was wounded in a car accident and died in the Kurosaki clinic. Orihime has worn the hairpins ever since. A year after Sora died, Orihime met [Tatsuki Arisawa](https://anilist.co/character/1094/Tatsuki-Arisawa) who defended her from the bullies. They have been best friends ever since.",
      "metadata": {
        "gender": "female",
        "age": "15-29",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7-JdR4betokDjR.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7
      },
      "rarity": "rare"
    },
    {
      "id": "kisuke-urahara",
      "name": "Kisuke Urahara",
      "alt_names": [
        "浦原喜助",
        "Mr Hat-And-Clogs"
      ],
      "role": "supporting",
      "description": "__Height:__ 183 cm (6'0\")\n__Race:__ Shinigami\n__Position:__ Owner of the Urahara Shop\n__Zanpakutou:__ Benihime\n\nKisuke Urahara is a mysterious shinigami who runs his own shop in the world of the living, specifically Karakura Town, that caters to Shinigami / Soul Reaper needs. He has several employees who work under him at his shop, including [Tessai Tsukabishi](https://anilist.co/character/15571/Tessai-Tsukabishi), [Jinta Hanakari](https://anilist.co/character/8018/Jinta-Hanakari), and [Ururu Tsumugiya](https://anilist.co/character/3528/Ururu-Tsumugiya). He also is known to have a close relationship with [Yoruichi Shihōin](https://anilist.co/character/908/Yoruichi-Shihouin), and has a strong interest in the substitute soul reaper [Ichigo Kurosaki](https://anilist.co/character/5/Ichigo-Kurosaki).\n\nHe is generally known to be a laid-back, jovial fellow, however he is far more deceptive than he lets on, and there are times he can be dead serious when the situation warrants it. Despite his carefree attitude, his speech is always polite, though it is sometimes sarcastic. Kisuke tends to go over the top with whatever he becomes passionate about, and has once described himself as a \"mere honest, handsome, perverted businessman.\" Despite his appearance, Urahara is a highly skilled fighter, using a combination of powerful attacks and cunning deceptions, and is capable of holding his own with nothing more than his shikai.\n\nUrahara can often be found near the scene of events that he deems important, but will rarely step in to intervene, preferring to pull the strings from outside. After the event is over, he kindly pops up and helps the side he deems fit. He often tends to know more than he reveals, and has strong history and ties to the soul society and several characters within it. While he is a major driving force throughout much of the story, he is usually only the catalyst, allowing others to do the work for him. He also likes building large underground training spaces in secret, it's practically his hobby.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b210-mw01NrQfRjzT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 210
      },
      "rarity": "rare"
    },
    {
      "id": "toushirou-hitsugaya",
      "name": "Toushirou Hitsugaya",
      "alt_names": [
        "日番谷冬獅郎",
        "Shiro-chan (シロちゃん)",
        "Lil' Shiro"
      ],
      "role": "supporting",
      "description": "__Height:__ 133 cm (4'4\")\n__Race:__ Shinigami\n__Rank:__ Captain of the 10th Division\n__Zanpakutou:__ [Hyourinmaru](https://anilist.co/character/25881/Hyourinmaru)\n\nHitsugaya comes from Junrinan, District 1 of Rukongai. There, he lived with an old woman (said to be his grandmother), Momo Hinamori, and possibly other people. Little else is known about his past, but it is known that he became a Shinigami shortly after Hinamori. He is also a friend of Jidanbou, the West Gate Keeper, and was the one who taught him the \"city rules.\"  As a child, Hitsugaya was a bit of a brat who liked to eat watermelons and poke fun at Hinamori. The two were close friends and Hitsugaya, despite being younger and much shorter than his friend, always felt that he needed to protect her. With Hitsugaya's natural talent, he quickly entered the Shinigami Institute shortly after Hinamori, despite his age. She continued to call him \"Shiro-chan\" out of habit and felt she needed to protect him. Because of a promise she had made, she only began to call him \"Hitsugaya-kun\" after he had achieved his Zanpakutō's initial release and was recognized as a Shinigami. Highly capable and knowledgeable, he quickly became the youngest of the Captains within the Gotei 13. His favorite foods are watermelon and sweet nattou. He also hates hot weather.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b245-buy3Cfn6IFSB.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 245
      },
      "rarity": "rare"
    },
    {
      "id": "yasutora-sado",
      "name": "Yasutora Sado",
      "alt_names": [
        "茶渡泰虎",
        "Chad"
      ],
      "role": "supporting",
      "description": "__Height:__ 197 cm (6'5\")  \n\nYasutora Sado, or as his friends call him, Chad, is a teenager of Mexican descent who is close friends with [Ichigo Kurosaki](https://anilist.co/character/5/Ichigo-Kurosaki). He is extremely tall and appears to be much older than he actually is.\n\nChad is a quiet person and is sometimes the subject of jokes or bullies because he never fights back, against ordinary humans, or often hollows and Soul Reapers until necessary. Nonetheless, he is treated equally within his group of friends in Karakura (Ichigo, Keigo and Mizuiro). Chad also has a weakness for cute things, like small animals and Kon, and is one of the few characters that actually treats Kon with any dignity but for the most part ignores him. To match his extraordinary size, Chad possesses extraordinary superhuman durability, even before activating his spiritual powers, being able to survive the impact of a falling steel girder on his back and a head-on motorcycle collision, and is strong enough to break telephone poles and wield them as giant clubs, even when already injured. Besides his physical strength, Chad has also shown to be very intelligent; he ranked 10th out of 322 in school, while Ichigo ranked 23rd.",
      "metadata": {
        "gender": "male",
        "age": "16-28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/575.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 575
      },
      "rarity": "rare"
    },
    {
      "id": "rangiku-matsumoto",
      "name": "Rangiku Matsumoto",
      "alt_names": [
        "松本乱菊"
      ],
      "role": "supporting",
      "description": "__Race:__ Shinigami\n__Height:__ 172 cm (5'7\")\n__ Rank:__  Lieutenant of the 10th Squad\n__Zanpakutō:__ [Haineko](https://anilist.co/character/24771/Haineko)\n\nRangiku is an attractive, fair-skinned woman with long, wavy, strawberry-blonde hair (worn short in her youth), icy blue eyes, and a beauty spot to the right of her mouth. Her most distinctive features are her very large breasts, which are even larger than Orihime Inoue's. She also shares Orihime's strange taste in food. She dresses in the garb typical of shinigami, though her robes hang loose enough for her ample bosom to be revealed. She wears a necklace and a pink scarf over her shoulders. In addition, her lieutenant's armband is worn on her uniform's sash, as opposed to around the arm.  Rangiku tends to be a slacker who doesn't like paperwork and loves to drink saké. She's not the least bit modest about her appearance, frequently referring or complaining about her large breasts in casual conversation. She even tries to bribe Ichigo Kurosaki into letting her stay at his house using them, though unsuccessfully. Her easy-going and free-spirited personality is in sharp contrast with the serious Hitsugaya, but the two seem to be quite close, regardless. Rangiku is almost constantly by his side and has shown her loyalty to him on several occasions. While she seems somewhat self-centered, she is sensitive to the feelings of others, evident when she sees the concern Hitsugaya has for Momo Hinamori, the guilt Izuru Kira shares with her when Gin Ichimaru is revealed as a traitor, and when Orihime feels depressed about her role in Ichigo Kurosaki's life. Despite her lackadaisical image, she can be extremely serious when needed. She's shown to be somewhat maternal, especially with Orihime and Momo.   ~!Not much is mentioned about Rangiku's past. She came from Rukongai and was rescued as a child by Gin Ichimaru; the two soon became friends. In one short chapter from the manga, she was once asked by Ichimaru during her childhood when her birthday was. She replied that she did not know because she had been alone for as far as she could remember. This possibly means she was orphaned since birth. When he heard about this, Ichimaru told her that if this was the case, then her birthday should be set on the day they met (the day she was not alone anymore).  It is not known how she became a shinigami or how she became lieutenant of the 10th Division, but it is known that she has held the position longer than her current captain has held his. She first met Hitsugaya in Rukongai when the two bumped into one another. Recognizing his immense power, and the harm it was causing to the old woman he lived with, she convinced him to become a shinigami in order to control it.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b904-bdfi2xqHicCj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 904
      },
      "rarity": "rare"
    },
    {
      "id": "soi-fon",
      "name": "Soi Fon",
      "alt_names": [
        "砕蜂",
        "Fon Shaolin",
        "Sui Feng"
      ],
      "role": "supporting",
      "description": "__Race:__ Shinigami\n__Height:__ 4' 11\" (150 cm)  \n__Rank:__ Captain of the 2nd Division, Commander-in-Chief of the Onmitsukidō, Corps Commander of the Executive Militia Corp, 9th Head of the Fēng Family\n__Previous Position:__ Bodyguard of [Yoruichi Shihōin](https://anilist.co/character/908/Yoruichi-Shihouin) Executive Militia member\n\nSoi Fon is staunchly loyal, firm, and unbending in her beliefs. She is a hard worker and takes a strong moral stand — she particularly believes in following orders. She is generally reserved and not arrogant like her lieutenant. She will not hesitate in the slightest to strike down even her subordinates if they stand in her way. Soi Fon, like most female shinigami, is a member of the Shinigami Women's Association.   Underneath her standard shinigami captain uniform, Soi Fon wears the special forces leader's uniform, which has no sleeves or covering for the back. The reason the shoulders and the back are exposed is because of Soi Fon's ability to use shunkō (flash cry), an advanced technique that combines hand to hand combat and kidō and causes high spiritual pressure to accumulate at the shoulders and back, blasting away the fabric at the shoulders and back. Her hair is worn short with two long braids covered in cloth.   Long ago, she had a close friendship with Yoruichi Shihouin that went beyond the typical leader/subordinate relationship. When Youruichi left the soul society with no explanation, Soi Fon took it as a personal betrayal of her feelings, with gives rise to her intense hatred of anyone who disobeys orders or disturbs the harmony of the soul society. She finally comes to terms with her feelings toward Yoruichi during the \"Rukia Rescue\" arc, and the two becomes friends again soon after. Soi Fon has borderline romantic feelings toward Yoruichi which becomes evident on several occasions such as when she buys some photos of Yoroichi eating voraciously in skimpy clothing.  Soi Fon also has a personal dislike for Kisuke Urahara because of his close relationship with Yuruichi. Another person she dislikes is her own lieutenant, Oomaeda, whom she punches quite frequently for his stupidity and cowardice.  The correct romanization of her name, as confirmed by Kubo Tite, is Suì-Fēng.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b905-zKwCoIRiYJSr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 905
      },
      "rarity": "rare"
    },
    {
      "id": "renji-abarai",
      "name": "Renji Abarai",
      "alt_names": [
        "阿散井恋次",
        "Freeloader",
        "Red Pineapple"
      ],
      "role": "supporting",
      "description": "__Height:__ 188 cm (6'2\")\n__Race:__ Shinigami\n__Rank:__ Lieutenant of the 6th Division\n__Zanpakutou:__  [Zabi](https://anilist.co/character/24528/Zabimaru-Female)[maru](https://anilist.co/character/29307/Zabimaru-Male)\n\nRenji is one of the most unusual Bleach character, having long crimson hair which is usually kept in high ponytail, and whole upper body tattooed in tribal work. He dresses in normal Shinigami kimono, but he usually wears some kind of headband (it's shown to be rather very expensive glasses or white headband).  In terms of personality, Renji is same as any other Shinigami. His personality varies from cocky and eccentric, to being depressed after he's defeated, all the way to being clueless and funny. Although he's carefree and happy character in most of the series, he can be quite serious, especially when it's the matter of life and death situations for either him or people he hold precious.  He is shown to have rather complicated relationship with his captain, Kuchiki Byakuya. Renji sees Byakuya as the goal he has to surpass. First time, when Renji was still in the Academy, he encountered Byakuya and felt something chilling about him. In the meantime, Renji became Byakuya's lieutenant, and throughout the series, Renji starts to see Byakuya not only as rival, but also as man he can look up to.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b906-ImRjx5HFM8X6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 906
      },
      "rarity": "rare"
    },
    {
      "id": "byakuya-kuchiki",
      "name": "Byakuya Kuchiki",
      "alt_names": [
        "朽木白哉",
        "Bya-kun"
      ],
      "role": "supporting",
      "description": "__Height:__ 180 cm (5' 11\")  \n__Relatives:__ [Rukia Kuchiki](https://anilist.co/character/6/Rukia-Kuchiki) (Adoptive Sister/Sister-in-law)\n__Zanpakutou:__ Senbonzakura\n\nByakuya Kuchiki is the captain of the 6th Division in the Gotei 13 and the 28th head of the noble Kuchiki clan. His lieutenant is [Renji Abarai](https://anilist.co/character/906). \n\nByakuya Kuchiki is a part of one of the four noble families in Soul Society. As such, Byakuya acts in an aristocratic manner: he is always quiet and apathetic towards other people, even while actually deeply conflicted. He is notably calm, even in battle. He generally acts indifferent, bordering on arrogance, to most situations he is faced with, and rarely views his opponent as being worth his time. In spite of his icy and regal manner, Byakuya still cares for and protects those important to him.\n\nByakuya strongly believes in law and order. As a captain of the Gotei 13 and head of one of the great noble families, he works hard for a peaceful society. He feels that if someone in his position does not follow the rules as a good example, no one else will. He believes that to maintain the order, all lawbreakers must be punished, even if it goes against his own wishes.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b907-kgnDKeMtEN5y.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 907
      },
      "rarity": "rare"
    },
    {
      "id": "kenpachi-zaraki",
      "name": "Kenpachi Zaraki",
      "alt_names": [
        "更木剣八",
        "Ken-chan",
        "Kenny",
        "Demon of Battle"
      ],
      "role": "supporting",
      "description": "__Race:__ Shinigami\n__Height:__ 202 cm (6'7\")\n__Rank:__ Captain of the 11th Division\n__Relatives:__ [Yachiru Kusajishi](https://anilist.co/character/910/Yachiru-Kusajishi) (adoptive daughter)\n\nZaraki's first name comes from the district he once resided in, Zaraki, which is district #80 of the North Alley of Rukongai. District #80 is the worst, most lawless region of Rukongai, full of thieves and murderers (whereas area #1 is the most orderly and law-abiding). While residing in District #80, Kenpachi was nameless. During that time, he became proficient in swordsmanship and killed numerous enemies. At some point during his travels outside of District #80, he found a small girl and named her Yachiru, in remembrance of the only person he ever admired, after she showed no fear of his sword. Yachiru came from area #79, Kusajishi, where her parents were murdered. The two events were apparently quite close. On that day, he also took on a name: Kenpachi, the title bestowed upon the strongest swordsman, the one who has killed the most. The two developed a father-daughter-like relationship.\n\nAlso, at some point (before he became a Captain), he fought and defeated Ikkaku Madarame; for this reason, Ikkaku pledged to serve under Kenpachi from there on out (Ikkaku doesn't actually get the chance to do so until he joins the 11th Division), but Ikkaku would still jump at the chance to fight Kenpachi to the death. After some time had passed, Kenpachi found his way to the Seireitei. He defeated and killed the previous Captain of the 11th Division (whose identity is currently unknown) and gained his seat in the Gotei 13 in this manner. In the anime, his assumption of the Captain's seat caused Maki Ichinose to leave the Soul Society. According to the anime, it is also what convinced Ikkaku and Yumichika to join the Shinigami.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b909-slhoFBon7oiH.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 909
      },
      "rarity": "rare"
    },
    {
      "id": "yachiru-kusajishi",
      "name": "Yachiru Kusajishi",
      "alt_names": [
        "草鹿八千流"
      ],
      "role": "supporting",
      "description": "__Race:__ Shinigami\n__Height:__ 109 cm (3'7\")\n__Rank:__ Lieutenant of the 11th Division\n__Relatives:__ [Kenpachi Zaraki](https://anilist.co/character/909) (adoptive father)\n\nYachiru is the shortest member of the Gotei 13. She became a shinigami without having taken the standard exams. She is the current Vice-Captain of the 11th division but her strength and powers thus far are unknown. She is also the president of the Shinigami's Women Society. \n\nShe first met Kenpachi as a baby after he had just killed a group of people. She instantly became drawn to him as she later said that it was as though Kenpachi had used blood to wash away the dark, hopeless, unforgiving world she lived in.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b910-cAC9g4i208Ou.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 910
      },
      "rarity": "rare"
    },
    {
      "id": "zangetsu",
      "name": "Zangetsu",
      "alt_names": [
        "斬月",
        "Kokui no Otoko (黒衣の男)"
      ],
      "role": "supporting",
      "description": "__Affiliation:__ [Ichigo Kurosaki](https://anilist.co/character/5/Ichigo-Kurosaki)\n\nIchigo's zanpakutou is named Zangetsu. The spirit of Zangetsu resembles a 30 to 40 year-old man, and Ichigo calls him \"old man\" as a result. \n\nZangetsu is portrayed as wise and calm in most matters, and fond of testing Ichigo in unusual ways, many of which have a purpose completely contrary to the stated goal. Zangetsu has displayed the ability to temporarily close fatal wounds during combat, though whether or not this is a unique ability is unclear. Unlike most zanpakuto, Zangetsu has no release command. The shikai form of Zangetsu resembles an over sized, though more elegant, cleaver blade without a hilt guard. The sword is as tall as Ichigo is, 1.74 meters, and has a black blade with a silver edge. When not in combat, the cloth extends to cover the rest of the sword and falls away when necessary, shrinking back to a manageable size. The cloth can also be used to swing the weapon like a flail and toss it at opponents, but this is rarely done. \n\nThe bankai of Zangetsu, named Tensa Zangetsu (天鎖斬月, lit. heavenly chained cutting moon), is considered completely out of the ordinary for any zanpakutō. Unlike most bankai forms, which usually create some sort of massive creature or effect, Ichigo's bankai actually shrinks his sword down to a daitō (Japanese long sword) with a black blade, handguard in the shape of the manji (which is the kanji for \"ban,\" meaning \"full\"). The cloth wrapped around the hilt is replaced by a short chain with a broken link, similar to that of a plus spirit. In addition to his sword, Ichigo's robe is replaced with a long-sleeved, ankle-length black coat with red lining that is closed at his chest, much like that of Zangetsu himself.    ~!When Ichigo enters the zanpakutō realm while it is in bankai, the spirit of Zangetsu seems much younger, around Ichigo's age. !~ Zangetsu's special ability (in either form) is the getsuga tenshō (月牙天衝, lit. moon fang heaven stab, Viz: Moon-Fang Piercer of the Heavens), which fires concentrated energy blasts from the tip of the blade in the shape of a crescent moon.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b911-KgzOcvf4jhOh.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 911
      },
      "rarity": "rare"
    },
    {
      "id": "ryuuken-ishida",
      "name": "Ryuuken Ishida",
      "alt_names": [
        "石田竜弦"
      ],
      "role": "supporting",
      "description": "Uryuu Ishida&#039;s father. He also knows the way of the Quincy and was one of the most powerful but he finds it a waste of time.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1083-NnfsmUxq9493.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1083
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-25T20:33:19.223Z"
}