{
  "work_id": "k",
  "count": 15,
  "characters": [
    {
      "id": "yashiro-isana",
      "name": "Yashiro Isana",
      "alt_names": [
        "伊佐那社",
        "Shiro"
      ],
      "role": "protagonist",
      "description": "**Height**: 169 cm\n\nA joker who goes around asking for his schoolmates to share their lunch with him. Yashiro is soft-spoken but very charismatic. He is very friendly and well-liked. In addition, he is quite respectful towards anyone he meets, even robots.  He is also somewhat laid-back and happy-go-lucky. Yashiro carries also a red, Japanese-style parasol with him at all times.\n\n~!His real name is Adolf K. Weissman and he's the Silver King. The Colorless King was once in control of \"Yashiro's\" body, but once he took control of Weissman's original body, their spirits switch. He had amnesia from episode one and regains them in the 11th episode, finally bringing light to the confusing situation.!~\n\n(Source: ANN, K Project Wikia)",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64591-8wPvsPK3hzOw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64591
      },
      "rarity": "epic"
    },
    {
      "id": "reisi-munakata",
      "name": "Reisi Munakata",
      "alt_names": [
        "宗像礼司",
        "Blue King"
      ],
      "role": "protagonist",
      "description": "__Age:__ 24  __Height:__ 185 cm  __Birthday:__ October 1  __Horoscope:__ Libra   (RH-)  The head of SCEPTER4 and the Blue King. Reishi is a sophisticated, observant and composed individual who is cautious in the battlefield. Though he is willing to use physical action in a fight, Reishi does attempt to win with victory through negotiation instead. He is a natural leader and generally puts the concern of innocent lives over his own. Though he possesses a general loathing towards Mikoto Suoh, Reishi still accepts him as a human being. He takes immediate notice when his vice-commander Awashima's displays apparent disregard for his civil rights. However, he remained indifferent to how the idea could effect the Red King, even stating that it was a good one. Reishi has a fondness for solving jigsaw puzzles during his spare time.  As a member of SCEPTER4, Reishi has power over lightning, imbibing himself in a blue color. When exerted, the aura has the defensive potential to protect Reishi and his subordinates against a direct attack from the flames of Mikoto Suoh, known as the king of HOMRA and an incredibly powerful combatant.  (Source: Project K Wikia)",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64593-psXw45SnkGVC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64593
      },
      "rarity": "epic"
    },
    {
      "id": "neko",
      "name": "Neko",
      "alt_names": [
        "ネコ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 155 cm\n\nNeko has a very joyful, carefree, and energetic personality. She is very playful, often participating or even starting chases with people. In addition, Neko seems to have no qualms or worries about being nude, especially in front of men, showing some immodesty. She even stated that she does not like wearing clothes, the reason being that \"Clothes are too restricting\". She is also a mysterious girl, who is also a cat. Neko also likes Shiro and even calls him \"My Shiro\".\n\n~!Neko is a female Strain. By projecting her powers within a perimeter with herself at the center, she can interfere and manipulate the human senses and perceptions of those around her. However, her powers aren't limited to visual and auditory hallucinations. Her power to manipulate perception can even play with a person's memory. She can create false memories in people, and make people who've met for the first time believe they're old friends.!~\n\n(Source: ANN, K Project Wikia)",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/64595.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64595
      },
      "rarity": "epic"
    },
    {
      "id": "mikoto-suoh",
      "name": "Mikoto Suoh",
      "alt_names": [
        "周防尊",
        "Red King"
      ],
      "role": "protagonist",
      "description": "__Height:__ 185 cm  \n\nThird King, known as the Red King. Has an ability to control fire. Feared by people as the leader of the Red Clan, HOMRA. Mikoto is a quiet man who says very little, even to his own subordinates. He is very calm, rarely being irritated or annoyed, and even when his mood changes Mikoto still maintains his composure. Mikoto is an avid smoker, often holding a cigarette and a lighter in each hand.  \n\n(Source: Anime News Network and K Project Wiki)",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64597-ca6IDjwKbOkZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64597
      },
      "rarity": "epic"
    },
    {
      "id": "kuroh-yatogami",
      "name": "Kuroh Yatogami",
      "alt_names": [
        "夜刀神狗朗",
        "Black Dog",
        "Kuro"
      ],
      "role": "protagonist",
      "description": "__Height:__ 178 cm \n\nA young man with an unyielding personality. He is also a skilled swordsman, martial artist, and housekeeper. Kuroh is a quiet, serious and composed individual that appears tough and completely no-nonsense on the surface. He is very determined to accomplish his goals, whatever they may be, but despite so Kuroh is willing to set them aside for the finer things in life, such as genuine companionship. Kuroh says that he follows a policy where, rather than judging a man by his appearance or words, their actions are what matters more.  In his younger years, Kuroh was trained by the 7th King, Miwa Ichigen. However, after unknown circumstances, Ichigen had passed away, leaving behind a will in Kuroh to defeat the \"evil\" King.",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64599-VxC3Xua4HSQ0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64599
      },
      "rarity": "epic"
    },
    {
      "id": "seri-awashima",
      "name": "Seri Awashima",
      "alt_names": [
        "淡島世理",
        "The Heartless Woman"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm\n\nShe acts as Munakata's right arm, coldly carrying out her missions. Seri appears to be somewhat passive, though seemingly indifferent about others' civil rights. She prefers to use different alternatives in dire situations rather than killing as a first option.  She's a regular at Izumo's bar and she likes her martinis with red bean paste.  (Source: ANN, K Project Wikia)",
      "metadata": {
        "gender": "female",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64619-N0qHvMvoFTVX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64619
      },
      "rarity": "rare"
    },
    {
      "id": "saruhiko-fushimi",
      "name": "Saruhiko Fushimi",
      "alt_names": [
        "伏見猿比古",
        "Saru"
      ],
      "role": "supporting",
      "description": "__Height:__ 178 cm\n\nThird in Command of SCEPTER4 and a former member of HOMRA, having betrayed the latter Clan at some point in the past. Fushimi often displays himself as a cool-headed, though lazy and bored individual. He gives off a listless attitude and seems unmotivated, but is in fact very competent. He prefers not to participate in most of his Clan's activities. However, he will cooperate if necessary with little to no arguments. At the same time, he would often disregard his associates and act out on his own. While focused on an objective, Fushimi is willing to use any method possible to make his tasks quicker and easier, such as drugging innocent civilians. He would even attack several former allies without any hesitation just to accomplish his goal, displaying additional traits of ruthlessness.   A sociopath by nature, Fushimi's personality is far more twisted then he leads others to believe. He is cruel, bloodthirsty, and occasionally sadistic. During battle, Fushimi often sports a wide grin and a tendency to laugh giddily about the dangerous event. He also displays more evident signs of arrogance and superiority towards his opponents. Fushimi often boasts about his strength and speaks to his opponents in a more mocking tone. Nevertheless, Fushimi retains a carefree attitude during battle and likes to make rude, though somewhat personal jokes.  Misaki usually calls him \"Saru\" (Monkey).   ~!He used to be Misaki's partner back in HOMRA and personally burned the HOMRA mark off his own skin. He also displays the ability to use both blue and red flames from both clans.!~ (Source: ANN, Project K Wikia)",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64621-mC3KL5Bpqb2M.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64621
      },
      "rarity": "rare"
    },
    {
      "id": "rikio-kamamoto",
      "name": "Rikio Kamamoto",
      "alt_names": [
        "鎌本力夫"
      ],
      "role": "supporting",
      "description": "__Height:__ 185cm  \n\nA big man who is always hanging out with Yata. He may be big, but so is his honor. Rikio is a serious individual, though he does like playing games and engaging in fights. Nonetheless, he is quite friendly especially towards his fellow Homura members; upon Shōhei's inauguration, Rikio is one of the first few to immediately accept him into their leagues. He also appears to be a gluttonous fellow; during important objectives, he would instead go out and buy food to eat at the moment.",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/64623.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64623
      },
      "rarity": "rare"
    },
    {
      "id": "izumo-kusanagi",
      "name": "Izumo Kusanagi",
      "alt_names": [
        "草薙出雲"
      ],
      "role": "supporting",
      "description": "__Height:__ 188 cm\n\nIzumo is a very composed individual, reacting calmly even in dangerous or extreme situations. He retains this trait even when in the midst of a battle. However, because of his nature, others often tend to be intimidated by him. Additionally, he is quite intelligent and knowledgeable of the people or things around him. Izumo has a fairly extensive knowledge of people's backgrounds. Izumo is an avid smoker, and speaks in the Kyoto dialect. Owner of the bar \"HOMRA\", and has known Suoh for a long time.",
      "metadata": {
        "gender": "male",
        "age": "26",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64625-xiPTVwtu5fWM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64625
      },
      "rarity": "rare"
    },
    {
      "id": "anna-kushina",
      "name": "Anna Kushina",
      "alt_names": [
        "櫛名アンナ"
      ],
      "role": "supporting",
      "description": "__Height:__ 140 cm \n\nA quiet, doll-like girl who serves as HOMRA's unofficial mascot. Anna is very quiet and shy compared to her louder, more eccentric HOMRA members. In addition, she rarely expresses much emotion nor does she actively participate in the gang-like activities of HOMRA, due to her young age and status as the sole female in the group; however, she is not unwilling to tag along and cooperate if necessary. She has the ability to locate things and people and read minds using her red marbles.",
      "metadata": {
        "gender": "female",
        "age": "11",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/64627.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64627
      },
      "rarity": "rare"
    },
    {
      "id": "tatara-totsuka",
      "name": "Tatara Totsuka",
      "alt_names": [
        "十束多々良"
      ],
      "role": "supporting",
      "description": "__Height:__ 172 cm\n\nOne of the original members of HOMRA along with Suoh and Kusanagi. He can get along with anyone, so he often sets the mood in HOMRA. Totsuka has a calm, laid-back and very friendly personality. He often engages in conversations with people, even strangers, showing that he is charismatic and somewhat talkative. Totsuka has a habit of constantly recording things wherever he went; while he had stated that he does this during important events, he appears to do this in his free time as well, whether he was aware of it or not.\n\n(Source: ANN, K Project Wikia)",
      "metadata": {
        "gender": "male",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/64629.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64629
      },
      "rarity": "rare"
    },
    {
      "id": "misaki-yata",
      "name": "Misaki Yata",
      "alt_names": [
        "八田美咲",
        "Yatagarasu (八咫烏)"
      ],
      "role": "supporting",
      "description": "__Height:__ 167 cm  \n\nOne of HOMRA's raid captains who goes around riding a skateboard and acts as the group's vanguard. He's impulsive, but he also cares about his comrades very much. Yata is a brash teenager with high self-esteem. He is very brutal, showing no hesitation when bludgeoning his opponents, as well as vulgar and easily irritable, cursing openly towards people when things don't go as well as he'd planned. Nonetheless, he shows respect towards his fellow Homura members, especially Mikoto; so he gets very shy around girls. He hates being called by his first name. He joined to HOMRA with Saruhiko when they were teenagers.",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64631-wUzOdn7rPI6R.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64631
      },
      "rarity": "rare"
    },
    {
      "id": "kukuri-yukizome",
      "name": "Kukuri Yukizome",
      "alt_names": [
        "雪染菊理"
      ],
      "role": "supporting",
      "description": "__Height:__ 158 cm  \n\nA member of the Ashinaka High School's Student Council. Kukuri is a friendly, kindhearted girl.  She appears to have an interest in her classmate, Yashiro. When she notices that he doesn't have any vegetables included in his lunch, she decides to share hers with him, even going as far as to run across their entire school campus before finally giving up. Kukuri adds that he seems to fade away when she's not looking at him, showing a wider range of perception around him. When Neko and Kuroh \"transfer\" into Ashinaka High School, she quickly befriends the two, as they are both Yashiro's friends. Kukuri and Kuroh seems to get along well as a result of previous encounters.\n\n(Source: Anime News Network)",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64633-OObdPHCokCQ4.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64633
      },
      "rarity": "rare"
    },
    {
      "id": "saburouta-bandou",
      "name": "Saburouta Bandou",
      "alt_names": [
        "坂東三郎太",
        "San-chan"
      ],
      "role": "supporting",
      "description": "One of HOMRA's members. Childhood friends with Shouhei.",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/68987.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 68987
      },
      "rarity": "rare"
    },
    {
      "id": "adolf-k-weismann",
      "name": "Adolf K. Weismann",
      "alt_names": [
        "アドルフ・K・ヴァイスマン"
      ],
      "role": "supporting",
      "description": "The first King, the Silver King.   ~!Adolf K. Weismann (Adorufu Kā Vaisuman) was the Silver King, formerly a researcher in Germany who experimented with the effects of the Dresden Slate. He was ejected from his original body by the Colorless King and had since inhabited the body of a teenage boy, where after becoming amnesiac, Weismann assumed a new identity, Yashiro Isana.  (Source: k-project.wikia.com)!~",
      "metadata": {
        "gender": "male",
        "age": "90",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b70863-KA4ZGJYVgtZB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70863
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-26T05:32:45.037Z"
}