{
  "work_id": "fatezero",
  "count": 37,
  "characters": [
    {
      "id": "kiritsugu-emiya",
      "name": "Kiritsugu Emiya",
      "alt_names": [
        "衛宮切嗣",
        "Magus Killer",
        "Kerry",
        "EMIYA (Assassin)"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm\n__Sidearm:__ Thompson contender in conjunction with his Mystic Code Origin Bullets\n\nShirou's foster father and his savior from the aftermath of the massive Fuyuki fire. During his lifetime, Kiritsugu was disillusioned with becoming a Hero of Justice, a defender of humanity who could save everyone. Although he feels he failed to do so, his efforts were a source of inspiration for Shirou.  Prior to his fateful meeting with Shirou, Kiritsugu was notorious as the \"Magus Killer,\" a freelancer who would hunt down heretical magi. Although he was a magus with Magic Circuits and abilities he was considered unorthodox in that he would utilize modern technology and weaponry along with his magecraft to track down and kill magi.  Although mentioned and seen in flashbacks in Fate/stay night, Kiritsugu is one of the main protagonists in its prequel Fate/Zero.   \n\n~!It is hinted at in certain parts of Fate/stay night and confirmed in its prequel Fate/Zero that Kiritsugu is in fact Illyasviel von Einzbern's biological father, making Shirou and her step-siblings.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b10010-fNspzan5MzNk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10010
      },
      "rarity": "legendary"
    },
    {
      "id": "irisviel-von-einzbern",
      "name": "Irisviel von Einzbern",
      "alt_names": [
        "アイリスフィール・フォン・アインツベルン",
        "Iri"
      ],
      "role": "protagonist",
      "description": "__Height:__ 158 cm  \n\nIrisviel von Einzbern is the partner of Saber as well as the intended vessel for the Holy Grail. She is the mother of Illyasviel von Einzbern. Like her daughter, Irisviel is a homunculus, an artificial being created by the Einzbern. She was raised to be a puppet with no desires, but found happiness in her existence when she gave birth to Illyasviel. She is married to Kiritsugu Emiya, the biological father of her daughter.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b15164-BPfYcnNR3PwN.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15164
      },
      "rarity": "legendary"
    },
    {
      "id": "artoria-pendragon",
      "name": "Artoria Pendragon",
      "alt_names": [
        "アルトリア・ペンドラゴン",
        "Saber (セイバー)",
        "Altria Pendragon",
        "King Arthur",
        "King of Knights",
        "Blue Saber",
        "Arturia Pendragon",
        "Goddess Rhongomyniad",
        "Lion King",
        "Elise Watoson",
        "Once and Future King",
        "Proud Knight-King",
        "Arthur Pendragon"
      ],
      "role": "protagonist",
      "description": "__Height:__ 154 cm (5'1)\n\nArtoria Pendragon, better known as Arthur Pendragon and King Arthur, is regarded as a male in history but is actually female. She is the \"Once and Future King\" and a legendary hero of Britain known as the King of Knights. She used to wield the sword from the stone, Caliburn, but it was eventually destroyed and the Lady of the Lake gifted her with Excalibur and Avalon.\n\n__In Fate/Prototype:__ ~!He is presented as male instead, conserving his original name of Arthur Pendragon. Also called Prototype Saber, he is the Saber-class Servant under the control of [Ayaka Sajyou](https://anilist.co/character/54223).!~\n\n__In Fate/stay night:__ ~!Saber is summoned in the Fifth Holy Grail War as the Servant of [Shirou Emiya](https://anilist.co/character/496). Shirou had been having dreams of Excalibur in the days leading up to the start of the Holy Grail War after receiving his Command Spells and, while stumbling in his shed during his escape from [Lancer](https://anilist.co/character/499), Avalon, hidden inside him, reacts to the traces of a magic circle and summons Artoria as his Servant.!~\n\n__In Fate/stay night: Heaven's Feel:__ ~! Corrupted by [Angra Mainyu](https://anilist.co/character/120855), Artoria is vastly different from her normal self. She is also called Saber Alter/Black Saber. The results of her alteration is not only within Artoria's interior but also extends to her outward appearance. The color of her skin becomes pale, and the pupil of her eyes that were at first concealed behind a black visor during the moment of her summoning becomes golden from her original green eye color as well. Because the armor she wears was dyed jet black and grew in weight due to changing into a heavier armor, its power has increased more than normal.!~\n\n __In Fate/Zero:__ ~!Saber is summoned by [Kiritsugu Emiya](https://anilist.co/character/10010) to participate in the Fourth Holy Grail War on behalf of [Jubstacheit von Einzbern](https://anilist.co/character/16027) and the Einzbern family. Kiritsugu partners Saber with [Irisviel von Einzbern](https://anilist.co/character/15164), to act as Saber's Master in the open while he acts from behind to win with his own methods.!~ \n\n__In Fate/Grand Order - First Order:__  ~! She remains the corrupted version, known as Saber Alter.!~\n\n__In Fate/Grand Order Camelot:__ ~!The being called Goddess Rhongomyniad came into existence in the world that [Bedivere](https://anilist.co/character/8941), due to the wish of wanting his King to not perish after the battle of Camlainn, refused to throw Excalibur back into the Lake even after the third time.!~",
      "metadata": {
        "gender": "female",
        "age": "35 (chronologically), 15 (physically)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b497-Yg5pNmC8kxzs.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 497
      },
      "rarity": "legendary"
    },
    {
      "id": "kirei-kotomine",
      "name": "Kirei Kotomine",
      "alt_names": [
        "言峰綺礼"
      ],
      "role": "protagonist",
      "description": "__Height:__ 185cm (Fate/Zero), 193cm (Fate/stay night)\n\n~!Through an agreement between the Mages' Association and the Church, the Holy Grail Wars are moderated by a priest. Kirei's father was the mediator for the 4th Holy Grail War, and when he died, Kirei felt obligated to replace him. His selection as mediator is unusual, for Kirei is a member of both the Church and Mages' Association, organizations on hostile terms with one another. Since the death of Rin's father, he has also acted as an indirect caretaker for Rin.!~",
      "metadata": {
        "gender": "male",
        "age": "28 (Fate/Zero), 38 (Fate/stay night)",
        "dateOfBirth": "1967-12-28"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b506-qeg0TqitdCMS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 506
      },
      "rarity": "legendary"
    },
    {
      "id": "gilgamesh",
      "name": "Gilgamesh",
      "alt_names": [
        "ギルガメッシュ",
        "Archer",
        "King of Heroes",
        "King of Kings",
        "Golden King",
        "King of Babylon",
        "Oldest King",
        "AUO",
        "Gil-kun",
        "Wedge of Heaven"
      ],
      "role": "protagonist",
      "description": "__Height:__ 182 cm\n\nGilgamesh is the King of Uruk, said to have reigned during the Sumer Dynasty in Mesopotamia 5000 years ago. He's the namesake Hero described in the Epic of Gilgamesh, making him the most ancient Hero on which all the others legends were modeled. This grants him the title of King of Heroes and, within his Gates of Babylon, the prototypes of all the Noble Phantasms of the Heroes yet to come. \n\nBorn from the human Lugalbanda, the King of Uruk, and the goddess Rimat-Ninsun, he was a being so perfect and transcendent to the point that he was two-thirds deity and one-third human. He was the chosen one that would guide humanity on the earth that was slowly abandoning the Age of Gods, but instead he grew up to be a selfish and arrogant despot.\n\nHis only friend and being he considered his equal was Enkidu.\n\n__In Fate/Zero:__\n~!\nInitially summoned as the Archer-class Servant of [Tokiomi Toosaka](https://anilist.co/character/16017/Tokiomi-Toosaka) in the 4th Holy Grail War, using the fossil of the first skin ever shed by a snake as a catalyst, he soon becomes bored with his Master and takes interest in Kirei Kotomine. Together they plot to kill Tokiomi and forge a new pact, with Gilgamesh pushing Kotomine to accept his true desires. He also takes interest in Iskandar as a worthy opponent to kill, and in Artoria, a tragic figure to take as his bride. \n\nIn the end, invested by the pollution of the Holy Grail, he is gifted a mortal body and is reincarnated in the world. !~\n\n__In Fate/strange Fake:__\n~!\nWithin the World of Fate/strange Fake, Servant Archer Gilgamesh was previously summoned in the Fourth Fuyuki Holy Grail War and participated in the Fifth Fuyuki Holy Grail War. But the Servant summoned in the False Holy Grail War is a new Servant without any memories of the Fuyuki Holy Grail Wars. \n\nHe is the first Servant summoned in the True and False Holy Grail War as the \"False\" Archer-class Servant of [Thine Chelc](https://anilist.co/character/87307/).\n!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2514-hnE6LEdqm7Su.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2514
      },
      "rarity": "legendary"
    },
    {
      "id": "tokiomi-toosaka",
      "name": "Tokiomi Toosaka",
      "alt_names": [
        "遠坂時臣",
        "Tokiomi Tohsaka"
      ],
      "role": "protagonist",
      "description": "The father of [Rin](https://anilist.co/character/498/) and [Sakura](https://anilist.co/character/500/), two of the heroines from Fate/stay night. As a member of the Tohsaka family, he entered the Fourth Holy Grail War as the Master of Archer ([Gilgamesh](https://anilist.co/character/2514/)). [Kiritsugu Emiya](https://anilist.co/character/10010/) identifies Tokiomi as one of the two most threatening magi involved in the war after assessing all the Masters involved. Tokiomi is an arrogant and manipulative man who strives, as all-powerful magi do, to reach Akasha, or \"the root of all knowledge\". Although he cares for his daughters and his wife, he appears to be oblivious to the problems and pain they face due to his decisions.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16017-YvEqC99MKJzv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16017
      },
      "rarity": "legendary"
    },
    {
      "id": "waver-velvet",
      "name": "Waver Velvet",
      "alt_names": [
        "ウェイバー・ベルベット",
        "Sir Great Big Ben London Star"
      ],
      "role": "protagonist",
      "description": "__Height:__ 157 cm\n\nWaver Velvet is a nineteen year old student at Clock Tower, an institute of the Magus Association, and mage with a recognized magical lineage of three generations. While he is talented, he is not recognized by his peers or lecturers.\n\nAn intelligent young man, Waver came up with the revolutionary concept that a mage's power could be increased through effort, experience, and knowledge rather than increasing magical potential through that of a mage's heirs. His idea is dismissed by his lecturer, the nobleman Kayneth Archibald El-Melloi, who tears up Waver's manuscript without another thought.",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16023-gfwOgU1743ff.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16023
      },
      "rarity": "legendary"
    },
    {
      "id": "iskandar",
      "name": "Iskandar",
      "alt_names": [
        "イスカンダル",
        "Rider (ライダー)",
        "Alexander the Great",
        "King of Conquerors"
      ],
      "role": "protagonist",
      "description": "__Height:__ 212 cm\n__Master:__ [Waver Velvet](https://anilist.co/character/16023/Waver-Velvet)\n__Catalyst:__ Mantle once worn by Iskandar himself \n__Holy Grail War No.:__ 4th Holy Grail War  \n\nIn Fate/Zero\n~!Rider was originally meant to be summoned by Lord Kayneth El-Melloi Archibald, but due to some circumstances, he ended up being Waver Velvet's servant. Iskandar, or how he refers to himself, the King of Conquerors is a noble and courageous man, who prefers to conquer his enemies by winning without killing and controlling without humiliating. He is known as a marvelous ruler who once almost conquered the whole known world. He is not pragmatic, but is a person who lets history run its course and acts according to his impulses. While he is wild and somewhat inconsiderate to others, his greed ultimately resulted in the happiness of the people he ruled over.  In the new era, Rider is mostly amazed by ordinary modern things, and usually spends his free time exploring modern war vehicles and machinery.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16021-w5Jn1eb807vt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16021
      },
      "rarity": "legendary"
    },
    {
      "id": "gilles-de-rais",
      "name": "Gilles de Rais",
      "alt_names": [
        "ジル・ド・レェ",
        "Caster (キャスター)",
        "Bluebeard",
        "Holy Monster",
        "Demon Marshal"
      ],
      "role": "protagonist",
      "description": "__Height:__ 196 cm  \n\nIn Fate/Zero\n~!He is the Servant of Ryuunosuke Uryuu during the 4th Holy Grail War. Caster derives pleasure from first providing his victims with a moment of relief and hope, before killing them in a variety of horrific manners.  Caster was summoned shortly before the Fourth Holy Grail War began. His Master was Ryuunosuke Uryuu, a serial killer who unwittingly performed a successful summoning ritual using the blood of a murdered family. Like his Master, he is almost devoid of any morality and has no interest in obtaining the Holy Grail. He enjoys offering his victims brief moments of respite, or even the hope of release or escape, before inflicting death through gruesome and horrific means. According to Caster, allowing his victims hope will amplify the despair and terror upon their moment of death, a fact that he revels in. He also uses his magic to warp and twist humans into contraptions for his Master's entertainment, such as turning a girl into a pipe organ. \nIn his past life, he was a French nobleman who was once a comrade-in-arms of Jeanne of Arc. He first introduces himself to his Master as Bluebeard, which is the name of a fictional character based on Gille himself.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16024-MZXEjshw6q6B.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16024
      },
      "rarity": "legendary"
    },
    {
      "id": "ryuunosuke-uryuu",
      "name": "Ryuunosuke Uryuu",
      "alt_names": [
        "雨生龍之介"
      ],
      "role": "protagonist",
      "description": "__Height:__ 174 cm\n__Weight:__ 65 kg\n\nThe master of Caster, Ryuunosuke is a serial killer who summons Caster after murdering a family and using their blood as a component in the summoning ritual. Though he is not a magus, he was selected by the Holy Grail to fulfill the war's requirement of seven Masters and seven Servants. Ryuunosuke knows nothing about magic or the fourth Holy Grail War; his involvement in the war is simply to watch Caster kill people in unique and thrilling ways to relieve boredom.  (source: Type-Moon Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16019-nFljwebXHDqc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16019
      },
      "rarity": "legendary"
    },
    {
      "id": "diarmuid-ua-duibhne",
      "name": "Diarmuid  Ua Duibhne",
      "alt_names": [
        "ディルムッド・オディナ",
        "Lancer",
        "ランサー",
        "Diarmuid O'Dyna",
        "Diarmuid of the Love Spot"
      ],
      "role": "protagonist",
      "description": "__Height:__ 184 cm\n__Weight:__ 85 kg\n__Master:__ Kayneth Archibald El-Melloi\n\nIn Fate/Zero\n~!Lancer is the Servant of Kayneth Archibald El-Melloi during the 4th Holy Grail War. Lancer is generally even-tempered, and absolutely loyal to his Master. He is known for his chivalry and sense of honor, in contrast to the arrogant personality of Kayneth. He shares a bond of mutual respect with rival Servant Saber, his greatest wish being to face her in fair combat.  \n\nLancer is summoned by Kayneth Archibald El-Melloi in the 4th Holy Grail War, who originally intended to summon Rider-class Servant, Iskandar. Because his pupil Waver Velvet stole the artifact he had meant to use as a catalyst, Kayneth summoned Diarmuid Ua Duibhne in Iskandar's stead. Lancer's contract with Kayneth is unique in that, while Kayneth holds the Command Spells, the energy to materialize the Servant is maintained by Sola-Ui, Kayneth's fiancée.  His true identity is Diarmuid Ua Duibhne, the son of Donn, foster son of Aengus Óg and a warrior of the Fianna. Known as Diarmuid of the Love Spot, the appellation resulted from an encounter with Gráinne, a woman who caused a magical love spot to appear on his head. Any woman who looked upon his face would instantly fall in love with him.!~\n\n(Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16022-rdonZr99a9XO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16022
      },
      "rarity": "legendary"
    },
    {
      "id": "kayneth-archibald-el-melloi",
      "name": "Kayneth Archibald El-Melloi",
      "alt_names": [
        "ケイネス・エルメロイ・アーチボルト"
      ],
      "role": "protagonist",
      "description": "__Height:__ 181 cm\n__Weight:__ 62 kg\n\nA nobleman and a renowned mage from the Magus Association, Kayneth was a prodigy among magi, possessing exceptional magical potential and skills. He held the title of Euryphis lecturer within the Clock Tower, a notable mage academy, despite his young age. His magical lineage, going back nine generations, further enhanced his status. His magical abilities were attributed to wind and water, and he is proficient in the magical arts of summoning, alchemy, and spiritual evocation. He is also a teacher of Waver Velvet's, and was responsible for rejecting and tearing up Waver's radical thesis concerning magical potential. This act was in turn directly responsible for driving Waver to, in retaliation, enter the fourth Holy Grail War by stealing a valuable artifact from Kayneth.   Lord El-Melloi is, with regard to magical ability, arguably the most skilled Master in the Fourth Holy Grail War. He excels in magic involving mercury, which he employs to create a variety of attack and defence forms, such as barriers strong enough to resist point blank Claymore Mine blasts and flying blades capable of slicing through stone walls. Lord El-Melloi's mastery is great enough such that his enchanted mercury can react without his conscious control, automatically forming shields against surprise attacks. Kiritsugu Emiya initially regards Kayneth as one of the two most threatening magi involved in the war alongside Tokiomi Tōsaka, though neither are considered the most dangerous to be involved.   He's engaged to Sola-Ui Nuada-Re Sophia-Ri, the daughter of the head of the spiritual evocation division, through an arranged marriage. While Kayneth is in love with her, Sola-Ui despises Kayneth, considering him a coward for not attacking opposing Masters face to face.   Kayneth is the Master of Lancer in the Fourth Holy Grail War. His participation in the War is merely a bid to increase his own prominence within the Magus Association. His initial base of operations was located at the Fuyuki Hyatt Hotel, and protected by twenty-four layers of barriers, numerous summoned monsters, various traps, and mystical spatial alterations in the lobby.   (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16028-ISNmfeK28uCj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16028
      },
      "rarity": "legendary"
    },
    {
      "id": "kariya-matou",
      "name": "Kariya Matou",
      "alt_names": [
        "間桐雁夜"
      ],
      "role": "protagonist",
      "description": "__Height:__ 173 cm\n\nKariya Matou is the uncle of [Shinji Matou](https://anilist.co/character/501), and the first scion of his family to be born with magical potential in several generations. Despite this, he grew disgusted with his family, particularly [Zoken Matou](https://anilist.co/character/16030), and cut all ties with them more than ten years prior to the 4th Holy Grail War. Disappointed with the lack of magical abilities in Shinji, Zoken resented Kariya for allowing the family's magical lineage to decline, especially since a Matō with magical powers was necessary to act as a Master during the Holy Grail Wars.\n\nKariya maintained contact with his childhood friend and love interest [Aoi Zenjou](https://anilist.co/character/16018), though he had willingly given up trying to pursue her affections after she married [Tokiomi Tohsaka](https://anilist.co/character/16017). Aoi would later have two daughters, [Rin](https://anilist.co/character/498) and [Sakura](https://anilist.co/character/500), who were both fond of Kariya.\n\n~!On the last day of the 4th Holy Grail War, [Berserker](https://anilist.co/character/12732) faces off against [Saber](https://anilist.co/character/497), culminating in a battle so ferocious that Berserker draws more mana than Kariya can provide. His Servant killed, Kariya survives long enough to make his way back to the Matou estate, where he is approached by Sakura. He tells her that he has come to rescue her, but collapses at her feet soon after. Kariya dies with a satisfied smile, comforted by dreams of escaping with Aoi, Sakura, and Rin and starting a family together. !~\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16026-cicpiktY4SOs.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16026
      },
      "rarity": "legendary"
    },
    {
      "id": "rin-tohsaka",
      "name": "Rin Tohsaka",
      "alt_names": [
        "遠坂凛",
        "Rin Tousaka",
        "Poppins of July",
        "Red Devil",
        "The Consultant",
        "Red Evil",
        "Kischur's Nightmare"
      ],
      "role": "supporting",
      "description": "__Height:__ 124 cm (Fate/Zero), 159 cm (Fate/stay night)\n\nRin is a model student and idol of Shirou's school. She barely talks to other students in her school and exhibits a desire to be left alone, as exemplified by her tendency to stay on the school's rooftop, away from the rest of the students. She is also secretly a Magus and a Master in the Fifth Holy Grail War. In the beginning of the anime, she summons Archer for her Servant, although she originally wanted to summon Saber. Rin is reared as the successor to her family's magecraft, instructed by her father, Tokiomi Tohsaka, to prioritize sorcery over her own interests. After her father is killed, Rin continues to perfect her sorcery, with some guidance from her guardian, Kirei Kotomine. She strives to earn the admiration of her peers to avoid drawing attention to her private life, even though she is secretly stingy, tomboyish, and a perfectionist. She is perceptive, resourceful and avidly competitive.\n\n~!Rin is Sakura's older sister, but the two were forced to live apart by their father, Tokiomi. Rin once had a good relationship with Sakura before their separation, evident by a ribbon Sakura always kept. Rin later convinced herself that Sakura was living a happier life with the Matou family than she was living as the Tohsaka family heir, and this delusion blinded her to the knowledge that Sakura was only barely keeping her own sanity in check while constantly suffering. Rin went as far as to try to preserve Shirou's life for what she thought was entirely Sakura's sake. Rin had also decided that she would kill Sakura in the events of the Holy Grail War if it came down to it. However, ultimately, she could not bring herself to do it and took the blow without harming her.!~",
      "metadata": {
        "gender": "female",
        "age": "17-19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b498-lwawtSpLyATL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 498
      },
      "rarity": "rare"
    },
    {
      "id": "sakura-matou",
      "name": "Sakura Matou",
      "alt_names": [
        "間桐桜"
      ],
      "role": "supporting",
      "description": "__Height:__ 120 cm (Fate/Zero), 156 cm (Fate/stay night)\n\nA student in her first year of high school, Sakura is the sister of Shinji Mato. After Shirou's father Kiritsugu died, Sakura often visited Shirou's home to help him with his daily chores. She is outwardly shy and timid, but possesses great inner strength. Sakura has a long standing and obvious crush on Shirou Emiya.",
      "metadata": {
        "gender": "female",
        "age": "16-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b500-NQrLbnBr1sDv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 500
      },
      "rarity": "rare"
    },
    {
      "id": "illyasviel-von-einzbern",
      "name": "Illyasviel von Einzbern",
      "alt_names": [
        "イリヤスフィール・フォン・アインツベルン",
        "Illya"
      ],
      "role": "supporting",
      "description": "**Height:** 133 cm\n**Birthday in [Fate/kaleid](https://anilist.co/manga/33526/): **Jul 20\n\nA young Teutonic aristocrat, she traveled to Japan to participate in the Holy Grail War as a Master. Illyasviel has an angelic appearance and an unsurpassed degree of magical power. She lives in a castle on the outskirts of Fuyuki City, accompanied only by her Servant and two maids. Illyasviel asks those she feels comfortable around to simply call her \"Illya\".",
      "metadata": {
        "gender": "female",
        "age": "8 (Fate/Zero), 18 (Fate/stay night)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b503-SmS87yq6l2tD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 503
      },
      "rarity": "rare"
    },
    {
      "id": "lancelot",
      "name": "Lancelot",
      "alt_names": [
        "ランスロット",
        "Knight of the Lake",
        "Berserker",
        "Black Knight",
        "Mad Dog",
        "Sir Lancelot du Lac",
        "Lord of Joyous Gard"
      ],
      "role": "supporting",
      "description": "__Height:__ 191 cm   \n__Weight:__ 81 kg  \n\nIn Fate/Zero\n    ~!Berserker is the Servant of Matou Kariya during the 4th Holy Grail War. Berserker is known to have three distinct Noble Phantasms, as shown on his status page. However, due to the enchantment that obscured his identity, his status page was shown blurred, making it impossible to identify the specific names and natures of his Phantasms, save for the sword Arondight. In addition, this Berserker is uniquely able to make anything he chooses into his own Noble Phantasm and effectively wield them, from telephone poles to the Noble Phantasms of other Servants.\nBerserker's real identity is Lancelot of the Lake. Until his identity was revealed, he had been known simply as the Black Knight.  Lancelot, known as the Knight of the Lake, had been loyal to Artoria, knowing both the king and the secrets of her sword well. Lancelot's downfall began when he loved Artoria's queen. Though the king was actually a woman, Artoria had married in order to present the image of a stable royal family before the kingdom and to maintain the illusion that she was a man in the face of the general public. Her queen willingly sacrificed her own life as a woman in order to fulfill the ideal of the stable government. However, Lancelot and the queen fell in love. Though he wanted to take her away, Lancelot's loyalty to Artoria and his sense of duty to serve the kingdom prevented him from doing so. When political enemies of the king exposed Lancelot and the queen's affair, the queen was ordered to be executed. Left with little choice, Lancelot rebelled in order to try and save her. The knight, the queen, who had made her beloved betray his duty, and the king, who felt responsible for the despair her most loyal servant endured, all suffered. Though Lancelot suffered greatly, he found that he could not hate Artoria, who had never blamed Lancelot for anything regarding the state of affairs they had become entangled in. In his despair, Lancelot desired to become a beast who had no worries; thus, when he became a Heroic Spirit, he became a Berserker-class spirit. !~ (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12732-yayxYNs1FQeF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12732
      },
      "rarity": "rare"
    },
    {
      "id": "aoi-tohsaka",
      "name": "Aoi Tohsaka",
      "alt_names": [
        "遠坂葵"
      ],
      "role": "supporting",
      "description": "__Height:__ 160 cm   \n\nAoi Tohsaka is the childhood friend of Kariya Matou, and became the wife of Tokiomi Tohsaka, adopting his surname. She is the mother of Tokiomi's two daughters, Rin and Sakura.  Aoi is a passive and loyal woman who does not interfere with her husband's affairs, described by Kirei Kotomine as the ideal version of a traditional wife. She accepted Tokiomi's proposal with full knowledge of what it meant to marry a mage. While Kariya loved her as well, he peacefully gave up pursuing her affections because she seemed happy accepting Tokiomi's proposal. It is implied that Aoi and Kariya remained in touch, given that her daughters, especially Sakura, were fond of Kariya's company.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16018-bVrg7lsnSubE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16018
      },
      "rarity": "rare"
    },
    {
      "id": "maiya-hisau",
      "name": "Maiya Hisau",
      "alt_names": [
        "久宇舞弥"
      ],
      "role": "supporting",
      "description": "__Height:__ 161cm   \n\nA young woman who acts as Kiritsugu Emiya's assistant during the fourth Holy Grail War. She is cold and professional, which makes it easier for Kiritsugu to act as he needs to.  Little is known about her history, save that Kiritsugu had rescued her from a war-torn land many years ago. When Maiya was a child, she was forced into the army and trained to be a soldier. She later reveals to Irisviel von Einzbern, Kiritsugu's wife, that she had been raped by other soldiers and later lost her child. After rescuing her, Kiritsugu became Maiya's mentor and taught her his way of life.   \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16020-unVmGwhB9rhm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16020
      },
      "rarity": "rare"
    },
    {
      "id": "hassan-i-sabbah",
      "name": "Hassan-i-Sabbah",
      "alt_names": [
        "ハサン・サッバーハ",
        "Assassin",
        "アサシン",
        "Hassan of the Hundred Faces",
        "Old man of the Mountain"
      ],
      "role": "supporting",
      "description": "One of the nineteen leaders of the Hashshashin sect and the 19th who took the name of Hassan-i-Sabah and the mantle of Old man of the Mountain.\n\nThis particular individual suffered from Multiple Personality Disorder which he utilized to compartmentalize his abilities. This gave his Noble Phantasm the ability to manifest his different personalities as separate and autonomous entities. Though they differ in terms of build and sex, the different personas share similar characteristics: they have dark brown skin, purple hair (for those who have it) and wear white skeletal masks. \n\nLike all other Hassan-i-Sabah, he can be summoned only in the Assassin Class with the class itself acting as a catalyst.\n\n__Personas:__\n• Asako (アサ 子)\n• Big Assassin (でかアサシン)\n• Child Assassin (ちびアサシン)\n• Macour the Quick (迅速のマクール)\n• Strange Arm Gozour (怪腕のゴズール)\n• Zayd the Base (基底のザイード)\n• more...\n\n__In Fate/Zero__\n\n~!\nAssassin serves as the Servant of Kirei Kotomine in the 4th Holy Grail War being mainly occupied with reconnaissance duties. The main personality that interfaces with Kirei is a young woman by the name of Asako.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16025-K9BmRRDigyWU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16025
      },
      "rarity": "rare"
    },
    {
      "id": "jubstacheit-von-einzbern",
      "name": "Jubstacheit von Einzbern",
      "alt_names": [
        "ユーブスタクハイト・フォン・アインツベルン",
        "Acht"
      ],
      "role": "supporting",
      "description": "The eighth and current head of the Einzbern family. He wasn't around during Justica's era, but he has kept himself alive for nearly two centuries by continuously prolonging his life. He has a white beard that makes one think of a frozen waterfall, and Emiya Kiritsugu notices an astute light from his eyes that makes it impossible to see any senility and constantly brings about a feeling of bias and pressure every time Acht's gaze meets him.   (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16027-zyB9gRx2MgnB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16027
      },
      "rarity": "rare"
    },
    {
      "id": "risei-kotomine",
      "name": "Risei Kotomine",
      "alt_names": [
        "言峰璃正"
      ],
      "role": "supporting",
      "description": "Kirei Kotomine's 80 year old father, Risei is a priest in the Church and the regulator of the third and fourth Holy Grail Wars. A friend of Tokiomi Tōsaka's, Risei actively supports him and conspires to ensure that Tokiomi will obtain the Holy Grail in the war, despite the fact that as a member of the Church, he should be ensuring only someone who is worthy of the a powerful artifact like the Grail should be obtaining it.  While he is proud of his son, who has demonstrated himself to be a perfect heir, Risei fails to understand Kirei in any sense. He believes that his son, who has recently lost his wife of two years, may be able to find some purpose in life again by aiding Tokiomi during the Holy Grail War.  Both Risei and Tokiomi, upon discovering that Kirei's command mantra had appeared three years before the start of the war, both came to believe that Kirei was destined to provide Tokiomi with an additional Servant and associated command spells for the upcoming war. Without informing Kirei as to the true nature of the mark that appeared, they transfer Kirei from the Church to the Mages Association as Tokiomi's pupil. Neither man reveals to Kirei that he can also obtain the Holy Grail, instead telling the young man that he is performing a mission for the Church.   ~!According to Kirei Kotomine in Fate, his father died trying to protect him. As revealed in Fate/Zero, after Caster's defeat, Kayneth Archibald El-Melloi approached Risei to obtain additional command spells. After Risei reluctantly gives what Lord El-Melloi has come for, the Master shoots Risei and leaves him to die. As he dies, Risei leaves behind a message containing a secret password that will provide his son with all the remaining command spells Risei could give out. Kirei arrives to find his father dead and his father's final parting gift, and comes to the conclusion that Risei died trying to protect him. Though Kirei sheds tears realizing his father cared about him till the end, he finds himself feeling the same feelings he felt when his wife died - the desire to have seen them die.!~  (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16029-DluHAqHQZmo1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16029
      },
      "rarity": "rare"
    },
    {
      "id": "zouken-matou",
      "name": "Zouken Matou",
      "alt_names": [
        "間桐臓硯",
        "Zouken Makiri",
        "Makiri Zolgen",
        "Zoken Matou"
      ],
      "role": "supporting",
      "description": "A shrewd, powerful, but ancient sorcerer, Zoken is the patriarch of the Matou family and is known to be the grandfather of Shinji and Sakura. He has amassed a large and extensive library of sorcerous knowledge, yet his lessons are strict and harsh. Zoken considers Shinji to be a disgrace of a sorcerer and believes Sakura may have more potential than her brother.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16030-WezL5e1dt9kr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16030
      },
      "rarity": "rare"
    },
    {
      "id": "sola-ui-nuada-re-sophia-ri",
      "name": "Sola-Ui Nuada-Re Sophia-Ri",
      "alt_names": [
        "ソラウ・ヌァザレ・ソフィアリ"
      ],
      "role": "supporting",
      "description": "__Height:__ 165 cm   \n\nThe daughter of the head of the spiritual evocation division of the Clock Tower of the Magus Association. She is engaged to Kayneth Archibald El-Melloi as a result of a strategic marriage arrangement. As her older brother (to whom the Sophia-Ri family had entrusted its magic crest) had achieved little success as a mage, her family sought to marry her to the celebrated Lord El-Melloi in an attempt to salvage the family name.  Sola-Ui is introduced in Volume 2 of Fate/Zero as Kayneth's fiancée - and apparently one who does not get along with her intended husband. While Kayneth acts as Lancer's Master, Sola-Ui is revealed to be the one supplying the Servant with magical energy.  Sola-Ui openly calls Kayneth a coward for not facing the other Masters face-to-face, and criticizes his tactics when commanding Lancer in battle. However, she is chastised by Lancer, who resents her reprimanding of his Master, and immediately backs down. Kayneth in turn views her apparent submission to Lancer as evidence of her developing affections for the Servant.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16032-lgeTalPU2c0u.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16032
      },
      "rarity": "rare"
    },
    {
      "id": "natalia-kaminski",
      "name": "Natalia Kamiński",
      "alt_names": [
        "ナタリア・カミンスキー"
      ],
      "role": "supporting",
      "description": "A freelance mercenary who sold information concerning Noritaka and his research on vampires. She rescues a young Kiritsugu and takes him as her apprentice. During her last mission, she is able to successfully kill a Dead Apostle,  ~!but dies when Kiritsugu shoots down the plane she is on to prevent the infected passengers from infecting others when the plane landed. Kiritsugu's last words to her reveal that he viewed her as his mother.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16035-d63WNTgYUNIX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16035
      },
      "rarity": "rare"
    },
    {
      "id": "leysritt",
      "name": "Leysritt",
      "alt_names": [
        "リーゼリット",
        "Liz"
      ],
      "role": "supporting",
      "description": "Leysritt is a homunculus created by the Einzbern family to serve as a maid much like Sella. Despite her appearance, she is only about two years old.\n\nRegardless of her thin ego, she developed a sense of reason due to her alignment with Illya. As a result, Leysritt often says what she thinks without any consideration and this gets her often into a verbal conflict with Sella.\n\nShe and Illya are actually very close friends and should Illya die, Leysritt would die as well. In contrast to Sella, she possesses a casual personality but has difficulty expressing her emotions and comes across as robotic at times. However, she appears to enjoy teasing Sella and also takes a liking to Shirou because his presence makes Illya happy.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24333-alhbcqCDBbzZ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24333
      },
      "rarity": "rare"
    },
    {
      "id": "martha-mackenzie",
      "name": "Martha Mackenzie",
      "alt_names": [
        "マーサ・マッケンジー"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b51305-AhcWmCegkqyW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51305
      },
      "rarity": "rare"
    },
    {
      "id": "glen-mackenzie",
      "name": "Glen Mackenzie",
      "alt_names": [
        "グレン・マッケンジー"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b52245-KxFhIfYBxIa6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 52245
      },
      "rarity": "rare"
    },
    {
      "id": "fionn-mac-cumhaill",
      "name": "Fionn mac Cumhaill",
      "alt_names": [
        "フィン・マックール"
      ],
      "role": "supporting",
      "description": "Fionn mac Cumhaill is leader of the Fianna knights of legend and lord of Diarmuid Ua Duibhne, the Lancer of the 4th Holy Grail War.   ~! He was the intended husband of Princess Grainne, whom Diarmuid inadvertently charmed with his Mystic Face. He was thus forced to elope with her, and Fionn, driven by jealousy, sent many pursuers after them. After some times, Fionn acknowledged their marriage, and reconciled with Diarmuid. Still, his resentment remained, and eventually drove him to leave Diarmuid for death when the warrior was fatally injured by a boar during their hunting trip.   Even after his death, Diarmuid resented neither Fionn nor Grainne, and regretted only that he could not follow his path of loyalty to Fionn. For this reason, Diarmuid participated in the War, in order to have a second chance of fighting for his master. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b52491-5jBBfGBbKVqJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 52491
      },
      "rarity": "rare"
    },
    {
      "id": "grainne",
      "name": "Grainne",
      "alt_names": [
        "グラニア"
      ],
      "role": "supporting",
      "description": "Princess Gráinne, daughter of the High King of Ireland Cormac mac Airt is the betrothed of Fionn mac Cumhaill, leader of the Fianna knight and lord of Diarmuid Ua Duibhne, the Lancer of the 4th Holy Grail War.   ~!  True to the legend, she fell in love with Diarmuid under the influcence of his Mystic Face (originated from the beauty mark under his right eye), and placed a geis on him so that he would run away with her on the night of her wedding to Fionn. As Diarmuid considered the geis a test of his honor, and knew that Gráinne fell prey to his curse, Diarmuid accepted her proposal and the two fled, besieged by Fionn's many warriors on the way. Finally, when Fionn accepted their marriage, Diarmuid was overjoyed to return to his service.  During a wild boar hunt, Diarmuid was fatally injured, and nothing but water drunk from Fionn's hands could save him. However, due to his lingering resentment, Fionn let the water slipped from his hands twice, and when he brought the water back to Diarmuid for the third time, Diarmuid was dead.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b52493-pff5Yn3bfoQR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 52493
      },
      "rarity": "rare"
    },
    {
      "id": "kotone",
      "name": "Kotone",
      "alt_names": [
        "コトネ"
      ],
      "role": "supporting",
      "description": "Rin's classmate.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b52829-tkzC9k9rdIq9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 52829
      },
      "rarity": "rare"
    },
    {
      "id": "jeanne-darc",
      "name": "Jeanne  d'Arc",
      "alt_names": [
        "ジャンヌ・ダルク",
        "Ruler (ルーラー)",
        "Joan of Arc",
        "The Maid of Orléans",
        "Holy Maiden of Salvation",
        "Juana de Arco",
        "La Pucelle d'Orléans",
        "The Maiden of Orleans",
        "St. Joan"
      ],
      "role": "minor",
      "description": "__Height:__ 159 cm (5'3)\n\nRuler's True Name is Jeanne d'Arc, the Saint of Orleans. A Catholic saint born in Domrémy, France, and the heroine of France who liberated Orléans in the Hundred Years' War.\n\nA Ruler Class Servant is the Standard-Bearer who Correctly Guides the Holy Grail War. Jeanne is a special Heroic Spirit summoned by the Holy Grail itself to act as the administrator of the Holy Grail War instead of the Church. Being summoned in the Ruler class also allows her to retain the memories of each repeating \"game\" unlike other Servants.\n\nJeanne d'Arc was a common farmer's daughter. She claims she had received the command of God to fight. She heard the Lord’s lament that the world changed straight into hell. The Lord wept into sorrow as no one could stop it and people were not even allowed to live simply, and were compelled to become either beasts or food. Conflict never ended, and blood continued to rain incessantly and soak the land. She received a revelation from the Lord, the voice contained no glory or victory, no obligation or sense of purpose but only the Lord laments. She caught his small, feeble murmurs that everyone else failed to hear. \n\nJeanne also has a minor cameo in the second season of Fate/Zero.",
      "metadata": {
        "gender": "female",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b67769-6TSfn8kz4KVf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 67769
      },
      "rarity": "uncommon"
    },
    {
      "id": "mordred-pendragon",
      "name": "Mordred Pendragon",
      "alt_names": [
        "モードレッド",
        "The Knight of Treachery",
        "Saber of Red",
        "Aka no Saber"
      ],
      "role": "minor",
      "description": "Mordred is the \"son\" of King Arthur though, in reality, she is a woman. \n\nMorgan le Fay, Artoria's sister, created Mordred as a homunculus clone of the King. Morgan grew Mordred in secret, inculcating her the desire to usurp the King and ascend to the throne as the rightful heir. To achieve this objective Mordred was made to be one of the Knights of the Round Table. \n\nWith time Mordred grew to idolize her \"father\", but the King refused to recognize her as a rightful heir. These clashing feelings of love and hate made Mordred play an important role in the fall of Camelot.\n\nIn Fate/Apocrypha\n\n~!Mordred is the Saber-class Servant of Kairi Sisigou as part of the Red Faction in the Turifas Holy Grail War.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b55977-wqiEfiJUuEFw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 55977
      },
      "rarity": "uncommon"
    },
    {
      "id": "dekorou",
      "name": "Dekorou",
      "alt_names": [
        "デコ朗"
      ],
      "role": "minor",
      "description": "He’s a soldier from Iskandar’s Ionioi Hetairoi.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b245712-wQqWLz5vzsUj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 245712
      },
      "rarity": "uncommon"
    },
    {
      "id": "eumenes",
      "name": "Eumenes",
      "alt_names": [
        "エウメネス",
        "Long Hair"
      ],
      "role": "minor",
      "description": "Eumenes is a soldier of Iskandar's army. He is a Non-classed Servant summoned by Iskandar's Noble Phantasm Ionioi Hetairoi. Eumenes has long dark hair and closely resembles Lord El-Melloi II, Iskandar's Master.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b245713-rpAIIqk9ZVgk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 245713
      },
      "rarity": "uncommon"
    },
    {
      "id": "chuu-wake",
      "name": "Chuu Wake",
      "alt_names": [
        "中分け"
      ],
      "role": "minor",
      "description": "A soldier from Iskandar’s Ionioi Hetairoi.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b245714-Ki5YsxSI9nQC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 245714
      },
      "rarity": "uncommon"
    },
    {
      "id": "ptolemy",
      "name": "Ptolemy",
      "alt_names": [
        "プトレマイオス",
        "Erect Member",
        "Ptolemaios",
        "Ptolemaeus",
        "Ptolemy I Soter"
      ],
      "role": "minor",
      "description": "Ptolemy is a soldier of Iskandar's army. He is a Non-classed Servant summoned by Iskandar's Noble Phantasm Ionioi Hetairoi. Like all of his fellow comrades in Ionioi Hetairoi, he is unquestionably loyal to Iskander and always supports his cause.\n\nWhile this younger version embodies his youth as a soldier under Alexander the Great, his older version embodies him as an old man and the ruler of Egypt.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b245715-7HD3EApk8tth.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 245715
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-23T01:44:45.744Z"
}