{
  "id": "fatezero",
  "type": "anime",
  "title": "Fate/Zero",
  "alt_titles": [
    "Fate/Zero",
    "Fate/Zero"
  ],
  "source": "AniList",
  "source_id": 10087,
  "description": "With the promise of granting any wish, the omnipotent Holy Grail triggered three wars in the past, each too cruel and fierce to leave a victor. In spite of that, the wealthy Einzbern family is confident that the Fourth Holy Grail War will be different; namely, with a vessel of the Holy Grail now in their grasp. Solely for this reason, the much hated \"Magus Killer\" Kiritsugu Emiya is hired by the Einzberns, with marriage to their only daughter Irisviel as binding contract.\n\nKiritsugu now stands at the center of a cutthroat game of survival, facing off against six other participants, each armed with an ancient familiar, and fueled by unique desires and ideals. Accompanied by his own familiar, Saber, the notorious mercenary soon finds his greatest opponent in Kirei Kotomine, a priest who seeks salvation from the emptiness within himself in pursuit of Kiritsugu.\n\nBased on the light novel written by Gen Urobuchi, Fate/Zero depicts the events of the Fourth Holy Grail War—10 years prior to Fate/stay night. Witness a battle royale in which no one is guaranteed to survive.\n\n(Source: MAL Rewrite)\n\nNote: The first episode aired with a runtime of ~48 minutes as opposed to the standard 24 minute long episode.",
  "metadata": {
    "format": "TV",
    "status": "FINISHED",
    "startDate": "2011-10-02",
    "endDate": "2011-12-25",
    "genres": [
      "Action",
      "Drama",
      "Fantasy",
      "Supernatural"
    ],
    "averageScore": 81,
    "popularity": 317221,
    "episodes": 13
  },
  "images": [
    {
      "url": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/medium/bx10087-M4Hd9qrHGrXk.png",
      "type": "cover",
      "source": "AniList"
    },
    {
      "url": "https://s4.anilist.co/file/anilistcdn/media/anime/banner/10087-32MFY9VnJQ7I.jpg",
      "type": "banner",
      "source": "AniList"
    }
  ],
  "external_ids": {
    "anilist": 10087
  },
  "tags": [
    "Battle Royale",
    "Magic",
    "Mythology",
    "Tragedy",
    "Ensemble Cast",
    "Anti-Hero",
    "Urban Fantasy",
    "Primarily Adult Cast",
    "Death Game",
    "Dissociative Identities",
    "Assassins",
    "Religion",
    "Philosophy",
    "War",
    "Gore",
    "Spearplay",
    "Swordplay",
    "Urban"
  ],
  "updated_at": "2025-12-23T01:44:45.738Z",
  "created_at": "2025-12-22T21:16:52.205Z",
  "enriched": false
}