{
  "work_id": "seraph-of-the-end-vampire-reign",
  "count": 24,
  "characters": [
    {
      "id": "yuuichirou-hyakuya",
      "name": "Yuuichirou Hyakuya",
      "alt_names": [
        "百夜優一郎"
      ],
      "role": "protagonist",
      "description": "__Height:__ 170 cm (5'7\")\n\nYuuichirou is a member of the Japanese Imperial Demon Army and Shinoa Hiragi's squad in the Moon Demon Company. He, along with Mikaela Hyakuya, possesses the \"Seraph\" gene, which is relevant to the forbidden taboo and the focal point of the story, \"Seraph of the End\".\n\nYuuichirou seems to be an excellent swordsman, as he was trained by Guren himself. He is also a \"seraph of the end\" with 1/10th of him being not human; he may have been experimented on by the Hyakuya, but this is unclear since the adults in charge of him were killed minutes after he arrived at the orphanage.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": "2004-10-16"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83015-XmUdY42WSKRG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83015
      },
      "rarity": "legendary"
    },
    {
      "id": "shinoa-hiiragi",
      "name": "Shinoa Hiiragi",
      "alt_names": [
        "柊シノア"
      ],
      "role": "protagonist",
      "description": "__Height:__ 150 cm (4'11\")\n\nShinoa Hiiragi is Guren's sergeant and one of the squad leaders of the Moon Demon Company. She is appointed to supervise Yuuichirou during his suspension from the Japanese Imperial Demon Army for his reckless behavior. She is sarcastic and enjoys teasing others, especially Yuuichirou. \n\nHer Demon Weapon is Shikama Douji (四鎌童子, lit. Four-Scythe Child), a manifestation-type demon weapon which takes the form of a large scythe, but can be condensed into a pen-like object. She can call out the demon, which she fondly addresses as \"Shi,\" inhabiting it out of the weapon to attack an enemy. Her primary ability is to detect anything that comes within the attack radius of her scythe.\n\nDespite being a member of the distinguished Hiiragi family, Shinoa is uninterested in their internal power struggle. Moreover, due to her sister's legacy, she is generally shunned by the upper echelon of the army. However, she is loyal to Guren and to the members of her squad. \n\nA childhood lacking in familial warmth left Shinoa with little understanding of the importance of friendship and camaraderie. She is moved by Yuuichirou's unwavering loyalty to the members of his squad, who he considers his family, and wants to foster the same feelings for them herself.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": "2005-12-25"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83017-XXdnbunnBdTd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83017
      },
      "rarity": "legendary"
    },
    {
      "id": "mikaela-hyakuya",
      "name": "Mikaela Hyakuya",
      "alt_names": [
        "百夜ミカエラ",
        "Mika"
      ],
      "role": "protagonist",
      "description": "__Height:__ 173 cm (5'8\")\n\nThe deuteragonist of the Owari no Seraph series. He is an incomplete vampire and a servant of Third Progenitor Krul Tepes. He was human until Krul Tepes forced him to drink her blood. He, along with Yuuichirou Hyakuya, possesses the \"Seraph\" gene, which is relevant to the forbidden taboo and the focal point of the story, \"Seraph of the End.\"\n\nHe wields a red colored sword. When he orders it to drink his blood, it sprouts thorny vines that pierce his hand. His strength grows in proportion to the amount of his blood the sword drinks.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": "2004-05-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b87287-cBUVUJNbvfvT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87287
      },
      "rarity": "legendary"
    },
    {
      "id": "shihou-kimizuki",
      "name": "Shihou Kimizuki",
      "alt_names": [
        "君月士方"
      ],
      "role": "protagonist",
      "description": "__Height:__ 177 cm (5'9\")\n__Race__: Human\n\nKimizuki is a serious and diligent person. He is competitive against Yuuichirou Hyakuya. He earned the highest test scores in their class, and he is angry when Yuuichirou appears out of nowhere and may earn Cursed Gear before him. He is hot-headed and tends to get in fights with both Mitsuba and Yuuichirou.\n\nHe is tidy and skilled at cooking. When his friends are unconscious or injured, he is the first to take care of them, whether it be nursing them or giving them his jacket to keep them warm.\n\nAlthough the other members of his squad quickly refer to each other on a first-name basis, he is the only member the others address with his surname. Kimizuki has very high intelligence and was at the top of his class in all subjects, and regularly earned perfect scores. He earned 100s on each of his Latin, English, and Japanese spellcraft exams. He is on par with Yuichiro on skills of swordsmanship.",
      "metadata": {
        "dateOfBirth": "2004-11-26"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/88912-HVslXuJNgNQc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88912
      },
      "rarity": "legendary"
    },
    {
      "id": "yoichi-saotome",
      "name": "Yoichi Saotome",
      "alt_names": [
        "早乙女与一"
      ],
      "role": "protagonist",
      "description": "__Height:__ 165 cm (5'5\")\n__Race__: Human\n__Affiliation__: Japanese Imperial Demon Army\n__Section__: Moon Demon Squad\n__Demon Weapon Series__: Black Demon Series\n__Demon__: Gekkouin\n\nHe is a member of the Japanese Imperial Demon Army and Shinoa Hīragi's squad in the Moon Demon Company.\n\nYoichi has an equilibrium of kindness and altruism, giving him an optimistic and sweet personality. This gives him a strong mental balance against his demon, who takes the form of his sister. He lacked passion to kill vampires and fight and avenge his sister originally, but as he got to know his new \"family\", he began to see the reason that he was there. Yoichi does dislike conflict amongst friends, but conflict on the battle field doesn't bother him anymore. As time passed, Yoichi is shown to be much more confident with his skills, sniping down three Horsemen at ease by himself.\n\nYoichi is usually the peace maker around Shinoa's Squad. Yuichiro and Kimizuki are usually fighting, and Yoichi often ends up in the middle of it. He has developed a love for his \"family\" that impacted his personality greatly. He used to get very nervous and stutter a lot, but the closer he got to the Squad, the more confident he got. He doesn't question his self-worth as much as before, and instead focuses more on protecting his new \"family\".",
      "metadata": {
        "dateOfBirth": "2004-11-23"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/88988-ioriKKJJQNat.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88988
      },
      "rarity": "legendary"
    },
    {
      "id": "guren-ichinose",
      "name": "Guren Ichinose",
      "alt_names": [
        "一瀬グレン",
        "Baka-Guren"
      ],
      "role": "protagonist",
      "description": "__Height:__ 183 cm (6'0\")\n__Race:__ Human\n__Section:__ Moon Demon Squad \n__Demon Weapon Series:__ Black Demon \n__Demon:__ Mahiru-no Yo\n\nHe is a Lieutenant Colonel of the Japanese Imperial Demon Army and the commanding officer of the Vampire Extermination Unit, Moon Demon Company.\n\nGuren would become a wise leader who values teamwork, co-operation and friends, and determined those were necessary to ensure the survival of the human race from demons and vampires. Sometimes pretending to be lazy, in truth, he really works hard. He keeps many secrets to himself, and has no difficulty lying about them. When enduring hardships in battle, he will focus on winning and take the most direct path to that.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": "1996-08-28"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88993-YNw36YYleasn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88993
      },
      "rarity": "legendary"
    },
    {
      "id": "mitsuba-sanguu",
      "name": "Mitsuba Sanguu",
      "alt_names": [
        "三宮三葉"
      ],
      "role": "protagonist",
      "description": "__Birthday:__ July 7, 2004\n__Height:__ 155cm (5'1\")\n__Weight:__ 44kg (97 lbs)\n__Race:__ Human\n__Affiliation:__ Japanese Imperial Demon Army\n__Section:__ Moon Demon Squad\n__Demon Weapon Series:__ Dakini\n__Demon:__ Tenjiryū\n\nA member of the Japanese Imperial Demon Army and a member of Yuu's team of the Moon Demon Squad. She also the younger sister of Aoi Sanguu.\n\nMitsuba is shown to be a serious and by-the-book soldier, who dislikes those who break the formation and commit to individual action. In reality, she is a talkative, selfish girl. Despite this, she gets jealous easily. Mitsuba appears to be the most talkative girl in her group.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135250-fCoUY2wGYLUw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135250
      },
      "rarity": "legendary"
    },
    {
      "id": "ashuramaru",
      "name": "Ashuramaru",
      "alt_names": [
        "阿朱羅丸"
      ],
      "role": "supporting",
      "description": "The demon into the black series demon blade used by Yuuchirou.\n\nIt often warns Yuuchirou about how humans are dangerous and can't be trusted.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/88888-4JoZHEeFDtOo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88888
      },
      "rarity": "rare"
    },
    {
      "id": "krul-tepes",
      "name": "Krul Tepes",
      "alt_names": [
        "クルル・ツェペシ",
        " Queen Krul",
        "Krullie"
      ],
      "role": "supporting",
      "description": "**Height**: 145 cm (4'9\")\n\nKrul Tepes is a third progenitor among the vampires and the former vampire queen of Japan. \n\nJust like all other vampires, she views the humans as nothing more than livestock. She sees them as foul and endlessly greedy creatures who will do anything for their own personal gain. When Ferid Bathory slaughters the Hyakuya Sect orphans she carefully hid in Sanguinem and protected as livestock, she becomes enraged because he fatally wounded one of the seraph and allowed another to escape. She never mentions a word about the orphans and displays no interest in them. She saves Mika's life against his will by turning him into a vampire, but this appears to have been done for her own personal interests. He refuses to drink human blood, so she gives her blood to him in exchange for making him dependent on her. Even so, she is the only vampire who shows him kindness, and there are several moments when she hugs him or treats him gently. After developing a close bond with Mika, she shows concern for his family member, Yūichirō Hyakuya. She claims to like both Mika and Yu. However, it is uncertain if this is due to her close relation with Mika and concern for Mika's sake or if this is because she wants to use the seraph for her own purposes. She also appears to trust Mika, and only she and Mika appear to know Krul's true goals.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88899-ydsougsJFwCi.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88899
      },
      "rarity": "rare"
    },
    {
      "id": "ferid-bathory",
      "name": "Ferid Bathory",
      "alt_names": [
        "フェリド・バートリー"
      ],
      "role": "supporting",
      "description": "He is a seventh progenitor among the vampires. He is the one who killed Yuuichirou's family, thus fueling his desire for revenge against all vampires.\n\nOn the outside, Ferid acts kind and polite. However, he keeps many secrets which he has ready to deploy, and tells equally as many lies, similarly to use as and when they are best served. Extremely sadistic, Ferid will go to lengths to prepare, and then carry about murderous acts on a whim. A sense of pleasure appears to be gained in patiently manipulating others in order to torment them. Preferring the blood of beautiful boys and girls, he has kept many mansions filled with them over the centuries. Once he loses interest in one to the point of forgetting the child's name, Ferid kills him or her.\n\nChatty, Ferid strikes up conversations with other vampires, and will speak calmly even in tense scenarios where he has the air of very much being in control of a situation.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88990-GQCTvKZPTg3h.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88990
      },
      "rarity": "rare"
    },
    {
      "id": "mito-juujou",
      "name": "Mito Juujou",
      "alt_names": [
        "十条美十",
        "Mito Jujo"
      ],
      "role": "supporting",
      "description": "She is a Colonel of the Japanese Imperial Demon Army and a member of Guren's squad in the Moon Demon Company. She is also the daughter of the prestigious Jujo family.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88991-2LVJtxBEWetz.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88991
      },
      "rarity": "rare"
    },
    {
      "id": "shinya-hiiragi",
      "name": "Shinya Hiiragi",
      "alt_names": [
        "柊深夜"
      ],
      "role": "supporting",
      "description": "__Height:__ 183 cm (6'0\")\n__Race:__ Human\n__Affiliation:__ Japanese Imperial Demon Army\n__Section:__ Moon Demon Squad\n__Demon Weapon Series:__ Black Demon Series\n__Demon:__ Byakomaru\n\nA Major General of the Japanese Imperial Demon Army. Although he has a high capacity for spellcraft since childhood, Shinya is not comfortable with being with the Hiiragi Family. Shinya is shown to be a gentle and cool man. He does not get angry easily, even when being insulted by Seishirō. \n\nHe is seen smiling pleasantly all the time, even in tough spots. He has a lighthearted and breezy personality. Shinya is shown to be very loyal to his friends, such as Guren. He is also very observant and perceptive, and easily grasps Guren's emotions.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": "1996-11-22"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88992-uoCcUGTnJYua.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88992
      },
      "rarity": "rare"
    },
    {
      "id": "seishirou-hiiragi",
      "name": "Seishirou Hiiragi",
      "alt_names": [
        "柊征志郎"
      ],
      "role": "supporting",
      "description": "Seishiro Hiiragi is a Major General of the Japanese Imperial Demon Army.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": "1997-01-25"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/89785-rJUVdLTloi00.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89785
      },
      "rarity": "rare"
    },
    {
      "id": "tenri-hiiragi",
      "name": "Tenri Hiiragi",
      "alt_names": [
        "柊 天利"
      ],
      "role": "supporting",
      "description": "Tenri Hiiragi is the general of the Japanese Imperial Demon Army.\n\n(Source: MAL)",
      "metadata": {
        "dateOfBirth": "1971-09-27"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/89786-SwsXt370d3UQ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89786
      },
      "rarity": "rare"
    },
    {
      "id": "crowley-eusford",
      "name": "Crowley Eusford",
      "alt_names": [
        "クローリー・ユースフォード"
      ],
      "role": "supporting",
      "description": "Crowley is a Thirteenth Progenitor among vampires and a member of Seventh Progenitor Ferid Bathory's faction. However, he hides his strength under Ferid's orders and is actually equal in strength to a Seventh Progenitor.\nCrowley is calm and brave which makes him a patient vampire who enjoys fighting any opponent. Even when he is in a tight spot, he remains calm with a pleasant smile.\n\nDespite sticking to Ferid, he appears to be emotionally detached from him, such as throwing the latter out of the bus as \"revenge\". Crowley also appears to be quite unimpressed with Ferid half of the time, calling his antics \"stupid\" and even sympathizing for the children getting dragged into the mess that Ferid created. He also doesn't appear to trust Ferid and is not afraid to be blunt to him for it.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90238-30bYmZ1vqDzs.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90238
      },
      "rarity": "rare"
    },
    {
      "id": "kureto-hiiragi",
      "name": "Kureto Hiiragi",
      "alt_names": [
        "柊暮人",
        "Kureto Hīragi"
      ],
      "role": "supporting",
      "description": "__Race:__ Human__\n__Height:__ 187 cm (6'1\")\n__Section:__ Shibuya Main Army\n__Demon Weapon Series:__ Black Demon\n__Demon:__ Raimeiki\n\nHe is the Lieutenant General of the Japanese Imperial Demon Army. His goal is to exterminate all the vampires in Japan and find the person who is manipulating the Hīragi family. He and Mahiru were in competition to be the next head of the Hīragi family. He was the student council president of First Shibuya High. He maintained his position as top of his class since first entering the school. He mentions to Guren that his decisions hold more weight at the school than the principal's. \n\n~!He later becomes​ the head of the Hīragi Family as well as the Japanese Imperial Demon Army, by killing his own father.!~",
      "metadata": {
        "gender": "male",
        "age": "17-25",
        "dateOfBirth": "1995-03-31"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135241-l3qu5ffyHUxn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135241
      },
      "rarity": "rare"
    },
    {
      "id": "norito-goshi",
      "name": "Norito  Goshi",
      "alt_names": [
        "五士典人"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 185 cm (6'1\")\n__Affiliation:__ Order of the Imperial Demons, Japanese Imperial Demon Army\n__Section:__ Moon Demon Company, Guren Squad\n__Rank:__ Colonel\n\nColonel in the Japanese Imperial Demon Army.",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": "1996-05-15"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135248-50MxOT6tcFGZ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135248
      },
      "rarity": "rare"
    },
    {
      "id": "sayuri-hanayori",
      "name": "Sayuri  Hanayori",
      "alt_names": [
        "花依小百合"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 160 cm (5'3\") (Catastrophe) 165 cm (5'5\") (Vampire Reign)\n__Affiliation:__ Order of the Imperial Moon, Japanese Imperial Demon Army, Guren Ichinose's Aides\n__Section:__ Moon Demon Company, Guren Squad\n__Rank:__ Second Lieutenant\n\nShe is a second lieutenant of the Japanese Imperial Demon Army and a member of Guren's squad in the Moon Demon Company. While serving as a member of the Moon Demon Company, she is also an Army instructor for the training classes. Sayuri belongs to a retainer house that serves the Ichinoses. Sayuri is shown to be quite perceptive at times, observing how Yu and his friends are much stronger than she is, when she was 16. \n\n~!She had a crush on Guren and was his emotional support.!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": "1996-05-23"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135249-vOv9xJMk95Ug.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135249
      },
      "rarity": "rare"
    },
    {
      "id": "shigure-yukimi",
      "name": "Shigure Yukimi",
      "alt_names": [
        "雪見時雨"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 150 cm (4'11\") (Catastrophe) 151 cm (4'11½\")[1] (Vampire Reign)\n__Affiliation:__ Order of the Imperial Moon, Japanese Imperial Demon Army, Guren Ichinose's Aides\n__Section:__ Moon Demon Company, Guren Squad\n__Rank:__ Second Lieutenant\n\nShe is a second lieutenant of the Japanese Imperial Demon Army and a member of Guren's squad in the Moon Demon Company. Like Sayuri Hanayori, Shigure is also a servant for the Ichinose Family. \n\n~!Similar to Sayuri, she's very protective of Guren, and does not hesitate to carry out his orders. Like Sayuri, she also has a crush on Guren, but does not show it often.!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": "1996-05-10"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135251-U6WqpdmDpUdK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135251
      },
      "rarity": "rare"
    },
    {
      "id": "horn-skuld",
      "name": "Horn  Skuld",
      "alt_names": [
        "ホーン・スクルド"
      ],
      "role": "supporting",
      "description": "Horn Skuld is a vampire noble who serves Thirteenth Progenitor Crowley Eusford. She is fond of both him and her partner, Seventeenth Progenitor Chess Belle, and she can usually be found in their company.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135255-RJ53Yz3cHmOQ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135255
      },
      "rarity": "rare"
    },
    {
      "id": "akane-hyakuya",
      "name": "Akane  Hyakuya",
      "alt_names": [
        "百夜 茜"
      ],
      "role": "supporting",
      "description": "One of the orphans from Hyakuya Orphanage along with Yuuichirou and Mika. Being the eldest in their group, she did the motherly duties for them, such as preparing food. \n\n~!She had a crush on Mikaela Hyakuya.!~\n~!Ferid Bathory hunts down Mika and Yu. When they agree to surrender, he pulls out Akane's head from the trunk of his fancy western car and tells Yu to say that to her face. Once Yu's demon side takes control, he tosses her head to Yoichi Saotome.\n\nAfter subduing Yu, he tells Mika that he has come to show them how to return Akane to life. He says the name of this experiment is the Seraph of the End.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135256-VXSNfK4qXLVo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135256
      },
      "rarity": "rare"
    },
    {
      "id": "chess-belle",
      "name": "Chess  Belle",
      "alt_names": [
        "チェス・ベル",
        "Chesu Beru"
      ],
      "role": "supporting",
      "description": "Race: Human (Formerly), Vampire (Currently)Born: April 1st\nHeight: 151 cm (4'11½\")\n\nAffiliation: Vampires\nSection: Ferid Bathory's Faction, Japan\nOccupation: Crowley Eusford's Aide\nRank: 17th Progenitor\n\nStatus: Alive\n\nChess Belle is a seventeenth progenitor vampire who serves Thirteenth Progenitor Crowley Eusford. Even though she is a noble, her personality is freewheeling gets jealous easily and behavior is very careless.\n\nChess is a very short girl with an hourglass figure and very large breasts. She has chin-length iris-colored hair and bangs that frame her face. Like all vampires, she has red eyes, fangs, and pointed ears. She also has visible lower lashes.\nShe wears a headband that matches Horn's. She also wears a matching black collar and a white cape that reaches past her buttocks.\n\nLike Horn, she wears an attire with a low cut that reveals her cleavage. She wears a black and white dress with detached black sleeves. A blue bow decorates the front of her bodice, and the black of the dress emphasizes her breasts and hips as it trails down to the front of her skirts. She has a large bow at her tailbone in the back of her dress. Two white skirts layer over each other and reach down to her knees. She wears black stockings that reach right above her\n\nShe is immature, careless, playful, and childish, which foils the more serious and mature behavior of her partner, Horn. She is very fond of both Crowley and Horn, and she can usually be found in their company. She gets jealous easily. She considers Horn to be stuffy.\n\nShe has difficulty controlling her desire for blood, so she tends to kill the humans she drinks from.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135257-quOjYpxuJANr.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135257
      },
      "rarity": "rare"
    },
    {
      "id": "rene-simm",
      "name": "René Simm",
      "alt_names": [
        "レーネ・シム"
      ],
      "role": "supporting",
      "description": "René Simm is a vampire who often works with Lacus Welt and Mikaela Hyakuya as a city guard. He is tasked with gathering surviving humans to provide a food source for vampires. Thinking objectively in situations, René keeps a clear head in precarious situations. He does not approve of Mika's behavior in battle and thought he destroyed a Four Horseman of John by himself to gain glory.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209534-6TV0LkFslDSO.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209534
      },
      "rarity": "rare"
    },
    {
      "id": "lacus-welt",
      "name": "Lacus Welt",
      "alt_names": [
        "ラクス・ウェルト"
      ],
      "role": "supporting",
      "description": "Lacus Welt is a vampire in Japan who often works with René Simm and Mikaela Hyakuya.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209535-tF3mgeGcpCph.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209535
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T12:37:10.949Z"
}