{
  "work_id": "homunculus",
  "count": 6,
  "characters": [
    {
      "id": "susumu-nakoshi",
      "name": "Susumu Nakoshi",
      "alt_names": [
        "名越進"
      ],
      "role": "protagonist",
      "description": "Susumu Nakoshi is a middle-aged man living in his car. Spending his time between a park full of homeless people and upper-class complex hotel, he is chosen by Manabu Ito to be an experimental guinea pig because he is neither an egocentric wealthy guy, nor a pitiful homeless man. He is \"just between\".  After the Trepanation he is able to see the \"monster\" in each human being, things that frighten or obsess people. By studying the human nature and facing the other's fear, he'll try to understand his own person thanks to this strange and worrying 6th sense. When he is stressed or depressed he jerks off and eats his own semen to prove if he is still \"alive\".",
      "metadata": {
        "gender": "male",
        "age": "34",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8278-Fakx1GON3oGD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8278
      },
      "rarity": "epic"
    },
    {
      "id": "ito-manabu",
      "name": "Ito Manabu",
      "alt_names": [
        "伊藤学"
      ],
      "role": "protagonist",
      "description": "Manabu Ito is a rich medical student who is well-versed in the matters of human psychology and physiology. However, his greatest concern is in performing a surgery known as trepanation. To do this, he seeks the ideal patient, Nakoshi, who lives a life of balance. Nakoshi accepts to be his experimental guinea pig for money. Ito claims that the procedure involves drilling a small hole into the skull, and allows for a sixth sense to develop, ~!though later maintains that his goal was to expose the idea as suggestive development (the placebo effect).!~",
      "metadata": {
        "gender": "male",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8279-4L42iG3wdsgq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8279
      },
      "rarity": "epic"
    },
    {
      "id": "nanako-nanase",
      "name": "Nanako Nanase",
      "alt_names": [
        "七瀬ななこ",
        "Nanami"
      ],
      "role": "supporting",
      "description": "Nakoshi's former lover from long ago. She was ugly, but he loved her more than any other woman he has ever met. According to him she was able to see homunculus too, albeit differently then him. Her drawings showed a person's true heart; Nakoshi's looked a pure white cloud.    ~! She becomes a slut, under the name \"Nanami\" who sleeps with many men although she lies to Nakoshi and claims that it is business related. Like Nakoshi she had plastic surgery done. When Nakoshi looks at her homunclus, it appears as faces that continually changes to people he has met before and a faceless ghost form. He theorizes when her face changes, she is lying.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/80971.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 80971
      },
      "rarity": "rare"
    },
    {
      "id": "ken",
      "name": "Ken",
      "alt_names": [],
      "role": "supporting",
      "description": "One of the homeless who live in the park across the hotel. He is aware that Nakoshi is a pathological liar and believes he will live the homeless group soon as Nakohsi is stuck between two worlds.   Ken also knows that Nakoshi has a habit of driving off somewhere in his car and returning satisfied. He appears to care for Nakoshi's well being as he confronts him when he sees him \"looking downward\", a sign Nakoshi has given up. Ken tries to help by telling him its too early for him to do that.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/81037.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81037
      },
      "rarity": "rare"
    },
    {
      "id": "yukari",
      "name": "Yukari",
      "alt_names": [
        "#1775"
      ],
      "role": "supporting",
      "description": "A high school senior going through a difficult phase in her life. A young underwear display girl, she likes karaoke and movies. Yukari is prone to shoplifting. She is part of a underwear peep show that also sells her underwear. Yukari and her mother do not get along. Nakoshi sees her homunculus as a symbolic sand monster, with the sand actually being words that relate to how she is feeling. She is addicted to drinking her own blood.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/81429.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81429
      },
      "rarity": "rare"
    },
    {
      "id": "mr-ita",
      "name": "Mr. Ita",
      "alt_names": [],
      "role": "supporting",
      "description": "A homeless man who lives in the park across the hotel. If the group ever has food Mr. Ita personally cooks it for them. It  is explained that before he came to the park, Mr. Ita was a chef, which is why he is such a good cook. Nakoshi regularly sees him feeding pigeons. He appears to have a fondness for them, because if another animal other then a pigeon eats the food Mr. Ita will throw a rock at them. Nakoshi sees his homunculus as himself (Mr. Ita) encased in a egg.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/81475.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81475
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T07:56:32.244Z"
}