{
  "work_id": "darker-than-black",
  "count": 15,
  "characters": [
    {
      "id": "hei",
      "name": "Hei",
      "alt_names": [
        "黒",
        "Li Shengshun",
        "Li Henshik",
        "The Black Reaper",
        "BK-201"
      ],
      "role": "protagonist",
      "description": "His codename is Hei, which means black in Chinese. Hei is a very talented contractor, his Messier Code is BK-201. Hei lives two lives in the series. In public he is Li Shengshun, a foreign exchange student from China. He is very nice and well mannered. He lives in the Umitsuki apartments and is always working a new part-time job.He has a huge appetite, not unlike most anime characters.  Hei's other life is of a Contractor called BK-201 and also the Black Reaper, mostly by other Contractors. Before becoming a contractor Hei was an assassin which earned him his nickname. Hei is usually seen on the job in a mask and a dark bullet proof coat.  Hei has the ability to manipulate electrons and can also disturb matter on a quantum level.",
      "metadata": {
        "gender": "male",
        "age": "22-25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n2160-CbHDsANTwxg2.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2160
      },
      "rarity": "epic"
    },
    {
      "id": "yin",
      "name": "Yin",
      "alt_names": [
        "銀"
      ],
      "role": "protagonist",
      "description": "A member of [Hei](https://anilist.co/character/2160/)'s team, an emotionless spirit medium known as a \"Doll.\" Her power lies in tracking and observation through direct contact with water. [Huang](https://anilist.co/character/2164/) mentions that her \"program\" is a minimal one, incapable of showing emotion or even allowing her to make decisions for herself; however, she later debunks this by making the decision to keep working with Hei and the others when given the choice of leaving, a possible sign of her recovering her humanity.\n\n~! Yin is of Finnish origin and her real name is Kirsi. She was once a student of a famed Finnish pianist named [Eelis Kastinen](https://anilist.co/character/23856/), who slowly started developing a love interest in her mother. Yin's father died in a plane crash. !~",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n2163-nA1EMwU7E5oJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2163
      },
      "rarity": "epic"
    },
    {
      "id": "huang",
      "name": "Huang",
      "alt_names": [
        "黄（ホァン）"
      ],
      "role": "protagonist",
      "description": "Huang's position can be interpreted as that of field supervisor. He is a human and only possesses strategic abilities. He has a general dislike for contractors and voices it regularly in spite of having to work alongside three of them. Huang passes down orders from the Syndicate to the rest of the team.   ~!Huang was going to run away with a girl he loved who was also a contractor, but she was killed saving Huang from being targeted by the syndicate.!~  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/2164-izIIWifzutwm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2164
      },
      "rarity": "epic"
    },
    {
      "id": "mao",
      "name": "Mao",
      "alt_names": [
        "猫",
        "マオ"
      ],
      "role": "protagonist",
      "description": "His name means \"cat\" in Chinese. He is a Contractor who has lost his original body and now resides within that of a black cat. His messier code is HM-432. His brain is directly connected to a wireless network which enables him to send and receive information at any time, as well as subduing the natural instincts of the animals he possesses. Mao usually creates diversions for Hei in battle. Mao's ability is to possess the bodies of other animals. While he lost his remuneration along with his body, he must connect periodically with the wireless network or run the risk of having the animal's natural instincts take over.    ~!Near the end of the series, his wireless connection is cut off, eliminating his human consciousness and resulting in his 'death.' However, he had a backup network under the control of an unknown organization and he manages to reunite with Hei. It is likely that \"Mao\" is his codename; like Hei, his real name was never stated. He is also in hiding with Hei, residing in the body of Suou's pet squirrel Petya.!~  Mao hates the Spring season as most cats would find a partner and try to have kittens.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n2165-LJwr5Cgg7J4n.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2165
      },
      "rarity": "epic"
    },
    {
      "id": "misaki-kirihara",
      "name": "Misaki Kirihara",
      "alt_names": [
        "霧原未咲",
        "Ichinose Yayoi"
      ],
      "role": "protagonist",
      "description": "The Section-Chief of the Foreign Affairs Section 4 who is investigating matters that concern Contractors. Misaki has long brown hair and glasses and rarely smiles or laughs. She has a strong sense of justice and a sharp intuition. Kirihara became a policewoman in order to protect the weak, has a distaste for smokers due to their smell, and is sensitive about the exposure of her body. She likes eating greasy food but claims to stay fit due to constantly moving around everyday as part of her job. Her father is Superintendent Supervisor Naoyasu Kirihara of the National Police Agency.   (Source: Wikipedia)     ~!It is hinted that she may have romantic feelings for Li Shun Sheng(Hei).  It was later revealed in the later part of special episode 26, that Hei&#039;s identity was revealed to her accidentally in a situation. In that particular episode, her subordinate,Yusuke Saito, has feelings for her and confessed it accidentally during a situation. Their memories of that incident however, was erased due to a however soon after verbalizing them his memory along with Kirihara&#039;s is erased due to a memory erasing substance accidentally released by Mao.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n2166-WXRpwEz7S55P.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2166
      },
      "rarity": "epic"
    },
    {
      "id": "mai-kashiwagi",
      "name": "Mai Kashiwagi",
      "alt_names": [
        "柏木　舞"
      ],
      "role": "supporting",
      "description": "A high school student. Her father, Tahara, was a researcher who rarely came home, and her mother has passed away. Mai is a rare case in that she is a Contractor that evolved from a Moratorium, a condition she had been afflicted with as a side effect of her father's attempts to subdue her powers.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/2435.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2435
      },
      "rarity": "rare"
    },
    {
      "id": "gai-kurasawa",
      "name": "Gai Kurasawa",
      "alt_names": [
        "久良沢凱",
        "Matsukichi"
      ],
      "role": "supporting",
      "description": "Kurasawa Gai is Japan&#039;s number one detective.  Formerly known as Matsukichi Gai, he was a police officer who quit the force to start his own detective agency.  He uses unorthodox methods to solve mysteries and crimes, afraid of cats, has horrible body odor and athlete&#039;s foot, and is struggling financially.  A lot of Gai&#039;s actions cannot be taken seriously, but he is quite amusing.      Other Info:      ~!Importance: Medium  Status: Alive  Episode(s)*: 7, 8, 13, 14    *Still to be revised!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/3213.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3213
      },
      "rarity": "rare"
    },
    {
      "id": "kiko-kayanuma",
      "name": "Kiko Kayanuma",
      "alt_names": [
        "茅沼キコ"
      ],
      "role": "supporting",
      "description": "Kiko is Kurasawa Gai's secretary/assistant. Usually referred to as \"flat-chested\" by Gai, she's an upbeat, energetic girl who loves anime and cosplaying.  In fact, she prioritizes her two hobbies over her job responsibilities.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/3214.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3214
      },
      "rarity": "rare"
    },
    {
      "id": "havoc",
      "name": "Havoc",
      "alt_names": [
        "ハヴォック",
        "Carmine"
      ],
      "role": "supporting",
      "description": "A Regressor who lost her powers and a significant portion of her memories after Heaven's Gate disappeared in South America, five years prior to the story's setting. She used to be one of the worst and most feared Contractors, rumored to have killed over 100,000 people during the South American War. Her former powers are unknown, but are said to be similar to creating a vacuum. Her remuneration was to drink the blood of children  (From Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/3320.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3320
      },
      "rarity": "rare"
    },
    {
      "id": "november-11",
      "name": "November 11",
      "alt_names": [
        "ノーベンバー11",
        "Jack Simon"
      ],
      "role": "supporting",
      "description": "The field leader, presently charged with investigating BK201 and his cohorts. November 11&#039;s ability enables him to freeze liquids, including blood in the human body he does not have direct contact with. He is able to shape water into projectiles in the process of freezing it and hurl them with lethal precision. He can also create protective shields out of frozen water. His remuneration is smoking cigarettes, a fact that peeves him to no end due to his aversion to smoking. He is MI6&#039;s top agent, and his civilian alias is Jack Simon. Through the series, he develops a close professional relationship with Misaki.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3552-PAsE3m6cs3rs.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3552
      },
      "rarity": "rare"
    },
    {
      "id": "amber",
      "name": "Amber",
      "alt_names": [
        "アンバー",
        "February"
      ],
      "role": "supporting",
      "description": "The first confirmed Contractor, with her star's Messier code UB-001. She was originally a spy for MI6 with the codename February but later defected and joined the Syndicate, adopting \"Amber\" as her new name. She worked together with Hei and Bai in South America during the \"Heaven's War\", and founded and leader of her own organization, the Evening Primrose at that time. She went missing together with Bai and millions of other people when the Heaven's Gate disappeared, only to reappear later to fight the Syndicate with the rest of the strenghtened Evening Primrose.   Amber's ability is chronal manipulation, which includes temporal freezing of time and rewinding of events to an unknown degree. Elaborate usage of her power enables her to gain knowledge of future events, and then respond to them accordingly. Once time has been frozen around her, she can also pull other people out of the frozen time stream, while those still under her ability's effect will no longer detect her presence or movement. Her remuneration is aging backwards, making her appear frequently younger. Amber loves Hei, in spite of him believing her to be a traitor, and has stated that she has only seen him truly smile once and she would do anything to see that smile again. Amber's feelings for Hei often result in her making decisions that compromise the mission objectives of the Evening Primrose and at times she goes as far as to order her subordinates to avoid fighting Hei.   ~! Her overall objective is to destroy the Hell's Gate in a way that doesn't erase every Contractor from existence. She maintains the mysterious Meteor Fragment retrieved from PANDORA's Gate Research Facility in her care in a pouch slung across her shoulder. After showing him all that he would have if he used his power to close off the gate (her, his friends, and his sister), she reveals the true extent of her feelings for him by sacrificing herself so that Hei may pursue, instead, the option of shutting down the particle accelerator that would destroy the gate instead of sacrificing Japan or all Contractors. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n3571-yBnKF5Wc8zXB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3571
      },
      "rarity": "rare"
    },
    {
      "id": "maki",
      "name": "Maki",
      "alt_names": [
        "マキ"
      ],
      "role": "supporting",
      "description": "A young boy with heterochromatic irises. He apparently is associated with Amber and seems to be working with her. Maki's ability allows him to perform some type of spontaneous combustion on objects that he touches with his hands. The explosions can occur remotely as he often prepares handprints before activating his ability. He uses this to cause attacks on the embassies in Tokyo. His remuneration is drinking hot milk.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5432.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5432
      },
      "rarity": "rare"
    },
    {
      "id": "zhijun-wei",
      "name": "Zhijun Wei",
      "alt_names": [
        "魏志軍"
      ],
      "role": "supporting",
      "description": "Contractor, Messier Code VI-952. He works as a bodyguard for the daughter of the leader of the Ch'ing-Long-Tang mafia.  Zhijun has the power to make anything his blood touches explode.  Simply by snapping his fingers the exact section his blood covers simply explodes. In addition to that his renumeration is spreading blood, allowing him to use his power to almost no limit. This makes him one of the most dangerous contractors in the series.   ~! As a body guard of the mafia bosses daughter, when she takes control of the mafia with his help, he kills her calling her pitiful. He struggles with Hei and Hei overcomes him, leaving him with a burn on the side of his face.  !~  ~! Later on in the show, after he disappears for a while, he resurfaces as one of Amber's pawns in Evening Primrose, hellbent on finding Hei and paying him back for scarring his face. He is eventually killed after Amber sends him to escort Hei to the gate, and he fights Hei, obviously outmatched. He states that since Amber can move through time, she must have known he would die, but he says he doesn't mind, because fighting Hei made it all the more worth it. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5942.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5942
      },
      "rarity": "rare"
    },
    {
      "id": "april",
      "name": "April",
      "alt_names": [
        "エイプリル",
        "Bella"
      ],
      "role": "supporting",
      "description": "A woman who supports November 11. Her power creates hurricanes which result in downpours, coating everything in water so that November 11 can freeze it. Her remuneration is to drink beer. In contrast to November 11, she very much enjoys her remuneration due to her love for alcohol. (Source: Wikipedia)   ~!In Ryuusei no Gemini, Hei kills April when she attempts to suffocate him with water.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/10314.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10314
      },
      "rarity": "rare"
    },
    {
      "id": "shihoko-kishida",
      "name": "Shihoko Kishida",
      "alt_names": [
        "岸田志保子"
      ],
      "role": "supporting",
      "description": "An operative of the syndicate even longer than Huang, Shihoko is a contractor tasked with the job of infiltrating Alma&#039;s organization to gather intel for an eventual assassination. Years ago, she was tasked with assassinating Isozaki, Huang&#039;s partner when the two were detectives, after learning that he was linked to covering up a the murder of one of the syndicate&#039;s operatives. She had gotten very close to Huang in order to figure out which of the two was working for Alma&#039;s organization, leaving Huang with an emotional scar for many years. Her contract allows her to destroy the internal organs of an individual at the cost of regaining her human sensitivity for a short time. The remuneration can put her in a state of psychological shock due to the abrupt swing of emotion.      ~!She later commits suicide by jumping in front of a truck, saving Huang from being targeted by the Syndicate.!~    Source: Wikipedia",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/10315.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10315
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-26T04:15:27.551Z"
}