{
  "work_id": "miss-kobayashis-dragon-maid",
  "count": 20,
  "characters": [
    {
      "id": "kobayashi",
      "name": "Kobayashi",
      "alt_names": [
        "小林さん"
      ],
      "role": "protagonist",
      "description": "Kobayashi is a computer programmer and office worker. She finds herself living with a dragon named [Tohru](https://anilist.co/character/120970/Tohru).\n\nEven though Kobayashi maintains a cool demeanor, she has been regarded as kind-hearted and reliable among her friends and colleagues. Level-headed and pragmatic, she stands as the source of reason when dealing with her dragon friends. However, when intoxicated, she tends to become rowdy and aggressive, especially in her interests in maids, and is not above subjecting Tohru to her drunken whims.\n\nBefore meeting Tohru, Kobayashi would don a stoic expression on her face. Now, she is more approachable and open to others, often seen smiling contentedly. Kobayashi often chastised Tohru for her lack of propriety on human standards. However, as time passes by, she grows accustomed to Tohru's quirks and would sometimes show small signs of affection and gratitude for the dragon, such as holding Tohru's hand or going out of her way to fulfill some of Tohru's wishes to ease her troubles.",
      "metadata": {
        "gender": "female",
        "age": "25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b120969-dHJBVb3lB8iN.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120969
      },
      "rarity": "legendary"
    },
    {
      "id": "tohru",
      "name": "Tohru",
      "alt_names": [
        "トール",
        "Tooru"
      ],
      "role": "protagonist",
      "description": "__Faction__: Chaos\n__Relatives__: [Damocles](https://anilist.co/character/172721/Damocles) (father)\n\nTohru is a female dragon with the ability to transform into a human girl. After [Kobayashi](https://anilist.co/character/120969/Kobayashi) rescues her, she falls in love with her and decides to work for her as a maid.\n\nAs a Chaos Dragon, Tohru was raised to hate humans and was supposed to be a fierce and dangerous force of evil with nothing other than destruction in mind. However, this all changed when she met Kobayashi. She is now cheerful and kind to every human she meets, except for those who are real, or as it is in most cases, imaginary, threats to her love interest Kobayashi (such as [Makoto Takiya](https://anilist.co/character/120976/Makoto-Takiya)). She is also quickly influenced by what she sees on television or the internet and shares a fiery relationship with her rival, [Elma](https://anilist.co/character/120977/Elma).\n\nAs Kobayashi's maid, Tohru is a hard worker and cares deeply for the household, tending to all aspects of daily life, although this will often lead to trouble, such as when Tohru tries to feed her tail to Kobayashi, or when she molests Kobayashi's dirty laundry. Still, Kobayashi always shows her appreciation for Tohru's efforts and does her best to guide Tohru in the ways of modern life and human culture on Earth. Tohru is very protective of [Kanna](https://anilist.co/character/120974/Kanna-Kamui) and is essentially her mother figure and big sister combined. Having been accepted by Kobayashi even in her dragon form, Tohru quickly fell deeply in love with her. Even faced with Kobayashi's stoic character and often unrequited advances, Tohru never fails to make her unending love for Kobayashi known. Tohru's equally strong sexual attraction to Kobayashi often drives her to trickery, such as making a chocolate heart with a love potion secretly added, or finding different ways to attempt making Kobayashi eat her tail.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b120970-knjWLdlQIs1y.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120970
      },
      "rarity": "legendary"
    },
    {
      "id": "kanna-kamui",
      "name": "Kanna Kamui",
      "alt_names": [
        "カンナカムイ",
        "Kanna Kobayashi (小林カンナ)"
      ],
      "role": "protagonist",
      "description": "Tohru's friend from the dragon realm who got exiled from her world and wound up living with Kobayashi as well. She is very young by dragon standards, equivalent to a primary school student, which she attends as a third-year student bearing Kobayashi's surname later in the series. She initially assumes that Kobayashi seduced Tohru into staying and wanted her to return to their original world. ~!She grows attached to Kobayashi as the series progresses, viewing her as a mother figure.!~ Kanna's basis and tribal attire are inspired by the culture of the indigenous natives of Hokkaido and claims to be from Ushishir. She bears feather-like horns and a thin tail ending in a bulb, and is capable of charging with electricity.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b120974-cZHsjS8DX9WW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120974
      },
      "rarity": "legendary"
    },
    {
      "id": "fafnir",
      "name": "Fafnir",
      "alt_names": [
        "ファフニール",
        "Takeshi Ooyama",
        "Faf-kun"
      ],
      "role": "supporting",
      "description": "An old friend of Tohru, he is a male dragon with a strong distrust for humans which leads to him questioning much of Tohru's actions and ideals in his earlier appearances. He shares some resemblance to the traits of his namesake, such as his cold demeanour and disdainful mentality. He appears as a refined young man with long black hair and red eyes in his human form. ~!After Tohru's attempts to find a place to stay for him (under the name Takeshi Ooyama), Fafnir eventually comes to live with Takiya, becoming obsessed with video games and popular culture.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b120971-7XdpFZNKMBuM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120971
      },
      "rarity": "rare"
    },
    {
      "id": "riko-saikawa",
      "name": "Riko Saikawa",
      "alt_names": [
        "才川リコ"
      ],
      "role": "supporting",
      "description": "**Relatives**: [Georgie Saikawa](https://anilist.co/character/120978/Georgie-Saikawa) (older sister)\n\nRiko Saikawa is [Kanna](https://anilist.co/character/120974/Kanna-Kamui)'s friend and classmate in elementary school. A running gag involves her becoming overwhelmingly flushed with bliss every time she and Kanna make physical contact, along with her shiny forehead.\n\nAt first glance, Riko seems bossy and mean, but over time, she seems nicer as shown with Kanna, and very polite around people like [Kobayashi](https://anilist.co/character/120969/Kobayashi), although she originally mistook Kobayashi for Kanna's mother. She has a crush on Kanna and enjoys being around her. When being touched by Kanna or when she receives praise from her, she tends to grin goofily and get red in the face, becoming overwhelmed with excitement.\n\nThough she initially tries to pick a fight with Kanna for her sudden popularity on the first day of her transfer to the school, she quickly becomes good friends with her. They often spend time with each other, walking home together from school and picking the other as their partner during school activities.",
      "metadata": {
        "gender": "female",
        "age": "9",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b120972-fEzG6QIFQnXp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120972
      },
      "rarity": "rare"
    },
    {
      "id": "shouta-magatsuchi",
      "name": "Shouta Magatsuchi",
      "alt_names": [
        "真ヶ土翔太"
      ],
      "role": "supporting",
      "description": "**Relatives**: Mr. Magatsuchi (father), Saori Magatsuchi (mother)\n\nShouta Magatsuchi is a young boy born into a family of mages in the modern world. He has shown to possess enough knowledge on the arcane arts to attempt summoning a demon. [Lucoa](https://anilist.co/character/120975/Quetzalcoatl) came out of a summoning portal Shouta created and starts living with him.\n\nShouta is an elementary school boy in 5th grade with both purple hair and eyes. His bangs reach well below his eyebrows. His appearance looks partly androgynous.\n\nShouta is quiet and shy most of the time when seen with Lucoa. When Lucoa attempts to seduce Shouta, he would run away with embarrassment and accuse Lucoa of being a demon.\n\nAs [his father](https://anilist.co/character/248474) is [Kobayashi](https://anilist.co/character/120969/Kobayashi)'s manager, she's asked to look after Shouta at times.",
      "metadata": {
        "gender": "male",
        "age": "10-11",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b120973-lNsOIwMrH8xo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120973
      },
      "rarity": "rare"
    },
    {
      "id": "quetzalcoatl",
      "name": "Quetzalcoatl",
      "alt_names": [
        "ケツァルコアトル",
        "Lucoa (ルコア)"
      ],
      "role": "supporting",
      "description": "**Faction**: Spectation\n\nQuetzalcoatl often referred to as Lucoa, is a former dragon goddess and an old friend of [Tohru](https://anilist.co/character/120970/Tohru). She was exiled from her seat after consuming cursed liquor that led her into a scandalous affair. As a member of the spectating faction, she does not interfere with any events involving the dragons or gods. She's by far the most powerful dragon in the series.\n\nQuetzalcoatl appears to be laid-back and carefree who is rarely seen without a smile. She is wise, kind, and nurturing who often has advice for her younger kin. As a former goddess, she is better tuned to human customs, as seen when she explains to Tohru why Kobayashi was not receptive to Tohru's initial cleaning regimen. Despite this, however, Lucoa seems to lack some sense of dignity severely. She is not above using her body as a means of getting what she wants, as shown when she attempts to use her alluring figure as an offering to [Shouta](https://anilist.co/character/120973/Shouta-Magatsuchi), hoping to allow her to stay in his home.\n\nQuetzalcoatl lives with Shouta but does not work for her stay. The two have a complicated relationship as Shouta sees Quetzalcoatl as a succubus or demon rather than a dragon. Quetzalcoatl will often try to get Shouta's attention, but due to her massive breasts, she often ends up flustering and embarrassing him instead.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b120975-oOyfRbMSpSpy.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120975
      },
      "rarity": "rare"
    },
    {
      "id": "makoto-takiya",
      "name": "Makoto Takiya",
      "alt_names": [
        "滝谷真"
      ],
      "role": "supporting",
      "description": "Kobayashi's co-worker who is initially believed by Tohru to be a rival for Kobayashi's affections, but is really just an otaku who likes to talk about maids with her. Kobayashi helps him set up during Comiket every year. ~!Fafnir eventually decides to live with him to stay in the human world.!~\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b120976-qUDSgLQ61tGQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120976
      },
      "rarity": "rare"
    },
    {
      "id": "elma",
      "name": "Elma",
      "alt_names": [
        "エルマ",
        "Elma Joui",
        "Lady Elma"
      ],
      "role": "supporting",
      "description": "**Faction**: Harmony\n\nElma is a female dragon from the Harmony faction, the opposing faction of Chaos, which [Tohru](https://anilist.co/character/120970/Tohru) belongs to. She adopts the name Elma Joui as her human alias after she finds that she is unable to return to her world. Elma is the only dragon of the main cast who lives on her own in the human world.\n\nElma usually takes the form of a human woman with short black hair, large breasts, blue eyes, and a long spiral unicorn-like horn (which she can freely hide). In the anime and [Elma’s Office Lady Diary](https://anilist.co/manga/100756/Miss-Kobayashis-Dragon-Maid-Elmas-Office-Lady-Diary/), her hair also has purple tips. At work, she wears round glasses. She also wears a business suit which consists of a white shirt, light blue tie, a loose blue sweater, a grey blazer, and a dark grey knee-length skirt with light grey socks and black heels. Her casual attire in the anime consists of olive-green skin-tight trousers, a light blue jacket, a dark blue vest, and a yellow scarf. Her first outfit, which she also wears in her world while in human form, consists of a light tan scarf with a dark blue (sometimes black) leotard. She wears a purple kimono with pink piping and a dark blue sash over the leotard, with the top pulled down. She has bandages around her legs and sandals. She can be seen with a cobalt blue and turquoise tail (which she can freely hide). Sometimes, she carries around a long, brown trident.\n\nIn Elma's dragon form, she's a blue sea serpent with a brown horn protruding from her forehead and her brown trident is her tail. She can freely move around in the water because she is a water dragon.",
      "metadata": {
        "gender": "female",
        "age": "Unknown",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b120977-x50lrAuIAsHE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120977
      },
      "rarity": "rare"
    },
    {
      "id": "georgie-saikawa",
      "name": "Georgie Saikawa",
      "alt_names": [
        "才川ジョージー",
        "Nae Saikawa"
      ],
      "role": "supporting",
      "description": "**Relatives**: [Riko Saikawa](https://anilist.co/character/120972/Riko-Saikawa) (younger sister), unnamed parents\n\nGeorgie Saikawa is the older sister of Riko Saikawa. Her real name is Nae Saikawa (才川苗). She likes to pretend to be a housemaid.\n\nGeorgie wears an orange polka-dot maid outfit with a white apron. She also has a white cap and has her red hair in twin-pigtails. Her stockings are black striped.\n\nGeorgie is a sweet and gentle lady. She always supports Riko and her family. She seems to know a lot about maids and has a huge passion for them. She mentions that she's wanted to be one since she was a kid when she read a book about maids, but no one accepted her job offers, so decided to be one for her family.\n\nGeorgie and [Kobayashi](https://anilist.co/character/120969/Kobayashi) automatically have a close bond as they both share an interest in maids. [Tohru](https://anilist.co/character/120970/Tohru) isn't fond of her and shows jealousy as she sees her as a rival through impersonating as a maid to win over Kobayashi.\n\n(Source: Miss Kobayashi's Dragon Maid Wiki, edited)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b120978-rLBVr3LBNeul.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120978
      },
      "rarity": "rare"
    },
    {
      "id": "damocles",
      "name": "Damocles",
      "alt_names": [
        "ダモクレス",
        "Shuuen-tei (終焉帝)",
        "Emperor of Demise"
      ],
      "role": "supporting",
      "description": "Damocles is the father of Tohru and is known as the Emperor of Demise and is considered one of the strongest dragons shown.\nDamocles is callous and stern, hating humans and viewing them as inferior and evil - a belief he tried to impart on Tohru. However, unlike other Chaos Dragons, he respects the non-interference laws preventing dragons from killing humans of Earth, although when angered, he attacks Kobayashi and threatens to leave her at the brink of death. Despite this, he cares for his daughter and is concerned for her safety and happiness.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172721-syVtsR9ZICbq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172721
      },
      "rarity": "rare"
    },
    {
      "id": "sone",
      "name": "Sone",
      "alt_names": [
        "曽根"
      ],
      "role": "supporting",
      "description": "Sone is one of Kobayashi's neighbors.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209895-xD9clnjbBPbt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209895
      },
      "rarity": "rare"
    },
    {
      "id": "yana",
      "name": "Yana",
      "alt_names": [
        "谷菜"
      ],
      "role": "supporting",
      "description": "Yana is one of Kobayashi's neighbors.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209896-rbrdDJWx1wYC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209896
      },
      "rarity": "rare"
    },
    {
      "id": "touzoku-no-shoujo",
      "name": "Touzoku no Shoujo",
      "alt_names": [
        "盗賊の少女",
        "Bandit Girl"
      ],
      "role": "supporting",
      "description": "She is a girl that Tohru met back in her world.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209897-8pmZltdzea8u.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209897
      },
      "rarity": "rare"
    },
    {
      "id": "kachou",
      "name": "Kachou",
      "alt_names": [
        "課長",
        "Kobayashi's Boss",
        "Shochou",
        "所長"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209898-oiJkzKNHVyXf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209898
      },
      "rarity": "rare"
    },
    {
      "id": "josei-kyoushi",
      "name": "Josei Kyoushi",
      "alt_names": [
        "女性教師"
      ],
      "role": "minor",
      "description": "Kanna and Riko's teacher.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b222745-QkYp6NiQDN8q.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 222745
      },
      "rarity": "uncommon"
    },
    {
      "id": "tatsuta",
      "name": "Tatsuta",
      "alt_names": [
        "辰田"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b234738-K2iT69q65jO5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 234738
      },
      "rarity": "uncommon"
    },
    {
      "id": "yamashita",
      "name": "Yamashita",
      "alt_names": [
        "山下"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b234739-avPjJ7IO5Y7q.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 234739
      },
      "rarity": "uncommon"
    },
    {
      "id": "sasakibe",
      "name": "Sasakibe",
      "alt_names": [
        "笹木部"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b234740-l3CIGXT5AuOO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 234740
      },
      "rarity": "uncommon"
    },
    {
      "id": "toda",
      "name": "Toda",
      "alt_names": [
        "戸田"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b234741-wLov2jSeyzvT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 234741
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-23T03:12:04.073Z"
}