{
  "work_id": "the-devil-is-a-part-timer",
  "count": 24,
  "characters": [
    {
      "id": "satan-jacob",
      "name": "Satan Jacob",
      "alt_names": [
        "サタン・ジャコブ",
        "Sadao Maou (真奥貞夫)",
        "Milord",
        "Sire",
        "The Devil",
        "Demon King Satan"
      ],
      "role": "protagonist",
      "description": "Satan Jacob is the main protagonist of the series. He was once the Demon King who declared war on Ente Isla in an attempt to annex the four continents. However, due to the actions of the Hero Emilia Justina and her companions, he was forced to retreat to Earth, causing him to lose almost all of his powers.\n\nSatan was well-known throughout Ente Isla as the great overlord of his people, his name synonymous with the terror and cruelty his army brought to those unfortunate enough to fall victim. He allowed his minions the right to perform any heinous acts they deemed fit, showing immense cruelty through the slaughter of many innocent humans in his conquest. By contrast, on Earth Sadao Maou is shown to be a diligent and proactive employee, instead applying his strong drive and determination to better himself in his new life. Forced to spend time living as a human and interacting with those he previously considered to be lesser beings, he has since developed a kindhearted and cheerful disposition making him popular among both his colleagues and neighbors. He now strives to climb the corporate ladder at MgRonald's.\n\n~!Though he is not the legendary Satan spoken of in the Ente Islan Bible, Satan Jacob was given the name at birth, as it has since become an extremely common name among demons. While he once belonged to a lowly goblin-class tribe, Satan's family and comrades were slaughtered in a conflict between demons, the enemy having left him behind to die following the carnage. While lying motionless on the ground awaiting his eventual demise, he was found and rescued by a mysterious angel, who chose to care for the child and ensure his survival. The stranger claimed she had never seen a demon crying before and nursed him back to health, sharing with him many stories and her knowledge of humankind. Through her stories, he became instilled with a desire to unite his own kind the same way that humans had done in the past.!~\n\n(Source: Hataraku Maou-sama Wikia, edited)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b70733-d564H7iUj7Y2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70733
      },
      "rarity": "legendary"
    },
    {
      "id": "emilia-justina",
      "name": "Emilia Justina",
      "alt_names": [
        "エミリア・ユスティーナ",
        "Emi Yusa (遊佐恵美)",
        "The Hero"
      ],
      "role": "protagonist",
      "description": "Emilia is the main female protagonist and the Hero who defeated the Demon King Satan. After forcing the Demon King to retreat from Ente Isla, she followed him to modern day Japan to ensure his destruction. However, just like the Demon Lord, she lost most of her powers upon her arrival and was forced to assume a Japanese name. She was also forced to find employment, and so became a call center agent. She is a half human and half angel.\n\nOverall, Emi is a strong-willed and determined hero, displaying many admirable qualities befitting of one in her position; among which are a pure heart, boundless courage, unwavering loyalty to those closest to her, and a deep-seated desire to protect the innocent. Moreover, she lacks self-confidence and gets angry/frustrated easily. While initially hesitant to become the great hero of Ente Isla, the death of her father at the hands of Lucifer's Army ignited a fire in the heart of the young hero, giving her a motivation to train harder and strike down those who destroyed her village. Due to her personal losses, she sees all demons as her enemy, most of all their leader, Satan Jacob.\n\n~!Emilia Justina was born to her parents, an ordinary farmer named Nord Justina and the archangel Lailah. Knowing she had committed a taboo by birthing a child to a human, her mother fled, leaving Emilia to be raised by her father on his farm located somewhere on the Western Continent. During Satan's conquest, the child lived a peaceful life with her father. Despite fearing the day they would be accosted by the encroaching demon army, he assured her that their village would be protected by the Church, putting her mind at ease. Her life changed drastically one afternoon when representatives from the Ente Islan Church arrived at her home to train Emilia as the Hero who could free the world of the Demon King Satan. Although reluctant at first, Emilia's motivation was fueled when she received news of her father's apparent death when the Demon King's army laid waste to their fields only days after her departure. In reality, Nord Justina was taken by Lailah and hidden safely on Earth during this time, though Emilia remained unaware of her father's true fate.!~\n\n(Source: Hataraku Maou-sama Wikia, edited)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b70735-DmmbHRLKpS0E.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70735
      },
      "rarity": "legendary"
    },
    {
      "id": "alciel",
      "name": "Alciel",
      "alt_names": [
        "アルシエル",
        "Shirou Ashiya (芦屋四郎)",
        "Alsiel"
      ],
      "role": "protagonist",
      "description": "Alciel is one of Satan's Demon Generals and was also transported to modern day Japan with him. Extremely loyal to Maou, he takes care of the domestic duties at home and goes to the library to research ways for Maou and himself to regain their powers.\n\nBack in Ente Isla, Alciel was known widely as the right hand of King Satan and a master strategist, making him both a trusted adviser and top military commander to the ruler of the Demon Realm. However, he shared his leader's belief that humans lives are meaningless and expendable, considering demonkind to be superior beings and showing a strong sense of pride bordering on extreme arrogance. \n\nWhile living in Japan, Ashiya has come to accept his rather mundane life, though he still openly laments how low they have fallen since arriving on Earth, and still tends to consider humans as beneath him. Due to their lack of sufficient funds and personal comforts, Ashiya has become incredibly tightfisted and strict about the household budget. One part of him that has not changed, though, is his extreme dedication and loyalty to the Demon King.\n\n(Source: Hataraku Maou-sama Wikia, edited)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b70737-lDeBmECttJCK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70737
      },
      "rarity": "legendary"
    },
    {
      "id": "chiho-sasaki",
      "name": "Chiho Sasaki",
      "alt_names": [
        "佐々木千穂",
        "Chi-chan"
      ],
      "role": "protagonist",
      "description": "Chiho is Maou's friend and a fellow employee at MgRonald's. She has a crush on Maou. She can hear and understand the language of Ente Isla, after receiving feedback from a hypnosis spell that Maou cast on her father, Inspector Sasaki.\n\nShe has a strong will and a polite, friendly, pleasant all around personality. She is head over heels for Maou, and sometimes gets jealous when she sees Emi and Maou together.\n\nShe is a part-time employee at MgRonald's along with Maou. Maou had met her father when he first landed on Earth, as her father is a policeman and caught him and Ashiya loitering around. Chiho attends school at Sasahata North High School.\n\n(Source: Hataraku Maou-sama Wikia)",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b70739-rJpfVU2YH5nS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70739
      },
      "rarity": "legendary"
    },
    {
      "id": "lucifer",
      "name": "Lucifer",
      "alt_names": [
        "ルシフェル",
        "Hanzou Urushihara (漆原半蔵)"
      ],
      "role": "protagonist",
      "description": "Lucifer is a fallen angel and one of the Demon King's generals. After his defeat at the hands of Hero Emilia, he was secretly rescued by Olba Meyer, who promised to return Lucifer to heaven if they became allies in defeating the Demon Lord. After being defeated by the Demon Lord, Urushihara moved in with Sadao Maou and Ashiya.\n\nLucifer is shown to be cunning and sneaky as well as a childish, preferring to surf the internet and play video games rather than help Ashiya with the housework. Due to his attitude, everyone tends to treat him lightly and pay no mind to many of his protests at being excluded from things. Lucifer is also self-proclaimed socially awkward, lazy to an extent, and has a short temper. However, it seems he has hidden feelings beneath his seemingly irresponsible and carefree attitude, and shows his serious side from time to time. To his irritation, Lucifer is usually referred to as a hikikomori even when among company.\n\n~!Known as the \"original sin\" and the son of Ignora, Lucifer was born after the destruction of the angels' home-world, making him part of the second generation of his kind. Once an honored and revered archangel, he was tasked with the responsibility of leading the archangels. Lucifer eventually abandoned his job, feeling it was too boring in heaven for him to remain. Losing his former status and gaining black wings signifying his corruption, his powers became demonic, reclassifying him a fallen angel. Lucifer traveled to the Demon Realm where he would remain for several years. During his time among the warring demonic tribes, Lucifer gained a certain amount of power and influence over his new compatriots, though was still not considered a \"pure\" demon due to his celestial origins. He would later join the young Satan Jacob in his plot to unite the demon realm under his flag, the rising monarch proclaiming that Lucifer should feel free to kill him if he ever felt displeased with his leadership.!~\n\n(Source: Hataraku Maou-sama Wikia, edited)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83103-fksjOXqJCmxd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83103
      },
      "rarity": "legendary"
    },
    {
      "id": "crestia-bell",
      "name": "Crestia Bell",
      "alt_names": [
        "クレスティア・ベル",
        "Suzuno Kamazuki (鎌月鈴乃)"
      ],
      "role": "protagonist",
      "description": "She is the chief interrogator and executioner for the Church Investigation Commission, who came into the human realm from Ente Isla to check on reports about Emi's alliance with Maou. Unknown to Maou who she is, she becomes his next door neighbor and eventually became close, being a good cook she would drop by in Maou's apartment to  prepare meals for everyone. She knows little about the human realm especially in Tokyo that she is having difficulty going around the city and understanding people's sense of fashion.   ~! It seems since the start that Maou and Lucifer knew who she was. !~  (Source:  Animefreak)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83105-NoBGyXWCvlW2.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83105
      },
      "rarity": "legendary"
    },
    {
      "id": "mayumi-kisaki",
      "name": "Mayumi Kisaki",
      "alt_names": [
        "木崎真弓"
      ],
      "role": "supporting",
      "description": "She is Maou's immediate superior at MgRonalds where he works.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82295-BOIpFzFPOzvS.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82295
      },
      "rarity": "rare"
    },
    {
      "id": "miki-shiba",
      "name": "Miki Shiba",
      "alt_names": [
        "志波美輝",
        "Miki-T",
        "Mikitty"
      ],
      "role": "supporting",
      "description": "**Miki** is the landlord at the place the Devil King stays, \"Villa Rosa Sasazuka\". She requested that her apartment be rented out to \"shady characters\" such as Maou and Alciel. She seems to have some knowledge of Ente Isla.\n\n~!She is a guardian of the Earth and is thought to be incredibly powerful to the point where Sariel and Gabriel did not strike Villa Rosa Sasazuka out of fear of provoking her. She is older than any known archangels in history.!~\n\n(Source: Hataraku Maou-sama Wikia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83461-Cys6adrlUMwg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83461
      },
      "rarity": "rare"
    },
    {
      "id": "rika-suzuki",
      "name": "Rika Suzuki",
      "alt_names": [
        "鈴木梨香"
      ],
      "role": "supporting",
      "description": "Emi's coworker.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83463-juPSiLKxkgxD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83463
      },
      "rarity": "rare"
    },
    {
      "id": "emeralda-etuva",
      "name": "Emeralda Etuva",
      "alt_names": [
        "エメラダ・エトゥーヴァ",
        "Emerada"
      ],
      "role": "supporting",
      "description": "Emi's friend from Ente Isla.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83465-tELCjsvutR3D.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83465
      },
      "rarity": "rare"
    },
    {
      "id": "albert-ende",
      "name": "Albert Ende",
      "alt_names": [
        "アルバート・エンデ"
      ],
      "role": "supporting",
      "description": "One of the comrades of Yusa, Emi on attacking the Dark Lord's castle.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83467-1G4LmD77QPdM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83467
      },
      "rarity": "rare"
    },
    {
      "id": "olba-meyer",
      "name": "Olba Meyer",
      "alt_names": [
        "オルバ・メイヤー"
      ],
      "role": "supporting",
      "description": "~!He is an ambitious high member of the church who came into the human world with Hanzou to seek and eliminate both Maou and Emi, so that he can be the sole ruler of  Ente Isla.!~  (Source: ANN)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83469-qV9WsHxA8Ack.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83469
      },
      "rarity": "rare"
    },
    {
      "id": "nord-justina",
      "name": "Nord Justina",
      "alt_names": [
        "ノルド・ユスティーナ"
      ],
      "role": "supporting",
      "description": "[Emilia's](https://anilist.co/character/70735) father. ~!He was thought to be dead, but it was revealed that he has been hiding in Japan under the name Sato Hiroshi!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83471-WQ0gQ37n8iHm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83471
      },
      "rarity": "rare"
    },
    {
      "id": "senichi-sasaki",
      "name": "Senichi Sasaki",
      "alt_names": [
        "佐々木千一"
      ],
      "role": "supporting",
      "description": "Chiho's father.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83603-2GHUaHmDA5fn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83603
      },
      "rarity": "rare"
    },
    {
      "id": "riho-sasaki",
      "name": "Riho Sasaki",
      "alt_names": [
        "佐々木里穂"
      ],
      "role": "supporting",
      "description": "Chiho's mother.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83605-GK9ntHAeKyiW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83605
      },
      "rarity": "rare"
    },
    {
      "id": "kaori-shouji",
      "name": "Kaori Shouji",
      "alt_names": [
        "東海林佳織"
      ],
      "role": "supporting",
      "description": "Chiho's classmate, who seemly has an affinity for boy's love.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83887-5PY5X9scHor9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83887
      },
      "rarity": "rare"
    },
    {
      "id": "robertio-iguno-valentia",
      "name": "Robertio Iguno Valentia",
      "alt_names": [
        "ロベルティオ・イグノ・ヴァレンティア"
      ],
      "role": "supporting",
      "description": "One of the Chief Inquisitors of  The Church on Ente Isla.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83889-7i0GgCgjtjXg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83889
      },
      "rarity": "rare"
    },
    {
      "id": "servantes-reberiz",
      "name": "Servantes Reberiz",
      "alt_names": [
        "セルヴァンテス・レベリーズ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83891-oDIe1vp1WThd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83891
      },
      "rarity": "rare"
    },
    {
      "id": "mitsuki-sarue",
      "name": "Mitsuki Sarue",
      "alt_names": [
        "猿江三月"
      ],
      "role": "supporting",
      "description": "He was introduced in ep. 8 as the manager of Sentucky Fired Chicken or SFC, MgRonald's rival fast food chain in Hatagaya district. He apparently has a thing for beautiful girls.   ~!His true identity is the archangel Sariel, who came to Japan to retrieve Emi's sword, \"Better Half\".!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84873-AWwWG8P66Sze.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84873
      },
      "rarity": "rare"
    },
    {
      "id": "watanabe",
      "name": "Watanabe",
      "alt_names": [
        "渡辺",
        "Nabe-san"
      ],
      "role": "supporting",
      "description": "Sadao's acquaintance. Sadao met him while volunteering on the Neighborhood Cleanup.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85359-Rt5yiSsKtaZQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85359
      },
      "rarity": "rare"
    },
    {
      "id": "kawachi",
      "name": "Kawachi",
      "alt_names": [
        "カワッチ"
      ],
      "role": "supporting",
      "description": "**First appearance:** Episode 9.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85361-MgZFsGQBZKcR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85361
      },
      "rarity": "rare"
    },
    {
      "id": "yuki-mizushima",
      "name": "Yuki Mizushima",
      "alt_names": [
        "水島由姫"
      ],
      "role": "supporting",
      "description": "**First appearance:** Episode 10 as the Manager of MgRonalds at the Fushima Park branch.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b86071-YXo5B2bAU3le.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86071
      },
      "rarity": "rare"
    },
    {
      "id": "kuryuu",
      "name": "Kuryuu",
      "alt_names": [
        "九流"
      ],
      "role": "supporting",
      "description": "**First appearance:** Episode 13.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b87387-3ozktGljzAW0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87387
      },
      "rarity": "rare"
    },
    {
      "id": "tamura",
      "name": "Tamura",
      "alt_names": [
        "田村"
      ],
      "role": "supporting",
      "description": "**First appearance:** Episode 13.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b87389-RY4WopfImi7I.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87389
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T05:35:31.815Z"
}