{
  "work_id": "gto-great-teacher-onizuka",
  "count": 15,
  "characters": [
    {
      "id": "eikichi-onizuka",
      "name": "Eikichi Onizuka",
      "alt_names": [
        "鬼塚英吉"
      ],
      "role": "protagonist",
      "description": "A hormonal, blonde-haired biker and virgin, Onizuka Eikichi graduated from a bottom-rung university by cheating and, as such, cannot get a decent job. His main way of spending time is peering up girls' skirts in a local mall. He is very athletic, as he can bench press 150 kg (331 lbs), has a second dan black belt in karate, and even claims to perform 500 push-ups, 1000 pull ups and 2000 squats daily.",
      "metadata": {
        "gender": "male",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b434-Q0K9e4HukawA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 434
      },
      "rarity": "epic"
    },
    {
      "id": "urumi-kanzaki",
      "name": "Urumi Kanzaki",
      "alt_names": [
        "神崎麗美"
      ],
      "role": "protagonist",
      "description": "The antithesis to the \"dumb blonde\" stereotype, Urumi Kanzaki is a prodigy with an IQ over 200. She is also a heterochromatic, possessing different colored eyes: one brown and one blue. However, she is psychologically disturbed, having her fair share of hate toward teachers. Her genius is displayed repeatedly by such abstract actions as the detonation of time bombs (i.e. firecrackers in disposable boxes) and making a harmless snake look like a cobra using paper cutouts. Her intellect is also shown through actions, such as shouting curse words in French and being able to speak fluent Mandarin. On the trip in Okinawa, Toshito Kikuchi noted that she can speak 5 languages.    ~!Her hatred for teachers stems from her time in elementary school. Urumi's teacher, Ms. Fujimori, while initially welcoming and receptive, wasn't able to handle her intellect properly, since she went to a second-rate college, and it was her first year teaching. Urumi's constant requests for the teacher's time, both inside and outside of school, as well as the fact that the lessons she wanted to learn from the teacher included extremely advanced, college-level subjects (such as differential calculus) eventually made the teacher snap. When Urumi interrupted Ms. Fujimori's lecture to correct her in front of the whole class, the teacher then told Urumi's secret to her class. While it isn't stated explicitly, it can be deduced that her intelligence is derived from her biological father, when Urumi tells Eikichi Onizuka that her mother had selected a sperm-donor, based on his intellect and nothing more. It is even suggested that her mother took the sperm from an American scientific genius (this information can be gleaned from a scene where Urumi and her mother visited some friends in the United States, and Urumi was led into a dark storage room by a doctor, who explains to her that her father is actually just a bottle of donated sperm); this also explains Urumi's natural, blond hair. Naturally, this caused a great deal of psychological trauma to Urumi, and quite an understandable hatred of teachers. It is still unclear what happened to Ms. Fujimori, as her last appearances in the storyline was begging Onizuka to help Urumi before something terrible happens to her.   She is later found by Miyabi in a small apartment, and hired to torture Onizuka. Formerly a student at Holy Forest for a while, but stopped attending regularly after some time, she begins almost immediately, as she frames him for lechery and sends him to jail overnight, only to appear in class and on his homeroom roster the morning after. Onizuka's frustration with her vastly increases, when Vice-Principal Uchiyamada strictly advises him that he cannot inflict physical harm on her due, to her educational potential. Urumi is eventually able to turn Onizuka into her slave (more-or-less, her \"genie\") by threatening to have him arrested, after she fakes her death when he accidentally pushes her off a building.   However, all this changes when she encounters her Ms. Fujimori again, awakening her deepest hatred and causing her to direct her wrath at the student body. Onizuka responds by bringing his biker gang to school and \"kidnaps\" her from class. He is finally able to get through to her by almost killing the two of them by jumping over - and nearly falling into - a gap at a suspension bridge, despite her attempts to convince him that she is not afraid of anything, including death. Onizuka makes her see past her trauma, however bad, just isn't worth messing up the present with (in the manga, he does this by having his biker friends share their life experiences with her). Inspired, she allies with Onizuka, and helps with his troubles.   Despite her switch in allegiance, Urumi continues her feud with Miyabi, until Miyabi reveals her origins to the student body. Urumi retaliates by setting up a web page, where she promises to post pictures of Miyabi in her bathroom (Urumi had earlier placed a hidden camera), after a countdown timer reaches zero. However, the site reveals only a single photograph of Urumi, Miyabi, and Tomoko Nomura during their younger years. Urumi never had any intention of ruining Miyabi; she just wanted to scare her. Urumi attempts suicide at an indoor skiing arena by freezing to death, but Onizuka rescues her. It is after this incident that Urumi considers Onizuka to be her \"favorite\".   She grows extremely infatuated with Onizuka, to the point of wanting to elope with Onizuka. Urumi takes a more stereotypical role of a character that prefers the use of violence, in response to jealousy - she is often seen beating Onizuka mercilessly every time he tries to fulfill his pervertednes. Urumi states Onizuka should wait for her hormones to start kicking in, because she's sure that she would have a bouncing body by then. Like Noboru Yoshikawa, her loyalty to Onizuka is extremely strong, to the point that she would consider suicide, if he were to leave, knowing that her own life is worthless without him around. !~ (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b455-JI7SM4C2iBIF.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 455
      },
      "rarity": "epic"
    },
    {
      "id": "azusa-fuyutsuki",
      "name": "Azusa Fuyutsuki",
      "alt_names": [
        "冬月あずさ"
      ],
      "role": "protagonist",
      "description": "A beautiful female teacher who is the heroine of the series. Unlike Onizuka, she led a relatively normal life, graduating from Waseda University. Her quiet manner and moderate ideas are misleading as she proves to be very tough on her own sometimes scaring even Onizuka. To prepare him for the test which would determine his teaching career, she prepares a mountain of jelly with eyes of Maguro tuna fish as fruits and imposes an impossibly tough schedule that would have killed anyone or drove them mad. Her field of teaching is Kokugo or Japanese language (English in the Live Action). She, not that surprisingly, falls in love with Onizuka, but as both are quite reluctant to admit their feelings and show them in the open they claim that they are just \"friends\". It's not really a major matter to anyone else except Suguru Teshigawara, who finds it most aggravating that a woman with her qualifications would fall in love with one with such a crude background as Onizuka. She has difficulty with the female students in her class due to all the boys in her class having crushes on her but brings them around fairly quickly after Onizuka's advice. She has a younger sister named Makoto.",
      "metadata": {
        "gender": "female",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/3529.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3529
      },
      "rarity": "epic"
    },
    {
      "id": "yoshito-kikuchi",
      "name": "Yoshito Kikuchi",
      "alt_names": [
        "菊地善人",
        "Coochie"
      ],
      "role": "protagonist",
      "description": "Yoshito Kikuchi is one of Eikichi Onizuka's students. This computer prodigy (scoring the highest without certain \"aid\" in the country, on a standardized test) serves as class president and is also notorious for making pornographic composite photos, during Onizuka's arrival at the Holy Forest Academy. He tries to blackmail him into resignation with several pictures posted all across the school for everyone to see. Onizuka catches Kikuchi and instead of punishing him, hires him to make composite pictures of Azusa Fuyutsuki and other female teachers, much to his surprise.\n\nKikuchi eventually befriends Onizuka, and later helps Noboru Yoshikawa prevent Anko Uehara's mother, the president of the local Parent-Teacher Association, from getting Onizuka fired. Kikuchi is an amateur martial artist, having prior experience in judo and other techniques learned from Mayu Wakui. It is revealed after the examinations that he was the one who switched Onizuka's test papers for a perfect score. When questioned about the actual results that Onizuka has, Kikuchi calculates it himself, and is thoroughly surprised at the score (it is unknown whether Onizuka actually did score perfect, or a score befitting his intelligence), and asks him directly, to which his teacher replies that he definitely received a perfect score. In the manga, a possible relationship is hinted between him and Ai Tokiwa, after some intervention and a forced embrace from Onizuka.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/3604.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3604
      },
      "rarity": "epic"
    },
    {
      "id": "kunio-murai",
      "name": "Kunio Murai",
      "alt_names": [
        "村井國男"
      ],
      "role": "protagonist",
      "description": "The class \"jock bully\", Kunio Murai is not very bright and loses his temper easily. When Eikichi Onizuka arrives at the Holy Forest Academy, Kunio and his gang (consisting of Kouji Fujiyoshi and Tadaaki Kusano) attempt to kill him several times with seemingly innocent pranks, such as a cockroach planted in his school lunch. The plans backfire (such as Kunio eating the cockroach, instead) and he goes insane, nearly ending up with his face impaled on a pair of razor-sharp scissors. Onizuka then takes advantage of Kunio's 27 year-old mother, Julia Murai, after trouncing Kunio at several arcade games. It is later revealed that Julia was carrying her son at the age of 13, and her parents and boyfriend abandoned her, making Kunio overprotective of his mother.\n\nKunio and his gang befriend Onizuka, after he saves them from a group of ruffians, but not before Onizuka joins the ruffians and has Kunio bungee jump off the Tokyo Bay Bridge. Kunio still gets very angry when Onizuka tries to make a pass at his mother, especially with the possibility that Onizuka may well be his new stepfather. His fear of a new father also rears its head when he suspects his mother may be marrying a man who resembles Dr. Elefun from Astro Boy.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/4119.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4119
      },
      "rarity": "epic"
    },
    {
      "id": "tomoko-nomura",
      "name": "Tomoko Nomura",
      "alt_names": [
        "野村朋子",
        "Big Top",
        "Toroko",
        "Tomo-chan "
      ],
      "role": "protagonist",
      "description": "A student in Eikichi Onizuka's class, Tomoko Nomura has a large chest (her cup size is F), but is not too bright, leading to people calling her Toro-ko (Toro meaning \"slow\" in Japanese; she is nicknamed Slo-mo-ko in the English version). After initially messing up her role in one of Miyabi Aizawa's plans to get Onizuka fired, she is cut off from Miyabi's group. Seeing her rather slow, clumsy nature, Onizuka enters her into a local beauty contest. He even arranges two porn producer friends to dress her up for the competition. Rather than read the given script for the acting category, Onizuka gives her a couple of action figures and she ends up doing an excellent improvised piece (with Vice-Principal Uchiyamada getting an accidental role). In the anime, Onizuka throws a cellphone on stage and she leaves a sentimental message on Miyabi's answering machine instead. She doesn't win, but she gets noticed by several television producers and begins starring in various commercials. Her young male manager, impressed with her natural beauty, and after falling in love at first sight, makes it his lifetime goal to help her succeed.      She was friends with Urumi Kanzaki since childhood, and their close bond likely arose out of their opposite personalities (Tomoko is clumsy and rather docile with a heart of gold, compared to Urumi's intellect and potential to be savagely cruel).      A side-story in the manga features Tomoko and her manager, also called GTO, only it stands for Great Tomoko Oppai (Oppai meaning breasts). In it, Tomoko's manager embarks on one very madcap adventure to save her from her dubious producers. In the live-action, instead of her succeeding dramatically in subsequent episodes, she would part for an Okinawa acting school.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/6231.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6231
      },
      "rarity": "epic"
    },
    {
      "id": "miyabi-aizawa",
      "name": "Miyabi Aizawa",
      "alt_names": [
        "相沢雅"
      ],
      "role": "protagonist",
      "description": "Anime - Aizawa began not to trust teachers anymore when one of her classmates got involved in a scandal due to an affair of their former instructor. From this, she and her cohorts began their quest of kicking out any teacher who will be assigned to their class. They were successful in making these teachers resign, but Onizuka...  Manga - What drives Miyabi to go bad and lead a rebellion against teachers is an incident which occured when she was in the 7th grade. She had been the favorite student of Mr. Ogi, teacher of Class 2-4 ( the name of her class back in junior high ). Ogi would praise her for her beauty and intellegence often. Miyabi misinterpreted this as Mr. Ogi having a crush on her. As a result, Miyabi began behaving and dressing in a more mature manner. She started cooking him lunch everyday. She also started wearing revealing clothes ( such as miniskirts and tanktops ). Instead of setting Miyabi straight, Mr. Ogi went along with it. To some degree, he did like Miyabi. He continued to praise her and accept her subtle advances. One day, Miyabi is invited to Mr. Ogi's house. She goes, thinking he is going to confess his love for her. As soon as she gets there, Mr. Ogi introduces her to his fiance. Miyabi storms off in tears, feeling hurt and used. As revenge, Miyabi takes illicit photos of herself and goes into class the next morning telling her classmates that Mr. Ogi raped her and then took pictures ( knowing that Mr. Ogi's hobby is photography ). Since that day, Miyabi has hated teachers.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/6232.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6232
      },
      "rarity": "epic"
    },
    {
      "id": "hiroshi-uchiyamada",
      "name": "Hiroshi Uchiyamada",
      "alt_names": [
        "内山田ひろし"
      ],
      "role": "protagonist",
      "description": "Yoshiko's father and Vice Principal of Holy Forest Academy. He is a very strict man who readily blindly follows the school rules and places them on top of anything else. Also he doesn't have much patience. He is easily enraged by Onizuka's behavior basically always. He seems to have no respect for school delinquents or any rebels during the series. Hiroshi believes that Onizuka is the evil root of all his misfortunes. He was visibly against Onizuka's hiring, but had to accept Principal Sakurai's decision.  Uchiyamada is always yelling at Onizuka's behavior and argues with him a lot.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/6238.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6238
      },
      "rarity": "epic"
    },
    {
      "id": "ryuuji-danma",
      "name": "Ryuuji Danma",
      "alt_names": [
        "弾間龍二"
      ],
      "role": "supporting",
      "description": "The other member of the Onibaku duo, Ryuuji is taller and maybe slightly more restrained than his partner, although get in his bad books and you're in for big trouble. He has more luck with women, having had a relationship with his teacher Ayumi, and later Nagisa (seen in GTO). Ryuuji's family are nice, normal people, who appear quite wealthy, who totally disapprove of his 'bad behavior', however his elder sister Yoko allows him to stay at her home when he needs to. His younger brother is called Yoshitaka. Ryuuji rides a Honda CBX-400F, as seen in Bad Company.",
      "metadata": {
        "dateOfBirth": "1976-03-30"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/2264.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2264
      },
      "rarity": "uncommon"
    },
    {
      "id": "kouji-fujiyoshi",
      "name": "Kouji Fujiyoshi",
      "alt_names": [
        "藤吉晃二",
        "藤吉コージ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/4460.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4460
      },
      "rarity": "uncommon"
    },
    {
      "id": "noboru-yoshikawa",
      "name": "Noboru Yoshikawa",
      "alt_names": [
        "吉川昇"
      ],
      "role": "supporting",
      "description": "A student at Holy Forest Academy who didn't have a good time before Eikichi Onizuka arrived, as he was the victim of bullying, mostly from Uehara Anko and her group. He is extremely good with video games and somewhat of an otaku, but proves to be quite handy with making things. Anko's bullying is so bad it makes him attempt to commit suicide twice, both times by leaping off the roof of the school, and both times resulting in him being saved by Onizuka, at the cost of Vice-Principal Hiroshi Uchiyamada's car. The two strike a quick friendship, which works for Onizuka, as Noboru has plenty of items that he wants to \"borrow\". His loyalty to Onizuka is by far the strongest, seen when he willingly sells his game collection to help cover Onizuka's debt. While on the school trip to Okinawa, he gets assigned to the same room as Anko and her friends by Onizuka. In retaliation for Onizuka and Noboru's antics, he gets tied up and led away into the dense jungle by the girls, but they all end up getting lost and rely on him for help. Despite the abuse, he saves Anko's life after she falls off a cliff, getting separated from the others. As the rest of the events of the manga unfolds, Noboru begins to enjoy Anko's company enough that she begins to feel affectionate to him.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5947.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5947
      },
      "rarity": "uncommon"
    },
    {
      "id": "anko-uehara",
      "name": "Anko Uehara",
      "alt_names": [
        "上原杏子",
        "An-chan"
      ],
      "role": "supporting",
      "description": "Anko Uehara is an athletic girl with well-off parents who has her own trio, in which she is accompanied by Naoko Asano and Mayuko Izumi.  Anko is one of the first of the class to start trouble for Eikichi Onizuka, due to her and her friends&#039; constant mistreatment of Noboru Yoshikawa. After the most recent assault on Noboru Yoshikawa leaving him severely beaten and humiliated yet again do they get taught a lesson by Onizuka, who literally spanks them at a karaoke bar and takes pictures of himself committing the act. Afterwards, Anko gets her mother, the president of the local Parent-Teacher Association, who believes her daughter is incapable of wrongdoing, to get Onizuka fired. This backfires, with the help of Noboru and Yoshito Kikuchi, who reveal her cruel, bullying nature in front of the student body and PTA. Anko tearfully confronts her mother about their relationship and perfectionist expectations of her, which leads to some family reconciliation and doesn&#039;t get any serious retribution from what she and her friends had done.  She and her friends keep their distance from any other attempts by students to get Onizuka fired, despite giving their verbal support.   ~! While still cold to Onizuka, Anko allies with him, after being fed up with Miyabi Aizawa&#039;s manipulation of others for her own gain. When Onizuka is framed for embezzeling funds for the school trip, she offers her credit card for use, but he flat-out refuses.  On the school field trip to Okinawa, her mean streak towards Noboru continues to persist, even escalating, as he and Onizuka start playing pranks of their own against her and her friends. In an ironic twist, Noboru saves her life, after her own prank fails. During a near-death experience, a flashback reveals her bullying stems from growing up with an abusive, older brother, who in turn, was abused by their father.  Shortly after, she develops feelings for him, and unsuccessfully tries to deny them. It takes an Onizuka scheme to get her to admit it.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/6229.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6229
      },
      "rarity": "uncommon"
    },
    {
      "id": "tadaaki-kusano",
      "name": "Tadaaki Kusano",
      "alt_names": [
        "草野忠明"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/6230.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6230
      },
      "rarity": "uncommon"
    },
    {
      "id": "mayu-wakui",
      "name": "Mayu Wakui",
      "alt_names": [
        "和久井繭"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/6233.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6233
      },
      "rarity": "uncommon"
    },
    {
      "id": "toshiyuki-saejima",
      "name": "Toshiyuki Saejima",
      "alt_names": [
        "冴島俊行"
      ],
      "role": "supporting",
      "description": "Along with his partner Kamata, he is feared as Kamakura no Kyouken (The Mad Dogs of Kamakura). This duo were renowned for their brutality, including shoving pencils through people's noses.    ~!However after being beaten by the Oni-Baku, the pair decided to join their gang.!~   Saejima has a malevolent face, so much so that girls are afraid of him and assume he is a Yakuza. He, like Ryuji, comes from a fairly well-to-do family, who are terrified of him- his sisters speak to him through a lock on their bedroom door, and his parents jump at his slightest movement. Saejima rides a Kawasaki.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6235-HCVGExk2ZtZt.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6235
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-24T17:45:51.702Z"
}