{
  "work_id": "the-melancholy-of-haruhi-suzumiya",
  "count": 15,
  "characters": [
    {
      "id": "kyon",
      "name": "Kyon",
      "alt_names": [
        "キョン",
        "John Smith"
      ],
      "role": "protagonist",
      "description": "__Height:__ 170 cm (5'7\") \n__Occupation:__ Student (grade 10-11)  \n\nKyon is a first-year high school student enrolled in North High, and his real name is unknown; instead being referred to by everyone by the nickname \"Kyon\". This nickname was created for him by his aunt and then spread by his [little sister](https://anilist.co/character/912/Kyon-no-Imouto). He is quite cynical and doesn't believe in anything interesting like aliens, time travelers, or espers. But his curiosity gets the better of him when he tries to talk to a new student, [Haruhi Suzumiya](https://anilist.co/character/251/Haruhi-Suzumiya). She ends up forming the SOS Brigade and drags Kyon into it, where he tries his best to stop Haruhi from causing too much trouble. Kyon is the second person to join the SOS Brigade, and is the \"fourth seat\" of the group. \n\n~!He is the only member of the group who is \"normal\", having no special abilities at all.!~",
      "metadata": {
        "gender": "male",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b252-2V9wYXSAktsX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 252
      },
      "rarity": "epic"
    },
    {
      "id": "haruhi-suzumiya",
      "name": "Haruhi Suzumiya",
      "alt_names": [
        "涼宮ハルヒ"
      ],
      "role": "protagonist",
      "description": "**Height:** 158 cm (5'2\") \n**Occupation:** Student (grade 10-11), Ultra Director, Ultra Detective, Brigade Chief and Founder\n\nHaruhi Suzumiya is the founding member of the SOS Brigade with the purpose of finding aliens, time travelers and espers. She is incredibly eccentric and usually anti-social, with no interest in \"ordinary\" humans.",
      "metadata": {
        "gender": "female",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b251-8DTaCNkSvBQ8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 251
      },
      "rarity": "epic"
    },
    {
      "id": "yuki-nagato",
      "name": "Yuki Nagato",
      "alt_names": [
        "長門有希",
        "Nagatocchi"
      ],
      "role": "protagonist",
      "description": "**Height:** 154 cm (5'0\") \n**Occupation:** Student (grade 11), ~!Integrated Data Sentient Entity Humanoid Interface!~\n\nYuki Nagato is a quiet high school freshman that is the only member of the SOS Brigade that was not \"voluntarily arrested,\" or coerced into joining, by [Haruhi Suzumiya](https://anilist.co/character/251/Haruhi-Suzumiya). She lives alone in the same apartment complex as [Ryouko Asakura](https://anilist.co/character/255/Ryouko-Asakura). Yuki has a very stoic and introverted personality, preferring simple body language rather than speaking. When prompted to speak, she does so in a very concise manner, always speaking in a monotone and displaying a dispassionate complexion. \n\n~!‎‎As it turns out, Yuki is a \"humanoid interface,\" or artificial human, created by the \"Integrated Data Entity\" three years prior for the purposes of interacting with and observing events on Earth. Specifically, she is assigned to observe Haruhi Suzumiya, who was supposedly the cause of an explosion of data that occurred and significantly altered the world.!~",
      "metadata": {
        "gender": "female",
        "age": "15-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b249-2YImP6IQTe8t.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 249
      },
      "rarity": "epic"
    },
    {
      "id": "mikuru-asahina",
      "name": "Mikuru Asahina",
      "alt_names": [
        "朝比奈みくる"
      ],
      "role": "protagonist",
      "description": "**Height:** 152 cm (5 ft)\n**Occupation:** Student (grade 11-12), SOS Deputy Vice Commander, ~!Time Traveler!~\n\nMikuru Asahina, a shy and timid girl with a childish naïveté, is the only character other than [Kyon](https://anilist.co/character/252/Kyon) to be brought into the SOS Brigade against her will. Considered one of the most beautiful girls in high school, Mikuru is as kind, caring and thoughtful as she is beautiful. She easily gets scared or flustered, and is apparently prone to daydreaming as she can also be rather clumsy at times. Nevertheless, she can be surprisingly resilient and is capable of recovering from even the most discomforting of situations. However, because of her gentle nature she seems rather helpless most of the time. Kyon sees it as his duty to always watch over and protect her, although, when it comes to [Haruhi](https://anilist.co/character/251/Haruhi-Suzumiya), there is no rescue. \n\n~!She is in fact a time traveller from the future with the purpose of observing Haruhi during the course of the story line. Mikuru often has trouble talking to Kyon because many of the things he asks about revolving around her powers are \"classified\". Mikuru's future self occassionally shows up as well, in order to properly guide the timeline to the correct path, and is notably more mature and knowledgeable than her past self. In order to differentiate between the older and younger versions, whenever the older self is present in the same time span, Kyon refers to her older self as Asahina-san (Big) and to the younger Asahina as Asahina-san (Small).\n\nMikuru is the designated \"mascot\" of the SOS Brigade, serving as a way to attract interest and members by using her attractive physical qualities- her cute face, trim figure, and noticeably sizeable bust. She was \"voluntarily arrested\" by Haruhi, who deemed it necessary to have an alluring \"Moe\" type in the club. Her sex appeal and innocence is often exploited by Haruhi to procure resources. Mikuru is on a regular occasion forced to wear any outfits that Haruhi buys for her. Haruhi also sees it fit that Mikuru is unable to dress and undress by herself most times and often does it for her, much to Mikuru's considerable - and vocal - distress.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b253-opGQ1w4AdkEK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 253
      },
      "rarity": "epic"
    },
    {
      "id": "itsuki-koizumi",
      "name": "Itsuki Koizumi",
      "alt_names": [
        "古泉一樹"
      ],
      "role": "protagonist",
      "description": "**Height:** 178 cm (5'10\")\n**Occupation:** Student (grade 11), Vice Commander, ~!Esper!~\n\nItsuki is the last member to have joined the SOS Brigade, having been recruited by [Haruhi Suzumiya](https://anilist.co/character/251/Haruhi-Suzumiya) as a \"mysterious transfer student\". Itsuki is constantly smiling and always speaks in a formal and polite manner. He is also prone to giving long and detailed explanations, usually illustrated by exaggerated hand gestures. Itsuki's fondness for speculation often causes him to produce explanations for situations involving the SOS Brigade, its members and related events. Itsuki only tends to share these explanations and theories with [Kyon](https://anilist.co/character/252/Kyon), and also enthusiastically plays different kinds of board games with him to pass the time, despite losing all the time, although Kyon suspects that he may be doing so on purpose. \n\n~!Itsuki is an Esper, and was sent to observe and keep Haruhi emotionally stable by a mysterious group known as \"The Agency\", in order to protect the rest of humanity. Although he is an esper, which is exactly one of the sorts of people Haruhi desires to meet, Itsuki never reveals himself as such, at least, not to her. Despite the theory he advances in which Haruhi is the equivalent of God, Itsuki says that there are many differing lines of speculation about Haruhi within \"The Agency.\" Itsuki himself does not believe in a singular God, nor does he regard Haruhi as such, although he reveals that he has colleagues that do. Apparently, most of the questions that he raises about Haruhi's true nature are philosophical in nature and do not necessarily represent his personal beliefs. Itsuki also reveals that the majority of \"The Agency\" advocates observing Haruhi instead of doing anything that might provoke her.   \n\nOut of the three Brigade members, Kyon is the least fond of Itsuki. He often finds himself annoyed with Itsuki's plastic smile, his willingness to acquiesce to Haruhi's outrageous schemes, playful teasing and his various forays into his psychological and philosophical theories. He is also distrustful of Itsuki's intentions, comparing him to [Yuki Nagato](https://anilist.co/character/249/Yuki-Nagato) when it comes to deciphering his expressions.!~",
      "metadata": {
        "gender": "male",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b254-ZyIHZUY6yz4W.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 254
      },
      "rarity": "epic"
    },
    {
      "id": "ryouko-asakura",
      "name": "Ryouko Asakura",
      "alt_names": [
        "朝倉涼子"
      ],
      "role": "supporting",
      "description": "At first, Ryouko appears to be a compassionate and hard-working high school girl. One of Kyon's friends, Taniguchi, places her in the top three first-year girls in the school with a grade of AA+: indicative of her pleasant personality, beauty, and athleticism. Her enormous popularity made her the unanimous choice for class president of Kyon's homeroom class. She also showed particular concern about how Haruhi had distanced herself from the rest of the class.   \n\n~!However, it turns out that she is Yuki's backup, and as such, is also another \"humanoid interface\".!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b255-25bilUoTq5HF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 255
      },
      "rarity": "rare"
    },
    {
      "id": "tsuruya",
      "name": "Tsuruya",
      "alt_names": [
        "鶴屋",
        "Tsuru-chan"
      ],
      "role": "supporting",
      "description": "Tsuruya is the hyperactive friend of [Mikuru](https://anilist.co/character/253/Mikuru-Asahina), notable for her loud voice, ankle-length hair, and prominent tooth. She possesses a cheerful and friendly disposition. She is also prone to long fits of unrestrained and intense laughter at things she considers even the slightest bit humorous.  Her fang-like tooth gives her an idiosyncratic speech pattern, causing her to misspeak words by leaving out syllables. Her speech pattern is often accompanied with a lisp and her catch phrases \"megas\" and \"nyoro\". Her knowledge of the SOS Brigade comes almost exclusively from Mikuru. She is also the heir of the Tsuruya family, which purportedly collaborates with [Itsuki](https://anilist.co/character/254/Itsuki-Koizumi)'s Agency. It is also unknown if Tsuruya has a secret identity or agenda. Though she is not a brigade member, Tsuruya is still often used as an extra body for some of the Brigade's activities.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b256-KIpinsCBiZFo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 256
      },
      "rarity": "rare"
    },
    {
      "id": "taniguchi",
      "name": "Taniguchi",
      "alt_names": [
        "谷口"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7\")\n__Occupation:__ Student (grade 10-11)\n\nTaniguchi is a loud high school student enrolled at North High who is good friends with both [Kunikida](https://anilist.co/character/258/Kunikida) and [Kyon](https://anilist.co/character/252/Kyon).\n\nTaniguchi is comically lascivious; giving a \"score\" of attractiveness to each first-year girl based upon his tastes and preferences. He remembers the full names of everyone receiving an &#039;A&#039; rank, with Nagato receiving an A-. As for Mikuru, her mere presence elicits an altered state of adoration for Taniguchi and Kunikida, especially when she was in her soba-serving costume. He also knew Haruhi from back in junior high, and was Kyon&#039;s original source of information on Haruhi before he started conversing with her. It is hinted that he may have been the person that dated Haruhi for the shortest amount of time.",
      "metadata": {
        "gender": "male",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b257-5T6DlqLcVyQ8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 257
      },
      "rarity": "rare"
    },
    {
      "id": "kunikida",
      "name": "Kunikida",
      "alt_names": [
        "国木田"
      ],
      "role": "supporting",
      "description": "__Height:__ 166 cm (5'5\")\n__Occupation:__ Student (grade 10-11)\n\nKunikida is a quiet high school student enrolled at North High who is good friends with both [Taniguchi](https://anilist.co/character/257/Taniguchi) and [Kyon](https://anilist.co/character/252/Kyon).\n\nKunikida is much quieter than Taniguchi with the latter doing most of the talking when the two are hanging out. He and Kyon went to the same junior high school, and may know more about Kyon. He once stated that \"Kyon likes weird girls,\" as evidence to support the idea that Kyon is romantically interested in [Haruhi Suzumiya](https://anilist.co/character/251/Haruhi-Suzumiya). It is believed that Kunikida himself has a crush on [Tsuruya](https://anilist.co/character/256/Tsuruya).",
      "metadata": {
        "gender": "male",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b258-O2CH3BuLMew0.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 258
      },
      "rarity": "rare"
    },
    {
      "id": "arakawa",
      "name": "Arakawa",
      "alt_names": [
        "新川"
      ],
      "role": "supporting",
      "description": "Arawaka is a butler in The Melancholy of Haruhi Suzumiya. Not much is known about him, but it is revealed that he is a member of the Agency and one of Koizumi&#039;s contacts. He is usually seen with Mori, another Agency member who takes on the appearance of a maid.    Arawaka is introduced as the butler of a mansion during the Lone Island Syndrome arc, but appears later on during the Lone Mountain Syndrome arc. He also helps in retrieving Mikuru from the other Agency.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/882.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 882
      },
      "rarity": "rare"
    },
    {
      "id": "sonou-mori",
      "name": "Sonou Mori",
      "alt_names": [
        "森園生"
      ],
      "role": "supporting",
      "description": "A member of the Agency.      ~!She is the one who leads negotiations with Mikuru Asahina's captors in the seventh novel, suggesting that she has a higher ranking position within the Agency.!~     Her normal appearance is that of a maid.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/883.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 883
      },
      "rarity": "rare"
    },
    {
      "id": "yutaka-tamaru",
      "name": "Yutaka Tamaru",
      "alt_names": [
        "多丸裕"
      ],
      "role": "supporting",
      "description": "Tamaru Keiichi&#039;s younger brother who also stayed at the mansion.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/884.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 884
      },
      "rarity": "rare"
    },
    {
      "id": "keiichi-tamaru",
      "name": "Keiichi Tamaru",
      "alt_names": [
        "多丸圭一"
      ],
      "role": "supporting",
      "description": "The owner/master of the house on the island from episode 9.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b885-t1kV4WAjudpH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 885
      },
      "rarity": "rare"
    },
    {
      "id": "kyon-no-imouto",
      "name": "Kyon no Imouto",
      "alt_names": [
        "キョンの妹",
        "Kyon's Sister"
      ],
      "role": "supporting",
      "description": "Not much is revealed about Kyon&#039;s fifth-grade sister; not even her real name is given. Other characters simply refer to the eleven-year-old as Kyon&#039;s (Younger) Sister or Little Sis. She has relatively few speaking lines, though she does appear in The Adventures of Mikuru Asahina - Episode 00, Episode 6, and Episode 14, fulfilling the duties of an irrepressible younger sister. She has even fewer lines and appearances in the original novel version than the anime&#039;s rendition. Usually, her presence is made apparent whenever Kyon is at home.    She is carefree, happy and playful and is also the force behind the use of the nickname &quot;Kyon&quot;; after she heard their aunt call her older brother such, she started using the nickname as well in front of his school friends. From there, the name spread and eventually stuck. She seems to get along well with all of the SOS Brigade, especially with Mikuru, sharing a sister-like relationship with her.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b912-7RxcjIl1JssE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 912
      },
      "rarity": "rare"
    },
    {
      "id": "kiyosumi-morimura",
      "name": "Kiyosumi Morimura",
      "alt_names": [
        "森村清純"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "age": "46",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/3620.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3620
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-25T08:34:11.402Z"
}