{
  "work_id": "bakuman",
  "count": 15,
  "characters": [
    {
      "id": "moritaka-mashiro",
      "name": "Moritaka Mashiro",
      "alt_names": [
        "真城最高",
        "Saiko"
      ],
      "role": "protagonist",
      "description": "__Horoscope:__ Aquarius\n__Height:__ 171 cm \n\nMashiro is a 14-year-old boy who doesn't know what to do with his life. One day his classmate Takagi finds out about his amazing drawing skills and asks him to help create a manga. He initially declines but changes his mind when Takagi helps him to ​get engaged with his crush, Azuki Miho.  He and Takagi create manga for Shonen Jump under the pen-name Ashirogi Muto. Mashiro is very talented in drawing although he is very dissatisfied with his style. He specializes in drawing fairly dark characters. His favorite manga is Ashita no Joe.",
      "metadata": {
        "gender": "male",
        "age": "14-24",
        "dateOfBirth": "1994-02-18"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14545-WjCGUsYLCEVn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14545
      },
      "rarity": "epic"
    },
    {
      "id": "akito-takagi",
      "name": "Akito Takagi",
      "alt_names": [
        "高木秋人",
        "Shujin"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175cm (5'8.9\")\n\nAkito is a young 14-year-old who gets some of the best grades in the country and is an award-winning writer. With these brains and writing skills,​ you would think he would have a stable and bright future, but no, this boy has dreams of becoming a mangaka and he is determined to make his dream come true at any cost.   Takagi persuades Mashiro into creating a manga with him after he finds out about his amazing drawing abilities. The two work under the pen-name Ashirogi Muto. Takagi specializes in serious and realistic story lines. His favorite manga is Dragon Ball.    ~!He eventually dates Miho's best friend, Kaya Miyoshi. Later they get married. !~",
      "metadata": {
        "gender": "male",
        "age": "14-24",
        "dateOfBirth": "1994-01-25"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14552-l5hN8i6wFfTl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14552
      },
      "rarity": "epic"
    },
    {
      "id": "miho-azuki",
      "name": "Miho Azuki",
      "alt_names": [
        "亜豆美保",
        "Amame",
        "Azukyun"
      ],
      "role": "supporting",
      "description": "__Height:__ 162cm\n\nAzuki is Mashiro's classmate. Her dream is to be a voice actor. She agreed to marry Mashiro when both of their dreams come true. However, she also told him that in the mean time, they should not have any distractions so they will contact each other only through emails. Her best friend is Kaya Miyoshi.\nAlthough her outer image is shy, she is a very mysterious girl. It is sometimes hard to know what she is thinking about.",
      "metadata": {
        "gender": "female",
        "age": "14-24",
        "dateOfBirth": "1993-11-05"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14546-J1ES7lBIPEIj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14546
      },
      "rarity": "uncommon"
    },
    {
      "id": "nobuhiro-mashiro",
      "name": "Nobuhiro Mashiro",
      "alt_names": [
        "真城信弘",
        "Tarou Kawaguchi (川口たろう)"
      ],
      "role": "supporting",
      "description": "Moritaka's uncle. He died due to overwork, but Moritaka thought he committed suicide until he saw his work. He uses his pen name Taro Kawaguchi for his works. He liked Miho's mother, but was too late to confess to her.  \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "35",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b15445-hJmcxnPuLFIC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15445
      },
      "rarity": "uncommon"
    },
    {
      "id": "eiji-niizuma",
      "name": "Eiji Niizuma",
      "alt_names": [
        "新妻エイジ"
      ],
      "role": "supporting",
      "description": "Eiji Nizuma is a high school genius mangaka who has been drawing ever since he was young. Moritaka Mashiro and Akito Takagi consider him their rival. He was supposed to serialize a manga called Yellow Hit but he wanted to draw a different manga, Crow, which appeared in Akamaru Jump instead. His assisants were initially Nakai and Fukuda (Mashiro also worked for him temporarily before Detective Trap was serialized). His editor is Hattori Yujiro. He once demanded to be allowed to end one series he hated if he ever made it as the most popular author in Jump.   Niizuma is slightly naive, but can also be serious and calculating when he wants to. Eiji tends to act conceited because he is hailed as a genius; however, after working on Crow for quite a long time, he grew more humble, even claiming to not be \"good enough of a Mangaka to be judging other people's work\" when asked by his editor to judge for the Golden Future Cup. (He judges anyway, but is not very helpful, only expressing his interest in Ashirogi and Ryu Shizuka). He tends to make noises and sound effects when drawing or writing his manga. Eiji is constantly chastised by his editor, and at first seems to be rather oblivious towards his rivals' feelings towards him, even expressing great excitement when he meets Ashirogi Muto and saying he is their fan. He is a great lover of manga and his opinion are valued by everyone at Jump, including his rivals. He refers to himself as an \"Eternal Boy\" and that is why he writes Shonen manga. He has only ever had a crush on one girl, back in elementary school, which paired with his naivet'e most likely explains his lack of success in the Super Leaders' Love Fest.",
      "metadata": {
        "gender": "male",
        "age": "15-26",
        "dateOfBirth": "1992-11-03"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16596-F2ykCK1ruRws.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16596
      },
      "rarity": "uncommon"
    },
    {
      "id": "kaya-miyoshi",
      "name": "Kaya Miyoshi",
      "alt_names": [
        "見吉香耶"
      ],
      "role": "supporting",
      "description": "__Height:__ 165cm (5'5\")\n\nMiho's best friend, who is in 9th year, class 2 in the same school as Miho and Mashiro. Though being her best friend, she doesn't know that Miho likes Mashiro. She confronts Takagi about having asked Miho about her dream, given that she had told him, which results into Takagi making her believe that he likes her. This surprises her, given that she likes him and she tells him she'll have to think about it. She and Takagi eventually begin going out. Miyoshi plans to go to Yakusa North High, the same high school Moritaka and Tagaki are planning to go to and eventually does so.    ~!She marries Takagi. !~",
      "metadata": {
        "gender": "female",
        "age": "15-25",
        "dateOfBirth": "1993-06-25"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17976-NcCZQaFL0rxv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17976
      },
      "rarity": "uncommon"
    },
    {
      "id": "akira-hattori",
      "name": "Akira Hattori",
      "alt_names": [
        "服部哲"
      ],
      "role": "supporting",
      "description": "One of the editors of the Weekly Shōnen Jump. He is a thin, odd-looking man with a wide-eyed gaze and distinctive lips. Hattori Akira was Akito Takagi's and Moritaka Mashiro's editor. He helped them with their names and eventually got them serialized for Detective Trap. Once they got serialized, however, Hattori had to hand them over to Miura due to conflicting responsibilities.   Hattori is often portrayed as one of the calmer and more calculated editors in the series. He comes across as a very wise and experienced editor which leaves him raising his voice only when he sees it absolutely necessary to do so. He is very fond of Takagi and Mashiro and continues to be interested in their progression as mangakas, offering off-hand advice to Miura when he can. Hattori is editing One Piece. Hattori's face (especially his lips and eyes) resemble the character Ryuk from the manga Death Note which is drawn by Takeshi Obata. The character was inspired by Jean-Baptiste Akira Hattori, a real life editor who worked with One Piece",
      "metadata": {
        "gender": "male",
        "age": "28-38",
        "dateOfBirth": "1980-04-27"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b18914-JY7zOgWjFmdL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18914
      },
      "rarity": "uncommon"
    },
    {
      "id": "shinta-fukuda",
      "name": "Shinta Fukuda",
      "alt_names": [
        "福田真太"
      ],
      "role": "supporting",
      "description": "__Birthplace: __Hiroshima-ken, Japan   \n\nFukuda is a main supporting character in Bakuman and the founder of Team Fukuda. He left home after high school and worked as an assistant to Eiji Niizuma for Crow, along with Mashiro. Fukuda had already won an honorable mention when he tried for the Tezuka Award and also got seventh place in the same issue of Akamaru Jump in which where Ashirogi's Money and Intelligence ran and got third place. Later, Fukuda competed with Ashirogi and Nakai in the Golden Future cup with his original manga, Kiyoshi Knight.   Later, Fukuda successfully serializes Kiyoshi Knight, quits his job as Niizuma's assistant, and gains a new assistant named Yasuoka. His editor is Yujiro. With the serialization of Kiyoshi Knight, Fukuda became an aspiring rival to Ashirogi, Eiji, and Nakai. Among these three, he is considered to have the worst drawings, though they apparently match his stories. His drawings often border on grotesque.   Fukuda is rash and often seems fueled by his emotional swings. He's very competitive and enjoys the competition between him, Ashirogi, Eiji, and Nakai. Along with all of this, he's also rather conceited, but at the end of the day is a very good friend (and rival).    ~!Despite the relative longevity of Kiyoshi Knight, Fukuda is unsatisfied with the series and concludes it, starting Road Racer GIRI to compete with his rivals. Road Racer GIRI gets off to a good start as soon as it is released, though Fukuda frequently remarks that he needs to get people who wouldn't \"draw such crappy bikes\". Fukuda's Road Racer GIRI ranks higher than Ashirogi's PCP on several occasions, maintaining a high ranking that is able to compete with and surpass Niizuma's +Natural. After the Love Fest, in which Fukuda is angry at placing second to last out of seven for his love manga, GIRI receives an anime offer, stunning Fukuda and causing him to gratefully thank Yujiro with formalities. !~ \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "19-28",
        "dateOfBirth": "1990-07-27"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21107-KprhXykBIZZO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21107
      },
      "rarity": "uncommon"
    },
    {
      "id": "kazuya-hiramaru",
      "name": "Kazuya Hiramaru",
      "alt_names": [
        "平丸一也"
      ],
      "role": "supporting",
      "description": "__Birthplace:__ Kanagawa-ken, Japan   \n\nHiramaru was a salaryman​ that hated working. On hearing Takagi and Mashiro talking about drawing manga on the subway and finding an abandoned copy of Jack, he quit his job to be a mangaka because he thought it would be less work for him. He is a different kind of genius compared to Eiji because he is talented even though he just started to write manga more in of a spur of the moment.   After teaching himself to draw manga in a very short amount of time, his manga, Otters 11 is serialized. He is hailed as a genius by Koji Yoshida who pushed for his serialization saying that Hiramaru had no real motivation to continue as a mangaka and failure would just make him quit.   Hiramaru is extremely lazy and immediately regrets getting serialized due to the amount of work to keep up a weekly series. He has said that he doesn't know why people have to work for a living and that he wants to sleep when he's tired and to eat when he's hungry. Due to his laziness, his editor, Koji Yoshida, often schemes to manipulate Hiramaru into working. Hiramura often tries to escape Yoshida to avoid working. His attempts to escape Yoshida is a long-running gag in the manga.   He is also a chronic hypochondriac and often makes incredible claims of illness. However, he is always proven healthy by the doctors. It's mostly believed that his \"illnesses\" are not only a product of his own fears, but also serves as an excuse to avoid work.   Hiramaru has a huge crush on Aoki Yuriko. Yoshida bribes him into doing work by giving him weekly facts about Aoki. Yoshida also often depicts dramatic scenarios of Aoki rejecting him due to his laziness or inability to produce names to energize him to work hard. Because he can't stand the idea of losing Aoki in his life, a combination of his own anxiety and Hiramaru's end-game scenarios, he works feverishly in hopes his work will earn Aoki's heart.    ~!Eventually, he gets engaged to her in Chapter 160. !~",
      "metadata": {
        "gender": "male",
        "age": "26-32",
        "dateOfBirth": "1984-06-18"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22818-1GvqQM3uTvcj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22818
      },
      "rarity": "uncommon"
    },
    {
      "id": "gorou-miura",
      "name": "Gorou Miura",
      "alt_names": [
        "港浦吾郎"
      ],
      "role": "supporting",
      "description": "Miura is the second editor for Ashirogi Muto. He is very enthusiastic and excited, and sometimes not a hard enough editor for the boys.    ~!After Detective Trap was canceled, he pushed Mashiro and Takagi to work on a gag manga.!~",
      "metadata": {
        "gender": "male",
        "age": "23-31",
        "dateOfBirth": "1987-05-14"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23480-wb09Sfu7awoB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23480
      },
      "rarity": "uncommon"
    },
    {
      "id": "koji-makaino",
      "name": "Koji Makaino",
      "alt_names": [
        "間界野昂次",
        "Koogy"
      ],
      "role": "supporting",
      "description": "Koogy is a musician and a fashion designer.    ~!He announces at his last concert he is going to be a manga creator, one of the four chosen for the Golden Future Cup, with the idea his fans will fill in the questionnaires for him, trying to change the competition in, as Fukuda likes to call it, \"a lame popularity contest\". !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23481-faxkPfu0JX7K.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23481
      },
      "rarity": "uncommon"
    },
    {
      "id": "yuriko-aoki",
      "name": "Yuriko Aoki",
      "alt_names": [
        "青木優梨子",
        "Aoki Ko",
        "Yuri-tan"
      ],
      "role": "supporting",
      "description": "__Pen name:__ Ko Aoki (蒼樹紅)   \n\nAoki is a manga creator who used to work for a shoujo magazine called Margaret Magazine​ until she was advised to switch over to a shounen magazine. Over at Shounen Jump, she worked with Nakai on her series Hideout Door. She usually bears a tough exterior and can come off as having a cold personality. Aoki attended To-Oh University with Iwase, the same fictional and prestigious university that L and Light from Death Note attend together.    ~!She currently works alone, both writing and drawing her stories without the help of a more talented artist, aside from her assistants. !~  ~!Hiramaru courts Aoki for a while, but the relationship becomes canon when he finally proposes to Aoki while on an amusement park's ferris wheel and she accepts. !~",
      "metadata": {
        "gender": "female",
        "age": "20-28",
        "dateOfBirth": "1990-03-11"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23482-yKRqvqHV2IO8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23482
      },
      "rarity": "uncommon"
    },
    {
      "id": "takuro-nakai",
      "name": "Takuro Nakai",
      "alt_names": [
        "中井巧朗"
      ],
      "role": "supporting",
      "description": "Nakai is an assistant for Niizuma. He won a monthly award ten years ago and has been determined to get serialized since. He is good with backgrounds and angles.    ~!Takuro Nakai was an assistant-for-Niizuma-turned manga artist. He won a monthly award ten years ago​ and has been determined to get serialized since. He was the artist of Hideout Door, and worked with Aoki Yuriko. After Hideout Door is canceled, Nakai leaves because he is sick of himself and how he used manga for his own personal gain. He returns to manga after Nanamine requests for his assistance. Nanamine's series was eventually canceled and Nakai becomes Hiramaru's assistant. !~",
      "metadata": {
        "gender": "male",
        "age": "33",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23483-1gqZxWGY4nhM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23483
      },
      "rarity": "uncommon"
    },
    {
      "id": "yujiro-hattori",
      "name": "Yujiro Hattori",
      "alt_names": [
        "服部雄二郎"
      ],
      "role": "supporting",
      "description": "Yujiro is one of the youngest editors at Shounen Jump and editor of Eiji Nizuma's successful manga Crow as well as Fukuda's, Kiyoshi Knight and later Road Racer Giri.   Yujiro has difficulty keeping Eiji in line but prides himself on finding such a talented Mangaka. Due to his success, he later becomes a team leader.   While initially arrogant towards Hattori Akira, Yujiro eventually warms up to him to the point where they meet regularly and exchange ideas as editors.   \n\n(Source: Bakuman Wikia)",
      "metadata": {
        "gender": "male",
        "age": "27-36",
        "dateOfBirth": "1982-04-03"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23485-8skseqqIg7yO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23485
      },
      "rarity": "uncommon"
    },
    {
      "id": "natsumi-katou",
      "name": "Natsumi Katou",
      "alt_names": [
        "加藤奈津実"
      ],
      "role": "supporting",
      "description": "She is one of Ashirogi Muto's assistants, along with Takahama and Ogawa. She is their only female assistant. She has one year of experience with shounen and one year of experience with shoujo.   She gains experience throughout the series as she becomes an assistant for Takahama's Business Boy Kenichi, Aoki Kou's A Time of Green Leaves, and then later back to being assistant for Ashirogi Muto's PCP after one of their assistants gets serialized.",
      "metadata": {
        "age": "33",
        "dateOfBirth": "1985-09-10"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/23681.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23681
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-25T06:32:39.213Z"
}