{
  "work_id": "mushi-shi",
  "count": 15,
  "characters": [
    {
      "id": "ginko",
      "name": "Ginko",
      "alt_names": [
        "ギンコ"
      ],
      "role": "protagonist",
      "description": "Ginko employs himself as a Mushi master (mushi-shi), traveling from place to place to research Mushi and aid people suffering from problems caused by them. Ginko's unusual white hair and green eye color is the result of an incident involving a mushi that occurred when he was a child. While designing the character, Mushishi-writer and -artist Urushibara actually planned to have the story take place in a contemporary setting. Ginko's rather modern clothes, which do not seem to match the time period reflected by all other characters, still reflect this. Ginko is a rare person who attracts mushi. This inspires his peripatetic lifestyle; staying in one place too long will gather a potentially dangerous amount of mushi. He also smokes constantly in order to keep mushi away.  In terms of personality, Ginko is rather laid back, but can be very serious when it comes to protecting people from mushi. He also often stresses that the mushi are not evil, but they merely exist as a part of the nature and try to survive like every other living being.\n\n~!When Nui found him, he was unconscious in the woods, wounded and abandoned. As he had no place to go, Nui decided to care for him instead of making him leave. He went by the name \"Yoki\" until Nui was consumed by the Ginko mushi, thus changing his name to \"Ginko.\"!~ ~!He lost his other eye and hair color when he tried to save Nui from the Ginko mushi that lived in the pond near where they lived. Nui protected Ginko by telling him to offer them as a sacrifice so the Ginko would let him be. He never saw Nui again and after nearly being consumed by the mushi he adopted the name Ginko to save himself.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b425-khK03T5n9Umq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 425
      },
      "rarity": "legendary"
    },
    {
      "id": "adashino",
      "name": "Adashino",
      "alt_names": [
        "化野"
      ],
      "role": "supporting",
      "description": "Adashino is the doctor of a seaside village whom [Ginko](https://anilist.co/character/425/Ginko) occasionally visits to sell Mushi-related items to. His hobby is collecting such items and keeps them in a shed behind his home.\n\n(Source: Mushishi Wiki, edited)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4071-RXY16EmCYjVr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4071
      },
      "rarity": "rare"
    },
    {
      "id": "nui",
      "name": "Nui",
      "alt_names": [
        "ぬい"
      ],
      "role": "supporting",
      "description": "Nui is a Mushishi and the narrator of the anime series. Her voice can be heard in many episodes.\n\nNui's appearance is very similar to the series' protagonist [Ginko](https://anilist.co/character/425/Ginko). Due to her exposure to the Ginko Mushi, she has white hair and only her left eye (which has turned green). She is tall and usually wears a dark kimono. Since she doesn't have her right eye, she keeps it shut. Nui's appearance was different before being exposed to the Ginko, she had long, black hair, dark eyes, and wore a brighter kimono. Similar to Ginko, she smokes Mushi-Tobacco to keep Mushi away.\n\nNui is a Mushishi from an isolated yet beautiful village in the mountains. Due to her tendency to attract Mushi she rarely stayed in her village and often used to travel from place to place driving Mushi away. She still often used to visit her parents, friends, and her husband and child.\n\nDue to her research on the Ginko, she was constantly exposed to its light and that changed her appearance. One day, she found an injured boy named Yoki in the woods who had lost his mother in a landslide. She tended to his wounds and explained to him the nature of Tokoyami.\n\n~!One day while returning from her travels, she learned from other villagers that her husband, parents, child, and her friends had disappeared into the mountains. While searching for them she found out that there were Tokoyami living in a pond.\n\nOnce she realized that her loved ones were turned into Tokoyami by the Ginko, she then decided to live near the pond and studied the Tokoyami and the Ginko that lived within it. She used the fish in the pond to conduct her research only to find out that eventually all the fish exposed to the Ginko turn into Tokoyami.!~\n\n~!She willingly exposed herself to the light of the Ginko and turned into Tokoyami. Before completely fading away, Yoki grabbed her hand and was also consumed by the Tokoyami. Within the Tokoyami, Nui's spirit guided Yoki and told him that in order to escape, he would have to sacrifice his memories and one of his eyes to the Ginko. The Ginko then awoke and consumed the rest of Nui.!~\n\n(Source: Mushishi Wiki, edited)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5167-DreoKnv7XdOS.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5167
      },
      "rarity": "rare"
    },
    {
      "id": "jin",
      "name": "Jin",
      "alt_names": [
        "ジン"
      ],
      "role": "supporting",
      "description": "A blacksmith whose dreams become reality seeks Ginko&#039;s help.  He appears in episode #4, The Pillow Lane.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b9972-HaxfJjEn6DSI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9972
      },
      "rarity": "rare"
    },
    {
      "id": "tanyuu-karibusa",
      "name": "Tanyuu Karibusa",
      "alt_names": [
        "狩房淡幽"
      ],
      "role": "supporting",
      "description": "Tanyuu is the fourth and current Scribe of the Karibusa family. A Karibusa Scribe is a person with a special coal-like birthmark. The birthmark contains a type of Mushi called The Forbidden Mushi. The curse is located on her right leg.\n\nTanyuu is a kind person who, despite the amount of hardship that the Mushi have brought on her life, is extremely attached to them. For this reason, she hates having to hear stories about Mushi being treated as lesser than humans or as vermin that need to be killed. She loves hearing stories about Mushi from [Ginko](https://anilist.co/character/425/Ginko) because unlike most Mushishi, he is attached to Mushi and understands that Mushi are not just evil creatures, but simply living creatures trying to survive. She is efficient and talented at her job, something she initially hated as a child but grew to love, and is proud but compassionate towards those she loves.\n\nA cursed Mushi that once nearly brought the destruction of all of life is sealed in her right leg and she is upset that this Mushi is the reason her current guardian and the Minai family line are suffering. She often worries more about others than herself but does lament the inability to use her leg. Tanyuu's deepest desire is to complete the sealing away of the forbidden Mushi and to be freed to travel with Ginko.\n\n(Source: Mushishi Wiki, edited)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13714-WP9UOIjZrD8j.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13714
      },
      "rarity": "rare"
    },
    {
      "id": "kisuke",
      "name": "Kisuke",
      "alt_names": [
        "キスケ"
      ],
      "role": "supporting",
      "description": "Kisuke appears in episode 14, &quot;Inside the Cage&quot;. He is unable to escape a bamboo forest due to Mushi that take the shape of mysterious white bamboo.    He is Setsu's husband and the father of her child.    He longs to revisit the village he grew up in, he has been stuck in the forest since he was a child.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16808-hfwuR6P9Neq9.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16808
      },
      "rarity": "rare"
    },
    {
      "id": "setsu",
      "name": "Setsu",
      "alt_names": [
        "セツ"
      ],
      "role": "supporting",
      "description": "Setsu appears in episode 14, &quot;Inside the Cage.&quot; Mysteriously, she was born as a bamboo shoot, but grew as a normal human - outside of surviving only on the water of the white bamboo, that is.    She is what they call an oni-ko, the daughter of a human and a mushi. She is like a normal human except needs the water of the white bamboo mushi, the mataradak'e, to survive. She is the daughter of the mataradak'e and a human mother",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16809-jZxCGqTSbVIE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16809
      },
      "rarity": "rare"
    },
    {
      "id": "miharu",
      "name": "Miharu",
      "alt_names": [
        "ミハル"
      ],
      "role": "supporting",
      "description": "Miharu appears in episode 15, &quot;Pretense of Spring&quot;. He is a young boy with the ability to see Mushi, by which he is absolutely fascinated. Of course, this ability never fails to make his sister, Suzu, worry, and for good reason.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16810-Ub2VKAhIZfRI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16810
      },
      "rarity": "rare"
    },
    {
      "id": "suzu",
      "name": "Suzu",
      "alt_names": [
        "すず"
      ],
      "role": "supporting",
      "description": "**Relatives**: [Miharu](https://anilist.co/character/16810/Miharu) (younger brother)\n\nSuzu is a character who lives with her younger brother, Miharu, in a small mountain house on the outskirts of a village.\n\nSuzu is a young lady, with pale skin, dark eyes, and long black hair kept in a loose braid. Her facial features are soft and kind, and she appears to be in her mid-teens to early-twenties, though her true age is unknown.\n\nSuzu has a fairly gentle personality, rarely yelling or getting angry. However, as she lives on her own while taking care of her brother, we can assume she has an independent spirit as well as a strong sense of responsibility. She seems to be an understanding person as, rather than begrudge Miharu for keeping things from her, she empathizes that he just wants to help out since the two of them have only each other.\n\nHer younger brother, Miharu, can see Mushi while she can not. He frequently wanders into the woods during winter when the two are just about to run out of food and is later found collapsed on the outskirts of town with a bag of fruits and vegetables which only grow in spring. He remains unconscious until spring each time, deeply worrying Suzu. During a snowstorm, [Ginko](https://anilist.co/character/425/Ginko) stumbles across her home and requests to stay the night. Suzu seems wary at first but allows him in. In the morning, she discovers that Ginko can also see the Mushi and tells him what's been happening with Miharu, prompting Ginko to offer to teach Miharu which Mushi are dangerous so that he can learn to avoid them.\n\n(Source: Mushishi Wiki, edited)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16811-TGtWeaI3GqEW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16811
      },
      "rarity": "rare"
    },
    {
      "id": "sayo",
      "name": "Sayo",
      "alt_names": [
        "さよ"
      ],
      "role": "supporting",
      "description": "Sayo appears in episode 16, &quot;Sunrise Serpent.&quot; She has been having trouble sleeping and suffers strange memory loss with each passing day... due to the infection of a snake-like mushi that lives in shadows and feeds on memories.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16879-LElz8hdY356n.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16879
      },
      "rarity": "rare"
    },
    {
      "id": "kaji",
      "name": "Kaji",
      "alt_names": [
        "カジ"
      ],
      "role": "supporting",
      "description": "Kaji appears in episode 16, &quot;Sunrise Serpent.&quot; He enlists the help of Ginko to get to the bottom of his mother's ever-worsening memory problems.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16880-zi9WSDFmsVUI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16880
      },
      "rarity": "rare"
    },
    {
      "id": "ito",
      "name": "Ito",
      "alt_names": [
        "緒"
      ],
      "role": "supporting",
      "description": "Ito appears in episode 17, &quot;Pickers of Empty Cocoons.&quot; Due to her ability to see Mushi, she is apprenticed at a young age by a man who uses a particular mushi&#039;s ability to pass through space. However, an unfortunate turn of fate traps her in the world of these mushi.     ~!After a hanging sheet from the laundry flew over her and landed on her while she slept an Urru crept into the space. An Urru in a concealed space will flee at a moment&#039;s notice upon discovery and when her sister lifted the sheet it pulled her into the Urru dimension that travels space. Normally people lost in these spaces are never seen again because of the great sizes of the Urru caverns. At the end of the episode she emerges from a spool of silk that someone had been working on in another area of the mountains. To the surprise of the spinner of the silk she emerges with a piece of paper telling where she lives and how to get there. She is reunited with her sister and hasn&#039;t changed over the years she was missing, by which she hasn&#039;t aged since she dissapeared.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16881-XihDLGmMC55L.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16881
      },
      "rarity": "rare"
    },
    {
      "id": "aya",
      "name": "Aya",
      "alt_names": [
        "綺"
      ],
      "role": "supporting",
      "description": "Aya is a character who lives alone in the mountain forest, crafting letter carriers for Mushishi.\n\nAya has dark eyes and wears her hair short, with her bangs brushed to her right. She wears dull kimono and has a rather disheveled appearance after the disappearance of Ito. As a child, she wore her hair long, although, before her apprenticeship, she kept it tied in a bun behind her head. She also wore colorful and patterned kimonos.\n\nAya is very family-oriented. She enjoys learning about her family's traditional crafts. Despite her fear, she resolves to go with the elder even without Ito, and will not let Ito go alone.\n\nAt two years old, Aya and her sister, [Ito](https://anilist.co/character/16881/Ito), are tested for the ability to see Mushi, as is the custom in their family. Both can see the uro that the elder had in a jar, so he determines that when they are 10, he will return to take one of the girls as an apprentice. At 10, the head of the family decides that they'll be lonely apart, and send both Aya and Ito away.\n\n~!When Ito disappears, Aya blames herself for lifting the sheet that fell over her sister, and her mourning continues after the elder tells her it is not her fault, even after his death and for five years following Ito's disappearance. Aya searches for her sister and places letters into the empty cocoons, hoping to find her. In this time, Aya stops wearing the colorful kimonos of her childhood and cuts her hair.!~\n\n(Source: Mushishi Wiki, edited)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16882-9odo3R1PQpkp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16882
      },
      "rarity": "rare"
    },
    {
      "id": "yamano-jii-sama",
      "name": "Yamano Jii-sama",
      "alt_names": [
        "山のじいさま"
      ],
      "role": "supporting",
      "description": "Jiisama appears in episode 17, &quot;Pickers of Empty Cocoons.&quot; He is able to use a particular type of mushi cocoons to deliver letters. Despite years of experience in the field, he was unable to protect his two young apprentices, Ito and Aya, from tragedy at the hands of these mushi.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16884-4jNGwVqjLABi.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16884
      },
      "rarity": "rare"
    },
    {
      "id": "kai",
      "name": "Kai",
      "alt_names": [
        "塊"
      ],
      "role": "supporting",
      "description": "Kai appears in episode 18, &quot;Clothes that Embrace the Mountain.&quot; He leaves home to become an artist - he achieves success quickly. However, because of this, he neglects his family until it is too late to return to them. And selling off the mushi-infested coat his sister made for him, well... that was a decision he would come to regret.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16886-QKVasbHA1UuL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16886
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-25T16:03:54.934Z"
}