{
  "work_id": "yona-of-the-dawn",
  "count": 15,
  "characters": [
    {
      "id": "yona",
      "name": "Yona",
      "alt_names": [
        "ヨナ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 157 cm\n__Race:__ Human\n\nThe spoiled princess of the Kouka kingdom, who has a crush on her cousin and childhood friend Soo-won. Soo-won comforted her when she lost her mother in young age. She hates her crimson red hair. Her bodyguard is the other childhood friend, the general Son Hak who she finds really annoying.\n\nAs the princess and the only heir of the Kouka Kingdom, Yona was raised with extreme care and gets whatever she wants, for example, beautiful accessories and clothing. This lead her to being a spoilt princess. After some life-changing events, Yona developed into a strong young lady who lives for the people of Kouka Kingdom, while also paying back the friends who helped her survive.\n\n~!After Soo-won kills her father in front of her eyes in order to become the new king, she has to run from the castle with Son Hak. !~\n\n~!She is the reincarnation of the red dragon.!~\n\n~!She later confesses her love to Son Hak.!~",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43814-M0nlr2AP7vY0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43814
      },
      "rarity": "legendary"
    },
    {
      "id": "hak-son",
      "name": "Hak Son",
      "alt_names": [
        "ハク",
        "Thunder Beast",
        "Dark Dragon",
        "Darkness Dragon",
        "Black Dragon"
      ],
      "role": "protagonist",
      "description": "**Height:** 188 cm\n\nHe is the former chief and general of the Wind Tribe. He is famously known as Thunder Beast for his fighting skills that were said to be unrivalled by anyone, earning him the title of \"strongest soldier in the kingdom\".\n\n~!He is in love with Yona. Even when Yona was unaware of his feelings, every now and then, Hak couldn't help but display his affection towards her.!~",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43815-WRbln8jA1mPk.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43815
      },
      "rarity": "legendary"
    },
    {
      "id": "yun",
      "name": "Yun",
      "alt_names": [
        "ユン",
        "Yoon"
      ],
      "role": "protagonist",
      "description": "__Height:__ 162 cm\nRace: Human\n\nIn Princess Yona's group, he is the healer and genius.\n\nHe is an outstanding curious intellectual. He can say mean things, but he's a caring pretty boy. He was born in a poor village of the Fire Tribe.",
      "metadata": {
        "gender": "male",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b67745-0oHMcSVNp7U5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 67745
      },
      "rarity": "legendary"
    },
    {
      "id": "ki-ja",
      "name": "Ki-Ja",
      "alt_names": [
        "キジャ",
        "White Dragon",
        "White Snake",
        "Gija"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm\n__Race:__ Dragon\n\nHe is the white dragon of the group. He has dragon claws on his right hand, which is said to have ten times the strength of a normal human's.\n\n~!In a side chapter focused on Kija, he (when he was a child) had secretly went to see his father (who was on deathbed). However his father was too weak to realise who it was and thought it was the granny. He had asked if it was okay for him to touch that child (Kija) now that his right hand was back to being a normal human hand. Kija, upon hearing this leapt onto the bed and hugged his father. His father died shortly after saying \"Kija\" when he realised it was him.!~",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b67747-Epj21EmBa34y.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 67747
      },
      "rarity": "legendary"
    },
    {
      "id": "shin-ah",
      "name": "Shin-Ah",
      "alt_names": [
        "シンア",
        "Blue Dragon",
        "Sinha"
      ],
      "role": "protagonist",
      "description": "__Height__: 180 cm\n__Race__: Dragon\n\nHe is the blue dragon and has dragon eyes that allows him to see great distances. Shin-Ah's dragon eyes are also capable of disrupting the nerves of anyone he glares at until it kills them.\n\n~!Later in the story, his power was explained in more detail. His victims are subject to fatal hallucinations. In extreme cases he can cause their entire bodies to stop functioning, including their hearts. However, he does not have full control over this power and will lose himself to the blue dragon's murderous willpower. When he finishes using that ability, he himself becomes paralyzed as a result, making the power a double-edged sword.!~\n\n~!He almost lost complete control when Yona was captured by some bandits (they were in the fire tribe and Shinah was assigned to protect Yona), causing them to have hallucinations after his mask was knocked off by a bandit. However, she wasn’t afraid of his power and saved him from losing to his power (though it wasn’t easy because he lost himself and didn’t recognize her). He was scared that he wouldn’t be able to stay by Yona’s side anymore and she would hate him because of this. But she reassured his importance to her and to continue to stay with the group.!~\n\nHe is also voiced by Sanae Kobayashi.",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b67749-56bkWIb9ZpWy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 67749
      },
      "rarity": "legendary"
    },
    {
      "id": "jae-ha",
      "name": "Jae-Ha",
      "alt_names": [
        "ジェハ",
        "Green Dragon"
      ],
      "role": "protagonist",
      "description": "__Height:__ 188 cm\n__Race:__ Dragon\n\nHe is the descendant of the Green Dragon and possesses the power of a dragon in his right leg. His power allows him to jump high and long distances that almost make it look like he can fly. It also makes his leg incredibly strong and lethal when used to kick. He's a big flirt, he doesn't care whether it's a man or a girl.\n\n~!Twenty-five years ago, Jae-ha was born in the Village of Ryokuryuu and Garou, the previous Ryokuryuu, took care of him. During his childhood, he was confined in chains within his room to prevent him from escaping the village and also from repeating the tragedy that happened eighty-five years ago. On his every attempt to flee, he was always stopped by Garou and he was beat up as punishment.!~",
      "metadata": {
        "gender": "male",
        "age": "25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b67751-wfoNe4W9UHTc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 67751
      },
      "rarity": "legendary"
    },
    {
      "id": "zeno",
      "name": "Zeno",
      "alt_names": [
        "ゼノ",
        "Yellow Dragon"
      ],
      "role": "supporting",
      "description": "__Height:__ 166 cm\n__Race:__ Dragon\n\nHe is the yellow dragon and has a really strong body.\n\n~!He joins the group immediately after the Awa arc. Later on it's revealed that he was watching Yona ever since she was chased out of Hiryuu castle to see if she was fit to use the power of the four dragons. After the events in Awa he decided that he wanted to follow her, so he showed up at the campfire.!~\n\n~!In chapter 100, it is revealed that he is immortal, and that he is the original dragon warrior who received the blood of the Yellow Dragon. His power worked by having certain areas of his body being seriously injured before having that part regenerating back quickly. This was why when he appeared to be a normal human when Hak tried to test whether his body was indestructible (he was not seriously injured). While his body is regenerating, scales appear on the places where his wounds were, making his body as hard as steel. According to Zeno himself, during regeneration his physical power is no less than Kija's dragon arm or Jae-Ha's dragon leg.!~\n\n~!He was married in the past to a sickly girl named Kaya.!~",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b67753-QzWNHsalPyWu.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 67753
      },
      "rarity": "rare"
    },
    {
      "id": "ik-su",
      "name": "Ik-Su",
      "alt_names": [
        "イクス"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "age": "33",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88669-Ysae9EN6qo7c.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88669
      },
      "rarity": "rare"
    },
    {
      "id": "soo-won",
      "name": "Soo-Won",
      "alt_names": [
        "スウォン",
        "Su-Won"
      ],
      "role": "supporting",
      "description": "__Height:__ 185cm\nRace: Human\n\nHe is the son of the deceased General Yu-Hon, the older cousin of Yona, as well as her and Hak Son's childhood friend, the three were best friends. He kills Yona's father and becomes the 11th King of Kouka and wants to unite the Kingdom to restore its original power after King Il's reign.\n\n~!He later meets Yona once again in Awa after Kumji's death and hides Yona from General Ju-do and the others, and states that he still has something to do when Yona wanted to kill Su-won.!~\n\nNozomi Yamamoto voices him as a child.",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88670-XZCwY41qf0P1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88670
      },
      "rarity": "rare"
    },
    {
      "id": "geun-tae-lee",
      "name": "Geun-Tae Lee",
      "alt_names": [
        "イ・グンテ"
      ],
      "role": "supporting",
      "description": "Lee Geun-Tae is the general of the Earth Tribe and he is the husband of Yun-Ho. He serves under Soo-Won after acknowledging his strength during the Battle Game Festival held in Chi'Shin. Geun-Tae is a bearded, dark-skinned man who is almost never seen without a proud snarl on his face. He has brown almond eyes (yellow in the anime) and long untidy dark brown hair that he ties in a ponytail using a rope-like ornament with tassels on both ends. His fringes cover most of his forehead and some of its strands hang to the sides of his face. Whenever he goes to the castle, he wears an outfit chosen by his wife: a brown leather overcoat with animal-prints atop a white robe with yellow-patterned hemlines, a two-layered purple beaded necklace, and a pair of black boots. While at home, he dons a simple robe where his scars can be visibly seen. Like the people in the Wind Tribe, he likes to take everything easy. He never considers the hierarchy on his tribe and he lets his people talk to him as if he is just an ordinary citizen. He also likes picking fights, especially against Han Joo-Doh, who he never shares a stable relationship with. However, as a general who fought on Emperor Joo-Nam’s era, he believes that he belongs to the battlefield and has been eager to use his skills and fight on the frontlines again. Ever since the banning of war under Emperor Il’s reign, he grew rusty and has been looking for a capable king who he can lend his strength to. Because of this, he will threaten a king of rebellion if he sees him not fit for the position.",
      "metadata": {
        "gender": "male",
        "age": "38",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/90229-buxzBEYlYPuk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90229
      },
      "rarity": "rare"
    },
    {
      "id": "tae-jun-kan",
      "name": "Tae-Jun Kan",
      "alt_names": [
        "カン・テジュン"
      ],
      "role": "supporting",
      "description": "Kan Tae-Jun is the second son of the Fire Tribe General Kan Soo-Jin. He is in love with Yona and has been determined to make her his wife so he could inherit the throne of the Kouka Kingdom.\n\nTae-Jun is a happy, cowardly, and arrogant man who is obsessed with Yona. He is a pampered person that gets anything he wants and will grow resentful and childish if someone stops him for claiming it. At times, he can also be sneaky and will go against even his father's orders if he thinks it'll be for the better. He has a high regard for himself and will boast his position to anyone, especially to those who offended him while he demand them to give him an apology. Despite his high position in the Fire Tribe, he has no idea of the real situation of the villages outside the capital and thinks that the people are merely slacking off. \n\nHowever, After experiencing all the citizen’s hardships, his eyes open to the bad state of his tribe and realizes that with how their current system, there won’t be any future for their tribe. Along with this, he grows to respect Yona and promises her that he will protect the Fire Tribe for her sake.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124329-TADtTqmuIRoY.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124329
      },
      "rarity": "rare"
    },
    {
      "id": "ao",
      "name": "Ao",
      "alt_names": [
        "青",
        "アオ"
      ],
      "role": "supporting",
      "description": "Ao is Shin-Ah's squirrel companion and friend, who is named after the previous Seiryuu by Shin-Ah.\n\nAo is a goofy and mischievous yet adorable squirrel, often playing around and making poses that match the person she is riding on. She likes to eat a lot which makes her bite on random things, like Yona's earrings or Shin-Ah's finger. She tries to make people (specifically Shin-Ah or Yona) cheer up if they are feeling down or sad by rubbing their face or acting cute.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b136995-rjHHnIU14EL1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 136995
      },
      "rarity": "rare"
    },
    {
      "id": "tae-yeon",
      "name": "Tae-Yeon",
      "alt_names": [
        "テヨン"
      ],
      "role": "supporting",
      "description": "Hak's adoptive brother.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b152730-E0WbUCipKndy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 152730
      },
      "rarity": "rare"
    },
    {
      "id": "mun-deok-son",
      "name": "Mun-Deok Son",
      "alt_names": [
        "ソン・ムンドク"
      ],
      "role": "supporting",
      "description": "Son Hak's adoptive father. Form General of the Wind tribe.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b152731-i99KTmLWgGgT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 152731
      },
      "rarity": "rare"
    },
    {
      "id": "haeng-dae",
      "name": "Haeng-Dae",
      "alt_names": [
        "ヘンデ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b152732-THcQEdO4l3Rb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 152732
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-25T05:04:02.703Z"
}