{
  "work_id": "dgray-man",
  "count": 15,
  "characters": [
    {
      "id": "allen-walker",
      "name": "Allen Walker",
      "alt_names": [
        "アレン・ウォーカー",
        "Crown Clown",
        "God's Joker",
        "Bean Sprout",
        "Short Stack",
        "Destroyer of Time"
      ],
      "role": "protagonist",
      "description": "__Height:__ 168-170 cm (5’6”-5'7\")   \n__Nationality:__ British\n\nAllen is the main hero of the series. He was abandoned by his biological parents because of the supposed \"deformity\" of his left arm (which was later revealed to be caused by his Innocence). He was eventually found and adopted by a traveling performer named Mana Walker on Christmas Day. Some time later Mana died, and Allen, tormented with grief and manipulated by the Millennium Earl, turned Mana into an Akuma, hoping that his beloved surrogate father would be fully resurrected. But the Mana Akuma cursed Allen and sliced through his left eye, leaving the \"Pentacle\" — the mark of the Akuma — which scars the left side of his face. This enabled his left eye to see the souls trapped within the Akuma from then on. It was at this same moment that Allen's left arm first invoked as an Anti-Akuma weapon, which instinctively destroyed the Mana Akuma. During the course of this traumatic event, Allen's hair turned from brown into a stark white.  \n\nAllen eventually meets Cross Marian, a General of the Black Order, who explained to Allen the ways of the Akuma and the trapped souls within them: Once a soul becomes trapped inside an Akuma, they are trapped forever; and that the only way to save one is to exorcise them from their Akuma vessel. Allen subsequently became Cross' disciple and spent the next three years with him before being sent to the Black Order to become an official exorcist. During this time, Allen was tormented by his master's constant irresponsible behavior and forced into various odd-jobs to pay off the debts that General Cross accumulated. This, coupled with Marian's womanizing ways and harsh treatment towards Allen, led to Walker fearing more than respecting his master whom he never speaks fondly of. \n\n~!In fact, when Jasdevi claims that Cross is like a demon, Allen denies this and instead insists that Cross is a real demon. In addition, when Jasdevi reveal that the debts Cross left to them total about 2 million yen, Allen grows demon horns, laughs at them, and calls their debts small change in comparison to his own, leaving Lavi to wonder just how much money Allen's been made to pay.  In addition to being physically fit and skilled at combat (as evident by his ability to fight and dodge Fou without the use of his Innocence), Allen has a few odd talents and skills. Because of the many debts Allen was forced into paying by Cross, he learned to play cards and gamble at a very young age, though his initial purpose was to practice his numb deformed left hand. He also learned how to cheat and win through deception and doesn't hesitate to use these tactics whenever necessary. In fact, he is quite proud of his talents. This is a stark contrast to his polite and courteous nature and often surprises his friends who wouldn't expect such a dark side to Allen and has caused them to wonder just what Cross has done to him. Walker also possesses circus abilities such as juggling and acrobatics, which he learned from traveling with Mana who was himself a circus clown by trade.!~\n\n~!Inspector Levrier and Cross have both referred to a \"player\" (as in one who plays a musical instrument), and Cross has hinted that there may be more than one.  Allen's synchronization ratio reached a maximum of 83% before having his Innocence destroyed by Tyki. Yet unknown to Allen, the Innocence lingered around as a hazy fog of particles; at the time, a direct reflection of his shattered state of mind. It wasn't until he came to an epiphany that he was able to seize control of his Anti-Akuma weapon once again and achieving his Innocence's true, fully-invoked form. When not activated, his arm is black and meets with his shoulder in a spiraling pattern that ends with tattoo-like emblem. Following this, the Order gave it the official designation of Crowned Clown (神ノ道化（クラウン・クラウン）, Kuraun Kuraun), due to its jester-like appearance when invoked. The kanji used in the name literally translates to God's Clown (神ノ道化, Kami no Douke). !~\n\n~!When invoked, Crowned Clown acts as a body-armored Innocence, forming a white-hooded cowl and sleeve of Innocence energy which covers his shoulders and right arm, while his left arm and hand become slender and black, clad in armor and razor sharp claws. A masquerade-style mask is always affixed to the cowl, which takes on various configurations and appearances. This transformation also changes Allen's usual hairstyle from flat to a spiky rear. As before, his Innocence possesses a certain degree of sentience, but as Crowned Crown is able to manipulate Allen's entire body like a marionette when incapacitated, or simply assisting in evasive tactics.!~",
      "metadata": {
        "gender": "male",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b139-QnuZQbLodMF3.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 139
      },
      "rarity": "epic"
    },
    {
      "id": "yuu-kanda",
      "name": "Yuu Kanda",
      "alt_names": [
        "神田ユウ",
        "Bakanda"
      ],
      "role": "protagonist",
      "description": "__Height:__ 177cm (5'9\")\n \nKanda Yuu is a main protagonist character and member of the fictional religious organization known as the Black Order, in the anime and manga series D.Gray-man, by Katsura Hoshino.  Kanda is a young and handsome Japanese man usually found in any mood that isn't positive.\n\nKanda comes across as cold, stoic, and arrogant, even to his fellow exorcists. In battle, he will do anything to win, sometimes at the risk of his teammates. He once made a sarcastic joke about leaving them to die. It is his opinion that exorcists are not saviors.  Yu, or Yuu, is Kanda's given name, though he dislikes being called by it or even introducing himself as such. He calls Allen \"bean sprout\" (モヤシ, moyashi, English Dub: \"Short Stack\"). Kanda seems to know Lavi, though he doesn't hesitate with his usual threats if Lavi calls Kanda by his given name. However, it is clear that Kanda does care for his fellow Exorcists and the Finders (whom he claims not to care about).  He tends to mask his emotions and often claims, \"It's none of my business.\" In spite of his intentions, he and Allen are often at each other's throats and rarely see eye-to-eye on anything.   \n\nKanda's favorite foods are soba noodles and tempura (especially pumpkin, shishitou [a small, sweet green pepper], and lotus root). Kanda dislikes many things, to the point that \"there are too many to write down\". However, Kanda himself points out that he hates people with naive personalities, people who don't keep their promises, cursed people, people who can't keep their mouths shut, people who call him by his given name, and \"sweet things\".",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140-vbv18x2l0tDw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140
      },
      "rarity": "epic"
    },
    {
      "id": "lenalee-lee",
      "name": "Lenalee Lee",
      "alt_names": [
        "リナリー・リー",
        "Lena"
      ],
      "role": "protagonist",
      "description": "__Height:__ 166 cm \n__Nationality:__ Chinese \n\nAlso known as Rinali  Komui's younger sister, and assistant Head Officer. Her parents were killed by an Akuma when she was very young. Because she is an Accommodator, the Black Order took her away from her only remaining family member (Komui) to Headquarters against her will. For three years she was never allowed to leave the place, which felt like a prison to her. Because she attempted suicide, she had to be restrained and tied to her bed. However, once Komui joined the Black Order, Lenalee became more at ease in the Black Order. She once told Allen that her \"world\" consists of her friends and family; if something terrible ever happened to them, she would be devastated.  She is an Exorcist whose anti-Akuma weapon is a pair of boots, \"Dark Boots\". That, when invoked increases one's speed and strength greatly in the legs. Aside from being able to have great speed, she can also fly with her boots.\n\n __Manga Spoilers:__  ~! In chapter 153 she made a promise with her innocence so it would become stronger to protect everything she loves, and so it liquified and fused with her blood, creating a better version of her Dark Boots. After defeating the Level 4 Akuma, the boots transformed into a red ring that stays on her legs until the innocence is activated.  She is the first known exorcist to create this new type of innocence named \"Crystal Type\". However, it has come to mind that after the battle, her innocence may be the heart of the innocence.!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b141-XOVoHUg6M2kN.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 141
      },
      "rarity": "epic"
    },
    {
      "id": "lavi",
      "name": "Lavi",
      "alt_names": [
        "ラビ",
        "Bookman Junior",
        "Baka Usagi"
      ],
      "role": "protagonist",
      "description": "__Height:__ 177cm (5'9\")\n\nA cheerful Exorcist of mixed race, who aims to become a Bookman and is working along the Black Order just to be close to the events that must be seen. To help him, he developed an incredible memory: he is able to memorize every single aspect of something he saw.\n\nHis anti-Akuma weapon is a size-shifting hammer, which he calls Ōzuchi Kozuchi or Nyoibo. It can grow or extend. The weight increases with its size, but since Lavi is the conformer, the weight does not effect him; however, it does to everyone else. His hammer can also summon several \"judgments\" with kanji possibly representing the classical elements that can be used individually or combined. However, between some of the seals are question marks. This probably means that Lavi has some seals that he has yet to learn from his Innocence. \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b779-kSxmhfuEP2UR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 779
      },
      "rarity": "epic"
    },
    {
      "id": "komui-lee",
      "name": "Komui Lee",
      "alt_names": [
        "コムイ・リー"
      ],
      "role": "supporting",
      "description": "__Nationality:__ Chinese\n__Height:__ 193cm\n__Weight:__ 79kg\n__Birthday:__ 13th June\n__Horoscope:__ Gemini\n__Interest:__ Sewing, Inventing\n__Likes:__ Coffee (Blue Mountain), Lenalee\n__Dislikes:__ Tidying up, Lenalee&rsquo;s future husband.\n\nKomui Lee is the Supervisor of the Black Order, and Lenalee&#039;s older brother. He is Chinese and about 29 years old. His parents were killed by Akuma when they were young, and when it was found out that Lenalee was compatible with an Innocence she was taken away from him. It was shown that Lenalee was kept in the Black Order, away from her only living family (Komui), against her will. When she tried to commit suicide, she had to be strapped down to the bed. However, Komui joined the Order and became the Science Department Supervisor for her sake and Lenalee begin to feel more at home in the Order.    Komui is shown as a very whimsical and goofy character, he is somewhat sadistic and borderline maniacal sometimes (&quot;Why did Komui end up so strange...? I patterned this character after Yoshida. My editor.&quot; - Quote from Vol 1, Komui&#039;s profile page). He drinks coffee nonstop (or more specifically Lenalee&#039;s coffee unless he has no choice), is lazy and often tries to worm his way out of doing work by either running away from the office (Reever has to track him down), talking on the phone non-stop even when the other side hung up or other methods (he created a robot named Komurin II that went berserk and nearly tore the Headquarter apart). He keeps a notoriously messy desk and lost Allen&#039;s letter of recommendation from General Cross when Allen first joined the Order, which led the Order into believing that Allen was an intruder. In the manga when it was asked how much do his colleagues trust Komui, the mangaka answered that it was 99% trust and 1% murderous intent. During his naps, one of the only ways to wake him up is to say that Lenalee is getting married due to his doting personality.    Komui, despite everything, does have a serious side. He feels guilty for throwing the Exorcists and Finders into danger, and tries to help in anyway he can, such as making better uniforms to protect the Exorcists. He is also the one to repair damages done to the Innocences of the Exorcists although the method seems very painful. He showed a more solemn and ruthless side in the funeral for the Exorcists and Finders by refusing requests to bring General Yeager&#039;s body back to his home and saying that the General&#039;s body must be cremated. Firm in his beliefs, Komui has shown a daring in refusing to follow Special Auditor Malcom Rouvelier&#039;s orders about keeping the Akuma Egg, and instead issues his own orders for the Egg&#039;s destruction.    Lenalee and Komui seem to share some kind of telepathic link, shown when Komui collapsed when Lenalee was being drowned by Eshi and that Lenalee can tell when Komui is taking a nap even from the other side of the world. He seems to be close friends with the cook Jerry and often hides out in the kitchen.",
      "metadata": {
        "age": "29",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142-q799HxUecPt5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142
      },
      "rarity": "uncommon"
    },
    {
      "id": "tyki-mikk",
      "name": "Tyki Mikk",
      "alt_names": [
        "ティキ・ミック",
        "Noah of Pleasure",
        "Tykipon",
        "Joyd",
        "Joido"
      ],
      "role": "supporting",
      "description": "__Height:__ 188 cm (6'2\")\n\nTyki lives a double life: his \"white side\" that is a carefree and goofy man of Portuguese descent who travels with humans that love to play poker, and his sadistic \"dark side\" that has a lust for blood and takes up his role as Noah's descendant (and therefore, one of the antagonists).\n\nTyki's powers stem from his ability to selectively interact with his surroundings. This allows him to become effectively intangible, passing through all manner of matter as a ghost would, or walk on air.  His powers also have an offensive aspect, allowing him to phase his hand into his opponents' bodies and selectively interact with their organs (i.e. their heart), crushing them or tearing them out without leaving any external wounds. Furthermore, he possesses the ability to reject the existence of space around an area he chooses, which essentially makes it possible for him to create a vacuum around anything he pleases.",
      "metadata": {
        "gender": "male",
        "age": "26-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b778-6iR5U4r75jHc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 778
      },
      "rarity": "uncommon"
    },
    {
      "id": "road-kamelot",
      "name": "Road Kamelot",
      "alt_names": [
        "ロード・キャメロット"
      ],
      "role": "supporting",
      "description": "__Height:__ 148cm (4'10\")\n\nRoad Kamelot is the first Noah introduced in the D. Gray-man series, appearing to Allen, Lenalee, and Miranda in the Rewinding City arc. Despite looking as if she is in her early teens, Road is referred to as the oldest of the Noah. Road has an affinity for candies and blood, as well as a childlike enjoyment of birthday-reminiscent themes.    \n\nRoad has a plethora of supernatural abilities, ranging from the ability to travel to an alternate dimension through a door that appears at her will to complete regeneration after injury. Her dimensional space is in the form of a wrapped present, while her weapons of choice are levitating candles that can be sharpened to waxen stakes. While inside her personal dimension, she can control nonliving objects within the area; for instance, her stake-like candles fly to attack at her will. She has absolute control of everything in her dimension ranging from her appearing out of the floor, creating a copy of Lavi to crumbling his Innocence. Outside of her dimension she has displayed Telekinetic powers.    Road&#039;s personality and home life are surprisingly normal, despite her role as a villain. She has a childlike need to be entertained at all times, usually by the Earl&#039;s parasol Lero, and forces Tyki to entertain her when Lero will not. She shows a tendency to procrastinate on schoolwork, like many children her age, and appears to be in trouble for skipping classes often. Despite her childlike tendencies, she has also shown signs of extreme sadism and seems to enjoy watching the suffering of others, including stabbing Allen through the eye, killing an Akuma subordinate for no other reason then to anger Allen, and nailing Miranda&rsquo;s hands to a clock while writing profanity on the wall in her blood.    \n\nHer relationships with the other members of the Noah family all vary on a basis quite similar to a normal family situation; She looks up to Tyki as an older brother and is very close to him, while the twins appear to bicker with her often in a sibling-like, affectionate manner. Her relationship with Skin is unknown, as almost no interaction between the two is shown in the series. She also seems to have feelings for Allen Walker, as she kisses him upon seeing him again. Tyki finds this surprising, as the only one she kissed before was the Earl.    \n\nDespite Road&#039;s young appearance, she is considered the First Child by Debit and Jasdero, which suggests that she was the first Noah to awaken in the current generation. Due to this fact, she is the only Noah capable of programming Noah&#039;s Ark, and appears to have the favoritism of the Millennium Earl. She represents Noah&#039;s &quot;Dreams&quot;. Road&#039;s nationality is unknown.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b780-QGegNJEufooQ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 780
      },
      "rarity": "uncommon"
    },
    {
      "id": "miranda-lotto",
      "name": "Miranda Lotto",
      "alt_names": [
        "ミランダ・ロットー"
      ],
      "role": "supporting",
      "description": "__Height:__ 168 cm (5'6\")  \n __Nationality:__ German \n __Relatives:__ Unknown  \n__Affiliation:__ Black Order (European branch) Cross Marian's unit  \n__Weapon:__ Time Record \n\nMiranda Lotto is a 25-year-old German woman whose clock caused time to rewind in her town after she connected with Innocence inside it. She often feels inferior and useless and has been fired from over one hundred jobs. This contributes to her chronic depression. With the help of Allen and Lenalee, she became determined to be a useful Exorcist. Her anti-Akuma weapon, the Time Record (刻盤), is located on her right arm. It allows her to stop or reverse time in an area for a short while, causing any object to revert to its original status. However, any damage the object suffered before and during the reversed time will affect the object once the technique is stopped and the dead cannot be revived, this is due to the fact her Innocence cannot erase time.",
      "metadata": {
        "gender": "female",
        "age": "25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b857-EVk4GH6Xbe6R.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 857
      },
      "rarity": "uncommon"
    },
    {
      "id": "sennen-hakushaku",
      "name": "Sennen Hakushaku",
      "alt_names": [
        "千年伯爵",
        "Millenium Earl",
        "Sennen Ko",
        "The Maker"
      ],
      "role": "supporting",
      "description": "The story's main antagonist. Also known as \"the Earl of Millennium\". He tricks people with dead relatives and friends into creating Demons (Akuma). He is a sorcerer from long ago, and he plans to lead the world to its destruction. Some time in the past he formed an alliance with the Noah Clan, who call him \"Duke Millennium\"(Except Road who calls him Millenie). Hoshino says she based the Earl of Millennium off a legendary alchemist/preacher (most likely the Count of St Germain or Nicolas Flamel, though in many ways he also reminiscent of Dorian Gray, possibly referenced in \"Dorian Grey man\" and thus \"D.Gray-Man\", as adapted in the film The League of Extraordinary Gentlemen) whose tale even claims he still may be alive somewhere.  In appearance, the Earl resembles a grotesque caricature of a Victorian gentleman -- a rotund figure in cape and top hat, with an enormous grin that remains fixed even when he is speaking and even eating, and his eyes permanently hidden behind a pair of pince-nez spectacles. In the manga, almost every one of his lines of dialog ends with a heart.In the anime, he invariably uses polite Japanese. Throughout the story, he displays two different personalities. The first is his normal cheerful, friendly, and happy attitude, almost like a friendly old uncle. With the Noah, he's a member of the family, and is particularly playful and affectionate towards Road. His other personality is one of sheer, sadistic malice, capable of happily playing with people's lives.  He wears a different hat in each encounter, each with a different decoration. In a gag comic in Volume 2 of the manga, he is shown taking off his hat, and having another set of ears. His main form of combat involves his umbrella Relo. He has also shown the ability to create massive explosions of dark energy. The Earl is also able to summon a large black sword that is the opposite of Allen's Crown Clown sword.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b858-09Xx2JSn4pqY.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 858
      },
      "rarity": "uncommon"
    },
    {
      "id": "cross-marian",
      "name": "Cross Marian",
      "alt_names": [
        "クロス・マリアン",
        "General"
      ],
      "role": "supporting",
      "description": "**Height:** 195 cm (6'4\") \n**Affiliation:** Black Order \n\nAllen's teacher, a scientist, and also one of the five Exorcist Generals. Currently, he has gone on a journey and has stopped corresponding with HQ for four years. Allen fears him, which is hinted from the fact most of his flashbacks that connect to his teacher end with some kind of traumatizing (usually humorous for readers) experience. He also has a habit of going into debt and making Allen work it off for him. It is revealed by Bookman that Cross has the unique ability to convert Akuma, making them to work under his orders. The method of conversion is unknown though. Beside that, it's believed that Marian has the ability to control the Noah's Ark (an ability granted to him by a traitor of the Noah family, who was subsequently killed by the Earl), although it's unknown if this hypothesis of the Earl will turn out to be correct. Marian seems to be the only person the Earl is seriously worried about.  Marian is the only exorcist with two anti-akuma weapons. His first one is \"Grave of Maria\" which is a woman corpse that has a parasite type Anti Akuma weapon, She only serves Master Cross. The second one is \"Judgement\" which is a Giant revolver Gun and Crosses own Anti-Akuma Weapon. Right now Cross is missing after he talked with Allen about his relation with the 14th.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2283-OAmnSWkiGJcG.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2283
      },
      "rarity": "uncommon"
    },
    {
      "id": "arystar-krory-iii",
      "name": "Arystar Krory III",
      "alt_names": [
        "アレイスター・クロウリー三世",
        "Aleister Crowley",
        "Kro-chan",
        "Vampire"
      ],
      "role": "supporting",
      "description": "__Height:__ 190cm (6ft. 3in.) \n__Nationality:__ Romanian  \n\nFull name Arystar Krory III, he is a man with split personalities: His soft, kind, and overly-emotional side, and his \"battle-mode\" side. You can easily tell when he switches between either personality by his expressions. He is very kind looking at one point with his different colored hair down, but when fighting his eyes become evil-looking, veins protrude from his face, making him look like a monster, and his different colored hair sticks up completely. He spent his entire life prior to becoming an Exorcist in a castle and was shunned by the surrounding villagers, who believed he was a vampire because he attacked certain villagers, the way he had attacked them and the fact that he has the stereotypical vampire theme. This is because his teeth were made of Innocence and he was instinctively attacking Akuma, but the villagers did not know that (and, before meeting Allen and Lavi, neither did he). Later, he fell in love with Eliade, not knowing that she was an Akuma. Allen and Lavi (who enjoys teasing Krory in a fight by calling him \"Kro-chan\", or \"Krokins\") later come and recruit him to be an exorcist. He is still getting used to the \"outside world.\"  Arystar's Innocence, still unnamed, resides in his teeth, but the strength is in his blood. It grants him a Feral-type ability. When invoked, it gives him great strength, and the ability to drink the blood of akuma, which can allow himself to regenerate and gives him a temporary increase in strength. He is also capable of draining the akuma poison from another person before it can take full effect. However, he is not immune to Akuma poison. Krory's Innocence and body simply break it down (when his body is too weak however, his body cannot fully break down the poison). Krory is also able to remove it from another person by drinking their blood. He can also inoculate his blood on the Akuma, poisoning them and killing them in very few seconds, but this, apparently, weakens him greatly. Taking the commentary of Miranda about the crimson snow that Arystar produced, he named this ability as \"Crimson\". Arystar is also capable of wrapping blood around his hands to fortify the flesh beneath; this is because his Innocence allows him to manipulate the blood in his body and, to an extent, others' bodies. He can even detach the blood from his body to make it nigh invulnerable and wield his max strength remotely as a winged blood mannequin called \"Bloody Krory\"; It appears that after the usage of this technique he becomes exhausted, much like the blood inoculation.",
      "metadata": {
        "gender": "male",
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2320-0dacmAwRnXCZ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2320
      },
      "rarity": "uncommon"
    },
    {
      "id": "bookman",
      "name": "Bookman",
      "alt_names": [
        "ブックマン",
        "Panda",
        "Old Geezer"
      ],
      "role": "supporting",
      "description": "An old man who records the hidden history. He comes from the Bookman clan and doesn't have a name. Instead, he simply introduces himself as \"bookman\" during his first meeting with Allen. Lavi accompanied him when he appeared in the manga. He refers to Allen as \"The Destroyer of Time\" as he believes that Allen is the only one who can defeat the Earl of Millennium. Bookman also mentions that a \"Bookman\" does not put himself in the frontline and he just happens to be on the same side as the Black Order. His anti-Akuma weapon is called Heaven Compass (天針), which is a set of acupuncture needles. One of his moves is \"Needles of Spells: North Crime\" (呪縛の針 「北ノ罪」) which impales the target with thousands of needles. His Innocence can also be used on a defensive technique called \"Needles of Divine Protection: East Crime\" (加護の針「東ノ罪」), making the needles encircle the target and protect it against external attacks. He also has some healing skills through acupuncture.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/3154.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3154
      },
      "rarity": "uncommon"
    },
    {
      "id": "daisya-barry",
      "name": "Daisya Barry",
      "alt_names": [
        "デイシャ・バリー"
      ],
      "role": "supporting",
      "description": "An exorcist from Bodrum who, despite his love of playing pranks on the other members of the order (i.e. using his Innocence to crack Tiedoll's glasses), was described by Tiedoll as &quot;a good kid.&quot; He was a disciple of Tiedoll and was on his rescue team along with Yu Kanda and Noise Marie. His anti-akuma weapon was a projectile ball which was wielded much like a soccer ball called the &quot;Charity Bell&quot; (隣人ノ鐘). The Charity Bell was capable of easily destroying Akuma level 2 by resonating inside the Akuma's body. While on his mission to find General Tiedoll, he encountered Tyki Mikk and was found the next morning hung in an upside-down cross fashion from a streetlamp, missing an internal organ and the Charity Bell. His design appears to have been inspired by court jesters of the European Middle Ages. His name is sometimes translated as Deesha Berry.",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3155-qo7iu7r5FOxr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3155
      },
      "rarity": "uncommon"
    },
    {
      "id": "skin-boric",
      "name": "Skin Boric",
      "alt_names": [
        "スキンボリック"
      ],
      "role": "supporting",
      "description": "One of the descendant Noah and a follower of the Millennium Earl    Another descendant of Noah who's assigned to kill Froi Tiedoll (the General being escorted by Kanda and Marie) who has also come to Japan. Skin was first shown in the early manga where he showed disgust at the Earl's dinner, saying he preferred sweets over a hard-boiled egg. He got so angry over dinner that he destroyed the Akuma who prepared the meal with his bare hands and then began to grow large spikes from his arm and back where his skin had peeled off. Because of this, Tyki always calls him &quot;Sweet Tooth&quot; instead of his real name.    In a flashback, it is discovered that he worked in New Orleans at the docks three years before the story of the manga. During this time, he exhibited the Noah's genes which allowed him to recall the 7000 years old memories of Noah causing him great pain and nightmares. It is then that he declares that he will never &quot;forgive it (the Innocence)&quot;. The rage of Noah was transferred into his body and he saw the state of the world from perspective of the Millennium Earl. In addition to recovering these memories, he meets Road and the Earl, who gives him his first taste of candy to stop him from biting his fingers in pain.    He represents the &quot;hatred&quot; of Noah and since he comes from New Orleans, it is assumed he is American.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5161-X4Coy4D8y0zI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5161
      },
      "rarity": "uncommon"
    },
    {
      "id": "lulu-bell",
      "name": "Lulu Bell",
      "alt_names": [
        "ルル・ベル"
      ],
      "role": "supporting",
      "description": "__Height:__ 166 cm\n\nThe blonde female Noah, who wears a black suit with a blue tie and often wears black shades. Originally appeared at the Noah Dinner Party with the first few revealed Noah.    She recently appeared in the manga again. Disguised as Andrew Nansen, she infiltrated the Order&#039;s headquarters to lead an invasion of a horde of Akuma after Allen and his friends&#039; hard struggle in the Ark. She plans to re-obtain the &quot;egg&quot; and create Skulls out of the most intelligent scientists of the Black Order. After seeing Allen, she also decides to bring him to the Earl to fill the spot of the 14th. Unfortunately for her, the generals of the Black Order, Cross Marian, Cloud Nine and Winters Sokaro, have proven to be far too powerful for Lulu Bell and her high-ranking Akuma to handle. In the end, she tried to escape with the egg, but Allen was onboard and destroyed the egg, causing a massive explosion. Whether Lulu Bell survived the explosion or not is currently unknown.    Lulu Bell represents the &quot;Lust&quot; of Noah with the power of &quot;Form&quot;.    In the anime adaptation, she often turns herself into a black cat to hide in the shadows or for spy purposes. She has cat-like qualities as well in her human form (for example, she licks her plate while drinking milk).    One of her main abilities as a Noah is the metamorphosis, in which she can transform herself into anyone or anything. She is not limited to a solid form, as she has been shown to transform into both humans for impersonation or water. She is especially deadly in liquid form as many attacks pass right through her. She has also been shown to turn her hands into whip-like tentacles, which she can use to pierce, strike, or slice. She is also able to affect Innocence to a certain degree. When Allen was sneak attacked by one of the Combined Akuma, he was temporarily weakened, which allowed Lulubell to negate Crown Clown with a slap.",
      "metadata": {
        "gender": "female",
        "age": "23",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5229-9HfZugL1rLLt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5229
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-25T10:36:46.374Z"
}