{
  "work_id": "jojos-bizarre-adventure-part-3-stardust-crusaders",
  "count": 15,
  "characters": [
    {
      "id": "joutarou-kuujou",
      "name": "Joutarou Kuujou",
      "alt_names": [
        "空条承太郎",
        "JoJo",
        "Qtaro",
        "Professor Kuujou",
        "Jotaro Kujo"
      ],
      "role": "protagonist",
      "description": "**Height:** 195 cm (6'5\")\n__Occupation:__ Student, Marine Explorer, Oceanographer\n__Nationality:__ Japanese \n\nJoutarou is Holly Kujo's son and Joseph Joestar's grandson. In Part 3, he has a recognizable attire of a blue trenchcoat-length school uniform jacket with yellow chains on the collar. He also wears a trademark hat which, while torn in the back, often seems to blend with his hair. When Joutarou first appears, he turned himself in to the police because he believes his Stand is an evil spirit possessing him. After he is released from jail, and learns what his Stand is, Joutarou gets used to Star Platinum -- a fierce, muscular, vaguely Aztec-looking spirit with \"the precision of a machine\" and the ability to destroy virtually anything with a sledgehammer barrage of fists. He has a very tough exterior, and is even rather rough and delinquent, but he also is very dedicated, intense, and loyal. He is very intelligent, but usually lets his (or Star Platinum's) fists do the talking with the enemy, even though he often has to rely on his wits to deal with stand users' attacks. He is also known for a quick and short temper. His catchphrase is \"Yare yare daze.\" It generally relates of being bored or exasperation. In Part 3, he is the main target of Dio, who realizes that Joutarou is his greatest threat.\n\nOne of the strongest stands in the JoJo universe; Star Platinum possesses super human senses, strength, stamina, accuracy and speed. It can see for great distances and at great magnifications. The Star tarot card that Star Platinum is named after symbolizes hope. Like other physically powerful stands, Star Platinum suffers from a narrow range of activity. It can only be active within a 2-3 meter radius from Joutarou. ~!It is similar to Dio's The World stand, and, it turns out, can likewise be used to stop time, but that ability is only revealed in Joutarou's epic battle with Dio Brando when Dio was about to drop a steamroller on him.!~\n\nIn the sixth story arc Stone Ocean, Joutarou becomes an oceanologist, moves to the United States, eventually marries, and his daughter, Jolyne inherits the potential to wield Stand powers.",
      "metadata": {
        "gender": "male",
        "age": "17-40",
        "dateOfBirth": "1970-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4003-gWDSEGbeOAll.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4003
      },
      "rarity": "epic"
    },
    {
      "id": "dio-brando",
      "name": "Dio Brando",
      "alt_names": [
        "ディオ・ブランドー"
      ],
      "role": "protagonist",
      "description": "__Height:__ 195 cm (6'5\")\n__Race:__ Human (formerly), Vampire (onwards)\n__Nationality:__ British\n\nDio is an immortal vampire and the arch rival of the Joestar clan.\n \n__Series 1: Phantom Blood__ \n~!Dio is the son of Dario Brando, an alcoholic and abusive father. Back when Dio was just a boy, he was brought into the household of George Joestar after the mysterious death of his father, so as to repay the debt he owed Dio's father for saving his life. But soon Dio's personality caused trouble for George's young son, Jonathan Joestar. Even more of a sociopath than his father, Dio was resolute to shatter Jonathan's spirit and take his place as the favored son, even going so far as to arrange for Jonathan's dog Danny to be burned to death. Initially, Dio is able earn the trust of the patriarch of the Joestar family through deceit (and at Jonathan's expense). However, his plans of taking over the Joestar household were discovered by Jonathan when he discovered that not only had Dio poisoned his biological father to death, he was doing the same to his adoptive father, all to take the Joestar estate for his own.  Determined not to be stopped, and understanding the potential to enjoy power over all things instead of just the Joestar estate, Dio wears and activates the Stone Mask, becoming a nearly unstoppable vampire. His gains supernatural abilities such as being able to walk on walls, and regenerating his body faster than fire can consume it. He is able to create two fluid jets from his eyes powerful enough to slice stone and kill living things. He is also able to vaporize his body fluid rapidly enough to freeze anything he touches. However, this is at the expense of having his body be sustained by sheer willpower alone, rather than vital energy. A sufficiently powerful vital force--specifically, sunlight or the Hamon force--will negate the sustaining force's presence and disintegrate the long-unliving body. Like all Jojo vampires, Dio sucks blood through tentacles in his fingers and has been seen at least once drinking blood from an unnamed girl.  At the end of Series 1, Dio's body was destroyed, but his severed head managed to kill Jonathan Joestar and together they sank to the bottom of the Atlantic Ocean.!~ \n\n__Series 3: Stardust Crusaders__ \n~!100 years later, at the bottom of the sea, Dio's severed head reattached itself to Jonathan Joestar's lifeless body (giving Dio the same star birthmark as the members of the Joestar family). Dio's casket is recovered by fishermen, who are implied to have been killed by Dio as he awakened. He finds that he is now in the year 1985. After he returns to land he develops a Stand (a sort of ghostly bodyguard), giving him vastly powerful new abilities on top of his vampiric powers. For most of Series 3, Dio is out of scene and in the shadows, and the question of exactly what his Stand \"The World\" can do is a mystery.  In Series 3, many of Dio's offensive vampiric abilities do not appear, though he displays a new ability described as \"evil implants\"; parasites generated in his hair that attach themselves to and brainwash victims, finding early success with Kakyoin and Polnareff. Dio's Stand \"The World\", as a sort of brother power to \"Star Platinum\", possesses great speed and strength and, crucially, is able to stop time, making Dio appear to teleport or move at impossible speed. Dio's ambition is to create a perfect world for himself and his servants. In the interim, he seeks to drain for himself the blood of the Joestar lineage, which will help him to fully fuse with Jonathan Joestar's body and take better control of The World. Once he does this, his powers will gradually increase, until he is able to stop time for as long as he likes. In the beginning of the story arc Dio's World, Dio mainly battles Kakyoin and Joseph. Kakyoin succeeds in leading Dio into a vast barrier created by his Stand, trapping him. Dio uses The World to stop time, allowing him to ignore the barrier and approach Kakyoin to deliver a fatal blow. Before dying, Kakyoin deduces the The World's time-stop ability and uses his last strength to give Joseph this message. Joseph then warns this to Jotaro before he is also killed by Dio.  After a long battle between Dio and Jotaro, Jotaro finds his own ability to stop time just before Dio drops a steamroller on him, proceeding in time-stop to break Dio's leg. Jotaro's intention was for the two to end the fight with a final blow once Dio's leg had healed. Dio, determined not to lose, squirts blood from his open leg into Jotaro's eyes. Dio then attempts a final kick with The World, which Jotaro blindly counters with a punch from Star Platinum. Star Platinum's hand breaks on The World's leg, but the punch sends a fissure through The World and through Dio, shattering Dio completely above the waist. Jotaro and doctors from the Speedwagon Foundation (an oil and medicine company loyal to the Joestar family) transfer the blood from Dio's lower half to Joseph Joestar, reviving him. Later, they lay Dio Brando's remains in the Sahara Desert to evaporate with the rising sun.!~ \n\n__Series 6: Stone Ocean__ \n~!In Part 6, it is revealed to the Joestars that his reemergence was planned to create a perfect world when the moon reached a certain angle and time. He stumbled upon Enrico Pucci not long before Part 3 and \"healed\" his disfigured foot for him. After piercing Pucci with a Stand arrow, the two spent considerable time together, plotting and scheming. He questioned Pucci's loyalty to him, wondering why he didn't use Whitesnake to remove The World from him. Pucci had explained that he loved Dio as he had loved God, and thus worshipped him too much to betray him. Ensuring that he wouldn't completely fade, he left one of his bones in Pucci's care. Dio's presence continues to haunt the series, emerging in flashbacks and his disfigured sons. His bone played a vital plot element for the first half of Part 6, an odd green baby inheriting a Stand to merge with it.!~",
      "metadata": {
        "gender": "male",
        "age": "13-121",
        "dateOfBirth": "1867-04-10"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4004-w0OtWuvjhftG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4004
      },
      "rarity": "epic"
    },
    {
      "id": "jean-pierre-polnareff",
      "name": "Jean-Pierre Polnareff",
      "alt_names": [
        "ジャン＝ピエール・ポルナレフ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 185 cm (6'1\")\n\nJean-Pierre Polnareff is a 22 year old Frenchman who joins the Joestar group on their journey to Egypt after being freed from Dio's control by the group. He aims to avenge the murder of his sister. His brash nature and overconfidence combined with his general tomfoolery is often the source of trouble throughout the journey, and other members of the group often remark on his tendency to endanger himself and others.\n\n~!Polnareff reappears in 2001 (Part 5), now 36 years old and wheelchair-bound, to assist Giorno and the rest of Passione in their fight against the boss.!~\n\nHe also serves as the inspiration for many characters in other franchises such as Guile (Street Fighter), Paul (Tekken), Benimaru Nikaido (King of Fighters).",
      "metadata": {
        "gender": "male",
        "age": "23-36",
        "dateOfBirth": "1965-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4368-1KToX8uSi1U1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4368
      },
      "rarity": "epic"
    },
    {
      "id": "joseph-joestar",
      "name": "Joseph Joestar",
      "alt_names": [
        "ジョセフ・ジョースター",
        "JoJo",
        "Josef Joestar",
        "Mr. Joestar",
        "Old Man",
        "Geezer"
      ],
      "role": "protagonist",
      "description": "__Height__: 195 cm (6'5\")\n\nJoseph Joestar begins as a young Englishman in New York, with his grandmother Erina. However, an attack by Straits and the disappearance of Robert Edward O Speedwagon soon involve him in the greater chain of events.",
      "metadata": {
        "gender": "male",
        "age": "18-78",
        "dateOfBirth": "1920-09-27"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6356-RImEfUfHpC58.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6356
      },
      "rarity": "epic"
    },
    {
      "id": "noriaki-kakyouin",
      "name": "Noriaki Kakyouin",
      "alt_names": [
        "花京院典明",
        "Noriaki Kakyoin",
        "Tenmei Kakyoin"
      ],
      "role": "protagonist",
      "description": "__Height__: 178 cm (5'10\")\n__Stand__: Hierophant Green\n\nKakyoin is a high school student and user of the stand Hierophant Green. Unlike most stand users, Kakyoin was born with his stand, though it caused him to feel like an outsider for most of his life due to not knowing any other stand users. Until meeting the rest of the main characters, Hierophant was Kakyoin’s only real friend.\n\nHierophant is not physically strong, but is elastic and can able to unravel into tentacles which can capture opponents. It can also enter an enemy’s body to possess them, though Kakyoin rarely uses this ability. Hierophant’s signature power is emerald splash, which hurls emeralds that slice opponents.\n\nKakyoin remains calm and collected even in dangerous situations, and is good at seeing through opponents’ strategies. \n\nDuring a trip to Egypt with his family, he encountered Dio, who controlled him using a flesh bud. It was later removed by Jotaro and Kakyoin joined the Joestar group.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/8945-gyPfrVpCb5CF.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8945
      },
      "rarity": "epic"
    },
    {
      "id": "mohammed-avdol",
      "name": "Mohammed Avdol",
      "alt_names": [
        "モハメド・アヴドゥル",
        "Mohammed Abdul"
      ],
      "role": "protagonist",
      "description": "__Height:__ 188 cm (6'2\")\n\n__Stand:__ Magician's Red\n\nAvdol is a fortune teller and friend of Joseph Joestar. They met three years before the events of the story. He was born with a stand, Magician’s Red, which controls fire. This stand’s abilities include Crossfire Hurricane, which shoots fire in the shape of an Ankh, and Crossfire Hurricane Special, which splits into multiple Ankh-shaped flames. He can also create flame tracker that detects a person’s energy.\n\nAvdol presents himself as a serious person but can sometimes let his emotions get the best of him. He often acts as the voice of reason among the Joestar group and exhibits strong loyalty by frequently placing himself in danger to protect his friends. He is knowledgeable about geography and stands, enjoys India’s chaotic atmosphere, and respects Polnareff’s chivalrous attitude that he displayed when they first met. Avdol gives Jotaro’s stand its name. \n\n~!Avdol encountered DIO in Egypt before the main events of the story, but was able to escape unscathed.!~\n\n~!At one point he is shot by Hol Horse and presumed dead, but he was actually in hiding and rejoins the Joestar group later. He is killed protecting Polnareff and Iggy from Vanilla Ice.!~\n\nHe is named after Paula Abdul.",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": "1960-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8946-BumWgNGkPP9W.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8946
      },
      "rarity": "epic"
    },
    {
      "id": "iggy",
      "name": "Iggy",
      "alt_names": [
        "イギー"
      ],
      "role": "protagonist",
      "description": "__Height:__ 33.3 cm\n__Nationality:__ American\n\nIggy is a boston terrier who wields a stand known as The Fool, which is able to manipulate sand. Since The Fool is made of sand, damaging it will not hurt Iggy. He creates various objects out of sand including the wings of a glider and a statue of DIO. Iggy is depicted as rude and disobedient, as shown by his tendency to chew on people’s hair while farting on them. He loves coffee-flavored gum.\n\nIggy was previously owned by a rich man, but he ran away and became a stray in New York. Avdol caught him and brought him to Egypt to help the Joestar group defeat DIO. He frequently chews Polnareff’s hair and once put chewed gum inside Jotaro’s hat.\n\n~!At first, Iggy seems indifferent towards the Joestar’s quest to defeat DIO. Then he accidentally finds DIO’s mansion and is attacked and injured by Pet Shop, causing his hatred for DIO to grow. He is killed after saving Polnareff from Vanilla Ice.!~\n\nHe was initially drawn as realistic dog, but as the story progressed, his face gradually became more similar to a human’s. He is named after Iggy Pop.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/21089.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21089
      },
      "rarity": "epic"
    },
    {
      "id": "hol-horse",
      "name": "Hol Horse",
      "alt_names": [
        "ホル・ホｰス",
        "Horu Housu"
      ],
      "role": "supporting",
      "description": "**Height**: 188cm *(anime)*\n\nHol Horse is a minor antagonist in JoJo's Bizarre Adventure: Stardust Crusaders (first seen in Chapter 141 and Episode 10), as well as one of the main characters of Crazy Diamond's Demonic Heartbreak. He is a tall, blonde-haired cowboy-themed mercenary, serving under Dio and his army of other Stand Users. He considers himself \"The #2\", preferring to work as support with a partner due to his cowardice and caution. He also respects women, no matter how pretty, or how ugly, as seen with his ex, Nena. \n\nHis Stand is Emperor, named after the Tarot Card of the same name. It manifests itself as a retro-futuristic pistol, which functions as a normal firearm, although the bullets are able to change their trajectory to Hol Horse's command.\n\n~!He is seemingly fatally injured by his own Stand's bullets in Chapter 221 (and episode 37 of the anime), but manages to survive and go into hiding, fearing Dio's punishment for failing his mission of killing the Joestar group.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16557-Kw9mRwSaq6ut.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16557
      },
      "rarity": "common"
    },
    {
      "id": "suzie-q",
      "name": "Suzie Q",
      "alt_names": [
        "スージーＱ",
        "Suzie Quatro"
      ],
      "role": "supporting",
      "description": "__Height:__ 168 cm \n\nThe female assistant to Lisa Lisa. Suzie Q is a slightly ditzy girl who worries for her friends. Evidently this carefree personality has not diminished even in the events of Stardust Crusaders, when she is shown enthusiastically recording her sightings in Japan on a camcorder when on a trip to see her daughter.   ~!She is introduced as the female assistant to Lisa Lisa. When she first appears, she is taken over by the remains of Esidisi and attacks her friends. Thanks to a combination attack by Caesar and Joseph, she is saved with only minor injury. She marries Joseph in 1939.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21962-74U6QodPnwtC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21962
      },
      "rarity": "common"
    },
    {
      "id": "j-geil",
      "name": "J. Geil",
      "alt_names": [
        "J・ガイル",
        "Centerfold"
      ],
      "role": "supporting",
      "description": "J. Geil is the man responsible for the murder of Polnareff's sister, earning him Polnareff's desire for revenge.    \n\nJ. Geil expend most of his time hiding from plain view, preferring to have a partner in which to rely on. This made him a perfect candidate for Hol Horse who like him believe working in pairs. He would hide in the shadows while Hol Horse broke the glass needed for his stand to work and sometimes they would do combination attack, such as Hal Horse breaking glass and J. Geil attacking while Hol Horse shot a bullet from his Stand, the Emperor, locking the enemy in a mortal circle.    \n\nLike his mother he had a deformity that give him two right hands.     \n\n(Source: JJBA Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n42159-dOLLXUpvkxmR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42159
      },
      "rarity": "common"
    },
    {
      "id": "daniel-darby",
      "name": "Daniel D'Arby",
      "alt_names": [
        "ダーニアル・J.・ダービー ",
        "the Gambler"
      ],
      "role": "supporting",
      "description": "__Occupation:__ Gambler\n__Stand:__ Osiris\n__Manga Debut:__ Chapter 211\n__Anime Debut:__ Episode 34\n\nD'Arby is an expert and inveterate gambler and his Stand, Osiris, can steal souls. He is a member of the Egypt 9 Glory Gods and meets the Joestar Group in Cairo. Here, he tricks them into wagering their souls in various gambles. D'Arby is also Telence T. D'Arby's older brother.\n\nDaniel J. D'Arby exhibits an affable but sly, knowing character. D'Arby first and foremost character trait is his love of gambling. He states that he lives for the thrill of gambling (which he recognizes as worthless). This love of gambling is complemented by his enjoyment for cheating, and he proudly admits that cheating is one of his greatest skills shamelessly rigging every game he's seen participating to while justifying himself by claiming that if the cheat isn't exposed, it is \"fair\" game.",
      "metadata": {
        "gender": "male",
        "age": "31",
        "dateOfBirth": "1958-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72735-U8o9FECDjdF0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72735
      },
      "rarity": "common"
    },
    {
      "id": "terence-darby",
      "name": "Terence D'Arby",
      "alt_names": [
        "テレンス・T.・ダービー",
        "the Gamer"
      ],
      "role": "supporting",
      "description": "__Nationality:__ American\n__Occupation:__ Butler\n__Stand:__ Atum\n\nD'Arby is one of the Egypt 9 Glory Gods and resides in DIO's mansion in Cairo acting as his butler. He isolates and challenges Jotaro, Joseph and Kakyoin when the Joestar Group enters the mansion and forces them into waging their souls against him in various video game challenges. He is also Daniel J. D'arby's younger brother.\n\nAs a butler, Terence is a mannerly individual. However, his demeanor is a facade for his twisted and arrogant personality. Due to his occupation, Terence is rather polite and affable, keeping his calm even in the face of provocations and comes to greet and confront the Joestar Group when they enter DIO's Mansion. Terence is a very intelligent man and is especially proficient at video games: He defeated the likes of Tatsuhiko, a child genius with an IQ of 190, albeit without the use of his Stand's ability to read minds.",
      "metadata": {
        "gender": "male",
        "age": "21",
        "dateOfBirth": "1968-01-05"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n72737-JqlDCNpdGnYu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72737
      },
      "rarity": "common"
    },
    {
      "id": "vanilla-ice",
      "name": "Vanilla Ice",
      "alt_names": [
        "ヴァニラ・アイス",
        "Iced"
      ],
      "role": "supporting",
      "description": "Vanilla Ice is the last Vampire created by DIO and one of the penultimate Stand Users the Joestar Group faces upon infiltrating DIO's Mansion. After the group is split up, he is sent to take out the team consisting of Avdol, Polnareff, and Iggy. Vanilla Ice is a Stand User controlling his void-based Stand ability, Cream, to battle.\n\nHis name is based off the famous ''rapper'', Vanilla Ice. His stand is named after the band, Cream.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b76658-ZOj7gr6EfN52.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 76658
      },
      "rarity": "common"
    },
    {
      "id": "enya-geil",
      "name": "Enya Geil",
      "alt_names": [
        "エンヤ・ガイル",
        "N-Yah Gail",
        "Enyaba"
      ],
      "role": "supporting",
      "description": "Enya Geil is one of Dio's most loyal supporters, and the one who originally gave him the Stand Arrow, which she obtained from Diavolo. She is the mother of J. Geil. Her stand is Justice, which is able to control people through their wounds, whether alive or dead.  For legal reasons, her name is changed in the American version of both the game and the manga, to N-Yah Gail and Enyaba Geil respectively.  In the OVA:  ~!She is able to change her appearance from that of a young woman to an old lady at will. No explanation as to why is ever given.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/77359.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 77359
      },
      "rarity": "common"
    },
    {
      "id": "rubber-soul",
      "name": "Rubber Soul",
      "alt_names": [
        "ラバーソール"
      ],
      "role": "supporting",
      "description": "Rubber Soul is a medium-height curly haired man, with his Stand granting him the ability to grow larger and to change appearance at will. He was hired by Dio with the promise of earning 100 millions as a reward for killing Jotaro. Rubber Soul does, however, have a rather disturbing personality: he is extremely rude and impolite, showing no respect nor mercy for people and animals, as they are beings that he only sees as food for his Yellow Temperance. He does not seem to be particularly intelligent, though he has a really bad temper: he wanted to ambush Jotaro with Kakyoin's appearance, but his unusual behavior blew his cover.  Rubber Soul is also very violent: he attempts to kill a pickpocket by breaking his back, and remorselessly eats a dog under the eyes of its master with his Stand. In order to grow bigger, he did not hesitate to eat bugs either.  From: http://jjba.wikia.com/wiki/Rubber_Soul",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n78409-7rErshohW3IK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 78409
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-26T00:27:45.449Z"
}