{
  "work_id": "is-it-wrong-to-try-to-pick-up-girls-in-a-dungeon",
  "count": 40,
  "characters": [
    {
      "id": "hestia",
      "name": "Hestia",
      "alt_names": [
        "ヘスティア",
        "Vesta",
        "Loli Kyonyuu (ロリ巨乳)",
        "Loli Big-Boobs"
      ],
      "role": "protagonist",
      "description": "__Race:__ God\n__Height:__ 140 cm (4'7\")\n__Affiliation:__ Hestia Familia\n\nHestia is an energetic, kind goddess who sees potential in Bell. She is a hard worker, and works jobs to support the two while Bell goes off to the dungeon. Hestia tends to be shown as very petty and gets jealous easily when girls, namely Aiz, show interest in Bell, because she is deeply in love with him, or they are the reason for his strength growth. Despite seeming mature and dependable toward Bell, Hestia is in truth, a lazy goddess, as she couldn't get a job or put effort into work. After descending to the Lower World, Hestia was taken care of by her friend Hephaestus. Soon after, she was asked to live on her own after she kept freeloading off of Hephaestus' familia and was given a room at an abandoned church. Hestia tried to create her own familia, but wasn't able to recruit anyone. After failing to recruit for the 50th time, she noticed Bell and decided to secretly follow him. Hestia found out that Bell had been trying to enter a familia, but was rejected multiple times and seemed to be in the same boat. Hestia then took the chance to recruit him, which Bell happily agreed upon; becoming the first member of her familia. She took Bell to a bookstore, the location she already decided beforehand, and granted her Falna to her first dependent.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b87654-UmmuLPwSK2Hd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87654
      },
      "rarity": "legendary"
    },
    {
      "id": "bell-cranel",
      "name": "Bell Cranel",
      "alt_names": [
        "ベル・クラネル",
        "Little Rookie",
        "Rabbit Foot",
        "Record Holder",
        "Ox Slayer"
      ],
      "role": "protagonist",
      "description": "__Race:__ Human\n__Height:__ 165 cm (5'5\")\n\nBell Cranel is the captain of the Hestia Familia. Bell was raised by his grandfather in a rural farming village deep within the mountains near the labyrinth city Orario. He had heard and read many stories about heroes from his grandfather, forming his dream of aspiring to be a mighty one himself. After his grandfather's death, he took it upon himself to leave the village, traveling to the land of Orario to fulfill his dreams. Upon his arrival in the city, Bell attempted to enter numerous Familia, but was rejected by each one. Hestia, a Goddess, unable to find members willing to join her Familia, asked him if he'd like to become the first member of her Familia. Bell gladly accepted, and so started his new life, finally with a Goddess' blessing.\n\nBell is a kind, straightforward, brave, yet shy boy who desires to be a hero like the ones he grew up reading about. He cares deeply for the people around him, especially his Goddess, Hestia, and his Familia. He considers them like family due to the death of his grandfather. Bell's goals didn't start out pure, as he wanted to be an adventurer in hopes of picking up girls, even thinking of starting a harem. However, after his experience with Ais and Bete, Bell seems to have forgone that dream and fell in love with Ais Wallenstein. He became determined to grow stronger so that he could be someone that could stand beside her. Ais saved Bell in an incident with a minotaur and that event made Bell fall in love with her and have fear of Minotaurs.",
      "metadata": {
        "gender": "male",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88860-catfcwlvUYst.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88860
      },
      "rarity": "legendary"
    },
    {
      "id": "liliruca-arde",
      "name": "Liliruca Arde",
      "alt_names": [
        "リリルカ・アーデ",
        "Lili"
      ],
      "role": "protagonist",
      "description": "__Race:__ Pallum\n__Height:__ 110 cm (3'7\")\n\nLiliruca Arde is a member of the Hestia Familia. Originally a member of the Soma Familia, she converted to the Hestia Familia after securing her freedom after the War Game. Lili was born to Hobbit parents belonging to the Soma Familia, making her a member of the Familia from birth. However, her parents didn't look after her and ordered her to earn money for them instead. A while later, her parents were killed in the dungeon, leaving her to fend for herself. The Soma Familia didn't take care of her and bullied her, making her lonely and isolated. To earn money, she tried to be an adventurer, but didn't have the talent, eventually switching to being a supporter. As a supporter, she was constantly looked down on by those she partied with, fueling the hatred of adventurers inside of her. After a while, Lili decided to run away from the Soma Familia and become a normal citizen. However, the Soma Familia found her and inflicted misery on the old couple who took care of her, destroying their store and stealing money. She began to hate Soma himself, wondering why he created a Familia if he wasn't going to take care of it. From that time on, Lili began using her hatred of adventurers as an excuse to trick and steal from them. \n\nShe also treated Bell the same way, however, his actions repeatedly caused her to question her own attitude. After she is saved by Bell, she becomes much closer to him and develops romantic feelings for him. Lili often uses her experience to gather information or do jobs that Bell and the other members of the Hestia Familia would be unable to do properly. She is also frequently amazed at how Bell seems to constantly get himself involved in trouble, yet she still cooperates with him in whatever he does.\n\nLili is regarded as the \"brains\" of the Familia, being that she is the most capable when it comes to developing battle plans and strategies. She advised Bell and Welf to travel to the eighteenth floor when they were trapped in the dungeon, and she was crucial in forming the Hestia Familia's plan of attack for the War Game. Lili also possesses a strong insight, forged through her time as a thief, as she was able to pick up Finn Deimne's speech patterns, mannerisms, and character after only one meeting with him.",
      "metadata": {
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88897-2xey5UG7Qr2S.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88897
      },
      "rarity": "legendary"
    },
    {
      "id": "welf-crozzo",
      "name": "Welf Crozzo",
      "alt_names": [
        "ヴェルフ・クロッゾ",
        "Ignis"
      ],
      "role": "protagonist",
      "description": "__Race:__ Human\n__Height:__ 175 cm (5'9\")\n\nWelf Crozzo is a member of the Hestia Familia and Bell's personal blacksmith, later becoming one for the entire Hestia Familia after converting from the Hephaestus Familia. Welf was originally born in Rakia, a nation type Familia ruled by Ares. As a member of the Crozzo Family, he lived as a noble due to the successes his predecessors had in creating magic swords. However, his life changed the day his Skill Crozzo Blood appeared, which enabled him to create magic swords again. Despite his family's joy at the prospect of being able to create more magic swords, Welf despised his skill, causing him to escape Rakia with the help of his former Goddess Phobos. \n\nWelf Crozzo is a straightforward and honest person. He is generally casual to everyone that he associates with. He doesn't like to be associated with his family name, preferring to not be a part of the conversation when his name is brought up and even refuses people that come to him seeking magic swords.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b138250-VOIbyr2PNsZS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 138250
      },
      "rarity": "legendary"
    },
    {
      "id": "ais-wallenstein",
      "name": "Ais Wallenstein",
      "alt_names": [
        "アイズ・ヴァレンシュタイン",
        "Sword Princess",
        "War Princess"
      ],
      "role": "supporting",
      "description": "__Height:__ 162 cm (5'4\")\n\nAis Wallenstein, also known as the Sword Princess, is a First-Class Adventurer and a key member of the Loki Familia. Among the small fraction of First-Class Adventurers, she is considered one of the strongest.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b87655-7QjpIyyZuqyp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87655
      },
      "rarity": "rare"
    },
    {
      "id": "ryuu-lion",
      "name": "Ryuu  Lion",
      "alt_names": [
        "リュー・リオン",
        "Ryu Lion",
        "Lyu"
      ],
      "role": "supporting",
      "description": "__Race:__ Elf\n__Height:__ 165 cm (5'5\")\n\nRyuu Lion is a waitress at the Hostess of Fertility.\n\nRyuu was a member of a family that cared for the sacred tree in their home forest of Ryumilua. As time passed, she began to think that beautiful Elves were the ugliest of all people, due to seeing her fellow Elves' behavior toward those of other races. No matter how much she tried to forget it, once she began thinking about it, the thought firmly planted itself in her mind. Eventually, the thought became enough to make her decide to leave the forest.\n\nRyuu is calm and stoic but also cares deeply for her friends. When a person related to her or her friends are in danger or in need of help, she is always ready to step in and help no matter the cost. Like many Elves, Ryuu is selective with who may touch her. However, she has been advised by Alise to not let go of a man that was able to grab her hands, and began to follow Bell with her eyes. Unlike most Elves, she doesn't bear the same hatred towards the Crozzo family or their magic swords for their role in the destruction of the forests the Elves lived in, stating that the event took place many years ago and that her village wasn't directly affected. \n\n~!After arriving in Orario, Ryuu became an adventurer known as Gale, belonging to the Astraea Familia. She was caught in a trap set by Evilus and all of her fellow Familia members were murdered. Overcome with vengeance, she persuaded Astraea to leave Orario as she didn't want her to see her revenge. After that, she single-handedly destroyed the Rudra Familia as a part of her rampage and those associated with Evilus through various trickery, traps, and assassinations, causing her to be branded as a fugitive as a result of the ensuing chaos. Her revenge finally fulfilled, she collapsed in an alley where she nearly succumbed to her injuries. Fortunately, she was discovered by Syr and nursed back to health by Mia Grand. Ever since then, she has joined the Hostess of Fertility.!~",
      "metadata": {
        "gender": "female",
        "age": "21",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88890-lJFKK5czkH9E.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88890
      },
      "rarity": "rare"
    },
    {
      "id": "eina-tulle",
      "name": "Eina Tulle",
      "alt_names": [
        "エイナ・チュール"
      ],
      "role": "supporting",
      "description": "__Race__: Half Elf\n__Height:__ 164 cm (5'5\")\n__Affiliation:__ Guild\n\nEina Tulle is a receptionist at the Guild and Bell Cranel's advisor. Eina joined the Guild five years earlier at the age of 14 after she graduated from the school. Originally excited to work at the Guild, she quickly learned that it wasn't as fun as she thought it would be, eventually changing her personality into what it is now. She met Bell four years later and became his dungeon adviser. \n\nEina shows a serious, calm demeanor, appearing as a very wise and sisterly figure towards Bell, even so far as getting worried whenever he went out to dangerous levels in the dungeon. She gets embarrassed when the subject of romance or love is mentioned, especially coming from Bell. Eina is passionate about her job as she doesn't want any adventurers under her care to die in the dungeon. She has a particular stance when it comes to advising adventurers; in addition to the usual Dungeon-prowling advice and regular meetings, she would also summon her adventurers to private lessons, where she crams as much Dungeon knowledge into their heads as possible. It was to the point where she gained a scary reputation among many adventurers, as she would often demand her pupils to perfectly draw out maps and monsters strategies from memory, with the threat of extra work if there were any mistakes. No one had lasted all the way to the end of her course, most ran away halfway through, and the only one known so far to be able to endure her lessons is Bell.\n\nDue to her beauty, Eina is popular with her coworkers and adventurers and is often flirted on, and some keep on trying even if they're rejected like Dormul and Luvis. However, she is interested in men that are unreliable like Bell instead of reliable men.",
      "metadata": {
        "gender": "female",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/88896-zhwTEI30T5XB.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88896
      },
      "rarity": "rare"
    },
    {
      "id": "syr-flova",
      "name": "Syr Flova",
      "alt_names": [
        "シル・フローヴァ",
        "Syr Flover"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 162 cm (5'4\")\n__Affiliation:__ Hostess of Fertility • Maria's Orphanage Alliance\n__Skill:__ Pupa Domina\n\nA shop employee who works at the bar Mistress of Abundance. A kind person who gives Bell food when he is hungry.\n\n~!Syr is actually a demi-god!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/88898-smaZBxgyx2wM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88898
      },
      "rarity": "rare"
    },
    {
      "id": "tiona-hiryute",
      "name": "Tiona Hiryute",
      "alt_names": [
        "ティオナ・ヒリュテ",
        "Amazon",
        "Crusher"
      ],
      "role": "supporting",
      "description": "__Race:__ Amazoness\n__Height:__ 165 cm (5'5\")\n__Affiliation:__ Loki Familia\n__Level:__ 6\n__Skills:__ Berserk • Intense Heat\n__Weapon: __Urga • Blade Rolan\n\nTiona Hiryute is a first class adventurer and an executive member of the Loki Familia. She is the younger twin of the Hiryute Sisters. Tione and Tiona were born in Telskyura and were forced to join the Kali Familia from the moment they were born. Both sisters didn't know who their parents were, but knew that they were sisters. She reached Level 2 on the same day Tione did after killing an Amazoness she knew in a fight to the death. Soon after, both sisters became students to Argana and Bache. Around a year after reaching Level 2, Tiona found her first hero story. The day before her seventh birthday, Tiona asked Kali to let her and Tione leave the country, which Kali granted a couple days later, much to the sisters' surprise. The sisters traveled across the land, temporarily joining different Familia for a year, during which both sisters reached Level 3. They arrived at Orario years later when they were 12 years old. After agreeing to join the Familia of the adventurer that defeated them, they proceeded to defeat everyone that challenged them, only to lose to Finn and Gareth when they were challenged by the Loki Familia. Following a dungeon expedition they went on shortly after joining, both sisters reached Level 4.\n\nTiona is an overly energetic Amazoness woman who likes teasing people, but is a caring friend. She isn't the type to use her brain, which she admits herself, and has a complex about her chest size compared to other women. She is also fond of hero stories and is almost equally as knowledgeable about the topic as Bell is. She also seems to be more caring than her sister, as seen when she let Wiene live.",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/121633-XNWkrmvyvevi.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 121633
      },
      "rarity": "rare"
    },
    {
      "id": "mord-latro",
      "name": "Mord Latro",
      "alt_names": [
        "モルド・ラトロー",
        "Ruffian Dog"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 178 cm (5'10\")\n__Affiliation:__ Ogma Familia\n__Level:__ 2\n__Weapon:__ Double-Edged Sword\n\nMord Latro is a Level 2 adventurer who was initially an enemy to Bell Cranel. Mord Latro is a loud and tough adventurer. He is also shown to be ill-tempered, holding a grudge against Bell for his rapid growth and fame. He is also shown to have a lustful nature, claiming that Bell should share Ryuu, Syr, and Lili while at the Hostess of Fertility because \"they were friends\". Despite Mord's dislike for Bell at first due to his growth and fame, he comes to respect Bell after his battle with him on the 18th floor, as well as witnessing Bell finish off the Floor Boss Black Goliath. Through various encounters, such as the El Dorado Resort incident, he also becomes much friendlier to him, even coming to his defense when an adventurer insulted him for helping monsters. He even bet 100,000 valis on the Hestia Familia during the War Game, showing his confidence in their abilities.",
      "metadata": {
        "age": "35",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/122200-F51vOIWgcAQh.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122200
      },
      "rarity": "rare"
    },
    {
      "id": "guile-india",
      "name": "Guile India",
      "alt_names": [
        "ガイル・インディア"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Level:__ 2\n__Weapon:__ Spike Mace\n__Equipment:__ Shield Crest\n\nGuile is one of Mord's loyal companions along with Scott Olds. He mainly follows the orders given to him such as watching over their hostage Hestia, but expressed the desire to go join the others at Mord's duel when they heard loud noises coming from that direction.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/122201-gpUaGnrmYY8n.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122201
      },
      "rarity": "rare"
    },
    {
      "id": "lunoire-faust",
      "name": "Lunoire Faust",
      "alt_names": [
        "ルノア・ファウスト",
        "Black Fist"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 161 cm (5'3\")\n\nLunoire Faust is a waitress at the Hostess of Fertility and a former bounty hunter known as Faust as a member of the Demeter Familia. Lunoire was born to parents that lived in a territory of the empire. However, her parents soon died because of a war, and she was forced to live her life as one of the street children. After living for some time in harsh conditions, she heard about the falna and joined a Familia, but later began traveling on her own a while later once her Goddess was forced back to heaven. After a while, she arrived at Orario nine years before the story and failed her first mission of killing the Gulliver Brothers, barely escaping with her life, and began refusing jobs to kill first class adventurers. Eventually, after failing to kill a wanted Ryuu, she joined the Hostess of Fertility. \n\nLunoire has a straightforward and caring personality, as shown when she tried to distance herself from her own Familia in order to protect them. She once considered finding a husband that didn't need to be cool as long as he would care for her and let her laze around in a small house.",
      "metadata": {
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b122203-Ghj2Dau1YeHx.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122203
      },
      "rarity": "rare"
    },
    {
      "id": "mia-grand",
      "name": "Mia Grand",
      "alt_names": [
        "ミア・グランド",
        "Demi Ymir",
        "Mama Mia"
      ],
      "role": "supporting",
      "description": "__Race:__ Dwarf\n__Height:__ 180 cm (5'11\")\n__Affiliation:__ Hostess of Fertility • Freya Familia\n__Level:__ 6\n\nMia Grand is the owner of the Hostess of Fertility, and is later revealed to be the former captain of the Freya Familia. Several years ago, Mia joined the Freya Familia because she owed Freya a favor, eventually becoming the captain of the Familia. When Ottar joined the Familia, Freya asked her to take care of him. Sometime before Ais came to Orario, Mia partially left the Freya Familia to open the Hostess of Fertility, employing Anya there.\n\nAs the proprietress of the Hostess of Fertility, she is strict both to her employees and customers alike. She doesn't tolerate any violence within the pub or slacking off by her employees and will punish any individuals accordingly, such as when she threatened Mord. Despite her rough personality, she is also shown to be kind, taking in girls with histories and protecting them. In addition, she likes money, telling Bell a couple of times to spend a lot of money.",
      "metadata": {
        "gender": "female",
        "age": "55",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b122206-7YEjlbz0KnjP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122206
      },
      "rarity": "rare"
    },
    {
      "id": "bete-loga",
      "name": "Bete Loga",
      "alt_names": [
        "ベート・ローガ",
        "Vanargand",
        "Fenris"
      ],
      "role": "supporting",
      "description": "__Race:__ Werewolf\n__Height:__ 183 cm (6'0\")\n__Affiliation:__ Loki Familia\n__Level:__ 6\n__Skills:__ Úlfheðinn • Fenris Wolf • Solmani\n__Magic:__ Hati\n__Weapon:__ Flosvirt • Dual Rolan\n\nBete Loga is a first class adventurer and an executive member of the Loki Familia. He was the former captain of the Vidar Familia until they left the city. Bete was born to the leader of a clan of Werewolves and had a sister named Luna along with a childhood friend named Rene, who he later got in a relationship with. However, his whole clan was killed by a monster when he was 12, and he traveled to Orario where he eventually became the captain of the Vidar Familia. When he was 16, he temporarily left the city as a Level 3 to kill the monster that killed his clan, succeeding in doing so after a day of fighting. Unfortunately, he discovered upon his return that his Familia had failed their recent dungeon expedition, resulting in the deaths of the vice-captain, who he used to be in a relationship with, along with several others while others that survived gained wounds fatal for an adventurer. The Vidar Familia subsequently left the city, though he stayed behind, and later joined the Loki Familia after an incident with Finn and Gareth at a pub.\n\nBete has a rough personality and a slight superiority complex. He completely hates the weak, especially those that don't do anything about their weakness, and is not afraid to express his opinions about it. He can be an idiot who can't read the atmosphere. Furthermore, he is a bad drunk and has a tendency to spout things when intoxicated. He has, in several instances, displayed feats of heroism and still worries for the wellbeing of his weaker subordinates. He is also described as a tsundere, hiding a more forebearing exterior. He admires and has a crush on Ais.",
      "metadata": {
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b122632-kzchULOi6BfA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122632
      },
      "rarity": "rare"
    },
    {
      "id": "lefiya-viridis",
      "name": "Lefiya Viridis",
      "alt_names": [
        "レフィーヤ・ウィリディス",
        "Thousand Elf (千の妖精",
        "Sauzando Erufu)"
      ],
      "role": "supporting",
      "description": "__Race:__ Elf\n__Height:__ 156 cm (5'1\")\n__Affiliation:__ Loki Familia\n__Level:__ 4\n__Skills:__ Fairy Canon • Double Canon\n__Magic:__ Arcs Ray • Fusillade Fallarica • Elf Ring\n__Weapon:__ Forest's Teardrop\n\nLefiya Viridis is a second class adventurer and a member of the Loki Familia. She is a mage training to succeed Riveria Ljos Alf. She has a magic that allows her to use any Elf Magic, hence the alias Thousand Elf. Sometime in the past, Lefiya was an honor student at the School, leveling up after three years at eleven years of age. After graduating, she joined the Loki Familia at Level 2 and leveled up a year later. \n\nLefiya is clumsy, but hard working. She occasionally zones out as her imagination runs rampant. She has a deep admiration for Ais and through her admiration, aims to become stronger so that she can stand next to Ais as an equal. She is often jealous of Bell due to his interactions with Ais. Lefiya maintains her elven pride, but is more open than normal Elves due to her own kind nature and growing up surrounded by people from other races. Lefiya struggled with her own worth as a member of the Loki Familia, having low confidence, self doubt, and other problems that began to get better once she befriended Filvis and learned concurrent chanting. Having a fear of being left completely alone due to her ineptitude, she highly valued her relationships, especially with Ais and Filvis. She can also mix between being kind and mean quickly, as she frequently switched between trying to harass Bell, being nice to him, holding a grudge against him, and also excusing him.",
      "metadata": {
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/125821-HEKoCg8ENjp6.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125821
      },
      "rarity": "rare"
    },
    {
      "id": "tione-hiryute",
      "name": "Tione Hiryute",
      "alt_names": [
        "ティオネ・ヒリュテ",
        "Jormungand"
      ],
      "role": "supporting",
      "description": "__Race:__ Amazoness\n__Height:__ 165 cm (5'5\")\n__Affiliation:__ Loki Familia\n__Level:__ 6\n__Skills:__ Berserk • Backdraft\n__Magic:__ List Iorum\n__Weapon:__ Zolas • Filuka • Halberd Rolan\n\nTione Hiryute is a first class adventurer and an executive member of the Loki Familia. She is the older twin of the Hiryute Sisters. Tione and Tiona were born in Telskyura and were forced to join the Kali Familia from the moment they were born. Both sisters didn't know who their parents were, but knew that they were sisters. She reached Level 2 on her fifth birthday after she unknowingly killed Seldas, a person that she had viewed as a mother and an older sister, in a daily fight to the death, resulting in her resentment of Telskyura. Soon after, both sisters became students to Argana and Bache. The day before Tione's seventh birthday, Tiona asked Kali to let them leave the country, which she granted a couple of days later, much to their surprise. The sisters traveled across the land, temporarily joining different Familia for a year, during which both sisters reached Level 3. They arrived at Orario years later when they were 12 years old. After agreeing to join the Familia of the adventurer that defeated them, they proceeded to defeat everyone that challenged them, only to lose to Finn and Gareth when they were challenged by the Loki Familia. Upon her defeat, Tione fell in love with Finn, and desperately tried to make herself into a woman he would like. Following a dungeon expedition they went on shortly after joining, both sisters reached Level 4.\n\nTione is in love with Finn Deimne and gets angry when other women try to flirt with him. She used to use dirty language, but cleaned it up after meeting Finn. However, her language returns to normal whenever she gets angry.",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/127209-IQuMFrofF1Nm.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127209
      },
      "rarity": "rare"
    },
    {
      "id": "loki",
      "name": "Loki",
      "alt_names": [
        "ロキ ",
        "Trickster",
        "Loki No-Boobs"
      ],
      "role": "supporting",
      "description": "__Race:__ God\n__Height:__ 165 cm (5'5\")\n__Affiliation:__ Loki Familia\n\nLoki is the head of the Loki Familia. Loki acts in a very tomboyish manner. She very much enjoys living up to her nickname, trickster, and shows a lustful side toward females, namely Ais Wallenstein. She also has a breast complex and tends to get into fights with Hestia over breast size.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b134595-UL8px5LYTh5r.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 134595
      },
      "rarity": "rare"
    },
    {
      "id": "riveria-ljos-alf",
      "name": "Riveria Ljos Alf",
      "alt_names": [
        "リヴェリア・リヨス・アールヴ",
        "Mama",
        "Nine Hell"
      ],
      "role": "supporting",
      "description": "__Race:__ High Elf\n__Height:__ 170 cm (5'7\")\n__Affiliation:__ Loki Familia\n__Level:__ 6\n__Skills:__ Fairy Anthem • Alf Regina\n__Magic:__ Rea Laevateinn • Wynn Fimbulvetr • Veil Breath • Via Shilheim • Vas Windheim • Liv Ilusio • Fil Eldis • Luna Aldis • Van Alheim • Flare Burn\n__Weapon:__ Magna Alfs\n\nRiveria Ljos Alf is the daughter of Larfal Ljos Alf and the vice-captain of the Loki Familia. Riveria was born in the Alf's Royal Forest as a member of the High Elf family. She lived there for 71 years until she grew tired of her father's negative attitude toward her interest in the outside world and decided to leave. She left the forest with her childhood friend and former personal chamberlain Aina with the help of Finn and Loki. She is also a friend of Njord, as he took care of them before the early Loki Familia entered Orario. \n\nRiveria has a serious personality. She is one of the only people that didn't laugh at Bell and condemned the others for laughing at him. She is also a strict mentor to the lower leveled members of her Familia, training Lefiya in her studies as a mage and Ais when she was a child. She is calm and collected during the heat of battle, dealing with unexpected events in a leader-like fashion, as shown in the event of the Loki Familia being attacked by large numbers of Virga on the 50th floor. Despite this, Riveria is kind to others, especially to her fellow Loki Familia members, earning her the nickname of mama from Loki. Riveria hates to be called an \"old woman\" as she punished a 7-year-old Ais, who called her so, by tying adamantite to her and throwing her in water, calling it \"swimming training\". This later became a traumatic experience for Ais.",
      "metadata": {
        "age": "99",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135541-Qc6MeG40mEgg.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135541
      },
      "rarity": "rare"
    },
    {
      "id": "hermes",
      "name": "Hermes",
      "alt_names": [
        "ヘルメス"
      ],
      "role": "supporting",
      "description": "__Race:__ God\n__Height:__ 177 cm (5'10\")\n__Affiliation:__ Hermes Familia\n\nHermes is the head of the Hermes Familia. At first glance, Hermes has a casual and playful personality. However, his true nature is someone who is sharp, shrewd, and cunning, becoming serious if needs be. He is eloquent in speech as he is skilled in holding his own when it comes to sounding other people. Later on, he gains an interest in Bell and does whatever he can to make him into a hero, such as convincing Ryuu to help him or getting rid of Ishtar. If needs be, he will clash with allies, as shown when he was willing to sacrifice a number of Xenos in order to restore Bell's reputation despite working with Ouranos to protect them.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142531-Z8b5Jee4R2FM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142531
      },
      "rarity": "rare"
    },
    {
      "id": "freya",
      "name": "Freya",
      "alt_names": [
        "フレイヤ",
        "Goddess of Beauty"
      ],
      "role": "supporting",
      "description": "__Race:__ God\n__Height:__ 170 cm (5'7\") , ~!162 cm (5'4\") (as Syr)!~\n__Affiliation:__ Freya Familia ~!• Hostess of Fertility (as Syr) • Maria's Orphanage (as Syr)!~\n\nFreya Is the head of the Freya Familia. Long ago, Hera, at the request of Zeus, asked Freya for help in their goal to save the world. Freya made her a challenge, telling her that she would help her if she won. Having lost the challenge, Freya was forced to stay in Orario as part of the deal, in addition to losing several members of her Familia as a result. Some time later, Freya met a girl named Syr. After telling her that she would rescue her, Freya asked the girl what she wanted. Hearing that she wanted to be like her, Freya decided to offer her a deal, which she accepted. Due to it, \n\nFreya is flirtatious, loves to tease, and has an unending appetite for talented adventurers. She seeks the best and most talented adventurers and will obtain them no matter the cost. She holds an obsession over Bell Cranel and actively does anything in her power to see him grow as an adventurer. Freya doesn't like to be bound by anyone, though she doesn't wish to become an arrogant ruler either. She is very impatient. She constantly interferes with Bell's activities knowing it might kill him but wanting to see him grow as fast as possible. At the same time, she is just as willing to help Bell to see him grow, such as when she gave up a grimoire just to speed up his progress. Freya is intrigued by his resistance to being charmed, making her want him even more. She doesn't take kindly to others trying to claim what she wants, as she invaded and ruthlessly destroyed the Entertainment District with her Familia when Ishtar tried to claim Bell and ended up sending her back to heaven. She said that she won't let any woman other than herself have him. She was also shown to show a little jealousy when Bell trained with Ais the first time and when Bell and Ais danced at Apollo's Banquet. Despite her usual straightforward method of acquiring those she takes a fancy to, Freya has decided to watch over Bell instead, stating that she could claim him whenever she wanted. Usually, she stays in her room in Babel, not making public appearances, but has recently started to come out to gather information about Bell or see him in person at the God's Banquets and Denatuses.\n\n~!Freya obtained her name and the ability to transform into her, while in exchange the girl obtained the name Helun and a magic that allows her to transform into Freya.!~\n\n~!As Syr, she shows a cheerful and kind demeanor, normally she is lightly mischievous, and at times, scary. She enjoys teasing Bell and others close to her, but is weak to getting teased herself, which usually ends up with her blushing beet red. She is kind, but tends to take advantage of others, usually to raise her family business, or avoid getting in trouble. She sometimes takes days off to care for the children at Maria's Orphanage in Daedalus Street.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142533-8HA0L1bjmF2P.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142533
      },
      "rarity": "rare"
    },
    {
      "id": "ottarl",
      "name": "Ottarl",
      "alt_names": [
        "オッタル",
        "Ottar. King"
      ],
      "role": "supporting",
      "description": "__Race:__ Boaz\n__Height:__ 210 cm (6'11\")\n__Affiliation:__ Freya Familia\n__Level:__ 7\n__Skills:__ Vana Arganture • Stortus Ottar\n__Magic:__ Hildis Vini\n__Weapon:__ Supreme Black Sword • Greataxe • Great Hammer\n\nOttar is the captain of the Freya Familia and is currently the only Level 7 in Orario. When Ottar was a child, he was abandoned without even having known his own name. Freya found him dying in an alley somewhere and told him he was beautiful and took him into her Familia. She also gave him his name at this time. Due to her material support and emotional warmth, Freya would become everything to Ottar. Two years after joining her Familia, Ottar would become Level 2. Around this time, Mia joined the Freya Familia at the request of Freya in order to train Ottar. Ottar clashed a few times with the Zeus and Hera Familias before they were defeated by the One Eyed Black Dragon and were forced out of Orario. Each time ended in him being defeated. At some point in the past, Ottar half-killed a Balor, the Monster Rex of the 49th floor. Later, after learning about Ais defeating Udaeus by herself, he also defeated Udaeus by himself while managing to obtain the Udaeus' sword. He reached Level 6 fifteen years before his battle with Udaeus and Level 7 after defeating Zald seven years before the same battle.\n\nOttar is extremely loyal to Freya and will follow her orders. He is shown to not feel any jealousy toward Freya's interest in Bell and does not allow anyone to insult Freya, becoming enraged if anyone does so. Despite being a member of the Freya Familia, he has been shown to help others, such as when he used an elixir on Mikoto after she used an Ignis Fatuus. Ottar believes the opposite of Eina, believing that adventurers would never break out their shell if they didn't adventure. He is also one of the few adventurers who are still active that has clashed with the Zeus and Hera Familias. His personality is greatly influenced by his experiences facing them.",
      "metadata": {
        "age": "32",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142536-5KnATQUEMoPQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142536
      },
      "rarity": "rare"
    },
    {
      "id": "finn-deimne",
      "name": "Finn Deimne",
      "alt_names": [
        "フィン・ディムナ",
        "Braver"
      ],
      "role": "supporting",
      "description": "__Race:__ Pallum\n__Height:__ 119 cm (3'11\")\n__Affiliation:__ Loki Familia\n__Level:__ 6\n__Skills:__ Pallum • Spirit Noble Brave • Dia Fianna • Command Howl • Ail mac Midna\n__Magic:__ Hell Finegas • Tir na Nog\n__Weapon:__ Fortia Spear • Spear Rolan\n\nFinn Deimne is the captain of the Loki Familia. Finn was born in a village located in a mountainous area and had bad memories of his life ever since he was born. He hated his parents and other Pallum as he wondered why they didn't try to use their intellect rather than submit to people who were stronger than them. Unlike them, he began to gather knowledge, secretly reading books at the village chief's house, and when he was caught, he was described to be like a sage. When he was ten years old, monsters attacked his village in the middle of the night, causing him to try to help the village, though he would have died if his parents hadn't protected him with their lives. Despite this, the other Pallum abandoned them, making him see despair through them. Nevertheless, he also saw courage through his parent's actions. After the other villagers arrived to get rid of the monsters, he ran off to cry, coming back the next morning to bury his parents himself. By that time, he had a firm resolve to become the Pallum's light and renamed himself Finn, his thumb beginning to tingle in the process.\n\nFinn has a sharp mind, being able to memorize complex things, judge correctly, and take action without hesitation. He cares for his Familia members' safety. Finn also wants to bring hope to the Pallums through his efforts in the dungeon. To further his efforts, he wishes to have a Pallum heir. Finn came to Orario to bring hope to the Pallum race. The Pallum race believed in the Goddess Phiana, which was actually a group of knights that had been deified. When they realized that Phiana didn't exist, the Pallum race fell into a decline. He came to Orario to give hope and pride for the Pallum currently in the world and those who would be born in the future, by becoming one of the strongest adventurers in Orario.",
      "metadata": {
        "age": "42",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142538-gWIg6BA9Vaw9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142538
      },
      "rarity": "rare"
    },
    {
      "id": "ganesha",
      "name": "Ganesha",
      "alt_names": [
        "ガネーシャ",
        "God of the Masses"
      ],
      "role": "supporting",
      "description": "__Race:__ God\n__Height:__ 190 cm (6'3\")\n__Affiliation:__ Ganesha Familia\n\nGanesha Is the head of the Ganesha Familia. Ganesha appears to be very flamboyant, speaking in a loud voice and making poses. He even spent practically all of the Familia's money in making the Ganesha Familia home into huge shape of himself, also naming it after himself. When protecting the citizens, reputation and position means nothing to him; he will even get Gods and Goddesses involved, if he so desires. Ganesha also has a habit of repeatedly mentioning his name, such as \"I am Ganesha\". However, when the situation demands it, Ganesha has shown himself capable of adopting a more serious attitude and expressing concern for the well-being of others.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142541-BC61VI7WoeAm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142541
      },
      "rarity": "rare"
    },
    {
      "id": "gareth-landrock",
      "name": "Gareth Landrock",
      "alt_names": [
        "ガレス・ランドロック",
        "Elgarm"
      ],
      "role": "supporting",
      "description": "__Race:__ Dwarf\n__Height:__ 151 cm (5'0\")\n__Affiliation:__ Loki Familia\n__Level:__ 6\n__Skills:__ Dvergr Enhance • Ardigalea\n__Magic:__ Earth Raid\n__Weapon:__ Grand Axe • Axe Rolan\n\nGareth Landrock is a first class adventurer and a top executive of the Loki Familia. Gareth is a good natured and kind person, acting as a father figure to members like Bete. Before Gareth joined the Loki Familia, he worked as a miner, working in various mines located in his homeland. He was known for going on business trips to dangerous volcanoes, finding several deposits of silver, and helping with work on an underground tunnel.",
      "metadata": {
        "age": "56",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142542-spZGwjtiqBEy.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142542
      },
      "rarity": "rare"
    },
    {
      "id": "takemikazuchi",
      "name": "Takemikazuchi",
      "alt_names": [
        "タケミカヅチ"
      ],
      "role": "supporting",
      "description": "__Race:__ God\n__Height:__ 176 cm (5'9\") , 183 cm (6'0\") with geta\n__Affiliation:__ Takemikazuchi Familia\n\nTakemikazuchi is a God and the head of the Takemikazuchi Familia. Takemikazuchi is friendly with Hestia and has taught her many things such as the dogeza. He is kind to his Familia members. He is also a natural gigolo, and is clueless to how his actions affect others around him, which makes him come out as insensitive.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142543-VIdHpFy6EIRO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142543
      },
      "rarity": "rare"
    },
    {
      "id": "hephaestus",
      "name": "Hephaestus",
      "alt_names": [
        "ヘファイストス",
        "Hephaistos",
        "Divine Smith"
      ],
      "role": "supporting",
      "description": "__Race:__ God\n__Height:__ 165 cm (5'5\")\n__Affiliation:__ Hephaestus Familia\n\nHephaestus is the head of the Hephaestus Familia. Hephaestus shows a strict and hardworking nature compared to her friend, Hestia, who was known as the lazy goddess. She is also known to care very much about her children.\n\nAs a Goddess of Smithing, Hephaestus is a master at it. She was able to smith the Hestia Knife, a living weapon with Hestia's falna, even without her arcanum.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142544-FXiSUaogBQ9l.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142544
      },
      "rarity": "rare"
    },
    {
      "id": "miach",
      "name": "Miach",
      "alt_names": [
        "ミアハ"
      ],
      "role": "supporting",
      "description": "__Race:__ God\n__Height:__ 188 cm (6'2\")\n__Affiliation:__ Miach Familia\n\nMiach is the head of the Miach Familia. Miach is a kind, compassionate, and friendly God, and has good relations with Bell and the members of the Hestia Familia, often handing out free potions to him. He has a habit of handing out free potions, causing financial problems for his Familia, and is referred to as a \"natural gigolo\" along with Takemikazuchi due to his friendliness toward women. He is also caring of his own Familia member Naaza Erisuis, taking out a huge loan from the Dian Cecht Familia to have a silver arm created for her.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142549-LwLWawgPSvQt.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142549
      },
      "rarity": "rare"
    },
    {
      "id": "chigusa-hitachi",
      "name": "Chigusa Hitachi",
      "alt_names": [
        "ヒタチ・千草",
        "Jian Girl"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 154 cm (5'1\")\n__Affiliation:__ Takemikazuchi Familia\n__Level:__ 2\n\nChigusa Hitachi is a member of the Takemikazuchi Familia. Despite having a timid and shy personality, she is loyal to her Familia, especially Ouka who she has feelings for.",
      "metadata": {
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142553-qRChPxIz6UUr.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142553
      },
      "rarity": "rare"
    },
    {
      "id": "zeus",
      "name": "Zeus",
      "alt_names": [
        "ゼウス"
      ],
      "role": "supporting",
      "description": "__Race:__ God\n__Affiliation:__ Bell Cranel\n__Previous Affiliation:__ Zeus Familia\n\nZeus is the adoptive grandfather of Bell Cranel and the former head of the Zeus Familia. Zeus was the head of one of the strongest Familia, which was weakened after their loss to the One-Eyed Black Dragon 15 years earlier, and he was subsequently forced out of Orario. He later became a farmer in a small village in the mountains north of the city, where he raised Bell, once protecting him from a Goblin attack. Zeus raised Bell until he decided to pretend he was dead for unknown reasons. He was later mentioned to have been shocked upon hearing that Bell had leveled up and asked Hermes to look after him. \n\nZeus is a pervert as seen by his words to Bell about picking up girls and he once peeked on the Goddesses at the Divine Bathhouse. He acted as a kind father-like figure to Bell, taking care of him and telling him hero stories along with giving him handwritten storybooks on his birthdays of stories he had heard himself. Because of this, Zeus was the reason why Bell decided to become an adventurer.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142554-K5QykgdvqiTy.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142554
      },
      "rarity": "rare"
    },
    {
      "id": "mikoto-yamato",
      "name": "Mikoto Yamato",
      "alt_names": [
        "ヤマト・命",
        "Absolute✝Shadow"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 157 cm (5'2\")\n__Affiliation:__ Hestia Familia • Takemikazuchi Familia (temporary leave)\n__Level:__ 2\n__Skills:__ Yatanokurogarasu • Yatanoshirogarasu\n__Magic:__ Futsunomitama\n__Weapon:__ Kotetsu • Chizan • Shunsan • Shakuya\n\nYamato Mikoto is a member of the Hestia Familia and the Takemikazuchi Familia, having converted to aid the former during the War Game. Mikoto originally hails from the Far East. Her parents died several years after her birth. Tsukuyomi and Takemikazuchi took the young girl into their orphanage, where she lived for years, eventually joining the Takemikazuchi Familia. Mikoto and the other members of the Takemikazuchi Familia used to sneak Sanjouno Haruhime out of her mansion at night to play with her. They were eventually caught, damaging relations between Haruhime's father and the shrine. They pursued their nightly fun regardless. Two years before the story, Mikoto and the other Takemikazuchi Familia members moved to Orario to earn money to help support the shrine.\n\nMikoto has a serious and honorable personality, unwilling to use cowardly tactics even in an emergency, as shown through her disapproval of Pass Parading the monsters that were chasing them onto the Hestia Familia. She also has a softer side as she cares for the well-being of her friends and is fiercely loyal to them.",
      "metadata": {
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142923-3DX8e5beuivx.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142923
      },
      "rarity": "rare"
    },
    {
      "id": "anya-fromel",
      "name": "Anya Fromel",
      "alt_names": [
        "アーニャ・フローメル",
        "Vana Alfi"
      ],
      "role": "supporting",
      "description": "__Race:__ Cat People\n__Height:__ 150 cm (4'11\")\n__Affiliation:__ Hostess of Fertility\n__Level:__ 4\n\nAnya Fromel is a waitress at the Hostess of Fertility. When she was one year old, Anya lost her parents and her home. Because of this, her brother Allen was forced to wander the ruins of a kingdom while protecting her. So it was for two years until they met Freya, who offered them to go with her, which they accepted. Sometime before Ais came to Orario, Mia partially left the Freya Familia to open the Hostess of Fertility, employing Anya there.\n\nAnya is shown to be a foolish person whose unthoughtful actions stand out. She is terrible at singing, enough to be referred to as a \"disaster\". Despite being somewhat of an airhead, she is loyal to her friends, such as when she was openly hostile to Hermes for mentioning Ryuu's past, and when she helped the Elf by being Chloe's opponent while she fought Lunoire. She used to act like a senior to Ryuu at work, though she failed miserably due to her unthoughtful actions, such as when she accidentally brought Lunoire coffee when she ordered tea. Even so, she refuses to give up, as shown when she repeatedly tried to touch Ryuu even though the Elf kept on swatting her away, at which point Ryuu thought she saw flames of resolve around her. However, she is reluctant to talk about her past, becoming startled when Ryuu asked her and immediately changed the subject. Anya is the younger sister of Allen Fromel. However, they have both cut ties with each other. Seemingly because of this, Anya refers to herself as an abandoned cat, and claims to not know who Vana Alfi is. Also, she was shown to lament something for a moment upon being called that and mentioned that it'd been a while since she last heard that name.\n\n(Source: Danmachi Wiki)",
      "metadata": {
        "gender": "female",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143047-S8aXD2FNKiPW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143047
      },
      "rarity": "rare"
    },
    {
      "id": "asfi-al-andromeda",
      "name": "Asfi Al Andromeda",
      "alt_names": [
        "アスフィ・アル・アンドロメダ",
        "Asufi Al Andromeda",
        "Perseus"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 164 cm (5'5\")\n__Affiliation:__ Hermes Familia\n__Level:__ 4\n__Magic:__ Kalov Argol\n__Weapon:__ Canoval Dagger\n\nAsfi Al Andromeda is a member and the captain of the Hermes Familia. She is also one of the most famous item makers in Orario, known as Perseus. Asfi was the princess of an island nation that was stolen by a God. At some point, she was taken away by Hermes and became an adventurer and a member of his Familia.\n\nAsfi is serious and will follow Hermes' orders. She is a hard worker that is often pushed around by Hermes. Welf states that she may come from royalty somewhere due to her behavior, and in truth, she is the princess of a maritime nation.\n\n(Source: Danmachi Wiki)",
      "metadata": {
        "gender": "female",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143051-QR6c6tRHEsyX.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143051
      },
      "rarity": "rare"
    },
    {
      "id": "chloe-rollo",
      "name": "Chloe Rollo",
      "alt_names": [
        "クロエ・ロロ",
        "Black Cat"
      ],
      "role": "supporting",
      "description": "__Race:__ Cat People\n__Height:__ 158 cm (5'2\")\n__Affiliation:__ Hostess of Fertility • Njord Familia\n__Level:__ 4\n__Magic:__ Pheles Cruz\n__Weapon:__ Violetta\n\nChloe Rollo is a waitress at the Hostess of Fertility pub and a former assassin known as Rollo as a member of the Njord Familia. Chloe was born to parents who were members of a Familia that acted as a criminal organization. From the moment she was born, she was taught different methods of assassination, and was praised when she properly utilized them. However, she began to dislike her Familia after her mother died while protecting her. Her Goddess agreed to let her leave, though she was ordered to carry out a number of tasks before leaving, including assassinating a Level 3 knight of the empire using only a knife. Despite the extreme difficulty of her tasks, she was successful, leveling up in the process. After leaving her Familia, she traveled around for a while, until she came to Orario around nine years before the story. While there, she failed her first mission, which was to assassinate Shakti Varma, barely escaping with her life, and began refusing jobs to kill first class adventurers. Eventually, after failing to kill a wanted Ryuu, she joined the Hostess of Fertility.\n\nChloe is known to have a crafty side and often gambles, which her fellow employees give a cold shoulder to. She is loyal to her fellow Hostess of Fertility coworkers, such as when she was openly hostile to Hermes for mentioning Ryuu's past. Despite being an assassin, she had a strict code of conduct, as she only killed people she considered to be scum and those who were resolved to die. She is a shotacon, as shown with her attitude toward Bell, and the fact that she labels young boys as \"the treasure of the world\". She first developed those feelings when she acted as a chivalrous thief for orphans while traveling on her own, and at the same time developed her greediness as well. Because of this, she refused to assassinate them if she was ever asked to. Also, she once considered having handsome young men serve her while she would caress their stomach and behind. As a part of her greediness, she stated that she would've tortured the fake Black Cat in order to make him pay up for impersonating her.\n\n(Source: Danmachi Wiki)",
      "metadata": {
        "gender": "female",
        "age": "21",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143052-in6jAkYQPFoT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143052
      },
      "rarity": "rare"
    },
    {
      "id": "kashima-ouka",
      "name": "Kashima  Ouka",
      "alt_names": [
        "カシマ・桜花",
        "Masuratakeo"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 190 cm (6'3\")\n__Affiliation:__ Takemikazuchi Familia\n__Level:__ 2\n__Weapon:__ Kougou\n\nKashima Ouka is a member and captain of the Takemikazuchi Familia. Ouka is a strong and respected member of his familia. Being the leader, he often decides the course of action for his Familia members during dungeon trips. He is capable of instructing his companions and making harsh decisions in desperate situations. Despite his decisions, he shows deep care for his Familia due to them knowing each other from when they were children. Ouka is also headstrong and unafraid to express his thoughts to others, believing that he made the right decision in doing a Pass Parade. However, he later made up for it when he decided that he didn't want to be a man who was all talk.\n\n(Source: Danmachi Wiki)",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143055-MbcPKK91Rc4g.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143055
      },
      "rarity": "rare"
    },
    {
      "id": "misha-flott",
      "name": "Misha  Flott",
      "alt_names": [
        "ミィシャ・フロット"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 150 cm (4'9\")\n__Affiliation:__ Guild\n\nMisha Flott is a Guild worker and friend of Eina Tulle. Misha is a curious and slightly irresponsible girl. She likes teasing her friend, Eina, about her relationship with Bell; or any of her male relationships for that matter. Though she likes complaining, she still does her job; although whether it was done correctly or not is up for debate. \n\n(Source: Danmachi Wiki)",
      "metadata": {
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143126-xoVN00iJFZJ7.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143126
      },
      "rarity": "rare"
    },
    {
      "id": "demeter",
      "name": "Demeter",
      "alt_names": [
        "デメテル"
      ],
      "role": "supporting",
      "description": "__Race:__ God\n__Height:__ 162 cm (5'4\")\n__Affiliation:__ Demeter Familia\n\nDemeter is the head of the Demeter Familia. Demeter is a good natured Goddess that acts mature when talking to others whether they may be Gods or their children. She apparently can get carried away as she asked Lunoire not to praise her too much about her cooking. She is on good terms with other Gods like Hestia and enjoys teasing others as shown when she hugged Bell in front of her. She can be aware of the hidden motives of others, such as when she noticed Dionysus' expression during the God's banquet. Demeter also cares for her children, as she used to worry about Lunoire when she was a bounty hunter, and suggested for her work with the other members in the fields once she finished her work.\n\n(Source: Danmachi Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b159926-6qqGW98bS1LX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 159926
      },
      "rarity": "rare"
    },
    {
      "id": "canoe-belway",
      "name": "Canoe Belway",
      "alt_names": [
        "カヌゥ・ベルウェイ"
      ],
      "role": "supporting",
      "description": "__Race:__ Raccoon\n__Height:__ 155 cm (5'1\")\n__Affiliation:__ Soma Familia\n__Level:__ 1\n__Weapon:__ Magic Sword\n\nAn adventurer from the Soma Familia. Canoe was crafty and greedy. He often beat Lili and stole the money and items that she had collected. He also betrayed Ged Raish after they ambushed Lili in the Dungeon, causing his death when he tried to escape, only to be killed by the approaching Killer Ants. His greed ultimately led to his demise as he let loose the Minotaur Ottar had tamed. \n\n(Source: Danmachi Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b183244-l9eOTDmuSDTE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 183244
      },
      "rarity": "rare"
    },
    {
      "id": "ged-raish",
      "name": "Ged Raish",
      "alt_names": [
        "ゲド・ライッシュ"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Age:__ Around 20\n__Height:__ 177 cm (5'10\")\n__Affiliation:__ Unknown Familia\n__Level:__ 1\nDeceased\n\nA former member of the Soma Familia. Ged showed little concern or patience for anyone who slowed him down from completing a quest or killing monsters. This was evident through his attitude toward Lili, calling her useless and even threatening to use her as a decoy. \n\n(Source: Danmachi Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b183245-t6dn7qUPvCl8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 183245
      },
      "rarity": "rare"
    },
    {
      "id": "scott-olds",
      "name": "Scott Olds",
      "alt_names": [
        "スコット・オールズ"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Level:__ 2\n\nScott Olds is one of Mord Latro's companions. \n\n(Source: Danmachi Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b183246-eAGEpnoHy46J.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 183246
      },
      "rarity": "rare"
    },
    {
      "id": "bom-cornwall",
      "name": "Bom Cornwall",
      "alt_names": [
        "ボム・コーンウォール"
      ],
      "role": "supporting",
      "description": "__Race:__ Spirit\n\nBom Cornwall is the owner of the Gnome's General Store. Bom used to buy Lili's stolen goods even though he knew that she changed her appearance using Cinder Ella and didn't report her. He later showed his kindness again when he agreed to hide Lili from the Soma Familia.  \n\n(Source: Danmachi Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b183247-HYjCyw3Ha6QR.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 183247
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T02:33:35.148Z"
}