{
  "work_id": "vagabond",
  "count": 23,
  "characters": [
    {
      "id": "musashi-miyamoto",
      "name": "Musashi Miyamoto",
      "alt_names": [
        "宮本武蔵",
        "Shinmen Takezo",
        "Demon"
      ],
      "role": "protagonist",
      "description": "Miyamoto Musashi or Shinmen Takezo (his real name), only at a very young age, embarked on a journey to become the strongest samurai only after being exiled from his own village. Musashi is the son of a samurai family, whose father is one of the most renowned samurai across the nation. One of the foremost reasons that drive Musashi to excel in sword-fighting, is his desire to overcome his father for all the harsh treatment given during his childhood and Musashi's incapability to rebel. Musashi is unique in terms of his sword skill for the unfamiliar movements and lack of style he uses. This is due to the fact that he spent most of his entire time in the forest having been labeled as a demon child by his village for his demeaning and wicked nature. Simply put, the forest and mountains are his home and where his master resides.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6194-HOyr8E7FCFHJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6194
      },
      "rarity": "legendary"
    },
    {
      "id": "matahachi-honiden",
      "name": "Matahachi Honiden",
      "alt_names": [
        "本位田又八"
      ],
      "role": "protagonist",
      "description": "Hedonist and childhood friend of Musashi. ~!Assumes Sasaki Kojiro's identity after a dying Tenki entrusts Kojiro's swordsmanship certificates to him. Later, after coming into contact with the genuine Kojiro, begins to identify himself as Sasaki Koujiro, an interpreter for Kojiro, the real Kojiro being deaf. He later becomes estranged from Musashi after a tense reunion, Matahachi displaying an intense jealousy to Musashi. He was an illegitimate son of a mistress and the previous head of the Hon'iden bloodline, he was born shortly before his father died. The wife of the former head Osugi Honiden adopted him as the Honiden has no heir.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8134-CrWGxQ3aeqeD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8134
      },
      "rarity": "legendary"
    },
    {
      "id": "kojirou-sasaki",
      "name": "Kojirou Sasaki",
      "alt_names": [
        "佐々木小次郎",
        "Ganryuu"
      ],
      "role": "protagonist",
      "description": "The legendary archrival of Musashi Miyamoto.\n\nRaised by Kanemaki Jisai, after he is found as a baby in casket, floating on the ocean. He develops an intense attachment to swords and fencing at an early age, possessing an almost preternatural ability to react to his opponents' moves. Kojirou is deaf and mute, though still literate. His personality is very playful, almost child-like. Ittousai has also commented on the possibility that Kojirou's eyes have become better developed to compensate for his lack of hearing.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b10731-qqAJQX9TeSvJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10731
      },
      "rarity": "legendary"
    },
    {
      "id": "otsu",
      "name": "Otsu",
      "alt_names": [
        "おつう"
      ],
      "role": "supporting",
      "description": "__Affiliation:__ Miyamoto Village\n\nChildhood friend of Takezo and Matahachi. Otsu was raised by Matahachi's family and arranged to marry Matahachi.\n\n~!Plans to go away when Matahachi runs off after the Battle of Sekigahara with Oko to Kyoto. Angry at Matahachi, Otsu refuses Granny Hon'iden's offer to join the Hon'iden family and seeks life and love elsewhere. Currently she is traveling with Takezo's &quot;apprentice&quot; Joutarou in order to find him.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/9482.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9482
      },
      "rarity": "rare"
    },
    {
      "id": "baiken-shishido",
      "name": "Baiken Shishido",
      "alt_names": [
        "宍戸梅軒",
        "Tsujikaze Kohei"
      ],
      "role": "supporting",
      "description": "Originally named Tsujikaze Kohei.  Born in 1580 in the Fuwa village and younger brother of Tsujikaze Tenma. His mom tried to kill him by pushing him off a waterfall the same way she did to Tsujikaze Tenma, however, Tenma kills her and takes Kōhei under his wing. Though Tenma showed him much kindness, Kōhei hardly displayed any affection. When the Tsujikaze Gang was formed and engaged in crimes ranging from robbery, rape, and extortion, Kōhei became its member at 12 and was considered most savage by others. At 12 Kōhei attempted to rape the wife of a villager he had slain, but Tenma, disgusted by the act, slew the woman to put her out of her misery and crushed Kōhei's testicles, rendering him (Kōhei) impotent.   Kōhei failed at killing Tenma and was imprisoned as punishment, during which time he came to adopt a nihilistic outlook on life. The Tsujikaze Gang failed to make a name for themselves and honor their employer, Toyotomi Hideyoshi, in attempting to capture Tokugawa Ieyasu. At the age of 20 in the year 1600, serving 7 years of imprisonment, Kōhei was released by surviving Sekigahara soldiers and escaped to hunt his brother ever since.   Originally desired to kill Tenma himself before Takezō got to him, Kōhei confronts Takezō only to have the battle postponed by Takezō’s captors; cuts the rope by which Takezō is suspended. Kōhei as a bandit came to be referred to as the 'God of Death' and killed Shishido Baiken, master of the kusarigama though revealed to be little more than the leader of a small band of thieves. Pretending to be Baiken, Kōhei lived with a little girl, Rindo, who also wielded the kusarigama and was actually his teacher in using it. He is challenged by Musashi and loses, yet his life is spared, though he loses some fingers on his left hand.   While recuperating he recalls that Sasaki Kojiro smashed his pride by being further \"along the path of death\" than him. It has recently been revealed that Kojiro was the one who gave Kohei his disfiguring facial scar.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/10836.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10836
      },
      "rarity": "rare"
    },
    {
      "id": "soho-takuan",
      "name": "Soho Takuan",
      "alt_names": [
        "沢庵宗彭"
      ],
      "role": "supporting",
      "description": "A Zen Buddhist monk, specifically, representative of the Rinzai sect. In 1610, he was appointed as abbot  of the main temple, Daitokuji.     Takuan is known for his brute honesty and meticulously perceptive personality, which was sought after by monks, swordsmen, and politicians alike (such as Tokugawa Iemitsu and Go-Mizunoo).     Takuan&#039;s shared correspondence with Yagyū Munenori was captured in a treatise called &quot;The Unfettered Mind.&quot; Takuan helps capture Takezo and later renames him as Miyamoto Musashi, setting him free to travel and evolve as a person.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14182-v8L5jrWWVvXt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14182
      },
      "rarity": "rare"
    },
    {
      "id": "seijuro-yoshioka",
      "name": "Seijuro Yoshioka",
      "alt_names": [
        "吉岡清十郎"
      ],
      "role": "supporting",
      "description": "Seijūrō Yoshioka is the current head of the Yoshioka, is considered a playboy due to his great time spent visiting the pleasure quarters to spend time with Akemi. Yoshioka Kempō&rsquo;s oldest son. Follows his instincts, both in and outside of combat, carefree and easygoing, seems to take things haphazardly.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14183-OGVvbiakcgsq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14183
      },
      "rarity": "rare"
    },
    {
      "id": "denshichirou-yoshioka",
      "name": "Denshichirou Yoshioka",
      "alt_names": [
        "吉岡伝七郎"
      ],
      "role": "supporting",
      "description": "Seijuurou's younger brother, though completely dedicated to his swordsmanship. Blames the school's dwindling reputation on account of Seijuurou's cavorting. He fought with Musashi at Rengeoin temple.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/14214.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14214
      },
      "rarity": "rare"
    },
    {
      "id": "touji-gion",
      "name": "Touji Gion",
      "alt_names": [
        "祇園藤次",
        "Toji Gion"
      ],
      "role": "supporting",
      "description": "One of the senior disciples who appears to be Yoshioka Seijuurou’s right-hand man or at least, follows him around. Arrogant. Vowed to hunt down Musashi as a self-proclaimed assassin for the Yoshioka school. Considered to have a refined bloodthirst by Agon of Houzouin. Visits the Houzouin temple and cuts off the arms of one of the priests. After witnessing the battle between Musashi and Inshun, he leaves momentarily realizing his own weakness.    ~!Later shows up to challenge Yagyuu Sekishūsai Muneyoshi, thinking to end his life fighting a great swordsman. From here on , his exact whereabouts are unknown. Until he reappears suddenly in Kyoto, one year since his take of leave, and attempts to take Miyamoto Musashi's life in a street fight, only to have his throat slashed open.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/22924.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22924
      },
      "rarity": "rare"
    },
    {
      "id": "inshun-hozoin",
      "name": "Inshun Hozoin",
      "alt_names": [
        "宝蔵院胤舜",
        "満田慎之介",
        "Shinnosuke Mitsuda"
      ],
      "role": "supporting",
      "description": "Originally named &ldquo;Shinnosuke Mitsuda,&rdquo; he witnessed the death of his father and mother Saya at the hands of a bandit at an early age. He was renamed to Inshun by In&rsquo;ei. A child prodigy in spearmanship, Inshun withdrew within himself desiring to become stronger. By 15 he was the strongest at the temple. Realized the potential of Seijūrō at a young age when Yoshioka Kempō came to the Hōzōin temple. The second-generation master of the Hōzōin spear technique.    (Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/22926.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22926
      },
      "rarity": "rare"
    },
    {
      "id": "ittousai-itou",
      "name": "Ittousai Itou",
      "alt_names": [
        "伊東一刀斎"
      ],
      "role": "supporting",
      "description": "Founder of the Itto-ryu school of sword fighting. Before establishing his own style, Ittousai is said to have studied a variant of the Chujo-ryu style of sword fighting under Kinemaki Jisai&#039;s instruction. He was a mentor of Sasaki Kojiro for a short time after Kojiro left the care of Jisai.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/24309.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24309
      },
      "rarity": "rare"
    },
    {
      "id": "jisai-kanemaki",
      "name": "Jisai Kanemaki",
      "alt_names": [
        "鐘巻自斎"
      ],
      "role": "supporting",
      "description": "Raised Sasaki Kojiro from a small child. In his past he was instructor to Itou Ittousai.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b25810-8lFD984rv7dq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 25810
      },
      "rarity": "rare"
    },
    {
      "id": "ryouhei-ueda",
      "name": "Ryouhei Ueda",
      "alt_names": [
        "植田良平"
      ],
      "role": "supporting",
      "description": "He is a loyal member of the Yoshioka School and is loyal to Denshichiro Yoshioka.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/25811.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 25811
      },
      "rarity": "rare"
    },
    {
      "id": "rindou",
      "name": "Rindou",
      "alt_names": [
        "龍胆"
      ],
      "role": "supporting",
      "description": "Daughter of Shishido Baiken. After her father's death by the hands of Tsujikaze Kohei, she lived with him and taught him the art of Chain and Sickle. Their relationship isn't clear.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b25957-GWDmh5QHWeka.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 25957
      },
      "rarity": "rare"
    },
    {
      "id": "orin",
      "name": "Orin",
      "alt_names": [],
      "role": "supporting",
      "description": "Daughter of the family that helped care for Sasaki Kojirou when he was a child.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/25958.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 25958
      },
      "rarity": "rare"
    },
    {
      "id": "gonnosuke-musou",
      "name": "Gonnosuke Musou",
      "alt_names": [
        "夢想権之助"
      ],
      "role": "supporting",
      "description": "A young samurai that Sasaki Kojiro encountered on his trip after leaving his master.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/25959.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 25959
      },
      "rarity": "rare"
    },
    {
      "id": "kusanagi-tenki",
      "name": "Kusanagi Tenki",
      "alt_names": [
        "草薙天鬼"
      ],
      "role": "supporting",
      "description": "Kojiro's childhood best friend.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/25960.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 25960
      },
      "rarity": "rare"
    },
    {
      "id": "tenma-tsujikaze",
      "name": "Tenma Tsujikaze",
      "alt_names": [
        "辻風典馬",
        "Shem-ra of the Desert"
      ],
      "role": "supporting",
      "description": "A brigand and head of a gang of free-booters that periodically visits Okō and takes whatever worthwhile she has acquired. He killed Akemi&rsquo;s father (Okō&#039;s husband), his own mother, and is later killed by Takezō after the Battle of Sekigahara.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29910-eSWaiuxjC0Tl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29910
      },
      "rarity": "rare"
    },
    {
      "id": "inei-houzouin",
      "name": "Inei Houzouin",
      "alt_names": [
        "宝蔵院胤栄"
      ],
      "role": "supporting",
      "description": "An elderly Buddhist monk, Houzouin Inei is the retired founder of the Houzouin spear technique. Quirky and wise by nature, Inei helps and trains Miyamoto Musashi in order to give Inshun -- the second-generation master of the Hōzōin spear technique -- the valuable experience of mortal combat.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/34932.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34932
      },
      "rarity": "rare"
    },
    {
      "id": "sekishusai-yagyu",
      "name": "Sekishusai  Yagyu",
      "alt_names": [
        "柳生石舟斎",
        "Yagyu Tajima no Kami Muneyoshi (柳生但馬の守 宗厳)"
      ],
      "role": "supporting",
      "description": "Leader of the Tokugawa clan and master of the Shinkage-ryuu fighting style.He Holds Musashi off with a backscratcher while bedridden and completely saps Musashi of his will to fight without even being fully conscious at the time, the encounter turns into a learning experience for Musashi, who is awed by the spiritual power of Munetoshi, and makes him aware of his shortcomings as a person.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b189846-fqzjryToN14d.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 189846
      },
      "rarity": "rare"
    },
    {
      "id": "jotarou",
      "name": "Jotarou",
      "alt_names": [
        "城太郎",
        "Musashi's disciple (武蔵の弟子)",
        "Jonosuke Yagyu"
      ],
      "role": "supporting",
      "description": "Jotaro is a young orphan boy and Miyamoto Musashi's first disciple.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b230319-YXGlDWZDx4VJ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 230319
      },
      "rarity": "rare"
    },
    {
      "id": "munisai-shinmen",
      "name": "Munisai Shinmen",
      "alt_names": [
        "新免無二斎"
      ],
      "role": "supporting",
      "description": "Munisai Shinmen is the father of Musashi Miyamoto. He was a renowned samurai but was very strict. He is seen to have treated his son harshly while growing up.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b230320-cX7lm3Q6C2If.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 230320
      },
      "rarity": "rare"
    },
    {
      "id": "akemi",
      "name": "Akemi",
      "alt_names": [
        "朱美"
      ],
      "role": "supporting",
      "description": "Daughter of Oko and, for a brief period, Yoshioka Seijuro's lover.",
      "metadata": {
        "gender": "female",
        "age": "15-19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b245150-J22pZNmvDDdY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 245150
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T16:34:02.516Z"
}