{
  "work_id": "my-hero-academia",
  "count": 194,
  "characters": [
    {
      "id": "izuku-midoriya",
      "name": "Izuku Midoriya",
      "alt_names": [
        "緑谷出久",
        "Deku (デク)"
      ],
      "role": "protagonist",
      "description": "__Height:__ 166 cm (5'5¼\")\n__Quirk:__ One For All\n\nStudent in Class 1-A at U.A High School.\n\nAlthough he was born without a Quirk, Izuku's innate heroism and strong sense of justice manages to catch the attention of the legendary hero All Might. Izuku has since become All Might's closest pupil.\n\nIzuku is a very timid, reserved, and polite boy. Although initially portrayed as insecure, tearful, and vulnerable, Izuku gradually matures into a more confident and braver person. His infectious leadership skills, combined with his passion and strategic abilities, have turned Izuku into a central figure of Class 1-A. He is caring and emotional, never hesitating to help or rescue someone in danger, even if he knows that he might not be strong or otherwise qualified enough to do it.\n\nIzuku is extremely (and sometimes scarily) enthusiastic about topics related to heroes. His dream drives him to write down notes about everything he learns about heroes' Quirks and fighting capabilities. Thanks to this practice, Izuku has developed a great analytical mind and can form complex battle plans in a few seconds, factoring in the best ways he can utilize the Quirks of allies and enemies alike for his own advantage.\n\nIzuku's Quirk \"One For All\" was transferred to him from All Might. His Quirk allows him to stockpile an enormous amount of raw power, allowing him to significantly enhance all of his physical abilities to various boundless levels. This results in unbelievable levels of strength, speed, stamina, agility, and durability. Izuku can focus the stockpiled power into a single body part, or spread it across his entire body evenly, though, focusing the power in a single part puts a greater strain on that part of his body.",
      "metadata": {
        "gender": "male",
        "age": "14-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89028-8w1I9o1ISHMg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89028
      },
      "rarity": "epic"
    },
    {
      "id": "katsuki-bakugou",
      "name": "Katsuki Bakugou",
      "alt_names": [
        "爆豪勝己",
        "Katsuki Bakugo",
        "Kacchan (かっちゃん)"
      ],
      "role": "protagonist",
      "description": "__Height:__ 172 cm (5'7\")\n__Quirk:__ Explosion\n\nStudent in Class 1-A at U.A. High School.\n\nKatsuki is a crude, arrogant, short-tempered, and aggressive person, especially at the beginning of the series. Due to the constant praise of his abilities and powerful Quirk, Katsuki has developed a superiority complex, and because of that, he desires to be the first and best at everything. He loves to win above all else and cannot stand it when he doesn't, leading him to lose his already short temper if he achieves anything but a complete victory.\n\nKatsuki is not only very athletic and talented at fighting, but also very intelligent and extremely perceptive, capable of strategic planning and improvisation. Additionally, his grades are among the highest of his class. Katsuki also possesses surprising talent in other areas, such as cooking and music, even though he doesn't show a particular interest in them. Overall, Katsuki is considered a natural-born genius with the potential to be one of the best Pro Heroes.\n\nKatsuki's Quirk \"Explosion\" allows him to secrete nitroglycerin-like sweat from the palms of his hands and ignite it on command, allowing him to create strong explosions. The more Katsuki sweats, the stronger his explosions become. Not only can Katsuki use the explosions for attacking, he can also use them to propel himself and navigate through the air at high speeds, allowing him to fly at his opponents without giving them time to react, as well as evade incoming attacks, even while in the air. The shockwave from an explosion can even be used as a shield.",
      "metadata": {
        "gender": "male",
        "age": "14-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88892-bdOha3lNcaN6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88892
      },
      "rarity": "epic"
    },
    {
      "id": "shouto-todoroki",
      "name": "Shouto Todoroki",
      "alt_names": [
        "轟焦凍",
        "Shouto (ショート)",
        "Shoto Todoroki",
        "Half-and-Half",
        "Icy-Hot"
      ],
      "role": "protagonist",
      "description": "__Height:__ 176 cm (5'9\") \n__Affiliation:__ U.A. High School\n__Quirk:__ Half-Cold Half-Hot\n\nStudent in Class 1-A at U.A. High School, where he got in through official recommendations. He is the youngest son of the top hero Endeavor.\n\nShouto initially has a cold, aloof personality, which stemmed from his complicated family life. Focused and unemotional, Shouto preferred to keep things to himself instead of hanging out with others. After the events of the U.A. Sports Festival, however, he notably became more sociable and kinder than ever before. He even gained a sense of humor and would occasionally smile, although still retaining some fragments of his previous distant attitude and nonchalant demeanor. While usually quiet and reserved, Shouto initially possessed a moderate level of arrogance, which, combined with his solitary tendencies, sometimes made him take the initiative without considering the opinions of others.\n\nShouto's Quirk Half-Cold Half-Hot gives him the ability to generate ice from the right side of his body, and flames from his left side. Due to years of rejecting his father, Shouto has developed a habit of favoring ice, even when fire would be a better option. This grudge also caused him to have difficulty controlling his flames. If he overuses one element without utilizing the other, then his own body temperature will suffer.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89220-KNBwaVFAR8FD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89220
      },
      "rarity": "epic"
    },
    {
      "id": "ochako-uraraka",
      "name": "Ochako Uraraka",
      "alt_names": [
        "麗日お茶子",
        "Ochaco Uraraka",
        "Uravity (ウラビティ)"
      ],
      "role": "protagonist",
      "description": "__Height:__ 156 cm (5'1\")\n__Quirk:__ Zero Gravity\n\nStudent in Class 1-A at U.A. High School\n\nOchako is an outgoing, lively person who thinks about everything positively, though she is objective enough to see flaws and virtues. She gets excited over little things very easily. Ochaco has been described by other students as \"the most laidback girl\" among her class, being very bubbly and kind of an airhead at times. She is often incredibly blunt without being aware of it. She is on good terms with everyone and is particularly close friends with several class members, including Izuku, Tenya Ida, and Tsuyu.\n\nOchaco's Quirk gives her the power to manipulate gravity upon touching solid things with the pads on her fingertips. The targets lose their gravitational pull, effectively making them weightless. She is able to activate or cancel her Quirk's effects by closing her fingers together, and is shown to be careful with her hands in order to avoid accidental quirk activation.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89221-gSF2a4gPbG4m.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89221
      },
      "rarity": "epic"
    },
    {
      "id": "toshinori-yagi",
      "name": "Toshinori Yagi",
      "alt_names": [
        "八木俊典",
        "All Might (オールマイト)",
        "Toshi",
        "Symbol of Peace"
      ],
      "role": "protagonist",
      "description": "__Height:__ 220 cm (7'2\")\n__Quirk:__ One for All\n\nAll Might is the No. 1 Hero and the \"Symbol of Peace.\"\n\nIn his hero form, All Might is a very tall and over-muscular man whose design resembles the american hero comics. His hair spikes on top of his head and his whole body has more shadows than a normal human being.\n\nHowever, in his true form, he is an overly-skinny man who spits a lot of blood out of his mouth and his clothes appear loose.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89224-K6KEuQAuYKzq.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89224
      },
      "rarity": "epic"
    },
    {
      "id": "tomura-shigaraki",
      "name": "Tomura Shigaraki",
      "alt_names": [
        "死柄木弔",
        "Hand Guy"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm (5'9)\n__Quirk:__ Decay\n\nLeader of the League of Villains and protégé of All For One. He was raised by his master, All For One, with the goal of killing All Might, and ultimately destroying the society he represents.\n\nTomura is a very twisted, malevolent, and maliciously warped young man, who is considered to be the polar opposite of Izuku Midoriya. He doesn't care for his or almost anyone else's life, having no qualms about performing evil deeds like murdering innocent people. Tomura was initially perceived to be a \"man-child\": arrogant, selfish, dependent, and demanding, becoming angry if things didn't go his way and likening reality to some sort of video game. Unlike his mentor, Tomura lacked subtlety, preferring to eliminate problems through force. Much like a child, Tomura seemed unable to cope with his own feelings, instead lashing out and abusing both others or himself, tearing at his own neck when he becomes frustrated. \n\nInitially, Tomura seemingly caused destruction just for the sake of it and felt directionless about the League's path forward after Stain's arrest. It would take a fateful meeting with Izuku in a mall for him to develop an epiphany and become aware of his true convictions: to crumble hero society through All Might's death.\n\nTomura's Quirk allows him to disintegrate whatever he touches with all five fingers. It will take effect whether the target is organic or not. The disintegration spreads quickly and will spread through the victim's whole body if they don't amputate the decaying body part. His Quirk can even spread beyond what he's touching, allowing him to disintegrate large groups of enemies instantly.\n\n(Source: My Hero Academia Wiki)",
      "metadata": {
        "gender": "male",
        "age": "20-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89226-C1ZKm2U3bR4T.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89226
      },
      "rarity": "epic"
    },
    {
      "id": "tenya-iida",
      "name": "Tenya Iida",
      "alt_names": [
        "飯田天哉",
        "Tenya Ida",
        "Turbo Hero: Ingenium (ターボヒーロー・インゲニウム)"
      ],
      "role": "supporting",
      "description": "__Height:__ 179 cm (5'10\")\n__Quirk:__ Engine\n\nClass representative of Class 1-A at U.A. High School\n\nTenya may look severe, but he's actually just a very serious person, who takes everything, even the most insignificant thing, seriously. A testament to his generally hyperactive and intense behavior, Tenya often exhibits plenty of peculiar tics, such as moving his arms around in strange chopping patterns or sometimes twitching his body uncontrollably. Tenya is very humble, willing to admit to his mistakes, apologize for rude behavior, and improve in areas he lacks. Being part of the highly-esteemed Ida Family of Heroes, Tenya is proud of his lineage and works hard to meet his expectations. He greatly admires his older brother, Tensei (also known as the Turbo Hero: Ingenium), and aspires to become a similar hero.\n\nTenya's Quirk Engine gives him car-like engines in each of his calves, giving him incredible running speed and extreme kicking power. Tenya needs to fuel his engines by drinking orange juice. Tenya's engines have multiple gears; it is currently unknown how many, but it has been implied that there are more than three.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89222-TL8MQM3wJgEB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89222
      },
      "rarity": "common"
    },
    {
      "id": "eijirou-kirishima",
      "name": "Eijirou Kirishima",
      "alt_names": [
        "切島鋭児郎",
        "Eijiro Kirishima",
        "Sturdy Hero: Red Riot",
        "Gouken Hero: Red Riot (剛健ヒーロー 烈怒頼雄斗)",
        "Ei"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7\")\n__Quirk:__ Hardening\n\nStudent in Class 1-A at U.A. High School.\n\nEijiro is a boisterous and outgoing guy with a fondness for manliness, often using the terms \"manly\" and \"unmanly\" to describe things and people he does or doesn't like, respectively. Eijiro is very honest and kind-hearted, having a straightforward way of thinking and following a specific code of chivalry that motivates him to live without regret. He is determined and selfless, bravely putting the safety of others before himself. He is also a big fan of Crimson Riot, a retro hero from whom he takes inspiration, including personal values and his hero name. Although Eijiro may not be as hot-blooded and competitive as Katsuki Bakugou, he does not shy away from comparing himself to him, with Izuku stating that the two have managed to develop a relationship between equals. As a result, Eijiro is notably one of the few people that Katsuki holds in higher esteem.\n\nEijiro's Quirk gives him the power to harden and sharpen any or all parts of his body, causing his flesh to become jagged and rock-like. There is a limit to how much damage his hardened body can withstand, which causes the Hardening itself to slowly dissipate, and Eijiro to lose stamina from struggling to keep his Quirk active.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89243-QLmUyyZk5K2l.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89243
      },
      "rarity": "common"
    },
    {
      "id": "fumikage-tokoyami",
      "name": "Fumikage Tokoyami",
      "alt_names": [
        "常闇踏陰",
        "Jet-Black Hero: Tsukuyomi",
        "Shikkoku Hero: Tsukuyomi (漆黒ヒーロー ツクヨミ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 158 cm\n__Quirk:__ Dark Shadow\n\nStudent in Class 1-A at U.A. High School.\n\nFumikage is reserved, serious, and focused, albeit noble and valiant. Though not talkative, Fumikage will directly ignore questions or requests that seem in some way pointless. During combat, Fumikage is known to be fierce and dependable, with his strength and capabilities rarely being questioned. Fumikage is fond of darkness and other related concepts, considering himself a \"creature of the dark\" and employing archaic-sounding speeches that paint him slightly creepy or dramatic. \n\nFumikage's Quirk \"Dark Shadow\" allows him to manifest a sentient shadow monster from his body that he can materialize and contract freely. Dark Shadow's energy is limited and can be drained by bright light. Dark Shadow retracts into Fumikage's body when it runs out of energy. The shadow entity's personality, strength, defense, and control depend on the lack of light. In bright light, Dark Shadow is weaker and smaller but still has considerable strength and defense and is easier to control, but in total darkness, Dark Shadow's size and parameters are drastically enhanced. It is powerful enough to rip out and cut down multiple full-grown trees easily. However, Dark Shadow is more difficult to control in the dark, causing it to rampage based on its own free will.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89898-yAYDmPQPSOTV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89898
      },
      "rarity": "common"
    },
    {
      "id": "shouta-aizawa",
      "name": "Shouta Aizawa",
      "alt_names": [
        "相澤消太",
        "Shota Aizawa",
        "Eraser Head",
        "Erasure Hero",
        "Eraser"
      ],
      "role": "supporting",
      "description": "__Height: __183 cm (6')\n__Occupation:__ Pro Hero, Teacher\n__Affiliation:__ U.A. High School\n__Quirk:__ Erasure\n\nAizawa's hero name, Eraserhead, was coined by Present Mic when they were younger. Using the binding cloth, Aizawa has a unique fighting style that allows him to immobilize his enemies. He is known to expel students that don't meet his standards, however it should be noted that he did not expel anyone from Class 1-A. Aizawa is extremely vocal, able to voice his opinions very easily. Although seeming emotionless and reserved, he has a soft spot for his students and genuinely cares for them. \n\n(Source: Boku no Hero Academia Wikia, Hero Wiki)",
      "metadata": {
        "gender": "male",
        "age": "30-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89225-XBgvUhI9naVI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89225
      },
      "rarity": "common"
    },
    {
      "id": "tsuyu-asui",
      "name": "Tsuyu Asui",
      "alt_names": [
        "蛙吹梅雨",
        "Tsu",
        "Rainy Season Hero: Froppy (梅雨入りヒーローフロッピー)",
        "Miss Ribbit (ケロケロ)"
      ],
      "role": "supporting",
      "description": "__Affiliation:__ U.A. High School\n__Quirk:__ Frog\n\nTsuyu is a very straight-forward girl that always says what's on her mind and what she thinks about others. She prefers to be called by her first name.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89223-5762vburxnlz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89223
      },
      "rarity": "common"
    },
    {
      "id": "denki-kaminari",
      "name": "Denki Kaminari",
      "alt_names": [
        "上鳴電気",
        "Stun Gun Hero: Chargebolt",
        "Stun Gun Hero: Chargezuma (スタンガンヒーロー・チャージズマ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 168 cm (5'6\")\n__Quirk:__ Electrification\n\nStudent in Class 1-A at U.A. High School.\n\nDenki is a friendly, social, and energetic boy who enjoys hanging out with others. He is rather casual when interacting with other people, including the generally unfriendly Katsuki Bakugou. \n\nDenki's Quirk Electrification allows him to store and discharge electricity. While he can also discharge this energy over a distance, Denki has little to no control over it, meaning it will go everywhere indiscriminately. Denki is also able to absorb and neutralize electricity and other lightning-based Quirks. Whenever Denki exceeds his wattage limit, he loses his ability to discharge energy, with his entire personality changing into that of a giggling idiot for a certain period until he reverts to normal. In this state, he is always giving thumbs-ups as a way to let others know that he is okay.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89249-Ygc30RlYoFta.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89249
      },
      "rarity": "common"
    },
    {
      "id": "momo-yaoyorozu",
      "name": "Momo Yaoyorozu",
      "alt_names": [
        "八百万百",
        "Yao-momo",
        "Everything Hero: Creati",
        "Bonbatsu Hero Creati(万物ヒーロー クリエイティ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 173 cm (5'8\")\n__Quirk:__ Creation\n\nVice class representative of Class 1-A at U.A. High School. She was admitted to the school through official recommendations. \n\nMomo is a very prudent, dedicated person who acts as a natural leader. She is generally level-headed and calm in dangerous situations, but she isn't above falling into a panic. Momo can be blunt with her comments about people's mistakes and miscalculations, tending to be very direct and wishing to help her peers improve enough to become great heroes. \n\nMomo's Quirk gives her the ability to create any non-living material/object from her exposed skin by transforming the molecular structure of her fat cells. In order to create something, she needs to understand the molecular structure of which the material/object is made.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89241-Q8KzAfX4Qe2y.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89241
      },
      "rarity": "common"
    },
    {
      "id": "hitoshi-shinsou",
      "name": "Hitoshi Shinsou",
      "alt_names": [
        "心操人使",
        "Hitoshi Shinso"
      ],
      "role": "supporting",
      "description": "__Height:__ 177 cm (5'9½\")\n__Quirk:__ Brainwashing\n\nStudent at U.A. High School, attending Class 1-C of the Department of General Education.\n\nHitoshi is a stoic and straightforward person with an innate ability to spark conversation with anyone despite holding a reserved and quiet attitude most of the time. He is shown to be rather clever, knowing just the right words to manipulate others into replying to his comments, allowing him to activate his Quirk. He does not mind doing something underhanded to claim victory in a fight. Due to having his Brainwashing Quirk perceived as evil throughout his life, Hitoshi has been somewhat feared by those aware of his power and has been discriminated against solely because of the Quirk he was born with. This persecution led him to become resentful of those who had Quirks more associated with hero work. Regardless of his drawbacks, however, Hitoshi desires to become a Pro Hero more than anything.\n\nHitoshi's Quirk Brainwashing allows him to put someone in a state where they are forced to obey whatever he commands. He can only activate this power when his target verbally responds to something he says. Brainwashing must be intentionally activated and will not take effect if Hitoshi doesn't want it to. Using a megaphone or anything that makes his voice artificial will not allow his Quirk to activate, as the said devices would transform his voice into an electronic signal.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89242-0m30Li19ZxXR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89242
      },
      "rarity": "common"
    },
    {
      "id": "minoru-mineta",
      "name": "Minoru Mineta",
      "alt_names": [
        "峰田実",
        "Fresh-Picked Hero: Grape Juice "
      ],
      "role": "supporting",
      "description": "__Height:__ 108 cm (3' 6½\")\n__Quirk:__ Pop Off\n__Affiliation:__ U.A. High School\n__Fighting Style:__ Medium Ranged Support\n\nMinoru Mineta, also known as the Fresh-Picked Hero: Grape Juice, is a student in Class 1-A at U.A. High School, training to become a Pro Hero.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89244-VVwK9loDHeTV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89244
      },
      "rarity": "common"
    },
    {
      "id": "hanta-sero",
      "name": "Hanta Sero",
      "alt_names": [
        "瀬呂範太",
        "Taping Hero: Cellophane (テーピンヒーロー セロファン)"
      ],
      "role": "supporting",
      "description": "__Height:__ 177 cm (5' 9¾\")\n__Quirk:__ Tape\n \nStudent in Class 1-A at U.A. High School.\n\nHanta is amicable and has proven to be one of the more sociable members of Class 1-A. He can sometimes be loud and showy, often trying to impress his peers with his Quirk. He is often the only person to call his classmates out when they act crazy. He is pretty humorous and usually makes jokes with his classmates. However, when push comes to shove, Hanta is a brave hero-in-training who wishes to prosper on his own while helping others do the same.\n\nHanta's Quirk is that he has tape dispenser-like organs in his elbows, from which he can shoot long cellophane tape-like strips; he can also retract them. They appear to be somewhat sturdier than regular tape. Overuse of his Quirk will cause his skin to dry out. He can use his tape to wrap people, swing long distances, and create traps, among other applications.",
      "metadata": {
        "gender": "male",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89895-DpFrgTelc9Qx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89895
      },
      "rarity": "common"
    },
    {
      "id": "mina-ashido",
      "name": "Mina Ashido",
      "alt_names": [
        "芦戸三奈",
        "Pinky  (ピンキー)",
        "Ridley Hero: Alien Queen"
      ],
      "role": "supporting",
      "description": "__Height:__ 159 cm (5'3\")\n__Quirk:__ Acid\n\nStudent in Class 1-A at U.A. High School.\n\nMina is a cheerful and easygoing girl who usually displays a smile. Highly social and excitable, she loves to hang out with her friends and is shown to become very upset when denied an opportunity to be at a gathering. She possesses a strong fashion sense and likes to go shopping. Due to her athleticism and energy, Mina enjoys and is very skilled at dancing. Mina is extremely courageous and is viewed as an ideal personality for hero work.\n\nMina's Quirk Acid allows her to produce a corrosive liquid from her body. She can control the solubility and viscosity of this corrosive liquid. There is a limit to how long she can produce the corrosive liquid until her skin gradually loses its natural resistance to it. Overusing her Quirk or pushing it too far can also be fatal, as it dehydrates her body very fast. Mina can use her acid offensively, but has shown utility with it as well, such as melting handholds for herself to climb with. She is also known to secrete a non-corrosive version of the acid from her feet in order to slide around.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89247-hu5MCqfoN82E.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89247
      },
      "rarity": "common"
    },
    {
      "id": "kyouka-jirou",
      "name": "Kyouka Jirou",
      "alt_names": [
        "耳郎響香",
        "Kyoka Jiro",
        "Hearing Hero: Earphone Jack"
      ],
      "role": "supporting",
      "description": "__Height:__ 154 cm (5'1\")\n__Quirk:__ Earphone Jack\n__Affiliation:__ U.A. High School\n__Fighting Style:__ Medium Ranged + Support Combat\n\nKyoka is a petite, fair-skinned girl with a slender build. She has triangular, lazy-looking onyx eyes with notably long lower eyelashes, and rather small eyebrows. Kyoka has a pragmatic, unenthusiastic and teasing personality that is mostly shown to those she finds irritating. Kyoka is not always like this though, as she does enjoy socializing with others, in which case she is usually nice and friendly. Kyoka's Quirk (Earphone Jack) allows her to plug the jacks that hang from her earlobes into all sorts of things and channel the sound of her heartbeat into them; causing havoc inside the plugged objects. It's also used to catch sounds and vibrations from her surroundings.",
      "metadata": {
        "gender": "female",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89897-5vU7N3ayiKRr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89897
      },
      "rarity": "common"
    },
    {
      "id": "yuuga-aoyama",
      "name": "Yuuga Aoyama",
      "alt_names": [
        "青山優雅",
        "Yuga Aoyama",
        "Shining Hero: Can't Stop Twinkling",
        "Kagayaki Hero: Can't Stop Twinkling (輝きヒーロー)"
      ],
      "role": "supporting",
      "description": "**Height:** 168 cm (5'6\")\n**Quirk:** Navel Lazer\n\nStudent in Class 1-A at U.A. High School.\n\nYuuga appears to be vain and prideful, thinking of himself as superior to the rest of his classmates, especially regarding his Quirk. He exhibits flamboyant mannerisms, is fond of posing, and likes to grab the attention of those around him despite frequently getting ignored by his peers. He also plays up his French heritage, occasionally implementing French words into his sentences.\n\nYuuga's Quirk allows him to shoot a powerful sparkling laser cannon from his navel. It is so powerful, it can blast through two meters of solid concrete. If he fires the laser for more than 1 second at a time, he will suffer intestinal distress.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127042-a6dlcC3ZYSDx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127042
      },
      "rarity": "common"
    },
    {
      "id": "mezou-shouji",
      "name": "Mezou Shouji",
      "alt_names": [
        "障子目蔵",
        "Mezo Shoji",
        "Tentacle Hero: Tentacole",
        "Shokushu Hero: Tentacole (触手ヒーロー テンタコル)"
      ],
      "role": "supporting",
      "description": "__Height:__ 187 cm (6'2\")\n__Quirk:__ Dupli-Arms\n\nStudent in Class 1-A at U.A. High School.\n\nShouji is friendly and gentle, and he will work nicely with anyone. He is not the type to hold grudges, showing no ill will towards those that harm him unwillingly. Shouji is entirely selfless and willing to risk his life for anyone. He can be empathetic and understanding, but still shows a sense of maturity and responsibility that prevents him from acting under emotional impulses. He is very protective of his classmates, especially if they are hurt or injured. He is also quite thick-skinned, as he said he is used to being feared due to his appearance.\n\nShouji's Quirk grants him a set of tentacles alongside his arms. He can transform the tips of these tentacles to replicate other parts of his body (ex: mouth, ears, eyes). The duplicated body parts are more efficient than the originals; as a result, Mezo is able to hear better, see-through more angles at a time, and they grant him much higher degrees of strength. He uses these arms to talk most of the time through duplicate mouths, rather than his actual mouth.\n\n(Source: My Hero Academia Wiki)",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89899-vIokiJ5jMESf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89899
      },
      "rarity": "common"
    },
    {
      "id": "kouji-kouda",
      "name": "Kouji Kouda",
      "alt_names": [
        "口田甲司",
        "Koji Koda",
        "Petting Hero: Anima",
        "Fureai Hero: Anima (ふれあいヒーロー アニマ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 186 cm (6'1\")\n__Quirk:__ Anivoice\n\nStudent in Class 1-A at U.A. High School.\n\nContrary to his strong and powerful appearance, Kouji is very timid and quiet. He rarely speaks and prefers using sign language to communicate with his classmates. He hates violence due to his kind-hearted nature. Kouji appears to greatly enjoy the company of animals, as his Quirk allows him to interact with animals in ways others cannot. He owns a small rabbit as a pet.\n\nKouji's Quirk \"Anivoice (生き物ボイス, Ikimono Voice)\" gives him the ability to command any creature in the animal kingdom by speaking to them. Whatever command he gives, the animal will carry it out. However, he cannot exert control if they cannot hear his command. The target must also be a real animal and not merely animal-like. Kouji can also exchange information with the animals to find the locations of various people and potential enemies faster. Kouji has been shown to use the Quirk effectively with flocks of birds to create a smokescreen of animals and to attack an opponent, along with his use of insects to distract and attack his opponents. He has now also overcome his fear of bugs, so he often uses bugs to swarm opponents with numbers.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89901-XCnkga69pLN9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89901
      },
      "rarity": "common"
    },
    {
      "id": "tooru-hagakure",
      "name": "Tooru Hagakure",
      "alt_names": [
        "葉隠透",
        "Toru",
        "Stealth Hero: Invisible Girl (ステルスヒーロー インビジブルガール)"
      ],
      "role": "supporting",
      "description": "__Height:__ 152 cm (5'0\")\n__Quirk:__ Invisibility \n\nStudent in Class 1-A at U.A. High School.\n\nTooru is a bubbly, cheery, and easygoing girl who does most things with an upbeat attitude. She is very socially eager and likes shopping, and her room suggests that she likes plushies and other cute things.\n\nTooru's Quirk is that her body is completely invisible. In addition to the stealth capabilities granted to her by her invisible body, Tooru can refract light that passes through her, allowing her to intensify the light into a blinding flash. She has further refined this application of her Quirk, achieving the ability to manipulate and redirect light-based attacks, such as Yuuga Aoyama''s Navel Laser.\n\n(Source: My Hero Academia Wiki)",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89900-QOH8tvJgtFVj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89900
      },
      "rarity": "common"
    },
    {
      "id": "rikidou-satou",
      "name": "Rikidou Satou",
      "alt_names": [
        "砂藤力道",
        "Rikido Sato",
        "Sweets Hero: Sugarman (甘味ヒーローシュガーマン)"
      ],
      "role": "supporting",
      "description": "__Height:__ 185 cm (6'1\")\n__Quirk:__ Sugar Rush\n\nStudent in Class 1-A at U.A. High School.\n\nRikidou is interested in sweets and baking, a valuable skill due to his Quirk. He is surprisingly talented at making sweets.\n\nRikidou's Quirk Sugar Rush allows him to increase his strength five-fold for three minutes. To activate his Quirk, he needs to consume 10 grams of sugar. When converting sugar into strength, his cognitive functions gradually drop, making him sleepy afterward. For every additional 10 grams of sugar he ingests, he extends the time of increased strength by another three minutes.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89902-LXStXzlmI70R.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89902
      },
      "rarity": "common"
    },
    {
      "id": "mei-hatsume",
      "name": "Mei Hatsume",
      "alt_names": [
        "発目明"
      ],
      "role": "supporting",
      "description": "__Height:__ 157 cm (5'2\")\n__Quirk:__ Zoom\n\nMei is a smart, off-setting, and assertive girl, often making those around her uncomfortable. She loves creating gadgets, which she refers to as her \"super cute babies\". Mei has a habit of \"going straight to the point\" and is very shameless and opportunistic when it comes to advertising her inventions. While talking to people, she has a habit of getting awkwardly close to them, which usually causes them to back away from her but she still moves up to them.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89248-8QeMSMjjJ5RO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89248
      },
      "rarity": "common"
    },
    {
      "id": "jin-bubaigawara",
      "name": "Jin Bubaigawara",
      "alt_names": [
        "分倍河原仁",
        "Twice (トゥワイス)"
      ],
      "role": "supporting",
      "description": "__Height:__ 178 cm (5'10\")\n__Quirk:__ Double\n\nVillain affiliated with the League of Villains, and part of its Vanguard Action Squad.\n\nJin has an incredibly unique personality: explosive, and lively with a very comedic demeanor. He enjoys assuming dramatic poses and eccentric facial expressions. Jin constantly contradicts himself, making a statement in one voice and immediately saying the opposite in another. This juxtaposition iss part of a mental instability that Jin embraces as a villain. He believes understanding your own identity is the most essential aspect in life, an understanding he lost during the 9-day conflict with his own clones that left him unsure whether he was the original or not. Now, if his mask is removed, he panics and threatens to \"split\" until he put his mask back on to become \"whole\".\n\nJin's Quirk allows him to create an exact duplicate of anything, living or not. To duplicate something, he needs to know its precise measurements and characteristics. The clones he makes do not disappear; instead, they disintegrate into a mud-like substance after taking a certain amount of damage. The duplicates are less durable than the original, and the second duplicate is even less durable than the first. When Jin creates duplicates of a person, he has no control over the clones because they have their own autonomy, personalities, and abilities that are utterly identical to the original.",
      "metadata": {
        "gender": "male",
        "age": "31",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89589-0ICQRy2iXj2l.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89589
      },
      "rarity": "common"
    },
    {
      "id": "mashirao-ojiro",
      "name": "Mashirao Ojiro",
      "alt_names": [
        "尾白猿夫",
        "Martial Arts Hero: Tailman",
        "Butou Hero: Tailman (武闘ヒーローテイルマン)"
      ],
      "role": "supporting",
      "description": "__Height:__ 169 cm (5'6\")\n__Quirk:__ Tail\n\nStudent in Class 1-A at U.A. High School.\n\nMashirao has a very calm and noble attitude and a profound sense of dignity, which prevents him from accepting results he doesn't feel he earned with his own abilities. He is also described as a hard worker. Along with a strong sense of dignity, Mashirao can be described as sheepish and bashful, not very often enjoying the spotlight and being easily embarrassed. A recurring joke is that others view Mashirao as \"plain,\" which profoundly upsets him.\n\nMashirao's Quirk is that he has a long, powerful, sturdy tail. His tail effectively functions as a third arm that he can use to grab things. Furthermore, it's attack power is strong enough to break objects made of metal, he can wrap it around enemies, and it can support Mashirao's body weight. Mashirao is incredibly adept at using his tail, combining it with his knowledge of martial arts to engage enemies in close-range combat, performing fast and acrobatic moves. His tail can also increase his speed and mobility by whipping it down against the ground to use it like a springboard.\n\n(Source: My Hero Academia Wiki)",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89896-3QzT5nSEPjcr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89896
      },
      "rarity": "common"
    },
    {
      "id": "nomu-usj",
      "name": "Nomu (U.S.J.)",
      "alt_names": [
        "脳無",
        "Nomu"
      ],
      "role": "supporting",
      "description": "__Height:__ 195 cm (6'4¾\")\n__Affiliation:__ League of Villains\n__Fighting Style:__ Melee Combat \n__Quirks:__ Shock Absorption; Super Regeneration\n\nThe U.S.J. Nomu is an Upper-Tier Nomu that appeared with the League of Villains and acted as one of the main antagonists of the U.S.J. Arc.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89240-OppJU1hLa2RM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89240
      },
      "rarity": "common"
    },
    {
      "id": "yuu-takeyama",
      "name": "Yuu Takeyama",
      "alt_names": [
        "岳山優",
        "Mt. Lady (Mt.レディ)",
        "Lady",
        "Mineyama Hero: Mt. Lady"
      ],
      "role": "supporting",
      "description": "__Height:__ 162 cm (5'4\") (Normal form); 2062cm (67'8\") (Transformed)\n__Quirk:__ Gigantification\n__Occupation:__ Pro Hero\n\nPro Hero. Her Quirk allows her to grow to a gigantic size. She cannot variate between her base-height and the gigantified height achieved via her Quirk, making her only able to be either her normal height of 162cm (5 feet 4 inches) or her enlarged height of 2,062cm (67 feet 8 inches) tall.",
      "metadata": {
        "gender": "female",
        "age": "22-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b121529-uVxKmxh0QvQi.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 121529
      },
      "rarity": "common"
    },
    {
      "id": "mirio-togata",
      "name": "Mirio Togata",
      "alt_names": [
        "通形ミリオ",
        "Mirio Togata",
        "Lemillion (ルミリオン)"
      ],
      "role": "supporting",
      "description": "__Height:__ 181 cm (5'11\")\n__Occupation:__ Student\n__Affiliation:__ U.A. High School\n__Quirk:__ Permeation\n\nHe is third-year student at U.A. High School and is part of The Big 3 _(the strongest three hero students in all of Japan)_. Before Izuku Midoriya, Mirio was the top candidate for All Might's successor and inheritor of One For All. His Quirk, Permeation, gives him the ability to become intangible, letting him pass through any tangible matter; he can phase through walls and/or the ground, as well as let enemy attacks pass through him harmlessly.",
      "metadata": {
        "gender": "male",
        "age": "18-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123527-rz0OotcLY0E4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123527
      },
      "rarity": "common"
    },
    {
      "id": "neito-monoma",
      "name": "Neito Monoma",
      "alt_names": [
        "物間寧人",
        "Phantom Thief (ファントムシーフ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 170cm\n__Quirk:__ Copy\n\nStudent in Class 1-B at U.A. High School.\n\nNeito has a rather complex personality since it differs depending on who he is addressing; he is particularly mocking, loud, and sarcastic with Class 1-A, but outside of these interactions, he is a calm, kind, and intelligent person. He envies Class 1-A with a passion over how they became the center of attention among U.A.'s first years because of the U.S.J. Incident. Truthfully, he only wants his class to stand out as they do, and he vents this feeling by throwing countless taunts towards his rivals, gloating over Class 1-B's successes and disparaging 1-A for their failures. \n\nNeito's Quirk is Copy, which allows him to duplicate and use another person's Quirk after coming into physical contact with the user. He can hold four Quirks simultaneously and maintain copied powers for ten minutes. After the time limit runs out, he loses the copied Quirk until he once again touches the original user.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125450-3zpOZwFtlYPp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125450
      },
      "rarity": "common"
    },
    {
      "id": "himiko-toga",
      "name": "Himiko Toga",
      "alt_names": [
        "渡我被身子"
      ],
      "role": "supporting",
      "description": "__Height:__ 157 cm\n__Quirk:__ Transform\n\nHimiko Toga is a villain affiliated with the League of Villains and part of its Vanguard Action Squad. She originally joined the group as a means to get closer to Stain.\n\nHimiko is a very cheerful girl, to the point of smiling even after having presumably killed someone, displaying apparent sadistic tendencies. She has a very twisted perception of love and friendship\n\nHimiko's Quirk Transform grants her the ability to transform into a physical lookalike of another individual, as well as copy their voice. She can only transform into people whose blood she has ingested. The more blood she drinks, the longer she has access to that person's form. For example, 1 cup of blood allows her to transform for a total of 18 hours. She can even switch between the appearances of multiple people if she drinks the blood of more than one person. \n\n(Source: My Hero Academia Wiki)",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125619-iQxQoGHJvjRJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125619
      },
      "rarity": "common"
    },
    {
      "id": "tamaki-amajiki",
      "name": "Tamaki Amajiki",
      "alt_names": [
        "天喰環",
        "Suneater (サンイーター)"
      ],
      "role": "supporting",
      "description": "__Height:__ 177cm (5'10\")\n__Quirk:__ Manifest \n\nThird-year student in Class 3-A at U.A. High School and part of The Big 3 (the strongest three hero students in all of Japan). \n\nTamaki is extremely shy, aloof, depressed, \"intimidating\", and introverted, especially around big audiences. He gets nervous very easily when talking to other people. If his anxiety gets the best of him, Tamaki will often face away and lean into a wall to hide his face from others. While his physical abilities and Quirk are outstanding, Tamaki is socially awkward and lacks confidence in his powers. Despite his timid heart, Tamaki can show flashes of bravery. Even though he's always been a shy and reserved boy, Tamaki was able to hone his skills and climb the ranks into one of U.A.'s Big 3. Mirio Togata is a big inspiration for Tamaki.\n\nTamaki's Quirk Manifest grants him the ability to manifest the physical characteristics of anything he's eaten; for example, if he eats takoyaki, he can transform his fingers into octopus tentacles. Additionally, anything Tamaki manifests is significantly stronger than normal. The more of a substance Tamaki eats, the stronger his manifestation will be. He can only manifest the traits of substances still in his system and loses access to those traits once the substance is fully digested. He must resupply his Quirk daily and decide what foods to eat beforehand.\n\n(Source: My Hero Academia Wiki)",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125934-luh5LqQ6NnJF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125934
      },
      "rarity": "common"
    },
    {
      "id": "all-for-one",
      "name": "All For One",
      "alt_names": [
        "オール・フォー・ワン",
        "Aku no Shouchou (悪の象徴)",
        "Symbol of Evil"
      ],
      "role": "supporting",
      "description": "__Quirk:__ All For One\n__Occupation:__ Villain\n__Fighting Style:__ Close Range and Long Range\n\nAll For One is the true leader and benefactor of the League of Villains. Once Japan's most powerful villain and All Might's arch-nemesis, his true motives are unclear and his true identity unknown. His current goal is to raise Shigaraki to become his eventual successor.\n\n(Source: Boku no Hero Academia Wikia)",
      "metadata": {
        "gender": "male",
        "age": "100+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/125956-jzhb8Z4peLb8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125956
      },
      "rarity": "common"
    },
    {
      "id": "shuuichi-iguchi",
      "name": "Shuuichi Iguchi",
      "alt_names": [
        "伊口秀一",
        "Spinner (スピナー)"
      ],
      "role": "supporting",
      "description": "__Height:__ 174 cm\n__Occupation:__ Villain\n__Affiliation:__ League of Villains (formerly), Paranormal Liberation Front (Lieutenant of Brown Regiment)\n__Quirk:__ Gecko\n\nShuuichi is a villain affiliated with the League of Villains and part of its Vanguard Action Squad. He is completely obsessed with the ways of [Stain](https://anilist.co/character/126067) to the point where he copies his clothing and weaponry style, aiming to follow the same ideals as him and make his dreams come true.\n\n(Source: Boku no Hero Academia Wikia)",
      "metadata": {
        "gender": "male",
        "age": "20-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126005-4MLIKsaBXnhu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126005
      },
      "rarity": "common"
    },
    {
      "id": "itsuka-kendou",
      "name": "Itsuka Kendou",
      "alt_names": [
        "拳藤一佳",
        "Kendo",
        "Battle Fist (バトルフィスト)"
      ],
      "role": "supporting",
      "description": "__Height:__ 166 cm (5'5\")\n__Quirk:__ Big Fist\n\nClass representative of Class 1-B at U.A. High School,\n\nItsuka is a spirited girl who is thoughtful of others. She does not hesitate to criticize even her classmates if she feels what they are doing is not correct. Due to Itsuka's cheerful personality, she can bring all of Class 1-B together, thus making her the \"big sister\" of Class 1-B. \n\nItsuka's Quirk Big Fist grants her the ability to enlarge both of her hands to a gigantic size. With the increased size comes enhanced striking power and gripping capabilities.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126064-xJCuJjtODlU2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126064
      },
      "rarity": "common"
    },
    {
      "id": "chizome-akaguro",
      "name": "Chizome Akaguro",
      "alt_names": [
        "赤黒血染",
        "Hero Killer: Stain",
        "Hero Goroshi: Stain (ヒーロー殺しステイン)",
        "Stendhal (スタンダール)"
      ],
      "role": "supporting",
      "description": "__Height:__ 182 cm (6'0)\n__Quirk:__ Bloodcurdle\n\nVillain and former vigilante that was notorious for having killed many Pro Heroes. He attacks and kills heroes who he believes do not fit his definition of a \"true hero.\"\n\nChizome is a cruel, unforgiving, and merciless man with a sense of duty to cleanse society of false heroes. He believes that those who become Heroes for fame or money are unworthy of being called the name and only All Might is a true hero. Due to his strong ideology, he took it upon himself to become the Hero Killer: Stain to stain his own hands with blood to purge fake heroes and change the current society. \n\nDespite his extremist views and beliefs, Stain did have genuine ideals about heroism, which he stood by firmly. He did not hesitate to save people he deemed worthy of being called Heroes, did not like killing without reason, and would even give advice to his enemies. Stain acknowledged that what he did was morally wrong but believed that for society to be put on the right path, someone must be what he was, suggesting that he saw himself as a martyr.\n\nStain's Quirk \"Bloodcurdle\" allows him to paralyze his target upon tasting a sample of their blood. The amount of time a victim remains paralyzed depends on their blood type; in ascending order from shortest to longest duration, they are: O, A, AB, and B. The maximum amount of time that anyone can be paralyzed is eight minutes.\n\n_In My Hero Academia: Vigilantes:_ ~!Chizome works as the vigilante \"Stendhal,\" hunting villains to make up for the heroes' mistakes. He declares his respect for [Knuckleduster](https://anilist.co/character/129631/Oguro-Iwao), as he believes the two of them share similar beliefs about society, but Knuckleduster completely disagrees. He takes Stendhal down with one punch, completely smashing his nose in, declaring that people like him, especially those who wear a mask like that, lack true determinism. Inspired by these comments, Stendhal cuts off his broken nose and abandons his mask, declaring that he will dye the world with \"stains that cannot be wiped away.\" !~",
      "metadata": {
        "gender": "male",
        "age": "31-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126067-ZL6sRFyaqX9c.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126067
      },
      "rarity": "common"
    },
    {
      "id": "eri",
      "name": "Eri",
      "alt_names": [
        "壊理",
        "エリ"
      ],
      "role": "supporting",
      "description": "__Height:__ 110 cm \n__Quirk:__ Rewind\n\nEri is a child with bandages all over her body. She wears a white short sleeve dress and has a small horn on the right side of her forehead and has white, long, choppy, unkempt hair. She also has red eyes. Under her bandages, her arms are shown to have numerous scars.\n\n~!Eri is the key source to [Kai Chisaki's](https://anilist.co/character/126357/Kai-Chisaki) operation to manufacture a Quirk-Destroying Drug. She is the granddaughter of the Eight Precepts of Death's boss!~",
      "metadata": {
        "gender": "female",
        "age": "6-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126093-1SuOurVJnRla.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126093
      },
      "rarity": "common"
    },
    {
      "id": "enji-todoroki",
      "name": "Enji Todoroki",
      "alt_names": [
        "轟炎司",
        "Endeavor (エンデヴァー)"
      ],
      "role": "supporting",
      "description": "__Height:__ 195 cm (6' 4¾\")\n__Occupation:__ Pro Hero\n__Quirk:__ Hellflame\n\nEndeavor is a tall man with a muscular physique. He has short and spiky, red hair with bright blue eyes. His beard and mustache appear to be made of fire, but when he turns off his flames on his face voluntarily, his stubble shows.\n\n~!His desire to surpass the number one hero has driven him in family matters. Enji put Shouto through ruthless \"training\" which caused Shouto a severe degree of physical and emotional pain. Shouto, harboring a bitter hatred towards his father on account of this, refuses to use his fire powers in battles until Izuku Midoriya reminded him of his mother's encouragement. Later, Enji understood his mistakes and told his son he would try to be a better hero and father. He hopes for Shouto and the rest his family to forgive him in the future. !~\n\n~!He's the former No.2 Hero, but later becomes the new No.1 Hero after All Might loses his Quirk!~",
      "metadata": {
        "gender": "male",
        "age": "45",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126158-Wix9rh7unTDQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126158
      },
      "rarity": "common"
    },
    {
      "id": "nana-shimura",
      "name": "Nana Shimura",
      "alt_names": [
        "志村菜奈"
      ],
      "role": "supporting",
      "description": "Shimura Nana was the seventh user of the One For All Quirk, All Might's mentor, and a close friend of Gran Torino.\n~!It was revealed that she is the grandmother of Shigaraki!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126319-38iRM8zTWazq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126319
      },
      "rarity": "common"
    },
    {
      "id": "kai-chisaki",
      "name": "Kai Chisaki",
      "alt_names": [
        "治崎廻",
        "Overhaul (オーバーホール)"
      ],
      "role": "supporting",
      "description": "__Height:__ 179 cm (5'10\")\n__Quirk:__ Overhaul\n\nKai Chisaki, also known by the villain name Overhaul, is the Yakuza Captain of the Shie Hassaikai.\n\nOverhaul is a mysophobic, antisocial sociopath obsessed with returning the world to the way it was before the Quirk phenomenon. Due to a combination of an old theory claiming Quirks derived from rats and his own mysophobia, Overhaul believes that Quirks are actually a plague on humanity, having infected people with \"syndromes\" of heroism and villainy. He looks down upon those that use their abilities for either purpose, referring to acts of heroic sacrifice or petty crime as \"sicknesses\". Overhaul is extremely determined to his ambition of eradicating Quirks, not only due to his own personal phobias, but also because such a thing would allow the yakuza to reclaim the power they once held over society. \n\nKai's Quirk \"Overhaul\" grants him the ability to disassemble anything he touches, as well as reassemble it in any configuration he desires, effectively giving him full control over matter. Kai can disassemble people to kill them or reassemble them to heal their wounds. He can also do this to himself and even merge his body with others, even allowing him to use their Quirks",
      "metadata": {
        "gender": "male",
        "age": "27-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126357-d5wTLYqKchRv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126357
      },
      "rarity": "common"
    },
    {
      "id": "dabi",
      "name": "Dabi",
      "alt_names": [
        "荼毘"
      ],
      "role": "supporting",
      "description": "__Height:__ 176 cm (5'9¼\")\n__Quirk:__ Blueflame\n\nDabi is a villain affiliated with the League of Villains and a member of the organization's Vanguard Action Squad. \n\nDabi is a stoic, aloof, confident, and focused individual who rarely shows emotion. While rather crude and violent, he's also shown to be quite cautious. Overall, Dabi is a highly enigmatic individual who trusts no one, preferring to do things alone and in his way. He also gives off the impression of knowing more about certain people than he lets on.\n\nDabi's Quirk grants him the ability to generate and control highly destructive blue flames from his body. He has very well-developed control of his flames and can project them far from himself and in large amounts. However, Dabi's body has a low tolerance for his flame, and he will get burned if he uses them for prolonged periods. \n\n~!It is later revealed that Dabi is Touya Todoroki (轟燈矢), the eldest son of the Pro Hero Endeavor and his wife Rei, and the older brother to Shouto Todoroki. For a significant period of time, his whereabouts were unknown.!~",
      "metadata": {
        "gender": "male",
        "age": "24-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126378-RFSljq5koy5U.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126378
      },
      "rarity": "common"
    },
    {
      "id": "camie-utsushimi",
      "name": "Camie Utsushimi",
      "alt_names": [
        "現見ケミィ"
      ],
      "role": "supporting",
      "description": "__Height:__ 161 cm (5'3\")\n__Affiliation:__ Shiketsu High School (Second-Year Student)\n__Quirk:__ Glamour\n\nCamie seems to be very talkative, especially when learning more about people who pique her interest. She was thrilled upon seeing Shoto Todoroki for the first time, delighted at the fact that she would both meet a handsome man as well as undergo training. According to Inasa Yoarashi, she has impressive \"interaction techniques\" because she asked for Todoroki's contact info. She also tends to speak in a unique way and incorporates a strange type of slang in it, which tends to confuse those around her. According to herself she also loves children. Camie's Quirk allows her to create both visual and auditory illusions for a short period of time.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126734-UzWlE0sz46uH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126734
      },
      "rarity": "common"
    },
    {
      "id": "nejire-hadou",
      "name": "Nejire Hadou",
      "alt_names": [
        "波動ねじれ",
        "Nejire Hado"
      ],
      "role": "supporting",
      "description": "__Height:__ 164 cm (5'4\")\n__Occupation:__ Student\n__Quirk:__ Wave Motion (ability to convert body's vitality into energy that can discharge as blast waves)\n\nShe is third-year student at U.A. High School and is part of The Big 3 _(the strongest three hero students in all of Japan)_. \n\nNejire is very enthusiastic, affable and cheery, and is always seen moving. She shows great interest in people's unique physical features and is easily distracted by them. She seems to like knowing more than others, but not in a proud way, as she just enjoys explaining things to people and sharing her knowledge.\n\nDespite her happy-go-lucky personality, Nejire is fierce in battle. When the situation calls for it, Nejire can be very calm and focused. Her curiosity never seems to extend to the enemy and she always maintains her focus on taking them down.",
      "metadata": {
        "gender": "female",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126843-Er6fBr1zk5vo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126843
      },
      "rarity": "common"
    },
    {
      "id": "inasa-yoarashi",
      "name": "Inasa Yoarashi",
      "alt_names": [
        "夜嵐イナサ",
        "Gale Force",
        "Baldy"
      ],
      "role": "supporting",
      "description": "**Height:** 190 cm (6'3\")\n**Affiliation:** Shiketsu High School (First-Year Student)\n**Quirk:** Whirlwind\n\nInasa is an energetic and enthusiastic young man who expresses himself with vigor. He's very loud, oddly polite, and values passion over anything else. Inasa believes that all heroes have \"hot spirits\" that enable them to motivate and help others. He disapproves of heroes who do not embody the spirit of passion, which is why he has negative feelings about Endeavor and his son.",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126855-TzRPLSix0CEb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126855
      },
      "rarity": "common"
    },
    {
      "id": "tetsutetsu-tetsutetsu",
      "name": "Tetsutetsu Tetsutetsu",
      "alt_names": [
        "鉄哲徹鐵",
        "Real Steel (リアルスティール)"
      ],
      "role": "supporting",
      "description": "__Height:__ 174cm (5'9\")\n__Quirk:__ Steel\n\nStudent in Class 1-B at U.A. High School.\n\nTetsutetsu is defined by his very hotheaded and outspoken personality.  He is confident, stubborn, and straightforward in his motivations and actions. He tends to be very vocal about his intentions and has a one-track mind, often looking for the simplest solution to problems to solve them most directly. Tetsutetsu's direct personality shows through his tenacious and upfront fighting style during battles.\n\nTetsutetsu's Quirk allows him to turn his body into steel. This power grants Tetsutetsu both augmented defensive abilities to withstand attacks and the increased strength of his unarmed physical attacks.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127043-zbvDStalaHnZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127043
      },
      "rarity": "common"
    },
    {
      "id": "hizashi-yamada",
      "name": "Hizashi Yamada",
      "alt_names": [
        "山田ひざし",
        "Voice Hero: Present Mic (プレゼント・マイク)"
      ],
      "role": "supporting",
      "description": "__Height:__ 185cm (6'1\")\n__Quirk:__ Voice\n\nPro Hero. He also works as an English teacher at U.A. High School and as a radio talk show host.\n\nYamada maintains the eccentric persona of a radio host. He often poses when he talks and maintains a certain level of excitement or volume, regardless of the situation. Though he tends to be a jovial individual, Hizashi is capable of great rage when it comes to his friends and colleagues.\n\nYamada's Quirk \"Voice\" allows him to increase the volume of his voice, giving him an ability that is similar to a sonic scream. The sound from his Quirk is strong enough to cause people's ears to bleed from far away. The only known weakness of this Quirk is that the loud sounds do not travel well underground, making this Quirk ineffective against anything that is underground or separated from him by layers of earth.",
      "metadata": {
        "gender": "male",
        "age": "30-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127425-POL7I9NC4emH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127425
      },
      "rarity": "common"
    },
    {
      "id": "ibara-shiozaki",
      "name": "Ibara Shiozaki",
      "alt_names": [
        "塩崎茨",
        "Vine (ヴァイン)",
        "Maria (マリア)"
      ],
      "role": "supporting",
      "description": "__Height:__ 167cm (5'6\")\n__Quirk:__ Vine\n\nStudent in Class 1-B at U.A. High School.\n\nIbara is a very modest and courteous person. Although graceful and soft-spoken, she is not afraid to make her pure intentions known. She seems highly religious due to her talking about heaven and divine beings in passing on multiple occasions, and her ultimate moves having somewhat religious names such as \"Faith's Shield\" and \"Crucifixion\".\n\nIbara's Quirk \"Vine (ツル, Tsuru) gives her hair-like vines that grow on her head. She can lengthen and manipulate the vines, allowing her to attack, defend and grapple. She also can detach them at will. The vines will grow back, provided her head receives proper sunlight and water.\n\n(Source: MyHero Academia Wiki)",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127426-Amaf70JKHWyn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127426
      },
      "rarity": "common"
    },
    {
      "id": "nemuri-kayama",
      "name": "Nemuri Kayama",
      "alt_names": [
        "香山睡",
        "R-Rated Hero: Midnight",
        "Juu-hachi Kin Hero: Midnight (18禁ヒーロー ミッドナイト_"
      ],
      "role": "supporting",
      "description": "__Height:__ 175 cm (5'9\")\n__Quirk:__ Somnambulist\n\nPro Hero. She also works as a Modern Hero Art History teacher at U.A. High School.\n\nNemuri is a very playful and flirtatious person with an unpredictably serious and temperamental side to her. She gets angry whenever someone interrupts her or insults her. She is especially sensitive about her age. Despite her flirtatious personality, Nemuri was intelligent, perceptive, and articulate. While she comes off as a hero who enjoys her fame derived from her beauty and sex appeal, Nemuri has demonstrated true heroism and bravery, willing to fight on the front lines and put her life at risk for others.\n\nNemuri's Quirk \"Somnambulist\" allows her to put nearby people to sleep by exuding a sleep-inducing aroma from her body. Her Quirk works better on males than females.",
      "metadata": {
        "gender": "female",
        "age": "31-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127427-urv42J2E7TZ2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127427
      },
      "rarity": "common"
    },
    {
      "id": "sorahiko-torino",
      "name": "Sorahiko Torino",
      "alt_names": [
        "酉野空彦",
        "Gran Torino (グラントリノ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 128 cm (4'2\")\n__Affiliation:__ Yuuei (Retired)\n__Quirk:__ Jet\n\nA retired hero who is one of All Might's colleagues and his former homeroom teacher. He was the one who taught All Might to control One For All during the his early days, and his training was so intense that All Might fears him to the point he subconsciously tried to forget about him until Grantorino sent his recommendation for Izuku to help him improve One For All, becoming his work place mentor. His Quirk is \"Jet,\" allowing him to take in air through the sole of his foot to allow him to jump higher.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/127428-CRQhdmFk9I8a.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127428
      },
      "rarity": "common"
    },
    {
      "id": "keigo-takami",
      "name": "Keigo Takami",
      "alt_names": [
        "鷹見啓悟",
        "Hawks (ホークス)"
      ],
      "role": "supporting",
      "description": "__Height:__ 172 cm (5' 7¾\")\n__Occupation:__ Pro Hero (No.3 - former, No.2 - current)\n__Quirk:__ Fierce Wings\n__Affiliation:__ Hero Public Safety Commission, ~! Paranormal Liberation Front (as a spy) !~\n\nHawks is carefree, jovial, and dislikes formalities, often acting in a spontaneous and unpredictable way while being cocky and taunting. He believes that popular approval is the most important metric a Pro Hero should be judged for, and does not appear to take the official rankings seriously, showing a preference for the lower ranks as it would allow him to act more freely and avoid the burdens of being a top hero. He states his wish to patrol in a leisurely fashion and \"take it easy\".\n\nIt is hinted that Hawks was a fan of Endeavor from an early age, as depicted by the drawing of him as a child holding an Endeavor figurine.\n\n(Source: Boku no Hero Academia Wiki)",
      "metadata": {
        "gender": "male",
        "age": "22 (first appearance), 23 (current)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b128299-eMEsWazNXE56.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 128299
      },
      "rarity": "common"
    },
    {
      "id": "taishirou-toyomitsu",
      "name": "Taishirou Toyomitsu",
      "alt_names": [
        "豊満太志郎",
        "BMI Hero",
        "Fat Gum (ファットガム)"
      ],
      "role": "supporting",
      "description": "__Height:__ 250 cm (8'2\") (Fat form)\n__Quirk:__ Fat Absorption\n\nIn his fat form, Taishiro is a big round man, easily towering over other adults. In this form, his mouth is big, and his nose is smaller, which alongside his odd body proportions, give him an odd look. After burning through his fat, however, it is revealed that he is quite muscular, and his body adapts conventional proportions.\n\nHis hero costume consists of black pants and an orange zippered hood, which has the initials of his alias on the front of Fat Gum. Alongside them, he also wears gloves, metallic boots, and a mask that covers his eyes and his forehead.",
      "metadata": {
        "gender": "male",
        "age": "29",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129755-SWhEgTR2pwXv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129755
      },
      "rarity": "common"
    },
    {
      "id": "manami-aiba",
      "name": "Manami Aiba",
      "alt_names": [
        "相場愛美",
        "La Brava (ラブラバ)",
        "Honey"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Love\n\nManami is a short woman who wears an elaborate outfit with several heart motifs, such as heart-shaped earrings, belt buckles, and a bowtie. She also wears a buttoned shirt with frilly cuffs, gloves, small high-heeled boots and, similar to Danjuro Tobita, a pair of poofy pinstriped pants, though hers boast a unique heart design near her inner thighs.\n\nManami's hair is arranged in pigtails with one large side-swept bang in the middle, and her eyes are big with ringed pupils. She appears to have dark circles around them.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129756-PfqvhMnYR9o5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129756
      },
      "rarity": "common"
    },
    {
      "id": "tensei-iida",
      "name": "Tensei Iida",
      "alt_names": [
        "飯田天睛",
        "Ingenium"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Engine\n\nTensei Iida, also known as Turbo Hero \"Ingenium\", is the older brother of Tenya Iida and a former Pro Hero.\n\nOutside of his hero armor Tensei looks much like his younger brother Tenya, with square features and short black spiked hair. A differing feature is that he possesses arrow-shaped eyebrows and has a slightly longer face.\n\nSimilar to his brother, he has engine exhausts protruding from his body, but out of the ends of his elbows instead of his calves.\n\n**Also in Illegals:** Tensei meets with Koichi during an early morning run. Tensei is impressed with Koichi's Quirk and offers him a place in his agency, even expressing a desire for a sidekick with a fast mobility quirk. Later, when Tensei discovers Koichi has been working as a vigilante hero, he withdraws his offer to Koichi, but only because he believes him to be already in the right place.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129757-9B5yHjf19FzZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129757
      },
      "rarity": "common"
    },
    {
      "id": "shinji-nishiya",
      "name": "Shinji Nishiya",
      "alt_names": [
        "西屋森児",
        "Kamui Woods",
        "Shinrin Kamui (シンリンカムイ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 168 cm (5'6\")\n__Quirk:__ Arbor\n\nPro Hero. \n\nUnderneath his helmet, he has puffy red leaf-like hair, though his face has remained unseen since he has only been shown while wearing his mask. Shinji is a very serious and focused person when it comes to being a hero in his hero duties; however, he easily feels down when someone takes his glory or credit. \n\nShinji's Quirk \"Arbor\" (樹木, Jumoku) allows him to enlarge and control his wooden body parts into strong tree branches. These branches are excellent for binding.",
      "metadata": {
        "gender": "male",
        "age": "27-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129758-Za9Rd3Jw2rWU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129758
      },
      "rarity": "common"
    },
    {
      "id": "natsuo-todoroki",
      "name": "Natsuo Todoroki",
      "alt_names": [
        "轟夏雄"
      ],
      "role": "supporting",
      "description": "__Height:__ 181cm\n\nNatsuo Todoroki is a college student. He is the son of Enji and Rei Todoroki, the younger brother of Toya and Fuyumi, and the older brother of Shoto.\n\nNatsuo is a young man of average height, sporting white spiky hair with two small pieces of hair hanging down by his forehead. He greatly resembles his father at his age.\n\nNatsuo seems to be a care-free individual, as seen in his interactions with him and his family. However, he can be serious, and cares deeply for his family, except his father who he resents for his abusive treatment to his family. He does not feel forgiving to his father, blaming him for his mother Rei's hospitalization and Shoto's suffering.\n\n(Source: MHA Wiki)",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129759-NKEqNgefypJF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129759
      },
      "rarity": "common"
    },
    {
      "id": "danjuurou-tobita",
      "name": "Danjuurou Tobita",
      "alt_names": [
        "飛田弾柔郎",
        "Gentle Criminal (ジェントル・クリミナル)",
        "Gentle"
      ],
      "role": "supporting",
      "description": "__Height:__ 181cm (5'11\")\n__Quirk:__ Elasticity\n\nDanjuro is a man with a refined appearance. He has a slicked back hairdo with a curl at the front. He sports a handlebar mustache along with a well-kept, medium-sized beard.\n\nDanjuro's clothes are also quite extravagant, featuring a jacket with enlarged collars and coattails, a pair of loose pinstriped pants and two belts. He also wears a pair of cuffs and a woolly scarf, and he uses a cane to walk.",
      "metadata": {
        "gender": "male",
        "age": "32",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129760-rIgYYYwWUvWm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129760
      },
      "rarity": "common"
    },
    {
      "id": "mirai-sasaki",
      "name": "Mirai Sasaki",
      "alt_names": [
        "佐々木未来",
        "Sir Nighteye (サー・ナイトアイ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 200 cm (6'6¾\")\n__Birthplace:__ Tokyo, Japan\n__Quirk:__ Foresight\n\nA Pro Hero and [Mirio Togata](https://anilist.co/character/123527)'s mentor. He was formerly [All Might](https://anilist.co/character/89224)'s sidekick and was considered to be the brains behind All Might's hero operation before opening his own hero agency. \n\nSir Nighteye is a lean but muscular man with a clean, well-kept appearance. Unlike most Pro Heroes, he seems to prefer plain office clothes (a plain white suit with gold buttons, a white dress shirt, and a red tie with white dots) instead of an elaborate hero costume. \n\nSir Nighteye maintains a stoic and intimidating presence, with a cold and sharp glare, but that is only the side of his personality that he shows in public. He greatly values humor and actually requires people to make him laugh before he acknowledes them. Nighteye believes that humor and energy are vital elements for the future of society and punishes subordinates that fail to display those qualities.\n\nIn chapter 161/episode 77: ~!Nighteye is hospitalized after sustaining grievous injuries during the fight against the Shie Hassaikai. While at the hospital, he is visited by Mirio, Izuku, and even All Might, reuniting the friends after a long time. After telling everyone to keep smiling to bring about a brighter future, Sir Nighteye passes away peacefully, with a smile on his face.!~",
      "metadata": {
        "gender": "male",
        "age": "38",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129761-P1sMOT3u9UJm.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129761
      },
      "rarity": "common"
    },
    {
      "id": "naomasa-tsukauchi",
      "name": "Naomasa Tsukauchi",
      "alt_names": [
        "塚内直正"
      ],
      "role": "supporting",
      "description": "Naomasa Tsukauchi is a police detective in the Police Force.\n\nNaomasa is a tall man with short black hair and black eyes. As a member of the police force, he is normally seen in his uniform. He wears a signature tan overcoat and a matching hat. He also sports a black suit underneath with matching slacks and dress shoes. \n\nDetective Tsukauchi is an earnest, hardworking individual who has earned the right to be a close friend of All Might. Enough so, that he was even entrusted with the truth about One For All and the latter's true form.\n\nHe appears to have a close relationship with All Might, as he even leaked sensitive information to the hero just because he felt it was the right thing to do.",
      "metadata": {
        "gender": "male",
        "age": "36+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129762-hZiUf1j7AypG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129762
      },
      "rarity": "common"
    },
    {
      "id": "you-shindou",
      "name": "You Shindou",
      "alt_names": [
        "真堂揺",
        "Yo Shindo",
        "Grand"
      ],
      "role": "supporting",
      "description": "__Height:__ 176 cm (5'9\")\n__Affiliation:__ Ketsubutsu Academy High School\n__Quirk:__ Vibrate\n\nA second year at Ketsubutsu Academy. His quirk, \"Vibrate,\" allows him to create large tremors similar to earthquakes, but firing off strong attacks leaves him immobile.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131157-vsHEPDuG0xkw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131157
      },
      "rarity": "common"
    },
    {
      "id": "kurogiri",
      "name": "Kurogiri",
      "alt_names": [
        "黒霧"
      ],
      "role": "supporting",
      "description": "__Affiliation:__ League of Villains\n__Quirk:__ Warp Gate\n\nKurogiri has a level-headed personality, which often serves to ground Tomura Shigaraki's immaturity. He is intensely loyal to both All For One and Tomura. He is very polite and well-spoken, even to enemies.\n\n~! Kurogiri is actually an intelligent Nomu made from the corpse of Eraserhead and President Mics high school friend Oboro Shirakumo made to serve Tomura Shigaraki. Although he remains unaware of his previous identity after Eraserheads efforts to talk to him it’s shown that a small part of Oboro is still in Kurogiri!~",
      "metadata": {
        "gender": "male",
        "age": "Unknown",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137506-EzqPO6yHvjcK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137506
      },
      "rarity": "common"
    },
    {
      "id": "mustard",
      "name": "Mustard",
      "alt_names": [
        "マスタード"
      ],
      "role": "supporting",
      "description": "Mustard is a B-rank villain affiliated with the League of Villains and a member of the organization's Vanguard Action Squad. He and the rest of his team serve as the main antagonists of the Forest Training Camp Arc.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b141746-GveUzwaizBs7.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 141746
      },
      "rarity": "common"
    },
    {
      "id": "kenji-hikiishi",
      "name": "Kenji Hikiishi",
      "alt_names": [
        "引石健磁",
        "Ken",
        "Kennie",
        "Magne"
      ],
      "role": "supporting",
      "description": "Hikiishi Kenji, also known as Magne  was a villain affiliated with the League of Villains and part of its Vanguard Action Squad. She and the rest of her team serve as the main antagonists of the Forest Training Camp Arc. Magne preferred to go by female pronouns despite her masculine presentation.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b141747-DyrrfEePO1nG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 141747
      },
      "rarity": "common"
    },
    {
      "id": "atsuhiro-sako",
      "name": "Atsuhiro  Sako",
      "alt_names": [
        "コンプレス",
        "Mr. Compress",
        "Mister"
      ],
      "role": "supporting",
      "description": "Mr. Compress's Quirk allows him to \"compress\" anything in a spherical area into a small marble without actually damaging it. The weight of the target is reduced alongside them, making them very easy to carry. If used on a person, it effectively entraps them, terminating the fight instantly and allowing Mr. Compress to abduct them without difficulty. The Quirk can also be used on select body parts, maiming the target.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b141748-ZlmszNufZ2me.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 141748
      },
      "rarity": "common"
    },
    {
      "id": "giran",
      "name": "Giran",
      "alt_names": [
        "義爛"
      ],
      "role": "supporting",
      "description": "Giran is a B-rank villain and broker in affiliation with the League of Villains, working to scout new recruits for their organization",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b141749-s68dMtAc4u7l.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 141749
      },
      "rarity": "common"
    },
    {
      "id": "muscular",
      "name": "Muscular",
      "alt_names": [
        "マスキュラ"
      ],
      "role": "supporting",
      "description": "Befitting his appearance, Muscular has a very sadistic and bloodthirsty personality. He openly admits that he wants to use his Quirk freely to kill. Muscular enjoys killing and tormenting those he fights, often saying \"show me your blood!\". Unlike most of the other members of the Vanguard Action Squad, he joined the League of Villains just to let loose his brutal tendencies, rather than following Stain's ideology",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b141750-k9JlDcS6wkdi.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 141750
      },
      "rarity": "common"
    },
    {
      "id": "moonfish",
      "name": "Moonfish",
      "alt_names": [
        "ムーンフィッシ"
      ],
      "role": "supporting",
      "description": "Blade-Tooth (歯刃 Shijin?): Moonfish's quirk gives him the ability to enlarge and manipulate his teeth into powerful blade. \nBeing one of the most powerful people in the Vanguard action squad being able to take on numerous powerful heros at once",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b141751-9a2AKfNWTD3n.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 141751
      },
      "rarity": "common"
    },
    {
      "id": "kaoruko-awata",
      "name": "Kaoruko Awata",
      "alt_names": [
        "泡田薫子",
        "Bubble Girl (バブルガール)",
        "Bubble (バブル)"
      ],
      "role": "supporting",
      "description": "Quirk: Bubble (バブル Baburu) \n\nWith this Quirk, Kaoruko can make bubbles filled with an aroma that she had smelled at least once before. She can make both sweet-smelling bubbles and foul-smelling ones. When she’s too nervous, she produces very unpleasant-smelling bubbles that are self-destructing \n\nShe is a dedicated hero as well as Sir Nighteyes sidekick",
      "metadata": {
        "gender": "female",
        "age": "21",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b141893-e29UnLY9LLsz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 141893
      },
      "rarity": "common"
    },
    {
      "id": "emi-fukukado",
      "name": "Emi Fukukado",
      "alt_names": [
        "福門笑",
        "Ms.ミスジョーク",
        "Ms. Joke",
        "ふくかどえみ"
      ],
      "role": "supporting",
      "description": "__Height:__ 5'5\n__Quirk:__ Outburst\n\nPro Hero and a teacher of 2nd year, Class 2 at Ketsubutsu Academy High School.",
      "metadata": {
        "gender": "female",
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142169-iKO4T2ocwezR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142169
      },
      "rarity": "common"
    },
    {
      "id": "togaru-kamakiri",
      "name": "Togaru Kamakiri",
      "alt_names": [
        "鎌切尖"
      ],
      "role": "supporting",
      "description": "__Height:__ 158 cm (6'2\")\n__Quirk:__ Razor Sharp\n__Affiliation:__ Yuuei\n__Occupation:__ Student\n\nTogaru Kamakiri is a student in Class 1-B at U.A.",
      "metadata": {
        "gender": "male",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143274-QGqDOnKyQ59m.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143274
      },
      "rarity": "common"
    },
    {
      "id": "shinya-kamihara",
      "name": "Shinya Kamihara",
      "alt_names": [
        "紙原伸也",
        "Edgeshot",
        "Ninja Hero"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7\")\n__Quirk:__ Foldabody: Shinya's Quirk allows him to make his body and limbs extremely thin and long, effectively allowing him to transform himself into a razor sharp string. He is able to transform faster than the speed of sound.\n\nShinya is a calm and focused individual, who is able to maintain a level head even when in a crisis situation, and encourages his teammates when they begin to panic. He is proven to be quite intelligent and is good at analyzing situations and strategy. He is the former Number 5 Pro-Hero, and is currently Number 4.",
      "metadata": {
        "gender": "male",
        "age": "33-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143275-wu7zyF4tUtMC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143275
      },
      "rarity": "common"
    },
    {
      "id": "tomoko-shiretoko",
      "name": "Tomoko Shiretoko",
      "alt_names": [
        "知床知子",
        "Ragdoll"
      ],
      "role": "supporting",
      "description": "Her Quirk allowed her to observe and monitor up to 100 people at a time, including their location and weak points.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143535-OsKq4GW05QWC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143535
      },
      "rarity": "common"
    },
    {
      "id": "tsunagu-hakamada",
      "name": "Tsunagu Hakamada",
      "alt_names": [
        "袴田維",
        "Fiber Hero: Best Jeanist (ファイバーヒーロー ベストジー二スト)"
      ],
      "role": "supporting",
      "description": "__Height:__ 190cm (6'3\")\n__Quirk:__ Fiber Master\n\nPro Hero, ranked in the top 4. He is the recipient of the \"Best Jeanist\" award for eight consecutive years.\n\nTsunagu is an elegant man with flamboyant tendencies. He believes very strongly that people with influence must maintain a positive appearance both physically and socially. Tsunagu often uses metaphors referencing jeans, denim, and various other sewing and fabric-based phrases, often inspiring his recruits with speeches, telling them to keep their life straight like their jeans. Tsunagu takes the role of being a hero very seriously. He is selfless, brave, and charismatic, and he aims to spread a sense of a peace to all people, no matter how dire the situation.\n\nTsunagu's Quirk \"Fiber Master (ファイバーマスター)\" allows him to freely manipulate the threads in any nearby piece of fabric. He has power over all types of cloth, but his Quirk works best with denim and is less effective on sweats. Fiber Master also works on other types of fiber not related to fabric, such as carbon fibers. He primarily uses this power to restrain his targets, either by using their own clothing against them, or simply unravels portions of his own clothing into strings.",
      "metadata": {
        "gender": "male",
        "age": "35-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143536-x5jMYB9HbATo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143536
      },
      "rarity": "common"
    },
    {
      "id": "shino-sousaki",
      "name": "Shino Sousaki",
      "alt_names": [
        "送崎信乃",
        "Shino Sosaki",
        "Mandalay"
      ],
      "role": "supporting",
      "description": "Telepath: This Quirk allows Shino to utilize a mental transmission and send telepathic messages directly into people's minds. Shino, has displayed the ability to send a message to tens of people at a time. She can send messages, but she can't receive them",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143537-6REKYeLiEyjC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143537
      },
      "rarity": "common"
    },
    {
      "id": "yawara-chatora",
      "name": "Yawara Chatora",
      "alt_names": [
        "茶虎柔",
        "Tiger"
      ],
      "role": "supporting",
      "description": "Pliabody: Yawara's Quirk allows him to stretch, flatten, and bend his body in ways that would normally be impossible",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143538-XcXRlaxVIRUS.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143538
      },
      "rarity": "common"
    },
    {
      "id": "nezu",
      "name": "Nezu",
      "alt_names": [
        "根津",
        "Mr. Principal",
        "Nezu Kouchou (根津校長)",
        "Principal Nezu"
      ],
      "role": "supporting",
      "description": "__Height:__ 85 cm\n__Quirk:__ High Spec\n\nNezu, also known as Mr. Principal is a Pro Hero and the principal of U.A. High School. He is an extremely rare case of an animal who manifested a Quirk.\n\nHe can be very long-winded at times when explaining or educating.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143539-WD70GZlS9rOt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143539
      },
      "rarity": "common"
    },
    {
      "id": "gigantomachia",
      "name": "Gigantomachia",
      "alt_names": [
        "ギガントマキア"
      ],
      "role": "supporting",
      "description": "Gigantomachia is a villain associated with the League of Villains.[1] He is one of All For One's faithful servants and his former bodyguard, cultivated to be of use to Tomura Shigaraki if anything were to happen to him.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143540-mdiBYSmeGovk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143540
      },
      "rarity": "common"
    },
    {
      "id": "ryuuko-tsuchikawa",
      "name": "Ryuuko Tsuchikawa",
      "alt_names": [
        "土川流子",
        "Ryuko Tsuchikawa",
        "Pixie-Bob"
      ],
      "role": "supporting",
      "description": "__Height:__ 167cm (5'6\")\n__Quirk:__ Earth Flow\n\nRyuko Tsuchikawa also known as Pixie-Bob, is a Pro Hero and a member of the Wild, Wild Pussycats. She is a very hyperactive and loud person with little regard for how she may come off to other people and also is very self-conscious about her age.\n\nRyuko's Quirk allows her to freely manipulate the earth for a variety of effects.",
      "metadata": {
        "gender": "female",
        "age": "31",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143541-9eTCioD2DHii.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143541
      },
      "rarity": "common"
    },
    {
      "id": "thirteen",
      "name": "Thirteen",
      "alt_names": [
        "スペースヒーロ・13号 ",
        "Space Hero",
        "Anan Kurose (黒瀬亜南)"
      ],
      "role": "supporting",
      "description": "Thirteen is a wise, well-mannered person. As a rescue hero, Thirteen has displayed how passionate they are about saving people through their teachings. They even developed their own training facility - the Unforeseen Simulation Joint - to train future heroes in search and rescue tactics. They are very passionate about Quirks, specifically on the topic of using Quirks for creation and assistance rather than for destruction and battle. \nThirteen has also been shown to be very brave. Despite not being a combat type, they do not hesitate to use their Quirk to fight against villains in the name of protecting others",
      "metadata": {
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143542-nZhQB2X6w1Cl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143542
      },
      "rarity": "common"
    },
    {
      "id": "shin-nemoto",
      "name": "Shin Nemoto",
      "alt_names": [
        "音本真"
      ],
      "role": "supporting",
      "description": "Shin Nemoto is one of the Eight Expendables who works for Shie Hassaikai. Shin's Quirk, Confession, allows him to force people to answer his questions with their true feeling.\n\nShin appears to be a very cynic man as a result of the fact that he could never find anyone worthy of his trust and friendship thanks to his Quirk. He states that emotions are unnecessary to carry out objectives, but it is unknown if he actually believes this or if it was just a way to demoralize Mirio Togata as he fought Overhaul. As Overhaul is the only truly sincere person he’s ever met, Shin is extremely devoted to him. Since he is granted knowledge about his boss's plans, Shin holds himself in high-esteem among the Eight Expendables, viewing himself as special and the only one of the group worthy of walking alongside Overhaul. Shin's loyalty to Overhaul is enough to make him follow his boss even after getting completely overwhelmed in battle.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144519-NqOMsza0Xg8n.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144519
      },
      "rarity": "common"
    },
    {
      "id": "hari-kurono",
      "name": "Hari Kurono",
      "alt_names": [
        "玄野針",
        "Chronostasis (クロノスタシス)",
        "Chrono"
      ],
      "role": "supporting",
      "description": "__Age:__ Unknown\n__Status:__ ~!Imprisoned!~\n__Quirk:__ Chronostasis: Kurono's Quirk allows him to slow down the movements of anything he hits with his clock hand-like hair. The minute hands slows a targets movements for one minute and the hour hand slows a targets movements for one hour. Kurono can extend his hair, but only if he is not moving.\n\nHari Kurono, also known as Chronostasis, is a yakuza member afflicted with the Shie Hassaikai, and the assistant/right hand man to Overhaul. He is one of the main antagonists of the Shie Hassaikai Arc.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144520-zlKANb0t8awS.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144520
      },
      "rarity": "common"
    },
    {
      "id": "deidoro-sakaki",
      "name": "Deidoro Sakaki",
      "alt_names": [
        "酒木泥泥 "
      ],
      "role": "supporting",
      "description": "__Age:__ Unknown\n__Status:__ ~!Imprisoned!~\n__Quirk:__ Sloshed: Deidoro's Quirk allows him to subject nearby people to severe dizziness and inhibit their sense of balance, putting them in a state similar to being drunk. He is often seen drinking shortly before using his Quirk, meaning the strength of Sloshed could directly correlate with how much alcohol Deidoro consumes.  This may have contributed to his alcoholic nature, or could be a completely independent variable.\n\nDeidoro Sakaki is one of the Eight Expendables who works for the Shie Hassaikai.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144521-my4pbprMkL1q.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144521
      },
      "rarity": "common"
    },
    {
      "id": "yuu-houjou",
      "name": "Yuu Houjou",
      "alt_names": [
        "宝生結",
        "Yu Hojo"
      ],
      "role": "supporting",
      "description": "Yu Hojo is one of the Eight Expendables who works for Shie Hassaikai. \n\nQuirk Crystallization: Yu's Quirk grants him the ability to produce crystals on his body. This is effective for both close-ranged offense and defense. He can also grow his crystals to form a sword around his arm",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144522-4b6KKArAIVfI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144522
      },
      "rarity": "common"
    },
    {
      "id": "kendou-rappa",
      "name": "Kendou Rappa",
      "alt_names": [
        "乱波肩動",
        "Kendo Rappa",
        "The Rapper  (ザ ラッパー)"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Strongarm\n\nOne of the Eight Bullets who serves Overhaul and the Shie Hassaikai.\n\nKendou is a very hot-blooded man who thrives on violence and bloodshed. He has a warrior-like mentality, and he only cares about seeking a battle that can satisfy him. Kendou believes it's unbecoming for a fighter to use weapons and that everyone should fight with the power of their bodies. Unlike most of the Eight Bullets, Kendou only serves Overhaul because he hopes to one day defeat him.\n\nKendo's Quirk allows him to rotate his shoulders at extreme speeds, allowing him to attack his targets with a near-endless barrage of bullet punches.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144523-QD6iYIblAW5U.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144523
      },
      "rarity": "common"
    },
    {
      "id": "rikiya-katsukame",
      "name": "Rikiya Katsukame",
      "alt_names": [
        "活瓶力也"
      ],
      "role": "supporting",
      "description": "Rikiya Katsukame is one of the Eight Expendables who works under Overhaul for Shie Hassaikai.\n\nQuirk Enhanced Strength: Even without activating his Quirk, Rikiya exhibits superhuman brawn, befitting his massive build. On two separate occasions, he effortlessly burst through a wall and a locked gate, knocking several policemen into the air while doing so, and casually damaged the jamb while readying his next punch.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144524-bzJKotKJzgXy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144524
      },
      "rarity": "common"
    },
    {
      "id": "soramitsu-tabe",
      "name": "Soramitsu Tabe",
      "alt_names": [
        "多部空満"
      ],
      "role": "supporting",
      "description": "Soramitsu Tabe is one of the Eight Expendables who works for Shie Hassaikai.\n\nQuirk Food: Soramitsu's Quirk allows his teeth and jaws to easily chew and consume anything. His stomach is also able to digest what he has eaten with no trouble.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144558-IR4g654kqLlM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144558
      },
      "rarity": "common"
    },
    {
      "id": "hekiji-tengai",
      "name": "Hekiji Tengai",
      "alt_names": [
        "天蓋壁慈"
      ],
      "role": "supporting",
      "description": "Hekiji Tengai is one of the Eight Expendables who works for Shie Hassaikai under Overhaul.\n\nQuirk Barrier Hekiji's Quirk allows him to create telekinetic barriers in the shape of a dome around him, for defensive purposes",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144559-kB0w3oq9lti0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144559
      },
      "rarity": "common"
    },
    {
      "id": "joui-irinaka",
      "name": "Joui Irinaka",
      "alt_names": [
        "入中常衣",
        "Joi Irinaka",
        "Mimic"
      ],
      "role": "supporting",
      "description": "Joi Irinaka  also known as Mimic ミミック  is a Yakuza and the general manager of Shie Hassaikai.\n\nQuirk Mimicry: Joi's Quirk allows him to transfer his body and mind into an object, allowing him full control over it. This Quirk, however, only works on objects that are about the size of a refrigerator or smaller",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144560-MtgNTPiyRyvD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144560
      },
      "rarity": "common"
    },
    {
      "id": "touya-setsuno",
      "name": "Touya Setsuno",
      "alt_names": [
        "窃野トウヤ",
        "Toya Setsuno"
      ],
      "role": "supporting",
      "description": "Toya Setsuno is one of the Eight Expendables who works for Shie Hassaikai. \n\nQuirk Larceny: Toya is capable of instantly moving objects in the possession of someone directly into his hands, in a manner similar to teleportation. However, the limits to his Quirk depend on the size of what he can steal,which must also be within his sight",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144561-OCHXnIed6zpH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144561
      },
      "rarity": "common"
    },
    {
      "id": "pony-tsunotori",
      "name": "Pony  Tsunotori",
      "alt_names": [
        "角取ポニー"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Horn Cannon\n\nPony is a timid girl. As a foreigner, she does not have much knowledge of the language in Japan. She is shown to be rather naive and innocent in personality, learning nasty phrases from Neito Monoma without realizing what those words mean, as shown when Neito tells Pony unkind phrases to tell Class 1-A.\nPony is a thoughtful and diligent person. She is the one who made her team not lose against Class 1-A because of her strategy and perseverance. She is highly observant and seems to be a careful person. Despite this, she made some unkind comments towards Mezo Shoji in their battle, calling him an \"octopus\" and saying she doesn't like looking at him.\n\nPony's Quirk allows her to send her horns flying and remotely control them at will. She is able to control up to four horns that are sent flying. She has also been shown to be able to balance on them as they carry her around, much like Hawks' wings.\nWhen Pony gets angry, she starts speaking in her native language: English.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145387-S2EtnFw4OCje.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145387
      },
      "rarity": "common"
    },
    {
      "id": "daruma-ujiko",
      "name": "Daruma Ujiko",
      "alt_names": [
        "氏子達磨",
        "Kyudai Garaki",
        "Doctor (ドクター)"
      ],
      "role": "supporting",
      "description": "Daruma Ujiko is the pseudonym of a villain affiliated with the League of Villains, later the Paranormal Liberation Front. He is a faithful servant of All For One and later Tomura Shigaraki as well.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b148747-8pzci7WGBjgN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 148747
      },
      "rarity": "common"
    },
    {
      "id": "rumi-usagiyama",
      "name": "Rumi Usagiyama",
      "alt_names": [
        "兎山ルミ",
        "Mirko",
        "Miruko"
      ],
      "role": "supporting",
      "description": "Rumi is the No. 5 Pro Hero. She has an athletic build with muscular arms and legs. She has dark skin, red eyes which are tilted slightly inwards, and straight white hair reaching down past her waist. On her head, she has a pair of long white rabbit ears pointing upwards with a slight crook. Along with these, she also has a round white tail, which gives her overall design a definite resemblance to an albino rabbit.\n\nHer hero costume consists of a sleeveless white leotard with dark purple trim around her shoulders and waist, a wide, yellow crescent moon design over her chest, and two thick metal plates on her midriff. She wears purple thigh-high boots to compliment her leotard, with more plating around the heel and toe areas, making her feet look like those of a rabbit. She also has white gloves on her hands, with long cuffs, sporting small triangular protrusions around the edges.\n\n(Source: My Hero Academia Wikia)",
      "metadata": {
        "gender": "female",
        "age": "27",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b148985-7TtdK4VTzPEe.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 148985
      },
      "rarity": "common"
    },
    {
      "id": "ryou-inui",
      "name": "Ryou Inui",
      "alt_names": [
        "犬井猟",
        "Hound Dog"
      ],
      "role": "supporting",
      "description": "Ryo Inui is a Pro Hero and serves as the Lifestyle Guidance Counselor at U.A. High School.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149178-SBDSbVrFPwC4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149178
      },
      "rarity": "common"
    },
    {
      "id": "setsuna-tokage",
      "name": "Setsuna Tokage",
      "alt_names": [
        "取蔭切奈",
        "Lizardy (リザーディ)"
      ],
      "role": "supporting",
      "description": "Setsuna Tokage is a student in Class 1-B at U.A. High School, and is one of four students admitted through recommendations; one being her fellow 1-B classmate Juzo Honenuki, as well as rival Class 1-A students Shoto Todoroki and Momo Yaoyorozu.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149179-Z9TRzi7xZbas.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149179
      },
      "rarity": "common"
    },
    {
      "id": "kinoko-komori",
      "name": "Kinoko  Komori",
      "alt_names": [
        "小森希乃子",
        "Shemage",
        "シーメイジ"
      ],
      "role": "supporting",
      "description": "Kinoko Komori is a student in Class 1-B, and is training to be a Pro Hero. Her quirk, Mushroom, allows her to spread spores that sprout mushrooms wherever they land, including inside of people's bodies.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149180-OdxMk2XbIM5m.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149180
      },
      "rarity": "common"
    },
    {
      "id": "yui-kodai",
      "name": "Yui Kodai",
      "alt_names": [
        "小大唯",
        "Rule (ルール)"
      ],
      "role": "supporting",
      "description": "Yui Kodai is a student in Class 1-B of U.A. High School. She is a quiet girl, but nevertheless cares about her fellow classmates.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149182-HhsB5XlWxBgo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149182
      },
      "rarity": "common"
    },
    {
      "id": "juzo-honenuki",
      "name": "Juzo Honenuki",
      "alt_names": [
        "骨抜柔造",
        "Mudman",
        "マッドマン"
      ],
      "role": "supporting",
      "description": "__Height:__ 174cm (5'8½\")\n__Affiliation:__ U.A High\n__Quirk:__ Softening\n\nJuzo Honenuki is a student in Class 1-B at U.A. High School, and is one of four students admitted through recommendations; one being his fellow 1-B classmate Setsuna Tokage, the others being rival 1-A students Shoto Todoroki and Momo Yaoyorozu.\n\nJuzo's Quirk allows him to soften any non-living thing he touches. For example, he can soften the ground to make it similar to quicksand, hindering movements and mobility. If Juzo makes contact again, he can undo the effect. He is also capable of swimming through softened material.",
      "metadata": {
        "gender": "male",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149183-Bzor9qzF0kOQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149183
      },
      "rarity": "common"
    },
    {
      "id": "rikiya-yotsubashi",
      "name": "Rikiya Yotsubashi",
      "alt_names": [
        "四橋力也",
        "Re-Destro",
        "リ・デストロ",
        "四ツ橋力也"
      ],
      "role": "supporting",
      "description": "Rikiya, better known by his code name Re-Destro, is the president and CEO of the Detnerat Company, the son of the infamous villain Destro (for which he named his own code name after), as well as the secret leader of the villainous Meta Liberation Army, an organization that follows the philosophy that the usage of Quirks is a basic human right, and seeks to liberate society and allow for the free use of Quirks.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149184-pu8nSQVrSmfY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149184
      },
      "rarity": "common"
    },
    {
      "id": "tatsuyuki-tokoname",
      "name": "Tatsuyuki Tokoname",
      "alt_names": [
        "常滑達行",
        "Slidin' Go",
        "スライディン・ゴー"
      ],
      "role": "supporting",
      "description": "A Pro Hero. ~!He is also secretly a member of the villainous Meta Liberation Army.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149185-SwzuLpFzI1pI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149185
      },
      "rarity": "common"
    },
    {
      "id": "kuugo-sakamata",
      "name": "Kuugo Sakamata",
      "alt_names": [
        "逆俣空悟",
        "Gang Orca (ギャングオルカ)",
        "Whale"
      ],
      "role": "supporting",
      "description": "Gang Orca is the current No. 11 Pro Hero, dropping from his previous No. 10 place. He took part in the assault on All For One and the League of Villains at Kamino Ward, and later served as a makeshift villain during the Provisional Hero License Exam.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149186-fvBDbvij65aI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149186
      },
      "rarity": "common"
    },
    {
      "id": "desutegoro",
      "name": "Desutegoro",
      "alt_names": [
        "デステゴロ",
        "Death Arms"
      ],
      "role": "supporting",
      "description": "Death Arms is a Pro Hero. He took part in the fight against the Sludge Villain, and later witnessed the U.A. Sports Festival from outside the arena, along with Mt. Lady and Kamui Woods.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149187-KovqtsbG8ffN.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149187
      },
      "rarity": "common"
    },
    {
      "id": "ken-ishiyama",
      "name": "Ken Ishiyama",
      "alt_names": [
        "石山堅",
        "Cementoss (セメントス)"
      ],
      "role": "supporting",
      "description": "Cementoss is a Pro Hero as well as a teacher at U.A. High School. During the U.A. Sports Festival, he acted as the proctor for the 1-on-1 fights in case things got out of hand. He also faced off against Eijiro Kirishima and Rikido Sato in their Final Exam.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149188-BfUrODKF0KMC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149188
      },
      "rarity": "common"
    },
    {
      "id": "fuyumi-todoroki",
      "name": "Fuyumi Todoroki",
      "alt_names": [
        "轟冬美"
      ],
      "role": "supporting",
      "description": "The only daughter of Eiji and Rei. Fuyumi is the younger sister of Touya and the older sister of Natsuo and Shouto. \n\nFuyumi is a hard working girl, often making meals for the family and works as a teacher at an unnamed school. Unlike her family members, she doesn't resent her father and just wishes they could all be a happy family, though she realizes such a thing is unlikely. Upon hearing Shouto gains friends, however, Fuyumi gets quite excited over it and is happy for him.\n\nIn the past, Fuyumi took care of Shouto after their mother went to a hospital and never came back. To this day, her wish that she could have done something for Shouto still lingers within her.",
      "metadata": {
        "gender": "female",
        "age": "22-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b150627-DGnzAiwTGb8q.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 150627
      },
      "rarity": "common"
    },
    {
      "id": "rei-todoroki",
      "name": "Rei Todoroki",
      "alt_names": [
        "轟冷"
      ],
      "role": "supporting",
      "description": "The damaged mother of the Todoroki family. Rei has an ice related quirk, which is believed to be powerful, as Eiji would not have had kids with her otherwise.\n\nIn the past, Rei was very supportive towards Shouto and his dreams to become like All Might. She used to always say that his blood does not define him for him and for herself.\n\nRei, who was once a kind and caring woman, is now in a mental ward.  After all the abuse she faced from Eiji, she began to become mentally unstable. Over time, she had slowly began to snap, until she finally poured boiling water onto Shouto's left side after seeing it. Immediately after burning Shouto, Rei began to apologize and attempt to comfort him when she realized what she had done. Due to her snapping, she was placed into a mental ward for her own safety.\n\nEven though Rei is in a mental ward, she has since returned to her former self. When Shouto visited, she was immensely happy and apologized for what she had done to him. Fuyumi and Natsuo also visit her as well, though she has yet to meet Eiji face to face again out of fear.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b150628-7hRvgWALAVyO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 150628
      },
      "rarity": "common"
    },
    {
      "id": "hassaikai-kumichou",
      "name": "Hassaikai Kumichou",
      "alt_names": [
        "八斎會組長",
        "Hassaikai Boss"
      ],
      "role": "supporting",
      "description": "Without revealing his name a man known as “The Boss originally ran the organization known as The Shie Hassaikai. \nThe Boss always believed his gang should follow a set or code and morals,\nThe Boss would be known for raising Kai Chisaki with Chisaki turning on him later to run the organization to follow his own views with him putting the boss into a comatose state.\nThe Boss would be the one to introduce Kai Chisaki to his grand daughter Eri.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b157246-X8uVFkfq1TN4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 157246
      },
      "rarity": "common"
    },
    {
      "id": "chiyo-shuuzenji",
      "name": "Chiyo  Shuuzenji",
      "alt_names": [
        "修善寺治与",
        "Recovery Girl",
        "リカバリーガール"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Heal\n__Occupation:__ Pro Hero, Nurse\n\nChiyo has a very kind and compassionate personality, where she treats everyone kindly, though she does have a strict and reproaching attitude towards those that have done something foolish. She's mostly like this with All Might for not teaching Izuku how to use his Quirk properly or with Izuku for using his Quirk recklessly.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b157655-OOLn8kPUegMw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 157655
      },
      "rarity": "common"
    },
    {
      "id": "sajin-higawara",
      "name": "Sajin Higawara",
      "alt_names": [
        "日河原砂塵",
        "Snatch"
      ],
      "role": "supporting",
      "description": "Sajin Higawara also known as Sand Hero: Snatch was a Pro Hero and a bodyguard for the Police Force.\n\nQuirk:SandStorm",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b158616-HfRQpRl3Yobl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 158616
      },
      "rarity": "common"
    },
    {
      "id": "chitose-kizuki",
      "name": "Chitose Kizuki",
      "alt_names": [
        "気月置歳",
        "Curious"
      ],
      "role": "supporting",
      "description": "Chitose Kizuki, also known as Curious, is a journalist and a member of the Meta Liberation Army.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b160440-YNv7rS6h3wjl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 160440
      },
      "rarity": "common"
    },
    {
      "id": "geten",
      "name": "Geten",
      "alt_names": [
        "外典",
        "Iceman"
      ],
      "role": "supporting",
      "description": "Geten is a loyal warrior of the Liberation Army and a devout believer in its principles. He feels greatly indebted and thankful to Re-Destro for granting him more power and desires to create a world where the strongest superpowers stand at the top of the hierarchy.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b160441-qN1xlkLJoQ26.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 160441
      },
      "rarity": "common"
    },
    {
      "id": "moe-kamiji",
      "name": "Moe Kamiji",
      "alt_names": [
        "上路萌",
        "Burnin (バーニン)"
      ],
      "role": "supporting",
      "description": "Moe Kamiji, also known as her hero name Burnin, is a pro hero and one of over 30 sidekicks working at the Endeavor Hero Agency.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b160442-K6TjOb7JugeL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 160442
      },
      "rarity": "common"
    },
    {
      "id": "koku-hanabata",
      "name": "Koku Hanabata",
      "alt_names": [
        "花畑孔腔",
        "Trumpet"
      ],
      "role": "supporting",
      "description": "Koku Hanabata, also know as Trumpet, is a member of the Meta Liberation Army, a Paranormal Liberation Front lieutenant, and also the leader of the Hearts and Mind party.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b160443-4ORO2GCwynKc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 160443
      },
      "rarity": "common"
    },
    {
      "id": "tomoyasu-chikazoku",
      "name": "Tomoyasu Chikazoku",
      "alt_names": [
        "近属友保",
        "Skeptic"
      ],
      "role": "supporting",
      "description": "Tomoyasu Chikazoku, also known as Skeptic, is a member of the Meta Liberation Army.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b160444-JvwnbYlLDYYI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 160444
      },
      "rarity": "common"
    },
    {
      "id": "sen-kaibara",
      "name": "Sen Kaibara",
      "alt_names": [
        "回原旋",
        "Spiral"
      ],
      "role": "supporting",
      "description": "__Height:__ 172 cm (5'7½\")\n__Quirk:__ Gyrate\n\nKaibara Sen is a student from 1-B.\n\nHis quirk \"Gyrate\" allows Kaibara to rotate any part of his body.",
      "metadata": {
        "gender": "male",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b164355-FbMi2hXpy7uz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 164355
      },
      "rarity": "common"
    },
    {
      "id": "gunhead",
      "name": "Gunhead",
      "alt_names": [
        "ガンヘッド ",
        "バトルヒーローガンヘッド",
        "Battle Hero Gunhead"
      ],
      "role": "supporting",
      "description": "Gunhead is a pro hero. We meet him when Ochaco Uraraka does an internship at the Battle Hero's Office.\nGunhead is a very professional individual whose kindness and friendliness makes him a great teacher. Despite his outward appearance he has cute tendencies such as posing cutely.\n\n(Source: My Hero Academia Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b188796-h1Jcw3FbFpqd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 188796
      },
      "rarity": "common"
    },
    {
      "id": "sekijiro-kan",
      "name": "Sekijiro Kan",
      "alt_names": [
        "管赤慈郎",
        "Blood Hero: Vlad King"
      ],
      "role": "supporting",
      "description": "Sekijiro Kan, also known by his hero name, Blood Hero: Vlad King, is a Pro Hero and the homeroom teacher of U.A. High School's Class 1-B.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b191598-p17tG9grdbhq.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 191598
      },
      "rarity": "common"
    },
    {
      "id": "shihai-kuroiro",
      "name": "Shihai Kuroiro",
      "alt_names": [
        "黒色支配",
        "Vantablack"
      ],
      "role": "supporting",
      "description": "Shihai is a sly, deceitful schemer, who prefers to catch people off guard. He appears to enjoy dark concepts and has a penchant for dramatic speech",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b208141-jG6kqjVhjtds.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 208141
      },
      "rarity": "common"
    },
    {
      "id": "jurota-shishida",
      "name": "Jurota Shishida",
      "alt_names": [
        "宍田獣郎太",
        "Gevaudan"
      ],
      "role": "supporting",
      "description": "Jurota seems to be an intellectual as he uses a fairly verbose way of speaking and often addresses others by respectful titles such as 'sir' and 'miss'. This is because he was brought up in a very well mannered and doting family. While transformed, however Jurota is rather boisterous and energetic, which is likely a side effect of his Quirk.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b208142-4KB3VlunJwmx.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 208142
      },
      "rarity": "common"
    },
    {
      "id": "nirengeki-shoda",
      "name": "Nirengeki Shoda",
      "alt_names": [
        "庄田連撃",
        "Mines",
        "庄田二連撃"
      ],
      "role": "supporting",
      "description": "Nirengeki has a very humble attitude, as he will not take credit for something he does not feel he earned by his own strength.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b208143-w6rQrczIATRG.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 208143
      },
      "rarity": "common"
    },
    {
      "id": "wash",
      "name": "Wash",
      "alt_names": [
        "ウォッシュ",
        "No.8 Pro Hero",
        "Laundry Hero",
        "洗濯ヒーロー ウォッシュ",
        "Sentaku Hero Wash"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b208144-BwZoSlJ8pY7R.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 208144
      },
      "rarity": "common"
    },
    {
      "id": "kousei-tsuburaba",
      "name": "Kousei Tsuburaba",
      "alt_names": [
        "円場硬成"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7\")\n__Affiliation:__ U.A High\n__Quirk:__ Solid Air\n\nKousei is a very enthusiastic and competitive individual who holds himself to a high standard as he makes an effort to avoid descending to the level of his rivals.",
      "metadata": {
        "gender": "male",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b208145-rhjugCBvoHTy.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 208145
      },
      "rarity": "common"
    },
    {
      "id": "manga-fukidashi",
      "name": "Manga Fukidashi",
      "alt_names": [
        "吹出漫我",
        "Comicman"
      ],
      "role": "supporting",
      "description": "Manga appears to be an expressive and dramatic person.\nHe is a regular man with a white speech bubble head that can change shape and display his thoughts in written form.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b208146-uw5gH77lCt5r.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 208146
      },
      "rarity": "common"
    },
    {
      "id": "yosetsu-awase",
      "name": "Yosetsu Awase",
      "alt_names": [
        "泡瀬洋雪",
        "Welder"
      ],
      "role": "supporting",
      "description": "Although he is not as social as some others, Yosetsu is foul-mouthed and tense, except for serious or life-or-death situations, in which he becomes very easily startled and much more talkative, although he retains his harsh way of speech.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b208147-FyOhOQmU1bNs.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 208147
      },
      "rarity": "common"
    },
    {
      "id": "hiryu-rin",
      "name": "Hiryu Rin",
      "alt_names": [
        "鱗飛竜",
        "Fortune Dragon",
        "Dragon Shroud"
      ],
      "role": "supporting",
      "description": "**Height:** 170 cm (5'7\")\n__Quirk:__ Scales\n\nHe is a Class 1-B student in U.A. High School, training to become a Pro Hero. It's notable that Hiryu possesses a serious demeanor when it comes to playing out his abilities into action. He is rather diligent in terms of academic abilities and Quirk functions as well. Hiryu has shown to be a very competent combatant, with a great handle on the applications of his Quirk. Thanks to the versatile nature of his Scales Quirk, Hiryu excels in both close and long-range combat, effectively switching between hand-to-hand combat, and shooting off his scales when it’s most convenient to him.",
      "metadata": {
        "gender": "male",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b208148-arAF2trr3C2J.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 208148
      },
      "rarity": "common"
    },
    {
      "id": "reiko-yanagi",
      "name": "Reiko Yanagi",
      "alt_names": [
        "柳レイ子",
        "Emily"
      ],
      "role": "supporting",
      "description": "Reiko is a quiet and emotionless teenager who often shows an odd body posture.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b208149-QVPxOrT9CjDR.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 208149
      },
      "rarity": "common"
    },
    {
      "id": "kojiro-bondo",
      "name": "Kojiro Bondo",
      "alt_names": [
        "凡戸固次郎",
        "Plamo"
      ],
      "role": "supporting",
      "description": "An easy going guy and described as a gentle giant.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b208150-YjTVkA257Eva.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 208150
      },
      "rarity": "common"
    },
    {
      "id": "melissa-shield",
      "name": "Melissa Shield",
      "alt_names": [
        "メリッサ・シールド"
      ],
      "role": "supporting",
      "description": "Melissa is a Quirkless girl and the daughter of Scientist David Shield.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125951-KagCLf5hOmeZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125951
      },
      "rarity": "common"
    },
    {
      "id": "shikkui-makabe",
      "name": "Shikkui Makabe",
      "alt_names": [
        "真壁漆喰",
        "Mr. Smith"
      ],
      "role": "supporting",
      "description": "__Height:__ 180cm\n__Quirk:__ Stiffening\n\nSecond year student at Ketsubutsu Academy, his quirk, 'stiffening', allows him to harden objects with his hands by rubbing or kneading them",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130942-7UyQibpAsRU4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130942
      },
      "rarity": "common"
    },
    {
      "id": "itejirou-touteki",
      "name": "Itejirou Touteki",
      "alt_names": [
        "投擲射手次郎",
        "Boomerang Man"
      ],
      "role": "supporting",
      "description": "__Height:__ 171cm\n__Affiliation:__ Ketsubutsu Academy\n__Quirk:__ Boomerang\n\nA second year student at Ketsubutsu Academy. His Quirk, \"Boomerang,\" allows him to plan the trajectory of any given object he can throw, including underground.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131154-vGR8QFW5zzMR.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131154
      },
      "rarity": "common"
    },
    {
      "id": "seiji-shishikura",
      "name": "Seiji Shishikura",
      "alt_names": [
        "肉倉精児",
        "Meat (ニク)"
      ],
      "role": "supporting",
      "description": "A second year student at Shiketsu High. His Quirk, \"Meatball,\" allows him to roll all living flesh up into meatballs, as well as manipulate his own flesh to his liking. He can remotely control his own flesh after detaching it.",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131155-LWzwOM3EDEfP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131155
      },
      "rarity": "common"
    },
    {
      "id": "tatami-nakagame",
      "name": "Tatami Nakagame",
      "alt_names": [
        "中瓶畳"
      ],
      "role": "supporting",
      "description": "__Height:__ 155cm\n__Occupation:__ Student\n__Affiliation:__ Ketsubutsu Academy\n__Quirk:__ Telescopic\n\nA second year student as Ketsubutsu Academy. Her Quirk, \"Telescopic,\" allows her to fold her limbs into her body, similar to a turtle.",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131156-C44n2tTBjzWd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131156
      },
      "rarity": "common"
    },
    {
      "id": "inko-midoriya",
      "name": "Inko Midoriya",
      "alt_names": [
        "绿谷引子",
        "緑谷インコ"
      ],
      "role": "supporting",
      "description": "__Height:__ 160 cm (5'3'')\n\nIzuku Midoriya's mother. Her quirk allows her to pull small objects towards her.",
      "metadata": {
        "gender": "female",
        "age": "41-42",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b136897-PGSMkwM1Nh4r.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 136897
      },
      "rarity": "common"
    },
    {
      "id": "juuzou-moashi",
      "name": "Juuzou Moashi",
      "alt_names": [
        "百足従造",
        "Juzo Moashi",
        "Centipeder "
      ],
      "role": "supporting",
      "description": "__Quirk:__ Centipede: Juuzou's Quirk grants him long, centipede-like limbs, which he can use to attack or restrain enemies from afar.\n\nMoashi is a sidekick affiliated with Sir Nighteye's Hero Office. Juuzou is a gentleman and a very well mannered person",
      "metadata": {
        "gender": "male",
        "age": "35",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145290-f8YmIdnxCW3i.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145290
      },
      "rarity": "common"
    },
    {
      "id": "ryuuko-tatsuma",
      "name": "Ryuuko Tatsuma",
      "alt_names": [
        "竜間龍子",
        "Ryuko Tatsuma",
        "Dragoon Hero: Ryuukyuu",
        "Ryuukyu (リューキュ)"
      ],
      "role": "supporting",
      "description": "When she activates her Quirk, her body transforms into that of a large, winged dragon with pale gray scales, although she still has the same skin tone, hair and eyes, and her hero costume remains visible bar her boots.",
      "metadata": {
        "gender": "female",
        "age": "26",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145291-KOA58Q8fz0Xm.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145291
      },
      "rarity": "common"
    },
    {
      "id": "ken-takagi",
      "name": "Ken Takagi",
      "alt_names": [
        "高木鍵",
        "Rock Lock"
      ],
      "role": "supporting",
      "description": "Quirk: Lock Down:/Ken can immobilize anything not living, locking it into a particular place. However, it can be overwhelmed by force and cannot apply to large areas.\n\nKen is a man of average height, with a darker complexion and dark, curly hair. He has pierced ears with padlocks in them. Notably, his fingertips have protrusions that resemble key teeth.\nPart of his hero costume is a small white mask that covers his eyes. He wears a necklace around his neck with five keys dangling from it. Rock Lock wears a two-colored, short-sleeved shirt with a black section and a white print on it, resembling a keyhole. He wears two light-colored shoulder pads with a dark keyhole shape on both of them.",
      "metadata": {
        "gender": "male",
        "age": "32",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145292-O537lBEdSXu7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145292
      },
      "rarity": "common"
    },
    {
      "id": "ectoplasm",
      "name": "Ectoplasm",
      "alt_names": [
        "エクトプラズム"
      ],
      "role": "supporting",
      "description": "__Height:__ 180 cm (5' 11\")\n__Affiliation:__ Yuuei\n__Quirk:__ Clones\n\nEctoplasm has the ability to produce ectoplasm from his mouth and transform it into clones of himself. He can create up to thirty clones at once, and push his limit to thirty-six if he's feeling good. He can also produce a giant clone of himself, although this sacrifices his ability to produce normal-sized ones for the time being. His clones can be defeated with a strong blow, but otherwise, only Ectoplasm can dispel them.",
      "metadata": {
        "gender": "male",
        "age": "41-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b150853-M4TpbJKGrVpJ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 150853
      },
      "rarity": "common"
    },
    {
      "id": "high-end",
      "name": "High End",
      "alt_names": [
        "ハイエンド",
        "Hood",
        "Nomu"
      ],
      "role": "supporting",
      "description": "__Affiliation:__ League of Villains\n\nHigh End Nomu was an intelligent Nomu created and is shown to be obedient to its master. They were one of the main antagonists in the Pro Hero Arc.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b165314-NOqlwdHM1JV4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 165314
      },
      "rarity": "common"
    },
    {
      "id": "lunch-rush",
      "name": "Lunch Rush",
      "alt_names": [
        "ランチラッシュ",
        "Cook Hero (クックヒーロー)"
      ],
      "role": "supporting",
      "description": "Lunch Rush is a Pro Hero and the Chef at the cafeteria of U.A. High School. He is known for his good cooking.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b191595-fx33bsx87wdn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 191595
      },
      "rarity": "common"
    },
    {
      "id": "snipe",
      "name": "Snipe",
      "alt_names": [
        "スナイプ"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Homing\n\nSnipe is a Pro Hero and a member of the teaching staff at U.A. High School. Snipe has the appearance of a stereotypical western cowboy\n\nSnipe's Quirk allows him to lock on to any target he can see within six hundred meters and make any projectile he releases chase after said target",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b191596-DnTHoaO7huTU.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 191596
      },
      "rarity": "common"
    },
    {
      "id": "higari-maijima",
      "name": "Higari Maijima",
      "alt_names": [
        "埋島干狩",
        "Excavation Hero",
        "Power Loader (パワーローダー)"
      ],
      "role": "supporting",
      "description": "Higari Maijima, also known as the Excavation Hero: Power Loader, is a Pro Hero and faculty member at U.A. High School.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b191597-3okHoV3FlDsb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 191597
      },
      "rarity": "common"
    },
    {
      "id": "masaki-mizushima",
      "name": "Masaki Mizushima",
      "alt_names": [
        "水島正規",
        "Manual",
        "Normal Hero"
      ],
      "role": "supporting",
      "description": "__Height:__ 176 cm\n__Occupation:__ Pro Hero\n\nMasaki Mizushima, also known as Normal Hero: Manuais, is the current No. 222 Pro Hero. He is based out of Hosu City.",
      "metadata": {
        "gender": "male",
        "age": "28-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b210091-jNfrkPuPfB67.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 210091
      },
      "rarity": "common"
    },
    {
      "id": "uwabami",
      "name": "Uwabami",
      "alt_names": [
        "ウワバミ",
        "Snake Hero"
      ],
      "role": "supporting",
      "description": "Uwabami is a Pro Hero.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b210092-4mFHYOy8SHNX.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 210092
      },
      "rarity": "common"
    },
    {
      "id": "yoichi-shigaraki",
      "name": "Yoichi Shigaraki",
      "alt_names": [
        "死柄木与一",
        "First User of One For All (初代ワン・フォー・オール)"
      ],
      "role": "supporting",
      "description": "All For One's younger brother.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b216391-gyax19uRymKT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 216391
      },
      "rarity": "common"
    },
    {
      "id": "kaina-tsutsumi",
      "name": "Kaina Tsutsumi",
      "alt_names": [
        "筒美火伊那",
        "Lady Nagant (レディ・ナガン)"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Rifle\n\nA villain who used to be a Pro Hero.\n\nKaina Tsutsumi can protrude and retract a rifle from her right elbow, which she can fire bullets out of with a range of 3 kilometers. She can create and use different types of bullets by mixing and molding her hair, such as hollow-point bullets and curving bullets.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b225724-5rFhG41RpHF2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 225724
      },
      "rarity": "common"
    },
    {
      "id": "daigorou-banjou",
      "name": "Daigorou Banjou",
      "alt_names": [
        "万縄大悟郎",
        "Lariat (ラリアット)"
      ],
      "role": "supporting",
      "description": "__Occupation:__ Pro Hero\n__Quirk:__ Blackwhip; One For All (formerly)\n\nThe 5th user of One For All whose natural Quirk was Blackwhip. His Quirk allowed him to create tendrils of black energy from his arms, excellent for grappling and increasing his mobility.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b229296-pIjoGB7hiKiw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 229296
      },
      "rarity": "common"
    },
    {
      "id": "masaru-bakugou",
      "name": "Masaru Bakugou",
      "alt_names": [
        "爆豪勝",
        "Masaru Bakugo"
      ],
      "role": "supporting",
      "description": "Masaru Bakugou is Katsuki Bakugou's father and the husband of Mitsuki Bakugou.",
      "metadata": {
        "gender": "male",
        "age": "42",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b231956-wML2lO5iEhgP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 231956
      },
      "rarity": "common"
    },
    {
      "id": "mitsuki-bakugou",
      "name": "Mitsuki Bakugou",
      "alt_names": [
        "爆豪光己",
        "Mitsuki Bakugo",
        "Katsuki no Haha (勝己の母)"
      ],
      "role": "supporting",
      "description": "Mitsuki Bakugou is Katsuki Bakugou's mother and the wife of Masaru Bakugou.",
      "metadata": {
        "gender": "female",
        "age": "38",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b231957-eDwjjTpit6Tn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 231957
      },
      "rarity": "common"
    },
    {
      "id": "kenji-tsuragamae",
      "name": "Kenji Tsuragamae",
      "alt_names": [
        "面構犬嗣"
      ],
      "role": "supporting",
      "description": "Kenji is the Chief of the Police Force.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b239975-0CzqybxRR25T.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 239975
      },
      "rarity": "common"
    },
    {
      "id": "native",
      "name": "Native",
      "alt_names": [
        "ネイティブ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b239976-3Htiud2mIsvn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 239976
      },
      "rarity": "common"
    },
    {
      "id": "kyoutoku-jirou",
      "name": "Kyoutoku Jirou",
      "alt_names": [
        "耳郎響徳"
      ],
      "role": "supporting",
      "description": "Kyotoku Jiro is Kyoka Jiro's father.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b239977-XSROyVpw0lt3.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 239977
      },
      "rarity": "common"
    },
    {
      "id": "sludge-villain",
      "name": "Sludge Villain",
      "alt_names": [
        "ヘドロ・ヴィラン"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b241581-imr1QlTDzwV8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 241581
      },
      "rarity": "common"
    },
    {
      "id": "sansa-tamakawa",
      "name": "Sansa Tamakawa",
      "alt_names": [
        "玉川三茶"
      ],
      "role": "supporting",
      "description": "Sansa is a member in the Police Force.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b241582-CMduR6cxiMX5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 241582
      },
      "rarity": "common"
    },
    {
      "id": "aorio-kuraishisu",
      "name": "Aorio Kuraishisu",
      "alt_names": [
        "暗指数煽雄"
      ],
      "role": "supporting",
      "description": "Aorio Kuraishisu is a Hero Expert.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b242342-PoJNd1AfE81u.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 242342
      },
      "rarity": "common"
    },
    {
      "id": "cider-house-leader",
      "name": "Cider House Leader",
      "alt_names": [
        "サイダーハウスリーダー"
      ],
      "role": "supporting",
      "description": "The leader of a gang of pickpockets who operated mainly during the holiday season, having studied the patterns and routes of hero and civilian activity in a specific street for a whole month, with the intent of maximizing profits from their looted items while facing minimal resistance.\n\nHe possesses a Quirk that allows him to control carbonated water. He also has connections with the black market, having acquired a pair of gauntlets provided by Detnerat that could convert his water blasts into gatling shots.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b242725-GKTUEP5OJRWG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 242725
      },
      "rarity": "common"
    },
    {
      "id": "kotarou-shimura",
      "name": "Kotarou Shimura",
      "alt_names": [
        "志村弧太朗"
      ],
      "role": "supporting",
      "description": "Kotarou Shimura was the father of [Tenko](https://anilist.co/character/89226/Tomura-Shigaraki) and Hana Shimura and the son of [Nana Shimura](https://anilist.co/character/126319/Nana-Shimura).",
      "metadata": {
        "gender": "male",
        "age": "32",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b251812-si4wvCG5A3o4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 251812
      },
      "rarity": "common"
    },
    {
      "id": "cathleen-bate",
      "name": "Cathleen Bate",
      "alt_names": [
        "キャスリーン・ベイト",
        "Star and Stripe (スターアンドストライプ)",
        "Cassie (キャシー)"
      ],
      "role": "supporting",
      "description": "__Height:__ 193 cm\n__Quirk:__ New Order\n\nThe current No. 1 Pro Hero of the United States of America. She is stated to be the strongest woman in the whole world. Cathleen's Quirk allows her to set a rule onto her surroundings, allowing her to manipulate and bestow new properties onto herself and the world around her. In order to activate her Quirk, she has to first make physical contact with the target and speak its name, then explains the rule she wishes to impose. She could only impose two rules at any given time.",
      "metadata": {
        "gender": "female",
        "age": "42",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b254809-vQXZtYhNZqqb.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 254809
      },
      "rarity": "common"
    },
    {
      "id": "shishido",
      "name": "Shishido",
      "alt_names": [
        "シシド",
        "Lion Hero"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Unknown Lion Quirk\n__Occupation:__ Pro Hero\n\nCurrent No. 13 Pro Hero",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b278638-HvsObiGge2aC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 278638
      },
      "rarity": "common"
    },
    {
      "id": "onima",
      "name": "Onima",
      "alt_names": [
        "オニマー"
      ],
      "role": "supporting",
      "description": "One of the many sidekicks who work at Endeavor's Agency.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b279793-Sx6KUdCAMLWM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 279793
      },
      "rarity": "common"
    },
    {
      "id": "untenmaru-kurumada",
      "name": "Untenmaru Kurumada",
      "alt_names": [
        "車田運天丸"
      ],
      "role": "supporting",
      "description": "Endeavor's chauffeur.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b279794-NSsbLQ5Zy1Cd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 279794
      },
      "rarity": "common"
    },
    {
      "id": "kidou",
      "name": "Kidou",
      "alt_names": [
        "キドウ"
      ],
      "role": "supporting",
      "description": "__Occupation:__ Pro Hero (Sidekick)\n__Affiliation:__ Endeavor Agency (Team Flaming Sidekickers)\n__Quirk:__ Traject\n\nOne of many sidekicks who works at Endeavor's Agency. His Quirk allows him to manipulate the trajectory of anything that passes through his bandages.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b279795-WMq73B1d4lEd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 279795
      },
      "rarity": "common"
    },
    {
      "id": "crust",
      "name": "Crust",
      "alt_names": [
        "クラスト",
        "Shield Hero Crust (シールドヒーロー クラスト)",
        "Kurasuto"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Shield\n__Occupation:__ Pro Hero (No.6)\n__Fighting Style:__ Close-ranged combat",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b289314-BBr8wZSw4nQI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 289314
      },
      "rarity": "common"
    },
    {
      "id": "hana-shimura",
      "name": "Hana Shimura",
      "alt_names": [
        "志村華"
      ],
      "role": "supporting",
      "description": "Hana was the older sister of [Tenko Shimura](https://anilist.co/character/89226/Tomura-Shigaraki) and granddaughter of [Nana Shimura](https://anilist.co/character/126319/Nana-Shimura). ~!She was killed by her brother when his Quirk went out of control!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b290001-42PFd1Y5cuvd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 290001
      },
      "rarity": "common"
    },
    {
      "id": "nao-shimura",
      "name": "Nao Shimura",
      "alt_names": [
        "志村直"
      ],
      "role": "supporting",
      "description": "Nao was the wife of [Kotarou Shimura](https://anilist.co/character/251812/Kotarou-Shimura) and the mother of their two children, [Tenko](https://anilist.co/character/89226/Tomura-Shigaraki) and [Hana](https://anilist.co/character/290001/Hana-Shimura). ~!She died when her son's Quirk went out of control.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b290002-rjvuYKreflYq.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 290002
      },
      "rarity": "common"
    },
    {
      "id": "mika-jirou",
      "name": "Mika Jirou",
      "alt_names": [
        "耳郎実徳"
      ],
      "role": "supporting",
      "description": "The mother of Kyoka Jiro.",
      "metadata": {
        "gender": "female",
        "age": "36",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b290632-6b2N8GUa6FaQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 290632
      },
      "rarity": "common"
    },
    {
      "id": "enma-kannagi",
      "name": "Enma Kannagi",
      "alt_names": [
        "巫円真",
        "かんなぎえんま",
        "Majestic (マジェスティック)",
        "Magic Hero (魔法ヒーロー)"
      ],
      "role": "supporting",
      "description": "__Height:__ 183 cm\n__Occupation:__ Pro Hero\n__Fighting Style:__ Long Range Support\n__Quirk:__ Magic\n\nPro Hero. During U.A. High School's Work Studies II, he takes in [Creati](https://anilist.co/character/89241) and [Lizardy](https://anilist.co/character/149179). He is one of the heroes assigned to the Villa Raid Team led by Edgeshot.",
      "metadata": {
        "gender": "male",
        "age": "36",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b291616-riQTNwXt6DYF.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 291616
      },
      "rarity": "common"
    },
    {
      "id": "hero-kouan-iinkai-kaichou",
      "name": "Hero Kouan Iinkai Kaichou",
      "alt_names": [
        "ヒーロー公安委員会会長",
        "Hero Public Safety Commission Chairman",
        "Madam President"
      ],
      "role": "supporting",
      "description": "Head of the Hero Public Safety Commission which is in charge of the Hero Association in Japan. She tasked [Hawks](https://anilist.co/character/128299) to infiltrate the League of Villains in order to gather intel on the group and learn more on their current agenda.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b296084-BXNwe3UApoSj.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 296084
      },
      "rarity": "common"
    },
    {
      "id": "hawks-no-chichi",
      "name": "Hawks no Chichi",
      "alt_names": [
        "ホークスの父",
        "Hawk's Father",
        "Takami"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b297172-nWyJRA5FNdM8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 297172
      },
      "rarity": "common"
    },
    {
      "id": "tomie-takami",
      "name": "Tomie Takami",
      "alt_names": [
        "鷹見遠見絵",
        "Hawks no Haha (ホークスの母)",
        "Hawk's Mother",
        "Tomie Ukai"
      ],
      "role": "supporting",
      "description": "Mother of [Keigo Takami](https://anilist.co/character/128299).",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b297173-Nx56We2El4m8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 297173
      },
      "rarity": "common"
    },
    {
      "id": "yoroi-musha",
      "name": "Yoroi Musha",
      "alt_names": [
        "ヨロイムシャ",
        "Equipped Hero"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Unknown\n__Occupation:__ Pro Hero ~!(Retired)!~\n\nNo. 9 Pro Hero. ~!He retired due to the high backlash against Heroes following the Paranormal Liberation War.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b297175-yhO2BUnCF6wX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 297175
      },
      "rarity": "common"
    },
    {
      "id": "hikage-shinomori",
      "name": "Hikage Shinomori",
      "alt_names": [
        "四ノ森避影",
        "しのもりひかげ"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Danger Sense; ~!One For All (formerly)!~\n\nHikage Shinomori was a valiant and noble man who was determined to defeat [All For One](https://anilist.co/character/125956). His Quirk, Danger Sense, allowed him to sense incoming threats in the surrounding area, giving him ample opportunity to react. ~!He was the fourth user of the One For All Quirk.!~",
      "metadata": {
        "gender": "male",
        "age": "40",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b297937-3BYVnca3G4Mx.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 297937
      },
      "rarity": "common"
    },
    {
      "id": "en-tayutai",
      "name": "En Tayutai",
      "alt_names": [
        "揺蕩井煙",
        "エン",
        "ガエン",
        "Smoke-Eater"
      ],
      "role": "supporting",
      "description": "__Quirk:__ Smokescreen; ~!One For All (formerly)!~\n\nEn is a former Pro Hero. His Quirk, Smokescreen, allowed him to generate clouds of smoke which could obscure vision. ~!He was the sixth user of the One For All Quirk.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b297940-QnyDtxL1CiVV.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 297940
      },
      "rarity": "common"
    },
    {
      "id": "ippan-josei",
      "name": "Ippan Josei",
      "alt_names": [
        "一般女性",
        "Ordinary Woman"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b299021-xrydg16JR4s0.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 299021
      },
      "rarity": "common"
    },
    {
      "id": "bruce-lee",
      "name": "Bruce Lee",
      "alt_names": [
        "ブルース・リー",
        "Sandaime One For All (三代目ワン・フォー・オール)",
        "Third Generation One For All User"
      ],
      "role": "supporting",
      "description": "__Quirk:__ ~!Fa Jin; One For All (formerly)!~\n\nThe Third user of the One For All Quirk. He was part of the resistance fighting against All For One, alongside the second user. ~!Fa Jin, the Quirk he was born with, allows the user to build up kinetic energy by repeating regular motions and store it for later use. When the user chooses to release the energy, they gain an explosive burst of speed and power.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b299022-qjIyPvwRfvk1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 299022
      },
      "rarity": "common"
    },
    {
      "id": "toshigtsugu-kudou",
      "name": "Toshigtsugu Kudou",
      "alt_names": [
        "駆藤敏次",
        "Nidaime One For All (二代目ワン・フォー・オール)",
        "Second Generation One For All User"
      ],
      "role": "supporting",
      "description": "__Quirk:__ ~!Gearshift; One For All (formerly)!~\n\nThe Second user of the One For All Quirk. He was the leader of a resistance movement who fought against All For One during the peak of his power. ~!Gearshift, the Quirk he was born with, allows the user to change the speed at which things accelerate through space. It is even capable of changing speeds while ignoring the laws of inertia.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b299023-lfzPGDlX0B7Y.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 299023
      },
      "rarity": "common"
    },
    {
      "id": "aoyama-no-chichi",
      "name": "Aoyama no Chichi",
      "alt_names": [
        "青山の父親",
        "Aoyama's Father"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b327991-mOq8L7d4huTA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 327991
      },
      "rarity": "common"
    },
    {
      "id": "ethan-drive",
      "name": "Ethan Drive",
      "alt_names": [
        "イーサン・ドライブ",
        "Bravo Leader"
      ],
      "role": "supporting",
      "description": "__Height:__ 190cm (6'3\")\n\nAmerican fighter pilot, leader of his brigade, and ally of Star and Stripe. Ethan served in the U.S. Air Force as a new recruit alongside Cathleen Bate. She would eventually go on to become the Number 1 Hero in America, known as \"Star and Stripe\", with Ethan as her \"Bravo Leader\", commanding an army of air fleets to back her up. He is an expert pilot.",
      "metadata": {
        "gender": "male",
        "age": "45",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b334975-0qZV4wyTzmix.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 334975
      },
      "rarity": "common"
    },
    {
      "id": "aoyama-no-hahaoya",
      "name": "Aoyama no Hahaoya",
      "alt_names": [
        "青山の母親",
        "Aoyama's Mother"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b336096-ExQgmBoF20mT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 336096
      },
      "rarity": "common"
    },
    {
      "id": "tajima",
      "name": "Tajima",
      "alt_names": [
        "タジマ"
      ],
      "role": "supporting",
      "description": "One of several undercover spies sent by All For One to infiltrate U.A. High School.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b337142-0xSCzz6w4Kfd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 337142
      },
      "rarity": "common"
    },
    {
      "id": "kunieda",
      "name": "Kunieda",
      "alt_names": [
        "クニエダ"
      ],
      "role": "supporting",
      "description": "Villain who was imprisoned in Tartarus for mass murder and corpse collecting. He escaped due to a prison riot caused by All For One before joining the latter's forces. He is known to collect those he kills and use their corpses as fertilizer for his Plant Quirk.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b339121-L4Vb8BjeAOrs.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 339121
      },
      "rarity": "common"
    },
    {
      "id": "yuuyu-haya",
      "name": "Yuuyu Haya",
      "alt_names": [
        "甲矢有弓"
      ],
      "role": "supporting",
      "description": "__Height:__ 160 cm\n\nThird-year student in U.A. High School's Hero Course. She has an unnamed Electric Arrow quirk.",
      "metadata": {
        "gender": "female",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b340706-P2UHkU32Waaz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 340706
      },
      "rarity": "common"
    },
    {
      "id": "fuutou-nahashira",
      "name": "Fuutou Nahashira",
      "alt_names": [
        "永白風統",
        "ながしら ふうとう"
      ],
      "role": "supporting",
      "description": "Student in U.A. High School's Business Course. Strongly influenced by Best Jeanist.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b340707-zigDgjR8Dg0K.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 340707
      },
      "rarity": "common"
    },
    {
      "id": "maina-furasu",
      "name": "Maina Furasu",
      "alt_names": [
        "普良巢舞奈",
        "ふらす まいな"
      ],
      "role": "supporting",
      "description": "Student of U.A. High School's Support Course from Class 1-H. She is classmates with Mei Hatsume.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b340808-96fjLEPy4F54.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 340808
      },
      "rarity": "common"
    },
    {
      "id": "komari-ikoma",
      "name": "Komari Ikoma",
      "alt_names": [
        "生駒小麿里"
      ],
      "role": "supporting",
      "description": "__Height:__ 157cm\n\nSchool teacher at Masegaki Primary School. Komari is often exasperated by her students' near-constant rude antics, and describes them as being \"problem children\". She is very distressed, nearly to the point of crying, when they constantly ignore her instructions. However, after seeing her students behaving differently at the Provisional Hero License Course, she was inspired to not give up.",
      "metadata": {
        "gender": "female",
        "age": "23-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b343424-KUqIkVmV82hX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 343424
      },
      "rarity": "common"
    },
    {
      "id": "tamashiro",
      "name": "Tamashiro",
      "alt_names": [
        "玉城",
        "たましろ"
      ],
      "role": "supporting",
      "description": "Student from Masegaki Primary School.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b343425-HhLYFR8CU96V.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 343425
      },
      "rarity": "common"
    },
    {
      "id": "meryl",
      "name": "Meryl",
      "alt_names": [
        "メリル"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b344470-awKtoM9SIO0K.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 344470
      },
      "rarity": "common"
    },
    {
      "id": "ronaudo-keage",
      "name": "Ronaudo Keage",
      "alt_names": [
        "蹴上露今努"
      ],
      "role": "supporting",
      "description": "Student of U.A. High School's Business Course.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b345443-7IL1P1K7MFjo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 345443
      },
      "rarity": "common"
    },
    {
      "id": "josei-kisha",
      "name": "Josei Kisha",
      "alt_names": [
        "女性記者",
        "Female Reporter"
      ],
      "role": "supporting",
      "description": "Television news reporter.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b345848-ypooTJN8XdfQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 345848
      },
      "rarity": "common"
    },
    {
      "id": "ua-robo",
      "name": "U.A. Robo",
      "alt_names": [
        "雄英ロボ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b346430-TrAaqg5Hn9H0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 346430
      },
      "rarity": "common"
    },
    {
      "id": "kouki-terumoto",
      "name": "Kouki Terumoto",
      "alt_names": [
        "照元光輝"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b381625-jDPmwTOKMpw0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 381625
      },
      "rarity": "common"
    },
    {
      "id": "dai",
      "name": "Dai",
      "alt_names": [
        "ダイ"
      ],
      "role": "supporting",
      "description": "Middle school student who desires to become a Pro Hero.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b382394-DDyAaAoF5rj9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 382394
      },
      "rarity": "common"
    },
    {
      "id": "oboro-shirakumo",
      "name": "Oboro Shirakumo",
      "alt_names": [
        "白雲朧",
        "Loud Cloud"
      ],
      "role": "minor",
      "description": "Oboro was a man of average stature with light, wavy hair that was swept back to flow upwards above his head, two shorter, ear-length tufts left hanging downwards to frame his face. He usually wore an expression of excitement, possessing a large, teeth-bearing grin and semicircular, inward-tilting eyes that were often squeezed shut.\n\nQuirk: **Cloud** (he is capable of moving through the air by creating clouds and riding on them.)\n\n(Source: My Hero Academia Wikia)",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b148982-ZJFhlJl9somG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 148982
      },
      "rarity": "common"
    },
    {
      "id": "shiina",
      "name": "Shiina",
      "alt_names": [
        "椎名",
        "Director"
      ],
      "role": "minor",
      "description": "The owner and director of the Oumagadoki Zoo. He is very tall and has the face of a rabbit. He was a human who was cursed by a magical rabbit. He now runs his zoo filling it with magical animals he finds, because if he finds enough of them, he can use their magic power to reverse the curse laid on him. Though not always the easiest to get along with, he sees the animals not as what they are, but rather as comrades.    Shiina is mostly known as the lunatic rabbit with no feelings for another, only when one of his friends are in danger. He shows his true love for animals when one of his friends is getting hurt or kidnapped most of the times or went in the trouble. Shiina doesn&#039;t listen to anyone, only to himself. Somehow his original body shows whenever he saves someone that is too close to him, which shows that the Ghost Rabbit gives him hints away to understand that, but he&#039;s a complete idiot that doesn&#039;t understand most of the things. In his childhood he was doing nonsense that causes him only trouble.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b30854-5zWAjnM9fkH9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30854
      },
      "rarity": "common"
    },
    {
      "id": "astro",
      "name": "Astro",
      "alt_names": [
        "アストロ"
      ],
      "role": "minor",
      "description": "__Height:__ 5'1\"\n\nHe is a small, young man with wild blue hair and a fierce expression befitting his personality. Astro is a courageous young man of great determination and ambition who cares deeply about his friends and adoptive family. Having grown up without a family, he considers having a family to be very important and that families should get along no matter how unlikable one of their members are. He values his adoptive family more than anything and cannot stand to see orphans abandoned on the street and adopts every orphaned child he comes across and raises them as his siblings, doing the best he can to give them the life they deserve. He is also heroic and brave in nature and cannot stand idly by while others get hurt and will often recklessly leap into battle to take down foes. He can also be stubborn or childish at times and does not like taking orders from adults and will make certain mistakes. He also dislikes to show his more sensitive side and tends to hide his tears when around his family.",
      "metadata": {
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/63195.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 63195
      },
      "rarity": "common"
    },
    {
      "id": "backdraft",
      "name": "Backdraft",
      "alt_names": [
        "バックドラフト"
      ],
      "role": "minor",
      "description": "Backdraft is a pro hero. His quirk, Hydrokinesis, allows him to create and manipulate water through spigots that he has in place of hands. He is affiliated with Musutafu Fire Department",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b283096-Q2ax4fM1lJuo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 283096
      },
      "rarity": "common"
    },
    {
      "id": "wedge",
      "name": "Wedge",
      "alt_names": [
        "ウェッジ"
      ],
      "role": "minor",
      "description": "One of the fighter jet pilots loyal to [Star and Stripe](https://anilist.co/character/254809), accompanying her on her flight to Japan.\n\n**His name is a reference to the Star Wars character Wedge Antilles, a renowned starfighter pilot.*",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b301303-Tb2ie5hKaJNU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 301303
      },
      "rarity": "common"
    },
    {
      "id": "kouichi-haimawari",
      "name": "Kouichi Haimawari",
      "alt_names": [
        "灰廻航一",
        "The Crawler",
        "The Hauler",
        "The Cruller",
        "Nice Guy"
      ],
      "role": "minor",
      "description": "__Height:__ 172 cm (5'8\")\n__Occupation:__ Vigilante, ~!Pro Hero Sidekick!~\n__Quirk:__ Slide and Glide (allows the user to project a repulsive force from their hands and feet)\n\nKoichi has an easy-going, mild-mannered personality. He is very generous and does not seem to expect anything from other people in return. He dreams of being able to become a recognized hero and is shown to enjoy the vigilante work that he does. He is very willing to do the less glamorous jobs, such as cleaning up trash and does not seem to think that these are negative aspects of being a hero or vigilante. \n\nHis costume consists of his regular clothes in conjunction with an All Might-haired hooded jacket, a black mask covering his face, red sunglasses, and protective bike gear.\n\nUnbeknownst to Koichi, he and Kazuho share a history. Koichi had once saved Kazuho when she fell into a river. He would give the drenched Kazuho his limited edition All Might hoodie and run off to his entrance exam for a high school that specialized in superheroics. Because he chose to save her, Koichi ended up missing the exam and returning to his hometown.\n\n~!After his battle against Number 6, he now possesses a scar on his left cheek, which he received from the villain shortly before his death. As \"The Skycrawler\", his hero costume is a blue full-body suit, akin to his traditional All Might hoodies and Number 6's \"O'Clock II\" costume, an updated version of his original gloves, and silver armored shoulder pads, also bearing a resemblance to Number 6's costume. He also wears a purple visor that resembles Captain Celebrity's, and has a utility belt over his waist with an \"SC\" on it.!~\n\n(Source: Wikia)",
      "metadata": {
        "gender": "male",
        "age": "19 (First appearance), 23 (Current)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126087-Etax9gdag1rl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126087
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-23T14:33:17.950Z"
}