{
  "work_id": "my-hero-academia-two-heroes",
  "count": 15,
  "characters": [
    {
      "id": "izuku-midoriya",
      "name": "Izuku Midoriya",
      "alt_names": [
        "緑谷出久",
        "Deku (デク)"
      ],
      "role": "protagonist",
      "description": "__Height:__ 166 cm (5'5¼\")\n__Quirk:__ One For All\n\nStudent in Class 1-A at U.A High School.\n\nAlthough he was born without a Quirk, Izuku's innate heroism and strong sense of justice manages to catch the attention of the legendary hero All Might. Izuku has since become All Might's closest pupil.\n\nIzuku is a very timid, reserved, and polite boy. Although initially portrayed as insecure, tearful, and vulnerable, Izuku gradually matures into a more confident and braver person. His infectious leadership skills, combined with his passion and strategic abilities, have turned Izuku into a central figure of Class 1-A. He is caring and emotional, never hesitating to help or rescue someone in danger, even if he knows that he might not be strong or otherwise qualified enough to do it.\n\nIzuku is extremely (and sometimes scarily) enthusiastic about topics related to heroes. His dream drives him to write down notes about everything he learns about heroes' Quirks and fighting capabilities. Thanks to this practice, Izuku has developed a great analytical mind and can form complex battle plans in a few seconds, factoring in the best ways he can utilize the Quirks of allies and enemies alike for his own advantage.\n\nIzuku's Quirk \"One For All\" was transferred to him from All Might. His Quirk allows him to stockpile an enormous amount of raw power, allowing him to significantly enhance all of his physical abilities to various boundless levels. This results in unbelievable levels of strength, speed, stamina, agility, and durability. Izuku can focus the stockpiled power into a single body part, or spread it across his entire body evenly, though, focusing the power in a single part puts a greater strain on that part of his body.",
      "metadata": {
        "gender": "male",
        "age": "14-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89028-8w1I9o1ISHMg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89028
      },
      "rarity": "epic"
    },
    {
      "id": "toshinori-yagi",
      "name": "Toshinori Yagi",
      "alt_names": [
        "八木俊典",
        "All Might (オールマイト)",
        "Toshi",
        "Symbol of Peace"
      ],
      "role": "protagonist",
      "description": "__Height:__ 220 cm (7'2\")\n__Quirk:__ One for All\n\nAll Might is the No. 1 Hero and the \"Symbol of Peace.\"\n\nIn his hero form, All Might is a very tall and over-muscular man whose design resembles the american hero comics. His hair spikes on top of his head and his whole body has more shadows than a normal human being.\n\nHowever, in his true form, he is an overly-skinny man who spits a lot of blood out of his mouth and his clothes appear loose.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89224-K6KEuQAuYKzq.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89224
      },
      "rarity": "epic"
    },
    {
      "id": "melissa-shield",
      "name": "Melissa Shield",
      "alt_names": [
        "メリッサ・シールド"
      ],
      "role": "protagonist",
      "description": "Melissa is a Quirkless girl and the daughter of Scientist David Shield.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125951-KagCLf5hOmeZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125951
      },
      "rarity": "epic"
    },
    {
      "id": "david-shield",
      "name": "David Shield",
      "alt_names": [
        "デヴィット・シールド",
        "Dave"
      ],
      "role": "protagonist",
      "description": "David is a scientist who creates support items for heroes, and an old friend of All Might. He is the father of Melissa Shield.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125952-2Ky9KQJ3q3p7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125952
      },
      "rarity": "epic"
    },
    {
      "id": "wolfram",
      "name": "Wolfram",
      "alt_names": [
        "ウォルフラム"
      ],
      "role": "protagonist",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126277-W5jPUpGT43Vw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126277
      },
      "rarity": "epic"
    },
    {
      "id": "katsuki-bakugou",
      "name": "Katsuki Bakugou",
      "alt_names": [
        "爆豪勝己",
        "Katsuki Bakugo",
        "Kacchan (かっちゃん)"
      ],
      "role": "supporting",
      "description": "__Height:__ 172 cm (5'7\")\n__Quirk:__ Explosion\n\nStudent in Class 1-A at U.A. High School.\n\nKatsuki is a crude, arrogant, short-tempered, and aggressive person, especially at the beginning of the series. Due to the constant praise of his abilities and powerful Quirk, Katsuki has developed a superiority complex, and because of that, he desires to be the first and best at everything. He loves to win above all else and cannot stand it when he doesn't, leading him to lose his already short temper if he achieves anything but a complete victory.\n\nKatsuki is not only very athletic and talented at fighting, but also very intelligent and extremely perceptive, capable of strategic planning and improvisation. Additionally, his grades are among the highest of his class. Katsuki also possesses surprising talent in other areas, such as cooking and music, even though he doesn't show a particular interest in them. Overall, Katsuki is considered a natural-born genius with the potential to be one of the best Pro Heroes.\n\nKatsuki's Quirk \"Explosion\" allows him to secrete nitroglycerin-like sweat from the palms of his hands and ignite it on command, allowing him to create strong explosions. The more Katsuki sweats, the stronger his explosions become. Not only can Katsuki use the explosions for attacking, he can also use them to propel himself and navigate through the air at high speeds, allowing him to fly at his opponents without giving them time to react, as well as evade incoming attacks, even while in the air. The shockwave from an explosion can even be used as a shield.",
      "metadata": {
        "gender": "male",
        "age": "14-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88892-bdOha3lNcaN6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88892
      },
      "rarity": "rare"
    },
    {
      "id": "shouto-todoroki",
      "name": "Shouto Todoroki",
      "alt_names": [
        "轟焦凍",
        "Shouto (ショート)",
        "Shoto Todoroki",
        "Half-and-Half",
        "Icy-Hot"
      ],
      "role": "supporting",
      "description": "__Height:__ 176 cm (5'9\") \n__Affiliation:__ U.A. High School\n__Quirk:__ Half-Cold Half-Hot\n\nStudent in Class 1-A at U.A. High School, where he got in through official recommendations. He is the youngest son of the top hero Endeavor.\n\nShouto initially has a cold, aloof personality, which stemmed from his complicated family life. Focused and unemotional, Shouto preferred to keep things to himself instead of hanging out with others. After the events of the U.A. Sports Festival, however, he notably became more sociable and kinder than ever before. He even gained a sense of humor and would occasionally smile, although still retaining some fragments of his previous distant attitude and nonchalant demeanor. While usually quiet and reserved, Shouto initially possessed a moderate level of arrogance, which, combined with his solitary tendencies, sometimes made him take the initiative without considering the opinions of others.\n\nShouto's Quirk Half-Cold Half-Hot gives him the ability to generate ice from the right side of his body, and flames from his left side. Due to years of rejecting his father, Shouto has developed a habit of favoring ice, even when fire would be a better option. This grudge also caused him to have difficulty controlling his flames. If he overuses one element without utilizing the other, then his own body temperature will suffer.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89220-KNBwaVFAR8FD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89220
      },
      "rarity": "rare"
    },
    {
      "id": "ochako-uraraka",
      "name": "Ochako Uraraka",
      "alt_names": [
        "麗日お茶子",
        "Ochaco Uraraka",
        "Uravity (ウラビティ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 156 cm (5'1\")\n__Quirk:__ Zero Gravity\n\nStudent in Class 1-A at U.A. High School\n\nOchako is an outgoing, lively person who thinks about everything positively, though she is objective enough to see flaws and virtues. She gets excited over little things very easily. Ochaco has been described by other students as \"the most laidback girl\" among her class, being very bubbly and kind of an airhead at times. She is often incredibly blunt without being aware of it. She is on good terms with everyone and is particularly close friends with several class members, including Izuku, Tenya Ida, and Tsuyu.\n\nOchaco's Quirk gives her the power to manipulate gravity upon touching solid things with the pads on her fingertips. The targets lose their gravitational pull, effectively making them weightless. She is able to activate or cancel her Quirk's effects by closing her fingers together, and is shown to be careful with her hands in order to avoid accidental quirk activation.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89221-gSF2a4gPbG4m.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89221
      },
      "rarity": "rare"
    },
    {
      "id": "tenya-iida",
      "name": "Tenya Iida",
      "alt_names": [
        "飯田天哉",
        "Tenya Ida",
        "Turbo Hero: Ingenium (ターボヒーロー・インゲニウム)"
      ],
      "role": "supporting",
      "description": "__Height:__ 179 cm (5'10\")\n__Quirk:__ Engine\n\nClass representative of Class 1-A at U.A. High School\n\nTenya may look severe, but he's actually just a very serious person, who takes everything, even the most insignificant thing, seriously. A testament to his generally hyperactive and intense behavior, Tenya often exhibits plenty of peculiar tics, such as moving his arms around in strange chopping patterns or sometimes twitching his body uncontrollably. Tenya is very humble, willing to admit to his mistakes, apologize for rude behavior, and improve in areas he lacks. Being part of the highly-esteemed Ida Family of Heroes, Tenya is proud of his lineage and works hard to meet his expectations. He greatly admires his older brother, Tensei (also known as the Turbo Hero: Ingenium), and aspires to become a similar hero.\n\nTenya's Quirk Engine gives him car-like engines in each of his calves, giving him incredible running speed and extreme kicking power. Tenya needs to fuel his engines by drinking orange juice. Tenya's engines have multiple gears; it is currently unknown how many, but it has been implied that there are more than three.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89222-TL8MQM3wJgEB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89222
      },
      "rarity": "rare"
    },
    {
      "id": "tsuyu-asui",
      "name": "Tsuyu Asui",
      "alt_names": [
        "蛙吹梅雨",
        "Tsu",
        "Rainy Season Hero: Froppy (梅雨入りヒーローフロッピー)",
        "Miss Ribbit (ケロケロ)"
      ],
      "role": "supporting",
      "description": "__Affiliation:__ U.A. High School\n__Quirk:__ Frog\n\nTsuyu is a very straight-forward girl that always says what's on her mind and what she thinks about others. She prefers to be called by her first name.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89223-5762vburxnlz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89223
      },
      "rarity": "rare"
    },
    {
      "id": "momo-yaoyorozu",
      "name": "Momo Yaoyorozu",
      "alt_names": [
        "八百万百",
        "Yao-momo",
        "Everything Hero: Creati",
        "Bonbatsu Hero Creati(万物ヒーロー クリエイティ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 173 cm (5'8\")\n__Quirk:__ Creation\n\nVice class representative of Class 1-A at U.A. High School. She was admitted to the school through official recommendations. \n\nMomo is a very prudent, dedicated person who acts as a natural leader. She is generally level-headed and calm in dangerous situations, but she isn't above falling into a panic. Momo can be blunt with her comments about people's mistakes and miscalculations, tending to be very direct and wishing to help her peers improve enough to become great heroes. \n\nMomo's Quirk gives her the ability to create any non-living material/object from her exposed skin by transforming the molecular structure of her fat cells. In order to create something, she needs to understand the molecular structure of which the material/object is made.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89241-Q8KzAfX4Qe2y.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89241
      },
      "rarity": "rare"
    },
    {
      "id": "eijirou-kirishima",
      "name": "Eijirou Kirishima",
      "alt_names": [
        "切島鋭児郎",
        "Eijiro Kirishima",
        "Sturdy Hero: Red Riot",
        "Gouken Hero: Red Riot (剛健ヒーロー 烈怒頼雄斗)",
        "Ei"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7\")\n__Quirk:__ Hardening\n\nStudent in Class 1-A at U.A. High School.\n\nEijiro is a boisterous and outgoing guy with a fondness for manliness, often using the terms \"manly\" and \"unmanly\" to describe things and people he does or doesn't like, respectively. Eijiro is very honest and kind-hearted, having a straightforward way of thinking and following a specific code of chivalry that motivates him to live without regret. He is determined and selfless, bravely putting the safety of others before himself. He is also a big fan of Crimson Riot, a retro hero from whom he takes inspiration, including personal values and his hero name. Although Eijiro may not be as hot-blooded and competitive as Katsuki Bakugou, he does not shy away from comparing himself to him, with Izuku stating that the two have managed to develop a relationship between equals. As a result, Eijiro is notably one of the few people that Katsuki holds in higher esteem.\n\nEijiro's Quirk gives him the power to harden and sharpen any or all parts of his body, causing his flesh to become jagged and rock-like. There is a limit to how much damage his hardened body can withstand, which causes the Hardening itself to slowly dissipate, and Eijiro to lose stamina from struggling to keep his Quirk active.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89243-QLmUyyZk5K2l.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89243
      },
      "rarity": "rare"
    },
    {
      "id": "minoru-mineta",
      "name": "Minoru Mineta",
      "alt_names": [
        "峰田実",
        "Fresh-Picked Hero: Grape Juice "
      ],
      "role": "supporting",
      "description": "__Height:__ 108 cm (3' 6½\")\n__Quirk:__ Pop Off\n__Affiliation:__ U.A. High School\n__Fighting Style:__ Medium Ranged Support\n\nMinoru Mineta, also known as the Fresh-Picked Hero: Grape Juice, is a student in Class 1-A at U.A. High School, training to become a Pro Hero.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89244-VVwK9loDHeTV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89244
      },
      "rarity": "rare"
    },
    {
      "id": "mina-ashido",
      "name": "Mina Ashido",
      "alt_names": [
        "芦戸三奈",
        "Pinky  (ピンキー)",
        "Ridley Hero: Alien Queen"
      ],
      "role": "supporting",
      "description": "__Height:__ 159 cm (5'3\")\n__Quirk:__ Acid\n\nStudent in Class 1-A at U.A. High School.\n\nMina is a cheerful and easygoing girl who usually displays a smile. Highly social and excitable, she loves to hang out with her friends and is shown to become very upset when denied an opportunity to be at a gathering. She possesses a strong fashion sense and likes to go shopping. Due to her athleticism and energy, Mina enjoys and is very skilled at dancing. Mina is extremely courageous and is viewed as an ideal personality for hero work.\n\nMina's Quirk Acid allows her to produce a corrosive liquid from her body. She can control the solubility and viscosity of this corrosive liquid. There is a limit to how long she can produce the corrosive liquid until her skin gradually loses its natural resistance to it. Overusing her Quirk or pushing it too far can also be fatal, as it dehydrates her body very fast. Mina can use her acid offensively, but has shown utility with it as well, such as melting handholds for herself to climb with. She is also known to secrete a non-corrosive version of the acid from her feet in order to slide around.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89247-hu5MCqfoN82E.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89247
      },
      "rarity": "rare"
    },
    {
      "id": "denki-kaminari",
      "name": "Denki Kaminari",
      "alt_names": [
        "上鳴電気",
        "Stun Gun Hero: Chargebolt",
        "Stun Gun Hero: Chargezuma (スタンガンヒーロー・チャージズマ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 168 cm (5'6\")\n__Quirk:__ Electrification\n\nStudent in Class 1-A at U.A. High School.\n\nDenki is a friendly, social, and energetic boy who enjoys hanging out with others. He is rather casual when interacting with other people, including the generally unfriendly Katsuki Bakugou. \n\nDenki's Quirk Electrification allows him to store and discharge electricity. While he can also discharge this energy over a distance, Denki has little to no control over it, meaning it will go everywhere indiscriminately. Denki is also able to absorb and neutralize electricity and other lightning-based Quirks. Whenever Denki exceeds his wattage limit, he loses his ability to discharge energy, with his entire personality changing into that of a giggling idiot for a certain period until he reverts to normal. In this state, he is always giving thumbs-ups as a way to let others know that he is okay.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89249-Ygc30RlYoFta.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89249
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-25T02:08:44.919Z"
}