{
  "work_id": "wonder-egg-priority",
  "count": 15,
  "characters": [
    {
      "id": "ai-ooto",
      "name": "Ai Ooto",
      "alt_names": [
        "大戸アイ",
        "Ai Ohto"
      ],
      "role": "protagonist",
      "description": "A girl who has very distinct heterochromia and for that she's bullied at school. Due to a certain event, she is temporarily not attending school. She's a very introverted girl who spends a lot of time alone, she's very protective when it comes to people that she cares about.\n\nShe has no special power or abilities but wields a multi-colored pen which can transform into a weapon.",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b199892-IUa7rBAT4j9H.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199892
      },
      "rarity": "legendary"
    },
    {
      "id": "rika-kawai",
      "name": "Rika Kawai",
      "alt_names": [
        "川井リカ"
      ],
      "role": "protagonist",
      "description": "A girl who doesn't hesitate to say what's on her mind, even for people she has just met.",
      "metadata": {
        "gender": "female",
        "age": "14-15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b199890-9WY1MIjTsqkc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199890
      },
      "rarity": "legendary"
    },
    {
      "id": "neiru-aonuma",
      "name": "Neiru Aonuma",
      "alt_names": [
        "青沼ねいる"
      ],
      "role": "protagonist",
      "description": "A girl who has very distinct green eyes and pigtails. She is very quiet and still at most times, loves herself and makes no initiative to get to know people. On the contrary, she avoids contact with people. She confesses to [Ai](https://anilist.co/character/199892/Ai-Ohto) her goal, to save [her sister](https://anilist.co/character/260352), for whose death she feels responsible.",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b199893-KpWnNBLyKHaw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199893
      },
      "rarity": "legendary"
    },
    {
      "id": "momoe-sawaki",
      "name": "Momoe Sawaki",
      "alt_names": [
        "沢木桃恵",
        "Momotaro"
      ],
      "role": "protagonist",
      "description": "A girl who has a very distinct beauty mark and slim figure. She is often mistaken for a man, and is popular among girls.",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b199891-YNqLCCE8VAHW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199891
      },
      "rarity": "legendary"
    },
    {
      "id": "acca",
      "name": "Acca",
      "alt_names": [
        "アカ"
      ],
      "role": "supporting",
      "description": "Acca is a mannequin with black glasses and a very slight smile. His build appears to be that of an average male, although it can be hard to tell since he is covered foot to neck.\nAlthough his true motives are quite unclear for now, his purpose is to guide the four main protagonists to battle in the Egg World as Ura-Acca does.\n~!Acca, along with Ura Acca, is one of the founders of Japan Plati. Originally regular humans, both of them abandoned their bodies and uploaded their brains into the bodies of mannequins that only exist in the Egg World.!~\n\nAbilities :\n~!He is capable of making his voice heard by the protagonists from anywhere or anything, or interact with non living objects, in the Egg World and in the reality. For example, in episode 5 and episode 6, he uses speakers or bins. Ura-Acca possesses the same ability. They can also communicate through the pomanders.\n\nBoth Acca and Ura-Acca can observe what the protagonists are doing, even in their dreams, through a big screen which shows directly what's happening. They almost always have an eye on them.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b204118-19o0SF8N3yRb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 204118
      },
      "rarity": "rare"
    },
    {
      "id": "ura-acca",
      "name": "Ura-Acca",
      "alt_names": [
        "裏アカ"
      ],
      "role": "supporting",
      "description": "Ura-Acca, together with Acca, is responsible for leading Ai and the others to the Egg World. In contrast to Acca, Ura-Acca's speech and appearance are more laidback and informal. Sometimes, he states very pointed opinions. He is also quite honest and prefers telling the truth rather than hiding It or avoiding the subject, as Acca would.\n~!Ura-Acca, along with Acca, is one of the founders of Japan Plati. Originally regular humans, both of them abandoned their bodies and uploaded their brains into the bodies of mannequins that only exist in the Egg World.!~\n\nAbilities :\n~!He shows the same abilities as Acca to communicate with the protagonists from anywhere or anything, in both reality and Egg World. He can even make electronic objects work remotely such as an arcade when the girls requested it.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b204117-mLPUJhFKi5IH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 204117
      },
      "rarity": "rare"
    },
    {
      "id": "koito-nagase",
      "name": "Koito Nagase",
      "alt_names": [
        "長瀬小糸"
      ],
      "role": "supporting",
      "description": "Koito is [Ai Ohto](https://anilist.co/character/199892/Ai-Ohto)‘s first friend. Because of her friendship with Ai, she was bullied at school. She is very calm by nature and is able to find good sides in all situations, as shown in her reaction to being bullied at school. She is also kind and gentle, especially towards people she cares about.\n~!Koito's eventual suicide is what leads Ai to become a shut-in, avoiding school and refusing to speak to the [teacher](https://anilist.co/character/204921/Shuichiro-Sawaki) when he visits her home. It is for Koito's sake that Ai begins using the Wonder Eggs.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b204115-QOsA8kKxnLLn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 204115
      },
      "rarity": "rare"
    },
    {
      "id": "tae-ooto",
      "name": "Tae Ooto",
      "alt_names": [
        "大戸多恵",
        "Tae Ohto"
      ],
      "role": "supporting",
      "description": "[Ai Ooto](https://anilist.co/character/199892/Ai-Ohto)’s mother. She is a very soft spoken woman and cares deeply about Ai. She is always calm, polite and very kind with anyone she talks with.\n~!She has divorced Ai's father and takes care of her alone, both of them living together. She is worried about her daughter and tries to support her in her own way, though Ai rarely leaves her own room. Tae is then relieved to see that she made some friends. She is currently dating [Shuichiro Sawaki](https://anilist.co/character/204921/Shuichiro-Sawaki), who visits the Ohto household quite often.!~\n\n(Source: Wonder Egg Priority Fandom Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b204116-n1I99ZVHQzfB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 204116
      },
      "rarity": "rare"
    },
    {
      "id": "shuichiro-sawaki",
      "name": "Shuichiro Sawaki",
      "alt_names": [
        "沢木修一郎"
      ],
      "role": "supporting",
      "description": "Shuichiro Sawaki is [Ai](https://anilist.co/character/199892/Ai-Ohto) and [Koito](https://anilist.co/character/204115/Koito-Nagase)'s homeroom teacher. He is the art club's advisor and often visits Ai's home and says he doesn't mind because her home is on the way to his house.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b204921-PEjb3Pp7lZjc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 204921
      },
      "rarity": "rare"
    },
    {
      "id": "frill",
      "name": "Frill",
      "alt_names": [
        "フリル"
      ],
      "role": "supporting",
      "description": "Frill is an artificial human created by Acca and Ura-Acca.\n\nFrill is cheerful and clever by design, showing intelligence significantly higher than that of the average fourteen year old. She also has a sense of humour, and is often seen laughing as a result of practical jokes or general silliness.\n~!Frill's true nature however, proves to be far more sinister. She is shown to become easily jealous when anyone threatens to take attention away from her, or be superior to her in any way, growing to even despise these people. She seems to care little about people who are not her two creators. Frill seems to lack the ability to properly develop empathy. Her obsessive and envious nature culminates when Acca and Ura-Acca both begin to turn their attention away from her, causing her to resort to murder. Following this, Frill's lack of empathy is fully displayed, showing very little, if any, remorse for her actions. After this, her creators call her a monster, and stop treating as if she were a human. This seems to confuse Frill, as she still seeks affection from her creators despite their disdain towards her.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b214874-2yiyIiVPWNa2.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 214874
      },
      "rarity": "rare"
    },
    {
      "id": "kurumi-saijou",
      "name": "Kurumi Saijou",
      "alt_names": [
        "西城くるみ"
      ],
      "role": "supporting",
      "description": "~!Kurumi Saijo emerges from Ai's first Wonder Egg.!~ Kurumi is an empathetic girl. She sometimes speaks to others in an authoritative manner, but is a helpful person. She is very sarcastic in serious situations.\n~!Kurumi was a student who had no real friends, only the superficial kind with whom you exchange empty phrases. Her Wonder Killer was an unknown schoolgirl with axes who endlessly laughed at her.!~\n\n(Source: Wonder Egg Priority Fandom Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b204143-SKXKmOH3jNZA.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 204143
      },
      "rarity": "rare"
    },
    {
      "id": "minami-suzuhara",
      "name": "Minami Suzuhara",
      "alt_names": [
        "鈴原南"
      ],
      "role": "supporting",
      "description": "~!Minami Suzuhara is the second person to hatch from a Wonder Egg bought by Ai.!~ Minami is very shy and timid. She has no confidence in herself nor her abilities at all, often describing herself as weak and lacking spirit. She is also very submissive due to her abuse at the hands of her gymnastics coach, obeying her without any questions and accepting the abuse without complaint.\n~!Minami was in her school's gymnastics club, the coach of which physically and emotionally abused her. Minami's Wonder Killer takes the coach's form, as her abuse was ultimately the cause of Minami's presumed suicide.!~\n\n(Source: Wonder Egg Priority Fandom Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b204893-rLGsvFhZkn96.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 204893
      },
      "rarity": "rare"
    },
    {
      "id": "mako",
      "name": "Mako",
      "alt_names": [
        "まこ"
      ],
      "role": "supporting",
      "description": "~!Mako and her best friend Miko are hatched from eggs bought by Ai and Rika.!~\nAlong with her best friend Miko, Mako was a fanatical fan of an idol named Yu-Yu. She and Miko attended concerts and meet-ups together in life. She is very cheerful and enthusiastic when talking about Yu-Yu, and very happy to see her best friend in the dream world.\n\nIn life, Mako often attended concerts and meet-ups for her favourite idol, Yu-Yu, along with Miko. They both admit to having aquired 'sugar daddies' in order to be able to afford attending Yu-Yu’s events.\n~!When Yu-Yu committed suicide, both Miko and Mako were quick to follow in his death as soon as possible, though they don't seem particularly remorseful about it.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205833-oDVrdgOW2MNu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205833
      },
      "rarity": "rare"
    },
    {
      "id": "miko",
      "name": "Miko",
      "alt_names": [
        "みこ"
      ],
      "role": "supporting",
      "description": "~!Miko and her best friend Mako are hatched from eggs bought by Ai and Rika.!~\nAlong with her best friend Mako, Miko was a fanatical fan of an idol named Yu-Yu. She and Mako attended concerts and meet-ups together in life. She is very cheerful and enthusiastic when talking about Yu-Yu, and very happy to see her best friend in the dream world.\n\nIn life, Miko often attended concerts and meet-ups for her favourite idol, Yu-Yu, along with Mako. They both admit to having acquired 'sugar daddies' in order to be able to afford attending Yu-Yu’s events.\n\n~!When Yu-Yu committed suicide, both Miko and Mako were quick to follow in his death as soon as possible, though they don't seem particularly remorseful about it.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205834-OfNKimIauDcD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205834
      },
      "rarity": "rare"
    },
    {
      "id": "miwa",
      "name": "Miwa",
      "alt_names": [
        "美和"
      ],
      "role": "supporting",
      "description": "~!Miwa is a girl hatched from Momoe’s egg.!~\n\n__Background :__\n~!Miwa was a girl who was molested on the train by the same person every day. One day, she gathered up her courage and called the man out for it, shouting for help to the other passengers on the train. Everyone pinned the molester down, helping Miwa. However, the man was actually an executive at her dad’s company. Her dad was fired from the company and her mother asked why she just could not just put up with it. Her mother had said that being groped shows how cute Miwa was, that the molester had picked her because she was cute. She was blamed by her mother for her father’s forced resignation, and expresses emotional distress when recalling this event to Momoe.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b206595-8mJHZxqH1cqM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 206595
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T19:35:59.436Z"
}