{
  "work_id": "fatezero-season-2",
  "count": 15,
  "characters": [
    {
      "id": "kiritsugu-emiya",
      "name": "Kiritsugu Emiya",
      "alt_names": [
        "衛宮切嗣",
        "Magus Killer",
        "Kerry",
        "EMIYA (Assassin)"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm\n__Sidearm:__ Thompson contender in conjunction with his Mystic Code Origin Bullets\n\nShirou's foster father and his savior from the aftermath of the massive Fuyuki fire. During his lifetime, Kiritsugu was disillusioned with becoming a Hero of Justice, a defender of humanity who could save everyone. Although he feels he failed to do so, his efforts were a source of inspiration for Shirou.  Prior to his fateful meeting with Shirou, Kiritsugu was notorious as the \"Magus Killer,\" a freelancer who would hunt down heretical magi. Although he was a magus with Magic Circuits and abilities he was considered unorthodox in that he would utilize modern technology and weaponry along with his magecraft to track down and kill magi.  Although mentioned and seen in flashbacks in Fate/stay night, Kiritsugu is one of the main protagonists in its prequel Fate/Zero.   \n\n~!It is hinted at in certain parts of Fate/stay night and confirmed in its prequel Fate/Zero that Kiritsugu is in fact Illyasviel von Einzbern's biological father, making Shirou and her step-siblings.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b10010-fNspzan5MzNk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10010
      },
      "rarity": "legendary"
    },
    {
      "id": "kirei-kotomine",
      "name": "Kirei Kotomine",
      "alt_names": [
        "言峰綺礼"
      ],
      "role": "protagonist",
      "description": "__Height:__ 185cm (Fate/Zero), 193cm (Fate/stay night)\n\n~!Through an agreement between the Mages' Association and the Church, the Holy Grail Wars are moderated by a priest. Kirei's father was the mediator for the 4th Holy Grail War, and when he died, Kirei felt obligated to replace him. His selection as mediator is unusual, for Kirei is a member of both the Church and Mages' Association, organizations on hostile terms with one another. Since the death of Rin's father, he has also acted as an indirect caretaker for Rin.!~",
      "metadata": {
        "gender": "male",
        "age": "28 (Fate/Zero), 38 (Fate/stay night)",
        "dateOfBirth": "1967-12-28"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b506-qeg0TqitdCMS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 506
      },
      "rarity": "legendary"
    },
    {
      "id": "artoria-pendragon",
      "name": "Artoria Pendragon",
      "alt_names": [
        "アルトリア・ペンドラゴン",
        "Saber (セイバー)",
        "Altria Pendragon",
        "King Arthur",
        "King of Knights",
        "Blue Saber",
        "Arturia Pendragon",
        "Goddess Rhongomyniad",
        "Lion King",
        "Elise Watoson",
        "Once and Future King",
        "Proud Knight-King",
        "Arthur Pendragon"
      ],
      "role": "protagonist",
      "description": "__Height:__ 154 cm (5'1)\n\nArtoria Pendragon, better known as Arthur Pendragon and King Arthur, is regarded as a male in history but is actually female. She is the \"Once and Future King\" and a legendary hero of Britain known as the King of Knights. She used to wield the sword from the stone, Caliburn, but it was eventually destroyed and the Lady of the Lake gifted her with Excalibur and Avalon.\n\n__In Fate/Prototype:__ ~!He is presented as male instead, conserving his original name of Arthur Pendragon. Also called Prototype Saber, he is the Saber-class Servant under the control of [Ayaka Sajyou](https://anilist.co/character/54223).!~\n\n__In Fate/stay night:__ ~!Saber is summoned in the Fifth Holy Grail War as the Servant of [Shirou Emiya](https://anilist.co/character/496). Shirou had been having dreams of Excalibur in the days leading up to the start of the Holy Grail War after receiving his Command Spells and, while stumbling in his shed during his escape from [Lancer](https://anilist.co/character/499), Avalon, hidden inside him, reacts to the traces of a magic circle and summons Artoria as his Servant.!~\n\n__In Fate/stay night: Heaven's Feel:__ ~! Corrupted by [Angra Mainyu](https://anilist.co/character/120855), Artoria is vastly different from her normal self. She is also called Saber Alter/Black Saber. The results of her alteration is not only within Artoria's interior but also extends to her outward appearance. The color of her skin becomes pale, and the pupil of her eyes that were at first concealed behind a black visor during the moment of her summoning becomes golden from her original green eye color as well. Because the armor she wears was dyed jet black and grew in weight due to changing into a heavier armor, its power has increased more than normal.!~\n\n __In Fate/Zero:__ ~!Saber is summoned by [Kiritsugu Emiya](https://anilist.co/character/10010) to participate in the Fourth Holy Grail War on behalf of [Jubstacheit von Einzbern](https://anilist.co/character/16027) and the Einzbern family. Kiritsugu partners Saber with [Irisviel von Einzbern](https://anilist.co/character/15164), to act as Saber's Master in the open while he acts from behind to win with his own methods.!~ \n\n__In Fate/Grand Order - First Order:__  ~! She remains the corrupted version, known as Saber Alter.!~\n\n__In Fate/Grand Order Camelot:__ ~!The being called Goddess Rhongomyniad came into existence in the world that [Bedivere](https://anilist.co/character/8941), due to the wish of wanting his King to not perish after the battle of Camlainn, refused to throw Excalibur back into the Lake even after the third time.!~",
      "metadata": {
        "gender": "female",
        "age": "35 (chronologically), 15 (physically)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b497-Yg5pNmC8kxzs.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 497
      },
      "rarity": "legendary"
    },
    {
      "id": "gilgamesh",
      "name": "Gilgamesh",
      "alt_names": [
        "ギルガメッシュ",
        "Archer",
        "King of Heroes",
        "King of Kings",
        "Golden King",
        "King of Babylon",
        "Oldest King",
        "AUO",
        "Gil-kun",
        "Wedge of Heaven"
      ],
      "role": "protagonist",
      "description": "__Height:__ 182 cm\n\nGilgamesh is the King of Uruk, said to have reigned during the Sumer Dynasty in Mesopotamia 5000 years ago. He's the namesake Hero described in the Epic of Gilgamesh, making him the most ancient Hero on which all the others legends were modeled. This grants him the title of King of Heroes and, within his Gates of Babylon, the prototypes of all the Noble Phantasms of the Heroes yet to come. \n\nBorn from the human Lugalbanda, the King of Uruk, and the goddess Rimat-Ninsun, he was a being so perfect and transcendent to the point that he was two-thirds deity and one-third human. He was the chosen one that would guide humanity on the earth that was slowly abandoning the Age of Gods, but instead he grew up to be a selfish and arrogant despot.\n\nHis only friend and being he considered his equal was Enkidu.\n\n__In Fate/Zero:__\n~!\nInitially summoned as the Archer-class Servant of [Tokiomi Toosaka](https://anilist.co/character/16017/Tokiomi-Toosaka) in the 4th Holy Grail War, using the fossil of the first skin ever shed by a snake as a catalyst, he soon becomes bored with his Master and takes interest in Kirei Kotomine. Together they plot to kill Tokiomi and forge a new pact, with Gilgamesh pushing Kotomine to accept his true desires. He also takes interest in Iskandar as a worthy opponent to kill, and in Artoria, a tragic figure to take as his bride. \n\nIn the end, invested by the pollution of the Holy Grail, he is gifted a mortal body and is reincarnated in the world. !~\n\n__In Fate/strange Fake:__\n~!\nWithin the World of Fate/strange Fake, Servant Archer Gilgamesh was previously summoned in the Fourth Fuyuki Holy Grail War and participated in the Fifth Fuyuki Holy Grail War. But the Servant summoned in the False Holy Grail War is a new Servant without any memories of the Fuyuki Holy Grail Wars. \n\nHe is the first Servant summoned in the True and False Holy Grail War as the \"False\" Archer-class Servant of [Thine Chelc](https://anilist.co/character/87307/).\n!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2514-hnE6LEdqm7Su.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2514
      },
      "rarity": "legendary"
    },
    {
      "id": "irisviel-von-einzbern",
      "name": "Irisviel von Einzbern",
      "alt_names": [
        "アイリスフィール・フォン・アインツベルン",
        "Iri"
      ],
      "role": "protagonist",
      "description": "__Height:__ 158 cm  \n\nIrisviel von Einzbern is the partner of Saber as well as the intended vessel for the Holy Grail. She is the mother of Illyasviel von Einzbern. Like her daughter, Irisviel is a homunculus, an artificial being created by the Einzbern. She was raised to be a puppet with no desires, but found happiness in her existence when she gave birth to Illyasviel. She is married to Kiritsugu Emiya, the biological father of her daughter.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b15164-BPfYcnNR3PwN.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15164
      },
      "rarity": "legendary"
    },
    {
      "id": "shirou-emiya",
      "name": "Shirou Emiya",
      "alt_names": [
        "衛宮士郎",
        "Emiyan",
        "Sherou"
      ],
      "role": "supporting",
      "description": "__Height:__ 167 cm \n\nShirou is the main character of Fate/stay night. He is a serious yet helpful, hardworking, and honest teenager. His hobbies include fixing a variety of broken things, from VCRs to stoves, as well as cooking and cleaning. He is initially confused about the Holy Grail War and attempts to irrationally shield others from danger, including his own Servant, Saber.",
      "metadata": {
        "gender": "male",
        "age": "16-19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b496-GI0waavDjyk3.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 496
      },
      "rarity": "rare"
    },
    {
      "id": "rin-tohsaka",
      "name": "Rin Tohsaka",
      "alt_names": [
        "遠坂凛",
        "Rin Tousaka",
        "Poppins of July",
        "Red Devil",
        "The Consultant",
        "Red Evil",
        "Kischur's Nightmare"
      ],
      "role": "supporting",
      "description": "__Height:__ 124 cm (Fate/Zero), 159 cm (Fate/stay night)\n\nRin is a model student and idol of Shirou's school. She barely talks to other students in her school and exhibits a desire to be left alone, as exemplified by her tendency to stay on the school's rooftop, away from the rest of the students. She is also secretly a Magus and a Master in the Fifth Holy Grail War. In the beginning of the anime, she summons Archer for her Servant, although she originally wanted to summon Saber. Rin is reared as the successor to her family's magecraft, instructed by her father, Tokiomi Tohsaka, to prioritize sorcery over her own interests. After her father is killed, Rin continues to perfect her sorcery, with some guidance from her guardian, Kirei Kotomine. She strives to earn the admiration of her peers to avoid drawing attention to her private life, even though she is secretly stingy, tomboyish, and a perfectionist. She is perceptive, resourceful and avidly competitive.\n\n~!Rin is Sakura's older sister, but the two were forced to live apart by their father, Tokiomi. Rin once had a good relationship with Sakura before their separation, evident by a ribbon Sakura always kept. Rin later convinced herself that Sakura was living a happier life with the Matou family than she was living as the Tohsaka family heir, and this delusion blinded her to the knowledge that Sakura was only barely keeping her own sanity in check while constantly suffering. Rin went as far as to try to preserve Shirou's life for what she thought was entirely Sakura's sake. Rin had also decided that she would kill Sakura in the events of the Holy Grail War if it came down to it. However, ultimately, she could not bring herself to do it and took the blow without harming her.!~",
      "metadata": {
        "gender": "female",
        "age": "17-19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b498-lwawtSpLyATL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 498
      },
      "rarity": "rare"
    },
    {
      "id": "sakura-matou",
      "name": "Sakura Matou",
      "alt_names": [
        "間桐桜"
      ],
      "role": "supporting",
      "description": "__Height:__ 120 cm (Fate/Zero), 156 cm (Fate/stay night)\n\nA student in her first year of high school, Sakura is the sister of Shinji Mato. After Shirou's father Kiritsugu died, Sakura often visited Shirou's home to help him with his daily chores. She is outwardly shy and timid, but possesses great inner strength. Sakura has a long standing and obvious crush on Shirou Emiya.",
      "metadata": {
        "gender": "female",
        "age": "16-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b500-NQrLbnBr1sDv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 500
      },
      "rarity": "rare"
    },
    {
      "id": "illyasviel-von-einzbern",
      "name": "Illyasviel von Einzbern",
      "alt_names": [
        "イリヤスフィール・フォン・アインツベルン",
        "Illya"
      ],
      "role": "supporting",
      "description": "**Height:** 133 cm\n**Birthday in [Fate/kaleid](https://anilist.co/manga/33526/): **Jul 20\n\nA young Teutonic aristocrat, she traveled to Japan to participate in the Holy Grail War as a Master. Illyasviel has an angelic appearance and an unsurpassed degree of magical power. She lives in a castle on the outskirts of Fuyuki City, accompanied only by her Servant and two maids. Illyasviel asks those she feels comfortable around to simply call her \"Illya\".",
      "metadata": {
        "gender": "female",
        "age": "8 (Fate/Zero), 18 (Fate/stay night)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b503-SmS87yq6l2tD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 503
      },
      "rarity": "rare"
    },
    {
      "id": "lancelot",
      "name": "Lancelot",
      "alt_names": [
        "ランスロット",
        "Knight of the Lake",
        "Berserker",
        "Black Knight",
        "Mad Dog",
        "Sir Lancelot du Lac",
        "Lord of Joyous Gard"
      ],
      "role": "supporting",
      "description": "__Height:__ 191 cm   \n__Weight:__ 81 kg  \n\nIn Fate/Zero\n    ~!Berserker is the Servant of Matou Kariya during the 4th Holy Grail War. Berserker is known to have three distinct Noble Phantasms, as shown on his status page. However, due to the enchantment that obscured his identity, his status page was shown blurred, making it impossible to identify the specific names and natures of his Phantasms, save for the sword Arondight. In addition, this Berserker is uniquely able to make anything he chooses into his own Noble Phantasm and effectively wield them, from telephone poles to the Noble Phantasms of other Servants.\nBerserker's real identity is Lancelot of the Lake. Until his identity was revealed, he had been known simply as the Black Knight.  Lancelot, known as the Knight of the Lake, had been loyal to Artoria, knowing both the king and the secrets of her sword well. Lancelot's downfall began when he loved Artoria's queen. Though the king was actually a woman, Artoria had married in order to present the image of a stable royal family before the kingdom and to maintain the illusion that she was a man in the face of the general public. Her queen willingly sacrificed her own life as a woman in order to fulfill the ideal of the stable government. However, Lancelot and the queen fell in love. Though he wanted to take her away, Lancelot's loyalty to Artoria and his sense of duty to serve the kingdom prevented him from doing so. When political enemies of the king exposed Lancelot and the queen's affair, the queen was ordered to be executed. Left with little choice, Lancelot rebelled in order to try and save her. The knight, the queen, who had made her beloved betray his duty, and the king, who felt responsible for the despair her most loyal servant endured, all suffered. Though Lancelot suffered greatly, he found that he could not hate Artoria, who had never blamed Lancelot for anything regarding the state of affairs they had become entangled in. In his despair, Lancelot desired to become a beast who had no worries; thus, when he became a Heroic Spirit, he became a Berserker-class spirit. !~ (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12732-yayxYNs1FQeF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12732
      },
      "rarity": "rare"
    },
    {
      "id": "tokiomi-toosaka",
      "name": "Tokiomi Toosaka",
      "alt_names": [
        "遠坂時臣",
        "Tokiomi Tohsaka"
      ],
      "role": "supporting",
      "description": "The father of [Rin](https://anilist.co/character/498/) and [Sakura](https://anilist.co/character/500/), two of the heroines from Fate/stay night. As a member of the Tohsaka family, he entered the Fourth Holy Grail War as the Master of Archer ([Gilgamesh](https://anilist.co/character/2514/)). [Kiritsugu Emiya](https://anilist.co/character/10010/) identifies Tokiomi as one of the two most threatening magi involved in the war after assessing all the Masters involved. Tokiomi is an arrogant and manipulative man who strives, as all-powerful magi do, to reach Akasha, or \"the root of all knowledge\". Although he cares for his daughters and his wife, he appears to be oblivious to the problems and pain they face due to his decisions.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16017-YvEqC99MKJzv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16017
      },
      "rarity": "rare"
    },
    {
      "id": "aoi-tohsaka",
      "name": "Aoi Tohsaka",
      "alt_names": [
        "遠坂葵"
      ],
      "role": "supporting",
      "description": "__Height:__ 160 cm   \n\nAoi Tohsaka is the childhood friend of Kariya Matou, and became the wife of Tokiomi Tohsaka, adopting his surname. She is the mother of Tokiomi's two daughters, Rin and Sakura.  Aoi is a passive and loyal woman who does not interfere with her husband's affairs, described by Kirei Kotomine as the ideal version of a traditional wife. She accepted Tokiomi's proposal with full knowledge of what it meant to marry a mage. While Kariya loved her as well, he peacefully gave up pursuing her affections because she seemed happy accepting Tokiomi's proposal. It is implied that Aoi and Kariya remained in touch, given that her daughters, especially Sakura, were fond of Kariya's company.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16018-bVrg7lsnSubE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16018
      },
      "rarity": "rare"
    },
    {
      "id": "ryuunosuke-uryuu",
      "name": "Ryuunosuke Uryuu",
      "alt_names": [
        "雨生龍之介"
      ],
      "role": "supporting",
      "description": "__Height:__ 174 cm\n__Weight:__ 65 kg\n\nThe master of Caster, Ryuunosuke is a serial killer who summons Caster after murdering a family and using their blood as a component in the summoning ritual. Though he is not a magus, he was selected by the Holy Grail to fulfill the war's requirement of seven Masters and seven Servants. Ryuunosuke knows nothing about magic or the fourth Holy Grail War; his involvement in the war is simply to watch Caster kill people in unique and thrilling ways to relieve boredom.  (source: Type-Moon Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16019-nFljwebXHDqc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16019
      },
      "rarity": "rare"
    },
    {
      "id": "maiya-hisau",
      "name": "Maiya Hisau",
      "alt_names": [
        "久宇舞弥"
      ],
      "role": "supporting",
      "description": "__Height:__ 161cm   \n\nA young woman who acts as Kiritsugu Emiya's assistant during the fourth Holy Grail War. She is cold and professional, which makes it easier for Kiritsugu to act as he needs to.  Little is known about her history, save that Kiritsugu had rescued her from a war-torn land many years ago. When Maiya was a child, she was forced into the army and trained to be a soldier. She later reveals to Irisviel von Einzbern, Kiritsugu's wife, that she had been raped by other soldiers and later lost her child. After rescuing her, Kiritsugu became Maiya's mentor and taught her his way of life.   \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16020-unVmGwhB9rhm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16020
      },
      "rarity": "rare"
    },
    {
      "id": "iskandar",
      "name": "Iskandar",
      "alt_names": [
        "イスカンダル",
        "Rider (ライダー)",
        "Alexander the Great",
        "King of Conquerors"
      ],
      "role": "supporting",
      "description": "__Height:__ 212 cm\n__Master:__ [Waver Velvet](https://anilist.co/character/16023/Waver-Velvet)\n__Catalyst:__ Mantle once worn by Iskandar himself \n__Holy Grail War No.:__ 4th Holy Grail War  \n\nIn Fate/Zero\n~!Rider was originally meant to be summoned by Lord Kayneth El-Melloi Archibald, but due to some circumstances, he ended up being Waver Velvet's servant. Iskandar, or how he refers to himself, the King of Conquerors is a noble and courageous man, who prefers to conquer his enemies by winning without killing and controlling without humiliating. He is known as a marvelous ruler who once almost conquered the whole known world. He is not pragmatic, but is a person who lets history run its course and acts according to his impulses. While he is wild and somewhat inconsiderate to others, his greed ultimately resulted in the happiness of the people he ruled over.  In the new era, Rider is mostly amazed by ordinary modern things, and usually spends his free time exploring modern war vehicles and machinery.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16021-w5Jn1eb807vt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16021
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T11:25:07.348Z"
}