{
  "work_id": "jojos-bizarre-adventure-part-7steel-ball-run",
  "count": 45,
  "characters": [
    {
      "id": "gyro-zeppeli",
      "name": "Gyro Zeppeli",
      "alt_names": [
        "ユリウス・カエサル・ツェペリ"
      ],
      "role": "protagonist",
      "description": "Gyro has a cocky and flamboyant personality, appearing to have a high opinion of himself. However, he can be driven by emotions for other people and become realistic and serious when a problem presents itself. Like most Manga archetypes, Gyro is incredibly intelligent when he needs to be. His most distinguishable body features are his long hair, western hat and his gold teeth which have \"GO! GO! ZEPPELI\" displayed on them, revealed whenever he smiles at someone. His signature laugh/chuckle is \"Nyo ho ho ho~\".  ~!Note that the \"Caesar\" in his name is pronounced in the traditional Greek way, more akin to the German \"Kaiser\". This is distinct from Caesar Anthonio Zeppeli from JoJo's Bizarre Adventure Part 2, whose name is pronounced in the modern English way.!~",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": "1866-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b11772-yqnTtXs3mcVG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 11772
      },
      "rarity": "legendary"
    },
    {
      "id": "johnny-joestar",
      "name": "Johnny Joestar",
      "alt_names": [
        "ジョニィ・ジョースター",
        "Joe Kid",
        "JoJo"
      ],
      "role": "protagonist",
      "description": "Johnny Joestar is an American former jockey turned paraplegic, and is the main protagonist of Part 7. He is a depressive man with a bleak outlook on life, but he is also very stubborn and capable of extreme, unwavering determination to the point of disregarding any risks or consequences, putting his goal above all else. He joins the Steel Ball Run race to find out the secret behind Gyro Zeppeli's steel balls, as Johnny believes they're capable of healing his legs.\n\nJohnny was once a horse racing prodigy. However, when waiting in line for a play, the girl he was with convinced him to cut to the front of the line and bribe the bouncers to throw out the youth in the front of the line, who had been waiting there all night. Furious, the youth shot Johnny in the back, paralyzing him from the waist down.\n\n~!Johnny earns a Stand named \"Tusk\" when they venture into the Devil's Palm as a result of their fight with Dio and Dr. Ferdinand. Tusk is able to fire Johnny's spinning fingernails similar to a revolver, with the nails having to take a few seconds to regrow. This long range attack becomes his primary means of defense. His Stand is small in size and has the same star-pattern over it as on Johnny's clothing, it appears to reside inside of him and only comes out to offer advice. It cannot speak, only make animal-like noises.  Later in the series, Johnny masters Gyro's \"Spin\" technique and uses it with his Stand's fingernail bullets; at one time, even being able to use it on himself. His Stand also evolves although remaining similar in appearance, now able to fire from the toenails on Johnny's paralyzed feet. !~",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": "1872-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b19492-gvMnKxhUhT9V.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 19492
      },
      "rarity": "legendary"
    },
    {
      "id": "funny-valentine",
      "name": "Funny Valentine",
      "alt_names": [
        "ファニー・ヴァレンタイン",
        "President Valentine"
      ],
      "role": "protagonist",
      "description": "__Occupation:__ The 23rd President of the United States\n__Hobbies:__ Playing musical instruments\n\nFunny Valentine is the main antagonist of Steel Ball Run. He is the 23rd President of the United States and the true mastermind behind the Steel Ball Run race. He watches the competition from behind the curtains and hopes to gather the Saint's Corpse to use the Holy Relic to further the United States of America's interests and power, and explains that his way to do that is by \"taking the first napkin\". Valentine has a lot of importance for patriotism and seems to care about his country. Most of Valentine's bad deeds are not selfishly centered, but instead are done in order to achieve what he thinks is power for America, and to follow his goal of making America the most dominant country.\n\n~!Valentine is a Stand User.\nValentine's Stand, Dirty Deeds Done Dirt Cheap (D4C), enables him access at any time to any number of alternate worlds/universes/dimensions; where if desired he may swap bodies with his counterparts, granting him pseudo-immortality. However, to activate said effect, Valentine must get caught between two objects (for example, a flag and the ground or a sofa and the wall). This limits D4C's ability but not by much since he has gotten caught between water and the bottom of the ocean as a method of using his ability before.\n\nValentine mostly uses an American Flag as his signature, and to active D4C's ability. He also has scars on his back resembling the old American Flag, as a result from him being tortured as a soldier.!~",
      "metadata": {
        "gender": "male",
        "age": "48",
        "dateOfBirth": "1847-09-20"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b20147-paS2fNaB3yOv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 20147
      },
      "rarity": "legendary"
    },
    {
      "id": "diego-brando",
      "name": "Diego Brando",
      "alt_names": [
        "ディエゴ・ブランドー",
        "Dio"
      ],
      "role": "protagonist",
      "description": "Diego Brando (usually called \"Dio\" for short) is a famous professional jockey from England. He is one of the participants in the Steel Ball Run race. Although unrelated to his DIO counterpart directly (parts 1-6 and 7-9 take place in two distinct, separate universes), he appears to be very similar to the original Dio in both looks and personality. \n\n~!He was raised among a group of homeless people after his mother saved him from drowning in a river when he was still a baby. He was later adopted into nobility when his talent as a jockey was discovered. Although he was raised with much love, he acts cold-hearted and will do virtually anything to win.!~",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": "1870-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b20148-mVGqsVJ2t27v.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 20148
      },
      "rarity": "legendary"
    },
    {
      "id": "lucy-steel",
      "name": "Lucy Steel",
      "alt_names": [
        "ルーシー・スティール",
        "Lucy Pendleton"
      ],
      "role": "protagonist",
      "description": "Lucy Steel is the wife of Steven Steel, the organizer of the Steel Ball Run race. Lucy is a kind, intelligent, and gentle girl who is extremely loyal to her husband. Although she appears nervous and meek, Lucy is incredibly courageous, resourceful, and determined.\n\n~!Lucy's involvement with the story truly begins when Funny Valentine is introduced. Lucy finds out that Funny Valentine plans to gather the bones of \"The Saint\" for his own needs and also kill Steven Steel. Lucy goes to great lengths to prevent this from happening.!~\n\n~!Later on, Lucy teams up with Hot Pants to steal back the heart of Jesus's corpse from the president. Lucy disguises herself as the president's wife, but she is captured by Valentine, and is chosen by the corpse to be its user. This turns Lucy into an artificial Stand user that allows her to use its \"holy field\" ability that Valentine plans to use to become the leader of the world.!~",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n23651-fWU7JnUMHH8U.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23651
      },
      "rarity": "legendary"
    },
    {
      "id": "ringo-roadagain",
      "name": "Ringo Roadagain",
      "alt_names": [
        "リンゴォ・ロードアゲイン"
      ],
      "role": "supporting",
      "description": "__Nationality:__ American\n__Hobbies:__ Dueling\n\nRingo Roadagain is a gunslinger at the service of Funny Valentine who traps Gyro, Johnny and Hot Pants at the beginning of the 4th Stage, near Cannon City, to seize the Saint's Corpse's parts. He is a Stand User and uses his time-rewinding Mandom during gun fights to get the upper hand.\n\nRingo is obsessed with bettering himself through duels. Considering himself \"incomplete\", he wants to reach new spiritual heights through duels, thinking that the pure killing intent he experiences to elevate his spirit. Because of this, he also has a strong personal moral code: Ringo prefers to fight on completely fair grounds and will even give pointers to his opponents regarding their weapons and position in order to perfectly level the playing field before their battle begins. Able to discern the dark will to kill in people, Ringo prefers to duel people who won't hesitate to kill on the spot so that his duels are as tense and pure as possible.\n\nRingo's Stand, Mandom, enables him to reverse time by exactly 6 seconds by turning a hand on his wristwatch. Although it is very limited, its ability is critical for Ringo to win his duels.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n23649-nXSheGwY1gAW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23649
      },
      "rarity": "uncommon"
    },
    {
      "id": "hot-pants",
      "name": "Hot Pants",
      "alt_names": [
        "ホット・パンツ"
      ],
      "role": "supporting",
      "description": "Hot Pants is a participant in the Steel Ball Run race. Her stand is Cream Starter.\n\n~!She is later revealed to be a nun who was sent to the race in disguise by the Kingdom of Naples and the Vatican in order to collect the saint corpse parts.!~",
      "metadata": {
        "gender": "female",
        "age": "23",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23650-awMG2DtHsm8N.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23650
      },
      "rarity": "uncommon"
    },
    {
      "id": "steven-steel",
      "name": "Steven Steel",
      "alt_names": [
        "スティーブン・スティール"
      ],
      "role": "supporting",
      "description": "The organizer of the Steel Ball Run race.\n\n~!It's revealed later in the series that Funny Valentine uses Steven's Steel Ball Run race to get the bones of \"The Saint\" against Steven's will.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n23652-fJf6jduDv3iY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23652
      },
      "rarity": "uncommon"
    },
    {
      "id": "wekapipo",
      "name": "Wekapipo",
      "alt_names": [
        "ウェカピポ"
      ],
      "role": "supporting",
      "description": "Wekapipo is an exiled Neapolitan and a practitioner of the Spin. He wields a special type of steel ball called Wrecking Ball.\n\nAfter serving as a royal guard for the Kingdom of Naples, Wekapipo was forced into exile and later entered the service of the current President of the United States, Funny Valentine. He, alongside Magent Magent, become amongst those sent to assassinate Johnny Joestar and Gyro Zeppeli for possession of the Saint's Corpse. He now works with the President to get the corpse parts and kill Gyro and Johnny in return for citizenship and residence in the United States, as well as a high ranking position in the government.",
      "metadata": {
        "gender": "male",
        "age": "31",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27042-yZsByUKCujCt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27042
      },
      "rarity": "uncommon"
    },
    {
      "id": "sandman",
      "name": "Sandman",
      "alt_names": [
        "サウンドマン "
      ],
      "role": "supporting",
      "description": "Sandman is a participant in the Steel Ball Run race from a Native American tribe. Despite being ostracized, he hopes that winning the race will earn him the money to buy back his ancestor's land, and he quickly becomes one of the fiercest competitors in the race thanks to his running technique.\n\n~!Sandman is a Stand User who wields In a Silent Way in battle, which can store sounds in objects or even people.!~",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28967-ShW5sAxzZDny.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28967
      },
      "rarity": "uncommon"
    },
    {
      "id": "pocoloco",
      "name": "Pocoloco",
      "alt_names": [
        "ポコロコ"
      ],
      "role": "supporting",
      "description": "A young man who participated in the Steel Ball Run race,  known for his incredible luck due to his stand's power.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n28968-BclBDTzZZVJn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28968
      },
      "rarity": "uncommon"
    },
    {
      "id": "mountain-tim",
      "name": "Mountain Tim",
      "alt_names": [
        "マウンテン・ティム"
      ],
      "role": "supporting",
      "description": "Working as a cowboy and bounty hunter, Mountain Tim is announced as a leading competitor in the Steel Ball Run. During the first stages of the race, Tim becomes one of Johnny and Gyro's allies. He is also a Stand User and shifts through his lasso thanks to his stand, Oh! Lonesome Me.\n\nMountain Tim is a man of average to above-average height and average build. Handsome and light-haired, he later acquires a scar crossing his face.\nHe wears a stereotypical range of cowboy attire; his hat has a zebra print, while the clothing on his upper torso, his belt gun holster, and his scarf have a leopard print. He wears a sheriff's badge in the shape of a five-pointed star on his left side.\n\nOh! Lonesome Me enables Mountain Tim to separate segments of his or others' bodies and freely slide them along a rope. It also grants him superhuman control over the rope, freely and precisely manipulating it to grab small objects from afar for instance.\nThis ability to separate himself into little pieces as far as the rope goes grants Mountain Tim greater agility and flexibility. Launching himself along it, Tim may shoot enemies from odd angles; and through the process of splitting and joining himself and others back together, he may travel and escape through small spaces.\n\nPossessing a mysterious mastery of equestrianism, horses tend to bow their heads in his presence.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28990-rOK1FsEOdabY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28990
      },
      "rarity": "uncommon"
    },
    {
      "id": "magenta-magenta",
      "name": "Magenta Magenta",
      "alt_names": [
        "マジェンタ マジェンタ"
      ],
      "role": "supporting",
      "description": "A man who first appeared accompanying Wekapipo to take out Johnny Joestar and Gyro Zeppeli. He&#039;s described as having a gross, gravelly voice and several nasty habits like licking his own snot.    He uses a Stand called 20th Century Boy that gives absolute protection to his body from any outwards harm, even things like drowning, as long as his hands are connected to the ground.    His and Wekapipo&#039;s names are both references to the songs of same name by the Japanese rap-group SOUL&#039;d OUT who are known to be fans of JoJo and performed the credits song Voodoo Kingdom for the JJBA: Phantom Blood movie.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n32640-yAQx3a7e0OzI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 32640
      },
      "rarity": "uncommon"
    },
    {
      "id": "sugar-mountain",
      "name": "Sugar Mountain",
      "alt_names": [
        "シュガーマウンテン"
      ],
      "role": "supporting",
      "description": "A cute and mysterious young girl who lives in a big tree.  She is a stand user and often plays with strange dolls.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b37442-eSNMPz9pd7S9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37442
      },
      "rarity": "uncommon"
    },
    {
      "id": "d-i-s-c-o",
      "name": "D-I-S-C-O",
      "alt_names": [
        "ディ・ス・コ"
      ],
      "role": "supporting",
      "description": "D-I-S-C-O  (ディ・ス・コ Di-su-ko) is a minor antagonist featured in the 7th part of JoJo's Bizarre Adventure, Steel Ball Run, specifically in the \"Chocolate Disco\" story arc. D-I-S-C-O is one of Valentine's henchmen. He confronts Gyro, separating him from an injured Johnny, near Independence Hall, Philadelphia. He is a Stand User, wielding the gauntlet-like Chocolate Disco.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n37446-PbfUzr0AFIMH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37446
      },
      "rarity": "uncommon"
    },
    {
      "id": "jesus-christ",
      "name": "Jesus Christ",
      "alt_names": [
        "イエス",
        "The Holy Saint"
      ],
      "role": "supporting",
      "description": "After Jesus' resurrection, he thanked Joseph of Arimathea for the care of his body and stated that he would travel to the east. When Joseph asked him about a future meeting, Jesus made a map in the sand showing Joseph nine locations. Jesus then traveled east across the continent, learning new languages and cultures until he reached the sea. Making a ship with the help of the locals, he set off across the sea to what would be known as America, where he lived, aged, and was finally put to rest. He seemed to have at least partial connection with the natives, who stated prior to his deathbed that they wished to see him. Shortly after his death, a large earthquake tore the ground apart, dividing his corpse by the movement of sand and relocating it to the different areas of America that would become the nine locations on Joseph of Arimathea's map.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n87201-D5g2n9pL6uqW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87201
      },
      "rarity": "uncommon"
    },
    {
      "id": "ferdinand-hakase",
      "name": "Ferdinand Hakase",
      "alt_names": [
        "フェルディナンド博士",
        "Dr. Ferdinand"
      ],
      "role": "supporting",
      "description": "Dr. Ferdinand is a man with blond hair - most of which being hidden under a thick, beige hood - that is parted on the right. He has long bangs that are arranged on the left side of his face.\n\nHis outfit's most notable feature is the several roses near the top of his long main garment, which appears to be only slightly shorter than his coat and resembles a dress or tunic. He dons a long, hooded coat, gloves, kneepads, pants and boots. Everything but the coat and kneepads appears to be the same colour (depicted as deep red in digital colour).\n\nHe looks somewhat androgynous and seems to be wearing mascara - particularly below his eyes - and perhaps lipstick. \n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130205-qNFmq4go1WiX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130205
      },
      "rarity": "uncommon"
    },
    {
      "id": "scarlet-valentine",
      "name": "Scarlet Valentine",
      "alt_names": [
        "スカーレット・ヴァレンタイン"
      ],
      "role": "supporting",
      "description": "Scarlet Valentine is the wife of Funny Valentine, making her the first lady of the United States. She is a strong and ambitious woman.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130206-TyyRL2sn3i0K.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130206
      },
      "rarity": "uncommon"
    },
    {
      "id": "blackmore",
      "name": "Blackmore",
      "alt_names": [
        "ブラックモア"
      ],
      "role": "supporting",
      "description": "Blackmore is a man of average to above-average height and medium build.\nHe wears a black, hooded poncho, punctuated in two columns on its chest and lining its sleeves by small metallic rings. Through the top of its hood is threaded a long ponytail of his light hair. Underneath, he wears light clothes covering his arms to his metacarpals; and his pants and boots in a piece, patterned by a symbol resembling a halved taijitu. \n\nBlackmore is introduced as one of Funny Valentine's loyal men, and an especially skilled assassin. His mission is to recover the Saint Corpse Parts that Johnny and Gyro had so far collected.\n\nWith his Stand, Catch the Rainbow, Blackmore may manipulate rain, including by halting falling drops, making them into threatening obstacles or a path he may cross in air; and relocating functioning parts of/or his entire body with their moving touch and force.\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130207-jh3obmhj00PP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130207
      },
      "rarity": "uncommon"
    },
    {
      "id": "mike-o",
      "name": "Mike O.",
      "alt_names": [
        "マイク・オー"
      ],
      "role": "supporting",
      "description": "Mike O. is a dark-skinned man of average to above-average height and medium build. His head is shaved save for a dark, curly patch on his crown; and centered on the edges of both eyes, extending to mid-forehead and covering his cheekbones, he has painted or tattooed a light, swerving design tapering at both ends into a spiral.\n\nHe wears a heavy overcoat of a thick collar and a sort of thick braid lining the length of his torso; a neatly folded scarf, and pants covered regularly by short spikes.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130208-oNr1V7SWJD87.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130208
      },
      "rarity": "uncommon"
    },
    {
      "id": "axl-ro",
      "name": "Axl RO",
      "alt_names": [
        "アクセル・RO"
      ],
      "role": "supporting",
      "description": "Axl appears to be a middle-aged man of average to above-average height and medium build. Darkness (either shadow, paint or a tattoo) covers his face to just below his eyes and in mirrored, hook-like tribal marks on his cheeks; save for a scattering of dots.\n\nOver a light, drooping rag, he wears a thick, round military helmet covered by a net. He wears a thick wide-necked top, bearing four dark rectangular patches between his shoulders and elbows on his long sleeves. His chest is overlaid with a V-shaped piece from which hang layers of squares; and he wears dark, knee-high boots.\n\nAxl's Stand is Civil War, with which is he able to transfer or unload sin and guilt via the attacks of hostile, ghostly representations of people and objects he or his targets harbor as having wronged or unfairly discarded.The manifestations of objects and people can appear suddenly from anywhere, for instance shadows or reflections in a mirror. \n\nThese objects attach themselves to and move through the target's body, creating a thin membrane that slowly engulfs them and the specters of people and animal likewise attack the target and try to fuse with them. Although a specter may also transform into the membrane, it can also physically harm its target.The membrane then gradually shrinks until the target is crushed.\n\nOnce the target makes contact with the object, they instantly remember how and why they sacrificed it or feel guilt about it. Axl RO is also able to directly command the specters to attack enemies or to defend himself.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130209-gDI9HCt1JZ4p.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130209
      },
      "rarity": "uncommon"
    },
    {
      "id": "gregorio-zeppeli",
      "name": "Gregorio Zeppeli",
      "alt_names": [
        "グレゴリオ・ツェペリ"
      ],
      "role": "supporting",
      "description": "Gregorio Zeppeli is a side character featured in Steel Ball Run who is Gyro's father and an executioner of the nation of Naples.\nGregorio Zeppeli is a somber and serious man, whose loyalty lies in his king and his family. Stating that true happiness lies in the family, Gregorio considers that protecting and honoring one's family is one's true obligation. He has taught his eldest son Gyro everything he knows, wishing to impart all of his family's traditions and honor his ancestors' work.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b139789-3SrJmZJr8WZ1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 139789
      },
      "rarity": "uncommon"
    },
    {
      "id": "oyecomova",
      "name": "Oyecomova",
      "alt_names": [
        "オエコモバ"
      ],
      "role": "supporting",
      "description": "Oyecomova is a Neapolitan terrorist who participates in the Steel Ball Run. Having heard of Gyro Zeppeli's participation, he seeks revenge on him and attacks Gyro alongside Mountain Tim and Johnny Joestar in the Rocky Mountains.\nHe stand Boku no Rhythm wo Kiitekure allows Oyecomova to create and attach special time bombs to anything he touches, be it solid objects or even water and smoke. This make his very deadly to approach.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b157251-HQpQCUK2xDVt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 157251
      },
      "rarity": "uncommon"
    },
    {
      "id": "pork-pie-hat-kid",
      "name": "Pork Pie Hat Kid",
      "alt_names": [
        "ポーク・パイ・ハット小僧"
      ],
      "role": "supporting",
      "description": "Pork Pie Hat Kid is a minor antagonist featured in the 7th part of JoJo's Bizarre Adventure, Steel Ball Run, introduced in the \"Tusk\" story arc.\n\nPork Pie Hat Kid is one of Funny Valentine's henchmen and attacks Johnny Joestar and Gyro Zeppeli in the desert to take their Saint Corpse Parts. He also happens to be a Stand User wielding the double hooked Wired.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b167880-j83R1UUpqoSA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 167880
      },
      "rarity": "uncommon"
    },
    {
      "id": "gaucho",
      "name": "Gaucho",
      "alt_names": [
        "ガウチョ"
      ],
      "role": "supporting",
      "description": "Gaucho is a Spanish competitor in the Steel Ball Run. During the third stage of the race, he is shown going the long way around a lake to reach the finish line.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172165-RCfFfNaOa0wz.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172165
      },
      "rarity": "uncommon"
    },
    {
      "id": "andre-boom-boom",
      "name": "Andre Boom Boom",
      "alt_names": [
        "アンドレ・ブンブーン"
      ],
      "role": "supporting",
      "description": "Andre Boom Boom is a minor antagonist from Part VII: Steel Ball Run and part of the Boom Boom Family.\n\nAndre appears as a boy in his early twenties and his most peculiar physical character are the freckles that cover his face. He has the odd abilities to make his nostrils flat and put his whole ear in his ear hole.\n\nJust like the other members of the family, Andre does not seem completely sane, but he shows a little more intelligence than his younger brother.\n\n(Source: JJBA Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172166-IGBGKHf5sO90.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172166
      },
      "rarity": "uncommon"
    },
    {
      "id": "mrs-robinson",
      "name": "Mrs.  Robinson",
      "alt_names": [
        "ミセス・ロビンスン"
      ],
      "role": "supporting",
      "description": "Mrs. Robinson is a minor character in Jojo's Bizarre Adventure: Steel Ball Run. He is a racer in the Steel Ball Run race.\n\n(Source: JJBA Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172167-lCzKtP18UATh.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172167
      },
      "rarity": "uncommon"
    },
    {
      "id": "dot-han",
      "name": "Dot Han",
      "alt_names": [
        "ドット・ハーン"
      ],
      "role": "supporting",
      "description": "Dot Han is a Mongolian competitor in the Steel Ball Run. A descendant of Genghis Khan, Dot Han is renowned for being an Equestrian master and is deemed one of the race's favorites.\n\n(Source: JoJo's Bizzare Encyclopedia Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172168-IwENapSp5EvY.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172168
      },
      "rarity": "uncommon"
    },
    {
      "id": "urmd-avdol",
      "name": "Urmd  Avdol",
      "alt_names": [
        "ウルムド・アブドゥル"
      ],
      "role": "supporting",
      "description": "Urmd Avdol is the alternate universe counterpart of the original universe's Muhammad Avdol.\n\nComing from Egypt, Urmd was said to have crossed the Sahara desert three times annually. Unlike the other contestants in the race, Urmd's choice of transportation was a camel, which made him a prime candidate for winning the race. Due to the camel's long legs, it had the ability to keep up with a horse's speed, but at the same time crush any other racers with its 800 kg body.\n\n(Source: JoJo Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172169-uSUbRlCQy3cl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172169
      },
      "rarity": "uncommon"
    },
    {
      "id": "wekapipo-giri-no-ani",
      "name": "Wekapipo Giri no Ani",
      "alt_names": [
        "ウェカピポの義理の兄",
        "Wekapipo's Brother-in-Law"
      ],
      "role": "supporting",
      "description": "The nobleman Wekapipo's sister married, who Wekapipo considered as a friend from his line of work. He was the son of a wealthy financial commissioner. He was regularly beating his wife and rendered her blind, prompting Wekapipo to ask the pope to annul the marriage, which the church approved of.\n\n~!Wekapipo then begged his brother-in-law to divorce his sister but was beaten up by the man's scabbard. Humiliated, the man challenged Wekapipo to a duel using Steel Balls and was killed. However, his influence made him able to have Wekapipo exiled even in death.!~\n\n(Source: JoJo's Bizzare Encyclopedia Wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172170-sOSrpxnCIxRW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172170
      },
      "rarity": "uncommon"
    },
    {
      "id": "captain-valentine",
      "name": "Captain Valentine",
      "alt_names": [
        "キャプテン・バレンタイン"
      ],
      "role": "supporting",
      "description": "Captain Valentine is a soldier who after coming back from the war, went to the house of one of his friends, who also served in the Army. \n\n~!He tells his friend's son, Funny, the story of his father.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172171-G2Q5OBadEgB1.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172171
      },
      "rarity": "uncommon"
    },
    {
      "id": "mrs-zeppeli",
      "name": "Mrs. Zeppeli",
      "alt_names": [
        "ゼッペリ夫人"
      ],
      "role": "supporting",
      "description": "The wife of Gregorio and the mother of five children, she cooks the meals for her family and cares a lot for them, as shown when she kisses Gyro's cheek before he became his father's assistant as an executioner. She doesn't have much medical expertise nor the ability to use Steel Balls, but she assists Gregorio and Gyro as a nurse.\n\n(Source: JoJo's Bizzare Encyclopedia Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172172-HVoI9GyvCvNS.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172172
      },
      "rarity": "uncommon"
    },
    {
      "id": "rina-higashikata",
      "name": "Rina Higashikata",
      "alt_names": [
        "東方理那"
      ],
      "role": "supporting",
      "description": "Rina Higashikata is a minor character briefly shown in Steel Ball Run. \n\n~!She is the wife of Johnny Joestar and daughter to Norisuke Higashikata I.!~\n\n(Source: JoJo's Bizzare Encyclopedia Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172173-ZF2EmIovqquE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172173
      },
      "rarity": "uncommon"
    },
    {
      "id": "nicholas-joestar",
      "name": "Nicholas Joestar",
      "alt_names": [
        "ニコラス・ジョースター"
      ],
      "role": "supporting",
      "description": "Nicholas Joestar is a minor character featured in Steel Ball Run.\n\nNicholas is the elder brother of Johnny Joestar by five years and the son of George Joestar.\n\n(Source: JoJo's Bizzare Encyclopedia Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172174-a7hS6ScxTaTq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172174
      },
      "rarity": "uncommon"
    },
    {
      "id": "l-a-boom-boom",
      "name": "L. A. Boom Boom",
      "alt_names": [
        "L.A. ブンブーン"
      ],
      "role": "supporting",
      "description": "L.A. Boom Boom is a minor antagonist in Steel Ball Run and the youngest member of the Boom Boom Family along with his father Benjamin and his older brother Andre.\n\n(Source: JJBA Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172175-sMhLBv28kBhf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172175
      },
      "rarity": "uncommon"
    },
    {
      "id": "potato-killer",
      "name": "Potato Killer",
      "alt_names": [
        "ポテトキラー"
      ],
      "role": "supporting",
      "description": "A murderer and pedophile who almost raped Ringo. As he wore a military uniform, so he may have been a soldier. \n\n(Source: JoJo's Bizzare Encyclopedia Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172176-tCFNsTWWvNfE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172176
      },
      "rarity": "uncommon"
    },
    {
      "id": "joseph-of-arimathea",
      "name": "Joseph of Arimathea",
      "alt_names": [
        "アリマタヤのヨセフ"
      ],
      "role": "supporting",
      "description": "The person responsible for documenting the location of Jesus' nine corpse parts.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172177-RSHUeJhBMnYR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172177
      },
      "rarity": "uncommon"
    },
    {
      "id": "fritz-von-stroheim",
      "name": "Fritz von Stroheim",
      "alt_names": [
        "フリッツ フォン・シュトロハイム"
      ],
      "role": "supporting",
      "description": "Fritz von Stroheim finishes the first stage in 6th place (after Gyro Zeppeli's demotion) and is awarded 25 points. His horse is named Europe Express.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172178-KHr0pPmeYxrf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172178
      },
      "rarity": "uncommon"
    },
    {
      "id": "diego-no-haha",
      "name": "Diego no Haha",
      "alt_names": [
        "ディオの母",
        "Diego's Mother"
      ],
      "role": "supporting",
      "description": "Repentant for abandoning her infant son, she dived into a flooding river to save him. She was responsible for teaching Diego pride.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172179-jr0WaQQe3jrU.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172179
      },
      "rarity": "uncommon"
    },
    {
      "id": "neapolitan-noble",
      "name": "Neapolitan Noble",
      "alt_names": [
        "ナポリの貴族"
      ],
      "role": "supporting",
      "description": "A noble from the Kingdom of Naples familiar with the Zeppeli family. During Gyro's youth, the man would periodically visit the Zeppeli to check on Gyro's age.\n\n(Source: JoJo's Bizzare Encyclopedia Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172180-IjVBocYuAMc3.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172180
      },
      "rarity": "uncommon"
    },
    {
      "id": "norisuke-higashikata",
      "name": "Norisuke  Higashikata",
      "alt_names": [
        "東方憲助"
      ],
      "role": "supporting",
      "description": "Norisuke Higashikata is a minor character in Part VII: Steel Ball Run.\n\nNorisuke is a mysterious Japanese competitor in the Steel Ball Run race.\n\n(Source: JJBA Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172181-ZJbZQLuSxukI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172181
      },
      "rarity": "uncommon"
    },
    {
      "id": "wekapipo-no-ane",
      "name": "Wekapipo no Ane",
      "alt_names": [
        "ウェカピポの姉",
        "Wekapipo's Sister"
      ],
      "role": "supporting",
      "description": "She was cherished by Wekapipo, who was seven years her elder. As a seventeen-year-old, the first time she'd ever left her home to see the ocean was on her wedding day. \n\n(Source: JoJo's Bizzare Encyclopedia Wikia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172182-RrQbQqf7WKwD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172182
      },
      "rarity": "uncommon"
    },
    {
      "id": "adam-pendleton",
      "name": "Adam Pendleton",
      "alt_names": [
        "アダム・ペンドルトン"
      ],
      "role": "supporting",
      "description": "Lucy's father. He is heavily indebted to the mafia after the death of his wife.\n\n(Source: JoJo's Bizzare Encyclopedia Wikia)",
      "metadata": {
        "age": "42",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172183-SKehjNbF6bj6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172183
      },
      "rarity": "uncommon"
    },
    {
      "id": "benjamin-boom-boom",
      "name": "Benjamin  Boom Boom",
      "alt_names": [
        "ベンジャミン・ブンブーン"
      ],
      "role": "supporting",
      "description": "Benjamin Boom Boom is a minor antagonist from Part VII: Steel Ball Run and the leader of the Boomboom Family and father of L. A. and Andre. He is one of the racers of the Steel Ball Run and one of the first Stand Users to be featured in Part VII.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b172184-9RSsngkye1aR.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 172184
      },
      "rarity": "uncommon"
    },
    {
      "id": "george-joestar",
      "name": "George Joestar",
      "alt_names": [
        "ジョージ・ジョースター"
      ],
      "role": "supporting",
      "description": "George is the father of [Johnny Joestar](https://anilist.co/character/19492/Johnny-Joestar) and [Nicholas Joestar](https://anilist.co/character/172174/Nicholas-Joestar), the former with whom he maintains a difficult relationship. He is a horse breeder by trade. \n\n(Source: JoJo Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b180500-ARxVv0kyGGm6.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 180500
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-23T23:10:43.065Z"
}