{
  "work_id": "classroom-of-the-elite-season-2",
  "count": 15,
  "characters": [
    {
      "id": "kiyotaka-ayanokouji",
      "name": "Kiyotaka Ayanokouji",
      "alt_names": [
        "綾小路清隆",
        "Argos-4",
        "Ayanokoji",
        "Aya-non",
        "Kiyo-pon",
        "X",
        "The False Genius",
        "Elevator Boy"
      ],
      "role": "protagonist",
      "description": "__Height:__ 176 cm (5'9\")\n\nAyanokouji is an inconspicuous and unobtrusive student. He is shown to be extremely intelligent and possesses a profound insight to study the emotions of people around him. Almost everything about his life prior to the entrance exams is unknown. He is shown to be extremely calculating and possessing superhuman intellect, perception, and strength. He's skilled at fighting and is able to easily manipulate the people around him. He is quite fond of his friends and protects those that he can without standing out. He has little regard for others' feelings and will coldly let them suffer to succeed, occasionally even his friends.",
      "metadata": {
        "gender": "male",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123212-ewZgUQr9vvEM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123212
      },
      "rarity": "epic"
    },
    {
      "id": "suzune-horikita",
      "name": "Suzune Horikita",
      "alt_names": [
        "堀北鈴音",
        "Muddykita"
      ],
      "role": "protagonist",
      "description": "__Height:__ 156 cm (5'1½\")\n\nA beautiful girl who sits next to Ayanokouji. She is the opposite of Ayanokouji when it comes to friendship; she disregards it and thinks of making friends unnecessary, thus she does not communicate much with her classmates. She is not convinced that she was placed in the D class, therefore she aims to get promoted to the A class.",
      "metadata": {
        "gender": "female",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123213-jUfrGBXfW7BL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123213
      },
      "rarity": "epic"
    },
    {
      "id": "kei-karuizawa",
      "name": "Kei Karuizawa",
      "alt_names": [
        "軽井沢恵"
      ],
      "role": "protagonist",
      "description": "__Height:__ 154 cm (5'0\")\n\nShe is a girl with a bad attitude who is located at the top of the D class hierarchy. She fights with Kushida for their class' top 2 places. Even though she gives off the impression of someone who is careless, arrogant, and messy, Kei's true self is very logical and astute with a sharp mind. She has remarkable ability to read the environment and the people around her, and makes the correct decision often.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b141122-6Zk52eU3VK3O.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 141122
      },
      "rarity": "epic"
    },
    {
      "id": "kakeru-ryuuen",
      "name": "Kakeru Ryuuen",
      "alt_names": [
        "龍園翔",
        "Dragon Boy",
        "ドラゴンボーイ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 173 cm (5'8\")\n\nKakeru Ryuuen is the class representative of class 1-C and is known for being an infamous delinquent. He does not lead his class by trust, but rather by fear. He has a group of henchmen who do his dirty work, which contributes to his fearsome reputation.",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b159627-kWwSUA1XR1Kx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 159627
      },
      "rarity": "epic"
    },
    {
      "id": "kikyou-kushida",
      "name": "Kikyou Kushida",
      "alt_names": [
        "櫛田桔梗",
        "Kikyo"
      ],
      "role": "protagonist",
      "description": "__Height:__ 155 cm\n\nShe boasts tremendous popularity among men and women as the D class' idol. She aims to be friends with everyone not just in D class. She wants to get along well with her classmate, Horikita.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123214-Ym9cldopi3yR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123214
      },
      "rarity": "epic"
    },
    {
      "id": "airi-sakura",
      "name": "Airi Sakura",
      "alt_names": [
        "佐倉愛里",
        "Shizuku"
      ],
      "role": "supporting",
      "description": "__Height:__ 153 cm (5'0\")\n\nA girl who is into photography. She hates standing out and likes to take modeling pictures.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123215-sMQJk35TqQv4.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123215
      },
      "rarity": "rare"
    },
    {
      "id": "honami-ichinose",
      "name": "Honami Ichinose",
      "alt_names": [
        "一之瀬帆波",
        "Class Rep Ichinose"
      ],
      "role": "supporting",
      "description": "__Height:__ 159 cm (5'2\")\n\nIf there was one sentence to describe Honami, it would be that she is genuinely kind-hearted, benevolent, and a pacifist to the core who is against using underhanded means and violence. One of her main traits is her unselfish and supportive personality, combined with her excellent social skills and her being naturally people-oriented. Honami is also a charismatic and energetic person, and extends her sweet and benign character even to those of the lower classes, unlike many other upper-class students.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123216-N9tQZf2XIKu6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123216
      },
      "rarity": "rare"
    },
    {
      "id": "sae-chabashira",
      "name": "Sae Chabashira",
      "alt_names": [
        "茶柱佐枝"
      ],
      "role": "supporting",
      "description": "__Height:__ 160 cm\n\nThe homeroom teacher of the protagonist's class (D). She is originally indifferent to her class, doing almost nothing to help them in the battle between classes, and remains unmotivated for the most part.",
      "metadata": {
        "gender": "female",
        "age": "26",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123217-sZaSZQGBYTcu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123217
      },
      "rarity": "rare"
    },
    {
      "id": "yousuke-hirata",
      "name": "Yousuke Hirata",
      "alt_names": [
        "平田洋介"
      ],
      "role": "supporting",
      "description": "__Height:__ 174 cm (5'8\")\n\nThe social leader of the D class. He has excellent academic and athletic ability, and is considered extremely handsome by his classmates, he is shown to be extremely compassionate and puts others before himself, considering everybody equal. He is considered a perfect male student and his placement in the D-class is originally considered a mystery.",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123218-HLOaxZINQojE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123218
      },
      "rarity": "rare"
    },
    {
      "id": "manabu-horikita",
      "name": "Manabu Horikita",
      "alt_names": [
        "堀北学"
      ],
      "role": "supporting",
      "description": "__Height:__ 178 cm (5'10\")\n\nHe is the leader of the school council and is Horikita Suzune's elder brother.",
      "metadata": {
        "gender": "male",
        "age": "18-19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123219-OEMawnnYXMFY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123219
      },
      "rarity": "rare"
    },
    {
      "id": "arisu-sakayanagi",
      "name": "Arisu Sakayanagi",
      "alt_names": [
        "坂柳有栖",
        "Little Girl (リトルガール)",
        "Princess"
      ],
      "role": "supporting",
      "description": "__Height:__ 150 cm (4'11\")\n\nArisu Sakayanagi is one of the class representatives of class 1-A along with Kōhei Katsuragi. She suffers from congenital heart disease which limits her physical ability. \n\nShe appears as a petite teenage girl with lilac-coloured hair and violet eyes. She wears a black beret on her head with a grey ribbon connected to it and wears the standard school uniform. She often walks with a cane due to her health condition. \n\nShe appears to possess a \"go with the flow\" attitude as she accepts most situations with no protest though she voices her dislike of boring situations after Katsuragi noted of the class scores. Unlike Kōhei Katsuragi, who has a conservative stance, Arisu possesses an innovative attitude. Together, the pair effectively lead class A through the school years.\n\nShe enjoys situations she finds interesting as shown when she smiled at Kakeru Ryūen's declaration to rule the school or when she listened to the speech of Suzune Horikita and found it amusing. In the light novels, Arisu enjoys toying with people as seen when she cryptically hinted to Kiyotaka Ayanokōji of knowing him while he had voiced he never saw her before. Later on, while being together with Honami Ichinose, she also had the chance to show her confidence and complacency after Teruhiko Yukimura of Ayanokōji Group boldly claimed that D-Class has the plan to overtake A-Class soon.\n\nAdditionally, although she has an easygoing personality, it was shown in the later part of the series that she's easily provoked when being described based on her petite appearance (e.g. \"Little Girl\") as she believes that it doesn't give her justice due to her domineering quality.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124691-S9GyfwMAkkJ9.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124691
      },
      "rarity": "rare"
    },
    {
      "id": "rokusuke-kouenji",
      "name": "Rokusuke Kouenji",
      "alt_names": [
        "高円寺六助"
      ],
      "role": "supporting",
      "description": "Rokusuke Kouenji is one of the students of class 1-D. He came from a well-known family of scholars. However, he ended up in D-Class for his egotistical behavior.\n\n~!In Year 1, Volume 11, he watches a scuffle between Hirata and Mii-Chan, which ended with Hirata pushing a desperate Mii-Chan, who was trying to help him, on the ground. Kouenji then intervenes and states his annoyance at Hirata \"for treating a girl wrong\" referring him as \"like a fly, very irritating\". His friendship with Mii-Chan is then showed to progress in Year 2, Volume 5, when they are seen walking together often, and Mii-chan referring to him as \"someone easy to talk to\" when asked about their relationship by Satou and Matsushita.\"!~\n\n~!During the Second Year Uninhabited Island Special Exam, he strikes an agreement with Suzune Horikita, in which he would try for a first-place finish and Suzune would reward him with complete protection from class vote expulsion until graduation and exempt him from being forced to co-operate with the rest of the class, which he wins.!~\n\n(Source: You-Zitsu Wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b158988-P28e8SU3WpGK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 158988
      },
      "rarity": "rare"
    },
    {
      "id": "haruka-hasebe",
      "name": "Haruka Hasebe",
      "alt_names": [
        "長谷部波瑠加"
      ],
      "role": "supporting",
      "description": "Haruka is a pretty normal person, but she is not very open to other people as shown when she didn't participate in the class's swimming session where she tends to prefer keeping to herself and not bothering people, simply to avoid trouble. She is considered to have good looks and is often viewed lustfully by boys, thus wanting to seclude herself. She is mostly seen wearing the school's uniform, with the difference that she has the upper button of her shirt undone and her tie relatively loosened. She prefers giving people nicknames the moment she meets them, which is said by Kushida to be a method for her \"to appear closer to the people she isn't close to\". \n\n~! In Year 2, Volume 5, Haruka is told off by Kushida when she tries to help the latter. She is then seen aggressively opposing the motion by Ayanokoji to expel Airi Sakura, being her closest friend, to no avail. She is one of the 4 remaining members and the sole remaining girl of the Ayanokoji Group.!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163517-pBRJeR0pkw0Z.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163517
      },
      "rarity": "rare"
    },
    {
      "id": "hiyori-shiina",
      "name": "Hiyori Shiina",
      "alt_names": [
        "椎名ひより"
      ],
      "role": "supporting",
      "description": "Hiyori Shiina is one of the students of Class 1-C who is a loner.\n\nShe's a quiet girl, though sometimes she is seen occasionally smiling. She always carries books with her in her bag in case she meets someone who shares the same interest in literature as her. Since nobody in class 1-C is into literature, she doesn't have anyone to talk to. She always speaks politely. She dislikes how the classes are competing with each other, wanting everyone to be friends.\n\n~! She encounters Kiyotaka in the library, and they find themselves having the same taste in books. As she always wanted a friend who has similar interests as her, their friendship gradually blossoms and she refers to him as her \"reading buddy\". She slowly starts developing romantic feelings for Kiyotaka.!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163518-xnSqZflOp9Wm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163518
      },
      "rarity": "rare"
    },
    {
      "id": "maya-satou",
      "name": "Maya Satou",
      "alt_names": [
        "佐藤麻耶"
      ],
      "role": "supporting",
      "description": "She is a student of class 2-D. \n\n~!In Volume 7.5, Maya asks for Kei Karuizawa's help to plan her \"date\" with Kiyotaka Ayanokouji. Kei was surprised and suggested other boys to her, but she refused, and said that she only liked Kiyotaka. She told her plan to Kei and made some changes according to her suggestions. She then later asked Kei if they could make it a \"double-date\", by including her and Yousuke Hirata in the plan. Eventually, Kei agreed and decided to schedule the double date on December 25. She confessed to Kiyotaka after the double date during Christmas, but was rejected and ran away crying. They promised each other that they will hang out again in the future and wants to see each other again but Sato couldn’t hold her feelings and excused herself first as she didn’t want him to see her in a pathetic state. She was hinted to have cried an innumerable amount of times behind closed doors after being rejected as the next time we saw her, she was able to frankly tell her friends she was rejected without being choked up. Her friends summarised that this could only had happened if she had come to terms with the rejection showing an immense amount of willpower to move on. That said, she still harbours feelings for Kiyotaka and has admitted that she finds him way cooler and hotter than Hirata not holding against Kei for liking the same person. She still feels conflicted that her best friend was in a relationship with her crush but decided to uphold their secret and support them in whatever way she can.!~\n\n~!Maya has below average academic abilities as was apparent during the Paper Shuffle special exam. Her physical abilities are of the lower echelon as well. However, she is one of more popular girls in her class. Although not to the tier of Kei, many observers were astonished to see someone like her talk to and publicly flirt with the 'uninteresting' Kiyotaka. She is also out-going and not afraid to take risks such as confessing to Kiyotaka on their first date.!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163519-as1ccGaDehxI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163519
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T17:34:33.308Z"
}