{
  "work_id": "high-school-dxd-new",
  "count": 15,
  "characters": [
    {
      "id": "issei-hyoudou",
      "name": "Issei Hyoudou",
      "alt_names": [
        "兵藤一誠",
        "Breast Dragon Emperor",
        "Red Dragon Emperor "
      ],
      "role": "protagonist",
      "description": "A second-year high school student attending Kuou Academy. He is known to be stupid, lecherous and a pervert among his peers. A normal high school student born in a normal family, but is in possession of the Sacred Gear \"Boosted Gear\" which is listed as one of the ultimate Sacred Gears (Longinus). He was killed by his first girlfriend, a Fallen Angel, and was revived as a Devil and a servant of Rias Gremory, his new master. Now he aims to become a Harem King by gaining a peerage, unaware of himself attracting girls around him.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b50387-99BEgVCuqwxa.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 50387
      },
      "rarity": "epic"
    },
    {
      "id": "rias-gremory",
      "name": "Rias Gremory",
      "alt_names": [
        "リアス・グレモリー",
        "Buchou (President)",
        "Ria",
        "Heiress of the House of Gremory",
        "Crimson-Haired Ruin Princess",
        "Princess of Destruction",
        "Princess of Gremory",
        "Devil Princess",
        "Switch Princess",
        "Red Dragon Emperor's Legal Wife"
      ],
      "role": "protagonist",
      "description": "__Height:__ 172 cm (5'8\")\n__Rank/Role:__ Top-class devil(Pure devil)/King\n__Power:__ Power of destruction\n\nA 12th grade student and the prettiest girl in the academy. Comes from the old noble of pure devils, the house of Gremory, a top-class devil who is called a genius nicknamed \"Crimson Ruin Princess\". Her brother is in fact one of the Yondai-Maou, Lucifer. Both of them possess the power of destruction. She revives Issei as her servant after finding him dead, killed by a fallen-angel and possessing a rare Sacred Gear. Kind and soft to her servants, becomes a totally different person when training or fighting.    ~!She begins to develop romantic feelings for Issei in Volume 2 of the light novel and moves in with him at the volume's end.  In Volume 10, he confesses that he loves her and she returns his feelings. They begin dating after that.!~",
      "metadata": {
        "gender": "female",
        "age": "18-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b50389-gIhJkyk8xj1P.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 50389
      },
      "rarity": "epic"
    },
    {
      "id": "asia-argento",
      "name": "Asia Argento",
      "alt_names": [
        "アーシア・アルジェント"
      ],
      "role": "protagonist",
      "description": "__Rank:__ Low-class \n__Devil Role:__ Bishop \n__Species:__ Reincarnated Devil (Former human) \n__Sacred Gear:__ Twilight Healing  \n\nA second-year student at Kuou Academy. Originally a sister who was known as a holy maiden due to her healing powers. She was raised in an orphanage and was taken in by the Church after her powers were discovered. However, she was kicked out of the Church for healing a Devil, and was taken in by people affiliated with the Fallen Angels. She starts living with Issei after being saved from the Fallen Angels' grasp. As a person raised in the Church, she lacks common sense.   \n\n~!After she starts living with Issei, she shows that she has feelings for him but he dismisses this as her looking at him like a brother.  When Rias moves in, she becomes increasingly more daring in her attempts to win Issei and views Rias as a rival in spite of their sister-like relationship.  At the end of Volume 6, she kisses Issei and he realizes the true depths of her feelings.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b51335-qc4XaXfPODjw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51335
      },
      "rarity": "epic"
    },
    {
      "id": "xenovia-quarta",
      "name": "Xenovia Quarta",
      "alt_names": [
        "ゼノヴィア",
        "Zenovia"
      ],
      "role": "protagonist",
      "description": "__Rank:__ Low-class \n__Devil Role:__ Knight \n__Species:__ Reincarnated Devil (Former Human) \n__Weapon:__ Excalibur Destruction (Volume 3), The Holy Sword Durandal → Ex-Durandal.  \n\nA Holy Sword user who was sent from the Church along with Irina to destroy or retrieve the stolen Excalibur swords. After she finds out that the God in the Bible has died a long time ago, she decides to join the Occult Research Club as Rias's servant. She tries to seduce Issei whenever she can because she wants to give birth to a strong baby.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b51337-QcbPyLiXoxB4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51337
      },
      "rarity": "epic"
    },
    {
      "id": "koneko-toujou",
      "name": "Koneko Toujou",
      "alt_names": [
        "塔城小猫",
        "Shirone"
      ],
      "role": "protagonist",
      "description": "__Rank:__ Low-class devil (Former nekomata)/Rook\n__Power:__ Youjutsu\n\nA 10th grade student. Originally about to be executed by the devils after her sister, Kuroka, kills her own master. The Satan, Lucifer, protected her, and left her under his sister's, Rias' care - becoming her servant. She refused to use the power of youjutsu because she didn't want to become like her sister. She overcame her power along with Akeno after Issei made her overcome her own powers. She doesn't show any emotion at all, and says harsh things and hits Issei when he is doing or thinking something perverted. She shows the most concern for her comrades when they are in trouble.   ~!At the end of Volume 5 she has warmed up significantly to Issei and even begins sitting on his lap and sneaking into his bed.  After this, she gradually develops romantic feelings towards him.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b51343-pt1UDTRvAXfY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51343
      },
      "rarity": "epic"
    },
    {
      "id": "yuuto-kiba",
      "name": "Yuuto Kiba",
      "alt_names": [
        "木場祐斗"
      ],
      "role": "protagonist",
      "description": "__Rank/Role:__ Mid-class devil (Former human)/Knight\n__Sacred Gear:__ Sword Birth -&gt; Sword of Betrayer (Balance-Break)\n\nAn 11th grade student. Self proclaimed best friend of Ise, and the school prince. He was a victim of the \"Project: Holy Sword\" where he was the only sole survivor. He became Rias's servant when she saved him from death, but still swore the accomplish his revenge to those who treated him as test subjects and disposed his friends. He also harbors a great hatred towards the holy sword Excalibur.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b51345-FZLxaAkG6Dy5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51345
      },
      "rarity": "epic"
    },
    {
      "id": "akeno-himejima",
      "name": "Akeno Himejima",
      "alt_names": [
        "姫島朱乃",
        " Priestess of Thunder and Light",
        "The Ultimate Sadist",
        "The President's Hitman"
      ],
      "role": "protagonist",
      "description": "__Rank:__ Middle-class Devil\n__Role:__ Queen\n__Race:__ Reincarnated Devil (Former Half-Human/Half-Fallen Angel)\n__Power:__ Elemental magic (mainly thunder), Holy Lightning (From Volume 5 onward)\n\nA third-year student and one of the \"Two Great Onee-samas\" of Kuou Academy along with Rias. Called the ultimate \"Queen\" by other members. Born between a human mother and fallen angel father, after the death of her mother, she became Rias' servant. She is a friend close enough to call Rias by her name in private, yet calls her Buchou in presence of others and displays a master-servant relationship in public. She persistently refuses to use her power of light, inherited from her father, but starts using it after being convinced by Issei.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b51347-YMb9fndAriXd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51347
      },
      "rarity": "epic"
    },
    {
      "id": "gasper-vladi",
      "name": "Gasper Vladi",
      "alt_names": [
        "ギャスパー・ヴラディ",
        "Gya-kun",
        "Gyasuke"
      ],
      "role": "protagonist",
      "description": "__Rank/Role:__ Low-class devil (Former human/vampire)/Bishop \n__Sacred Gear:__ Forbidden Balor View \n\nA half-vampire male cross-dresser who has the ability to stop the time of those he sees but he is unable to control it. He is sealed by Rias as ordered by the elders till she has grown up enough to control him. He still is unable to have a full command on his powers but can improve a lot by drinking Ise's blood.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b51349-BwumMUZiq8kw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51349
      },
      "rarity": "epic"
    },
    {
      "id": "irina-shidou",
      "name": "Irina Shidou",
      "alt_names": [
        "紫藤イリナ"
      ],
      "role": "supporting",
      "description": "__Rank:__ Angel (Former Human)\n__Weapon:__ Excalibur Mimic\n\nShe is Xenovia's partner and Issei's childhood friend. After finding out that the God in the Bible is dead, she still follows the teaching and is under the direct command of Michael. She also has a crush on Issei and was shocked to find out he turned into a devil. They are still friends despite that flaw.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b51339-vtfi7nIFPwYS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51339
      },
      "rarity": "rare"
    },
    {
      "id": "motohama",
      "name": "Motohama",
      "alt_names": [
        "元浜",
        "Perverted Glasses",
        "Three Sizes Scouter"
      ],
      "role": "supporting",
      "description": "Motohama (元浜) is the other best friend of Issei who made up the \"Perverted Trio\". Motohama has the ability to calculate a female's body measurements just by looking, which earned him nicknames such as \"Perverted Glasses\" (エロメガネ Ero-megane) and \"Three Sizes Scouter\" (スリーサイズスカウター Surī Saizu Sukautā). Like Matsuda, he constantly spreads bad rumors about Issei out of jealousy of his relationship with the Occult Research Club. He does not know that Issei and the Occult Research Club members are Devils. Motohama is known to have better results than both Issei and Matsuda.  (Source: High School DxD Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/55099.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 55099
      },
      "rarity": "rare"
    },
    {
      "id": "matsuda",
      "name": "Matsuda",
      "alt_names": [
        "松田",
        "Perverted Baldy",
        "Sexual Harassment Papparazzi"
      ],
      "role": "supporting",
      "description": "Matsuda is one of Issei's best friends who made up the \"Perverted Trio\" (変態三人組 Hentai San'nin-gumi), a trio of the biggest perverts at the Academy, and is a self-proclaimed lolicon. Matsuda's nicknames are \"Perverted Baldy\" (エロ坊主 Ero-bōzu) and \"Sexual Harassment Papparazzi (セクハラパパラッチ Sekuhara Paparatchi). Matsuda is a former jock and school sports star. He and Motohama are jealous of Issei's relationship with the Occult Research Club, and constantly spreads bad rumors about Issei, such as Issei being a sadist who blackmailed Rias and Akeno into doing sexual acts. He does not know that Issei and the Occult Research Club members are Devils.  (Source: High School DxD Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/55101.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 55101
      },
      "rarity": "rare"
    },
    {
      "id": "katase",
      "name": "Katase",
      "alt_names": [
        "片瀬"
      ],
      "role": "supporting",
      "description": "Member of Kuoh Academy's Girls' Kendō Club. She and Murayama are often subjected to Issei, Matsuda, and Motohama's lecherous peeping, in which they and the rest of the club retaliate by beating them with their shinai.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b55105-N466ye4hq9yz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 55105
      },
      "rarity": "rare"
    },
    {
      "id": "murayama",
      "name": "Murayama",
      "alt_names": [
        "村山"
      ],
      "role": "supporting",
      "description": "Member of Kuoh Academy's Girls' Kendō Club, and are anime-exclusive characters. She and Katase are often subjected to Issei, Matsuda, and Motohama's lecherous peeping, in which they and the rest of the club retaliate by beating them with their shinai. They are also in the same class as the Perverted Trio.  (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b55107-EcW0natZSWqM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 55107
      },
      "rarity": "rare"
    },
    {
      "id": "freed-sellzen",
      "name": "Freed Sellzen",
      "alt_names": [
        "フリード・セルゼン"
      ],
      "role": "supporting",
      "description": "Freed Sellzen is an exiled exorcist who only kills for his own desire. He kills Devils and humans who make contracts with Devils, claiming they are already stained to the extent beyond salvation. He is a wanted criminal at the Vatican. He does not believe in God from the start, as he only wanted to kill monsters. He is a battle-maniac, and prefers violence rather than logic. He is the most hated person to both exorcists and Devils. After being banished by the Orthodox Church, Freed sided with the Fallen Angels in Raynare's plot to steal Asia's Sacred Gear.  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/56705.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56705
      },
      "rarity": "rare"
    },
    {
      "id": "ddraig",
      "name": "Ddraig",
      "alt_names": [
        "ドライグ",
        "Welsh Dragon",
        "Sacred Gear",
        "Boosted Gear"
      ],
      "role": "supporting",
      "description": "He first appeared in volume 2 of the novel.    ~!Also known as the Welsh Dragon or the Sekiryutei (Red Dragon Emperor). One of the Two Heavenly Dragons along with the Vanishing Dragon Albion. The two dragons, with powers rivaling to gods, started fighting a long time ago for reasons even Ddraig forgot.   At that time, the angels, devils and fallen angels were waging a war against each other. The 3 factions believed that the fight the two dragons were having could spell disaster to the whole world so they set aside their war to stop the fight and seal the two dragons.   He now resides inside Issei's Sacred Gear as a result of being sealed in it. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/58117.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 58117
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-25T12:38:32.727Z"
}