{
  "work_id": "fire-force-season-2",
  "count": 15,
  "characters": [
    {
      "id": "shinra-kusakabe",
      "name": "Shinra Kusakabe",
      "alt_names": [
        "日下部森羅",
        "Devil's Footprints",
        "Akuma"
      ],
      "role": "protagonist",
      "description": "__Height:__ 173 cm (5'8\")\n__Affiliation:__ Special Fire Force Company 8\n__Rank:__ Second Class Soldier\n\nSince being accused of using his powers to cause the fire that took his family, his face's habit of tensing up into a bizarre smile when he gets nervous has earned him the derisive nickname of \"devil\". He joined the Fire Force to achieve his dream of becoming a hero and saving people from the fear of the flames, as well as uncover the truth behind his family's death twelve years ago.\n\nThough a newcomer in the Special Fire Force, Shinra has posed a challenge to experienced members of the force and has even defeated a Captain. Being a Fire Soldier, Shinra is experienced in rescuing people and is strong enough to carry four people out of a building. While he mostly relies on his Ignition Ability in combat, he has exhibited skill in ordinary fighting as well, being able to pin an opponent to the ground and break their guard with a sturdy kick, as well as being capable of defending himself from ground-breaking attacks.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n120462-oSWdz2MhkbDE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120462
      },
      "rarity": "epic"
    },
    {
      "id": "akitaru-oubi",
      "name": "Akitaru Oubi",
      "alt_names": [
        "秋樽桜備",
        "Bodybuilding Gorilla"
      ],
      "role": "protagonist",
      "description": "__Height:__ 189 cm (6'2\")\n__Affiliation:__ Special Fire Force Company 8\n__Rank:__ Captain\n\nThe popular and charismatic leader of the newly established Company 8. His goal is to investigate the other companies and uncover the truth about spontaneous human combustion. He has no powers, but uses his finely-honed muscles as a weapon in a battle style that's on even par with Benimaru's. Loves bodybuilding to an almost creepy extent.\n\nDespite not being a Pyrokinetic like most other known Battalion Commanders, Akitaru has a very fit physique, which allows him to face Infernals. In battle, he is seen using different weapons, suitable for the situation, like the Core Annihilating Pile Bunker or a fire fighting axe, which he can veil in white steam and thrust at the opponent. His weapons appear to be designed in order to impale an Infernal's core with low difficulty. He is able to carry up to 30kg of equipment each time he is on a mission to fight an Infernal. As a fire fighter, Akitaru was recognized enough to be decorated twice, though both were revoked due to actions prioritising saving citizens lives at the expense of defying orders.\n\n(Source: Fire Force Wikia, Kodansha)",
      "metadata": {
        "gender": "male",
        "age": "31",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130712-N38fiCh2y0CX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130712
      },
      "rarity": "epic"
    },
    {
      "id": "maki-oze",
      "name": "Maki Oze",
      "alt_names": [
        "尾瀬茉希",
        "Oggress"
      ],
      "role": "protagonist",
      "description": "__Height:__ 167 cm (5'6\")\n__Affiliation:__ Special Fire Force Company 8\n__Rank:__ First Class Fire Soldier\n\nA former member of the military, she is an excellent fighter who controls fire. She's a cool lady but is mad about love stories, and her beauty is overshadowed by her \"head full of flowers and wedding bells\". She's friendly but goes berserk when anyone comments on her muscles. Apparently,​ she used to be slender.\n\nMaki possesses Second Generation abilities, having adapted to Spontaneous Human Combustion by becoming able to control flames from a long distance. In doing so, she can handle herself against two Third Generations simultaneously, being able to extinguish and absorb their generated flames into a giant fireball. Maki's abilities provide defense for her entire team, as she can reflect incoming fire attacks and use an opponent's flames against them. While she is unable to deflect or redirect a fire with too much driving force, she is still able to alter its shape in order to reduce its impact.\n\n(Source: Kodansha USA)",
      "metadata": {
        "gender": "female",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130713-TgLx8rgtGpXV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130713
      },
      "rarity": "epic"
    },
    {
      "id": "takehisa-hinawa",
      "name": "Takehisa Hinawa",
      "alt_names": [
        "武久火縄"
      ],
      "role": "protagonist",
      "description": "__Height:__ 180 cm (5'11\")\n__Affiliation:__ Special Fire Force Company 8\n__Rank:__ Lieutenant\n\nA dry, unemotional ex-military man, whose stern disciplina is feared among the new recruits. He helped Obi to found Company 8. He never allows the soldiers to play with fire. The gun he uses is a cherished memento from his friend who became an Infernal.\n\nTakehisa is a Second Generation, who has awakened the ability to manipulate flames through the use of firearms, such as a machine gun or a pistol, which he wields on the battlefield. Takehisa's ability allows him to control the gunpowder inside bullets, making the impact they make stronger or weaker, depending on the situation. He can use this ability to make his bullets non-lethal.\n\n(Source: Fire Force Wikia, Kodansha)",
      "metadata": {
        "gender": "male",
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130714-pLzE3rXtP1C4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130714
      },
      "rarity": "epic"
    },
    {
      "id": "arthur-boyle",
      "name": "Arthur Boyle",
      "alt_names": [
        "アーサー・ボイル",
        "Stupid",
        "Knight King"
      ],
      "role": "protagonist",
      "description": "**Height:** 174 cm\n\nHe Trained at the academy with Shinra. Although he follows his own personal code of chivalry as the self-proclaimed Knight King, he is incredibly stupid. But girls love him. \n\nBeing a Third Generation Pyrokinetic, Arthur has been identified by individuals as having a strong will of fire. By raising the temperature of the flames he creates, he can fabricate and control plasma, which either elevates or diminishes in relation to Arthur's disarrangement from reality. The more delusional he is, the stronger Arthur becomes.\nBeing able to use his Ignition Ability on hilt-like objects, Arthur can weld, cut through metal, and generate electricity. He mainly uses his ability on his blade-less sword Excalibur, which is most effective using his right hand and cannot be easily extinguished by an experienced Second Generation. Using it, he can deflect and fend off against flames.\n\n(Source: Fire Force Wikia, Kodansha)",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130715-IYNBAHBQa14y.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130715
      },
      "rarity": "epic"
    },
    {
      "id": "iris",
      "name": "Iris",
      "alt_names": [
        "アイリス",
        "Sister"
      ],
      "role": "protagonist",
      "description": "__Height:__ 154 cm (5'0)\n__Affiliation:__ Special Fire Force Company 8\n__Rank:__ Nun\n\nA sister of the Holy Sol Temple, her prayers are an indispensable part of extinguishing Infernals. Personality-wise she is no less than an angel. \n\n(Source: Kodansha)",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130716-5564jUgQxK9a.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130716
      },
      "rarity": "epic"
    },
    {
      "id": "tamaki-kotatsu",
      "name": "Tamaki Kotatsu",
      "alt_names": [
        "環古達"
      ],
      "role": "protagonist",
      "description": "__Height:__ 156 cm (5'1\")\n__Affiliation:__ Special Fire Force Company 8\n__Rank:__ Second Class Soldier\n\n~!Originally a rookie member of Company 1, she was caught up in the treasonous plot of her superior officer Hoshimiya, and is currently being disciplined under Company 8's watch.!~ A tough girl with an unfortunate \"lucky lecher lure\" condition, she nevertheless has a pure heart.\n\nBeing a Third Generation, she is immune to being burnt by flames and can use her Ignition Ability to gird herself in pink flames, which grant her various cat-like traits, including cat ears, two forked tails and nails on her fingertips, an ability she dubbed \"Nekomata\". With her Ignition Ability active, Tamaki's agility and mobility is substantially increased, allowing her to run on all fours. She can use her forked-tails to generate a blast of fire, which is strong enough to break through building walls, restrain her targets in a circle of fire by lengthening them, or using them as a distress signal by the same process.\n\n(Source: Fire Force Wikia, Kodansha)",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130751-J8rhd4d3TxF4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130751
      },
      "rarity": "epic"
    },
    {
      "id": "princess-hibana",
      "name": "Princess Hibana",
      "alt_names": [
        "プリンセス火華"
      ],
      "role": "supporting",
      "description": "Hibana is a Third Generation pyrokinetic and Captain of the Special Fire Force Company 5.",
      "metadata": {
        "gender": "female",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130783-10kVdsVrwpuO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130783
      },
      "rarity": "rare"
    },
    {
      "id": "leonard-burns",
      "name": "Leonard Burns",
      "alt_names": [
        "レオナルド・バーンズ"
      ],
      "role": "supporting",
      "description": "He is a Third Generation pyrokinetic, and the Captain of Special Fire Force Company 1.",
      "metadata": {
        "gender": "male",
        "age": "50",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130785-zvGvLqecFUYX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130785
      },
      "rarity": "rare"
    },
    {
      "id": "huo-yan-li",
      "name": "Huo Yan Li",
      "alt_names": [
        "フォイエン・リィ"
      ],
      "role": "supporting",
      "description": "__Height:__ 184 cm (6' 0½\")\n__Affiliation:__ Special Fire Force Company 1\n\nHuo Yan Li is a Third Generation pyrokinetic and member of the Special Fire Force Company 1.\n\nIn contrast to his long-time friends and team-mates Karim Flam and Rekka Hoshimiya, Huo Yan is a rather laid-back and responsible individual, who doesn't like to get worked-up and waste time with meaningless fighting. He abides to the etiquette of the 1st Special Fire Brigade strongly, going as far as to point out formalities, such as a dress code. Despite the revelation of the Church's wrongdoing, Yan still abides by the institution because it gives people hope during tragedies and worships the Sun and Sun God and the good it brings to the world and humanity instead of the malicious ideals of the White Clad and the Evangelist.",
      "metadata": {
        "gender": "male",
        "age": "30",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130788-ir0uhF0pyicd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130788
      },
      "rarity": "rare"
    },
    {
      "id": "rekka-hoshimiya",
      "name": "Rekka Hoshimiya",
      "alt_names": [
        "烈火星宮"
      ],
      "role": "supporting",
      "description": "A Third Generation pyrotechnic, Lieutenant of Special Fire Force Company 1, and priest of the Holy Sol Temple. He is an eccentric and enthusiastic man. Always confident and expressive in his speech.\n\n~!He is one of several people using “insects” to turn people into infernals.!~",
      "metadata": {
        "gender": "male",
        "age": "23",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130789-LWUWKnST7XP2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130789
      },
      "rarity": "rare"
    },
    {
      "id": "karim-flam",
      "name": "Karim Flam",
      "alt_names": [
        "カリム・フラム"
      ],
      "role": "supporting",
      "description": "Karim is a second generation pyrotechnic, a Lieutenant of Special Fire Force Company 1, and priest of the Holy Sol Temple. He is a serious and cautious young man. He shows a high disrespect towards strangers, which can result in him insulting people.",
      "metadata": {
        "gender": "male",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130790-98TypEQSKtHj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130790
      },
      "rarity": "rare"
    },
    {
      "id": "benimaru-shinmon",
      "name": "Benimaru Shinmon",
      "alt_names": [
        "紅丸新門",
        "Beni",
        "Waka",
        "Asakusa no Hakaiou (浅草の破壊王)",
        "Asakusa's King of Destruction",
        "Moonlight Kamen (むーんらいと仮面)",
        "Moonlight Mask"
      ],
      "role": "supporting",
      "description": "Benimaru Shinmon is a hybrid Second and Third Generation, as well as the Captain of Special Fire Force Company 7. Benimaru is regarded as the strongest Fire Officer in the Special Fire Force. He is known as \"Asakusa's King of Destruction\" because of the devastating power that he is capable of unleashing. He is also an extremely skilled hand-to-hand combatant, as shown when he easily outmaneuvered and overpowered the combined might of Maki Oze, Shinra Kusakabe, Tamaki Kotatsu, Arthur Boyle, and Takehisa Hinawa. He possesses the rare trait of being a Second and Third Generation, which ultimately allows him to ignite his own flames willingly, and also control flames from an external source. He can use his brigade's matoi as a pole to fly to long-distance areas, and by using his Second Generation ability, can control the flames of other ignited matoi and direct them to a certain place. He can control the direction and speed of bullets in the same fashion as Takehisa. He is also capable of unleashing an immensely powerful blast that resembles a crimson-coloured moon, which is strong enough to kill a Demon Infernal.\n\nBenimaru is a practitioner of the iaido martial arts. Instead of using a sword, he can create a sharp blade of flames, a technique branching from his unique Iai Hand-Sword: First Form fighting style.",
      "metadata": {
        "gender": "male",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130848-AuuIm6GR8ody.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130848
      },
      "rarity": "rare"
    },
    {
      "id": "hikage",
      "name": "Hikage",
      "alt_names": [
        "ヒカゲ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "female",
        "age": "10",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130849-fXykXoZxDTZE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130849
      },
      "rarity": "rare"
    },
    {
      "id": "tooru-kishiri",
      "name": "Tooru Kishiri",
      "alt_names": [
        "トオル岸里"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130850-thF6qsqrw9Kr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130850
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T18:42:42.648Z"
}