{
  "work_id": "tower-of-god",
  "count": 25,
  "characters": [
    {
      "id": "twenty-fifth-baam",
      "name": "Twenty-Fifth Baam",
      "alt_names": [
        "스물다섯번째 밤",
        "Twenty-fifth Bam",
        "Bam",
        "Baam",
        "Yoru",
        "二十五日の夜",
        "Black Turtle",
        "Completed One",
        "Berserker Boy",
        "The Wild Card"
      ],
      "role": "protagonist",
      "description": "__Species:__ Human\n__Height:__ 168cm (Part 1), 180cm (Part II)\n__Rank:__ Irregular\n__Position:__ Wave Controller\n__Born:__  ~!Floor of Death!~\n__Occupation:__  ~!FUG Slayer Candidate!~\n\nTwenty-Fifth Baam is an Irregular and one of the main protagonists of Tower of God. Bam entered in search of his best friend Rachel, and after passing Headon's test he was deemed worthy to climb the Tower.\n\nIn Part I, he is a highly empathetic and caring young man, understanding little of life, having had virtually no contact with people before meeting Rachel and later entering the Tower. He hates loneliness and other people's loneliness. He is considered very naive and knows little about the Tower. During Part I, his only reason for climbing the Tower is to be with Rachel.\n\nIn Part II:\n~!\nHe was forced to join FUG, and received then the name of Jue Viole Grace (쥬 비올레 그레이스), the Slayer Candidate, to keep his real identity hidden. As Viole, he is far more violent. He now has friends to protect and will not hesitate to fight if it means protecting them. He now completely understands that in order to climb the Tower, he must be pre-emptive and prepared to engage in combat and eradicate all opposition. He's become more introverted, rarely ever speaking or displaying any signs of emotion. He's also quite cold and calculating, interacting with others only out of necessity and will take advantage of a situation to defeat his opponents.\n\nLater in the Part as FUG's hold on him weakens, he begins to be more expressive and talkative. Later, when he officially meets with Khun and Rak for the first time in seven years, he smiles happily and embraces them, showing that his original personality that he had hidden away to protect himself from FUG's influence was resurfacing.\n!~\n\nIn Part III:\n~!\nHe is completely back to his normal self, with the addition of some improvements in areas such as confidence. He additionally dropped the 'Viole' look and sticks with an updated 'Baam' look. He is still often called both Baam and Viole now. He now goes through new questions such as what to do when he can't save everyone, and old questions, such as why everyone can't just get along, but he is more accepting of things than before, all the while continually fighting stronger enemies and becoming stronger.\n!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84769-NaLHptr4KXKd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84769
      },
      "rarity": "epic"
    },
    {
      "id": "aguero-agnis-khun",
      "name": "Aguero Agnis Khun",
      "alt_names": [
        "쿤 아게로 아그니스",
        "クン · アゲロ · アグネス",
        "Koon Aguero Agnis",
        "Blue Turtle",
        "A.A",
        "Mr. Mask"
      ],
      "role": "protagonist",
      "description": "__Species:__ Human\n__Height:__ 170 cm\n__Rank:__ Regular\n__Position:__ Light Bearer\n\nKhun Aguero Agnis is a E-Rank Regular from Khun Family, and is often referred to simply as \"Khun\". He is a best friend of [Twenty-Fifth Bam](https://anilist.co/character/84769/TwentyFifth-Bam), one of the main protagonists of Tower of God.\n\nKhun relies heavily on his master intellect, however, this is not his only strong field. He also has exceptional physical attributes and is a skilled Light Bearer. His powers in combat cannot be denied.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84781-sNnhOZ1SZ66f.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84781
      },
      "rarity": "epic"
    },
    {
      "id": "rak-wraithraiser",
      "name": "Rak Wraithraiser",
      "alt_names": [
        "라크 레크레이셔",
        "ラーク・レクレイシャー",
        "Gator",
        "Rac Wreckraiser"
      ],
      "role": "protagonist",
      "description": "__Species:__ Wraithraiser, ~!Native One!~\n__Height:__ 3m (Decompressed)\n__Rank:__ Regular C-Rank\n__Position:__ Spear Bearer\n\nRak Wraithraiser is a Regular. He unwillingly teamed up with [Baam](https://anilist.co/character/84769/TwentyFifth-Baam) and [Khun](https://anilist.co/character/84781/Khun-Aguero-Agnis) during the first test on the Second Floor and passed other tests with them. He was selected for the Spear Bearer position. He is a large and powerful warrior and a very confident individual.\nRak is originally a 3 meter tall creature, but after he mocked the Ranker [Yu Han Sung](https://anilist.co/character/141286/Sung-Yu-Han), the Second Floor Test Director, his body was shrunken by them. He eventually found out how to get back to his original size. As a being who can control their body size, he is a Compression Licenser.He is a direct descendant of the Native One, a type of being that is able to rule over the elements in the Tower. \n\nRak doesn't come off as particularly smart; he thinks he's superior to almost everyone else and so refers to other people as \"turtles\". He occasionally calls himself \"Rakleader\" when he is feeling particularly full of himself, although Khun may be to blame for indulging him. He tries to make himself appear tough, although he's actually a bit of a baby sometimes. However, he does seem to have a little of a caring side in him.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84783-m1qgQvKVAoNn.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84783
      },
      "rarity": "epic"
    },
    {
      "id": "rachel",
      "name": "Rachel",
      "alt_names": [
        "라헬",
        "ラへル",
        "Michelle Light",
        "미쉘 라이트 "
      ],
      "role": "protagonist",
      "description": "__Species:__ Human\n__Rank:__ Extra\n\nRachel, also known as Michelle Light was Baam's best and only friend as she was the only one to visit him in his \"cave\". She longs to see the stars which is one of the fabled rewards waiting at the top of the Tower, because she \"fears the Night\".\n~!Like Baam she is an Irregular.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135466-vgW4DewsSkER.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135466
      },
      "rarity": "epic"
    },
    {
      "id": "headon",
      "name": "Headon",
      "alt_names": [
        "헤돈",
        "へドン"
      ],
      "role": "supporting",
      "description": "Headon is the Guardian of the First Floor and is the caretaker of the Tower. He has an appearance reminiscent of a white rabbit because of his long ears.\n\nHeadon talks in a friendly tone, but has been shown to have a cruel and manipulative streak. He presents his ideas and opinions in a logical and pragmatic manner, but his goals and desires themselves are not understood. He is perfectly willing to manipulate dozens of lives and create the nucleus of civil unrest to attain his mysterious goal.\n\nAlthough most Administrators normally stay on their Floors, Headon seems to be the only Administrator with the ability to visit other Floors of the Tower. It is said that Headon is the most experienced Administrator of the Tower. Although that only means he was the first Administrator Zahard met and therefore the first one to carry out the roles of a Administrator, that doesn't mean he's the oldest.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84775-z3qbgw45QGW8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84775
      },
      "rarity": "uncommon"
    },
    {
      "id": "yuri-ha-jahad",
      "name": "Yuri Ha Jahad",
      "alt_names": [
        "하유리자하드",
        "ユリ・ザハード",
        "Yuri Jahad",
        "Ha Yuri Zahard",
        "Violent Turtle"
      ],
      "role": "supporting",
      "description": "Ha Yuri Jahad, more commonly known as Yu​ri Jahad (lacking her family name), is a High Ranker and Princess from the Ha Family. Notably, she is one of the most famous Princesses and therefore highly favored, with much political influence throughout The Tower.\n\n~!She is the owner of Black March and Green April, two of the 13 Month Series. She is the first Princess to own two 13 Months at the same time since Garam Jahad. Notably, she is one of the most famed Princesses, and perhaps one of the most favored.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84777-xeZZ3a9YM2Cn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84777
      },
      "rarity": "uncommon"
    },
    {
      "id": "urek-mazino",
      "name": "Urek Mazino",
      "alt_names": [
        "우렉마지노",
        "Ray Barracuda"
      ],
      "role": "supporting",
      "description": "__Species:__ Human\n__Born:__ Outside\n__Height:__ 195 cm\n__Rank:__ Irregular, High Ranker #4 (Currently)\n__Position:__ Fisherman\n__Occupation:__ Wolhaiksong (Vice Captain)\n\nUrek Mazino is an Irregular, currently 4th in Rank. He was the strongest active Ranker before [Jahad](https://anilist.co/character/126030/Jahad) became active once again. He is also the most recent person to be part of the Top 5 High Rankers inside the Tower.\n\nHe is considered to be on the same level as Phantaminum by weaker Rankers, however, his true rank is almost impossible to determine in terms of the Top 4 ranks because the top 2 Rankers are inactive and thus, cannot be compared with Urek. He mentioned to [Bam](https://anilist.co/character/84769/TwentyFifth-Bam) on the 43rd Floor that they would meet again later on the 77th Floor, then left the floor. His current location is unknown.\n\nUrek is said to have a ruthless personality, leading him to be respected by all those who dare call themselves men and at the same time seems to be disliked by seemingly every woman he meets. He is also shown to be extremely confident to the point of arrogance, often ridiculing the efforts of those who were no match for him. Despite his ruthlessness and boastful nature, he still wants to help others and friends in need. He will also help strangers if he thinks they are \"worthy\" to be helped. He respects one's courage, determination, and nobility.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124137-ZMkbYja3ty77.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124137
      },
      "rarity": "uncommon"
    },
    {
      "id": "endorsi-jahad",
      "name": "Endorsi Jahad",
      "alt_names": [
        "엔도르시자하드",
        "エンドロシ・ザハード",
        "Androssi Zahard"
      ],
      "role": "supporting",
      "description": "__Height:__ 167 cm\n\nEndorsi Jahad is a Regular and one of Jahad's Princesses, currently climbing the Tower. Among Regulars, Endorsi is unmatched in terms of physical ability. Among the Jahad's Princesses, she is fairly warm and more human.\n\nHer parents weren't around when she was born. She was then adopted by a couple from the Middle Area before she became a princess. Later, her adoptive parents were killed by Snake Charmer.\n\nHer character concept is that of a 'Normal modern girl' taking great care of her looks, stressed about her weight, wanting to hear she is pretty while acting confident. A girl who is yet to mature fully.\n\nEndorsi doesn't believe in being friends with a guy at first and says that guys and girls cannot be friends and can only be boyfriend and girlfriend and later states that she is not allowed to date anyone because she is a Princess of Jahad, but later on she catches feelings for Bam and calls Bam her boyfriend.",
      "metadata": {
        "gender": "female",
        "age": "300~",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124138-2WCq8CD8FEsv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124138
      },
      "rarity": "uncommon"
    },
    {
      "id": "jahad",
      "name": "Jahad",
      "alt_names": [
        "자하드",
        "ザハード",
        "Zahard",
        "King of the Tower"
      ],
      "role": "supporting",
      "description": "__Species:__ Human\n__Born:__ Outside\n__Age:__ Older than his Empire\n__Height:__ 240 cm\n__Hair color:__ Yellow\n__Eye color:__ Orange\n__Position:__ Fisherman\n__Rank:__ Ranker, High Ranker #3 (Currently)\n__Occupation:__ Ruler and King of The Tower\n\n__Jahad__ (자하드, \"Jahadeu\") is the famed \"King of the Tower\" and the most famous and greatest being residing inside; he is like a god to the inhabitants of the Tower. He is a High Ranker, currently retaining the 3rd spot in the ranking, and the overarching ruler of Jahad's Floors and founder of the Jahad Empire while still conquering the Tower.\n\nInfamous for his prevailing immortality, he has become the prime target of FUG.\n\nAfter the events of the Hidden Floor, Jahad came out of hibernation and is active once again, making him the highest ranked __Active__ Ranker in the Tower, right above [Urek Mazino](https://anilist.co/character/124137/Urek-Mazino). Due to his actions, Jahad can be considered the primary antagonist of the series.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126030-4YcOVizAjo4Z.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126030
      },
      "rarity": "uncommon"
    },
    {
      "id": "karaka",
      "name": "Karaka",
      "alt_names": [
        "카라카",
        "カラカ"
      ],
      "role": "supporting",
      "description": "Karaka is a Slayer in FUG. His secret hideout is located on the 97th Floor.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135465-2cvQwFpNSSh7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135465
      },
      "rarity": "uncommon"
    },
    {
      "id": "hwaryun",
      "name": "Hwaryun",
      "alt_names": [
        "화련",
        "カレン",
        "Hwa-Ryun",
        "Karen"
      ],
      "role": "supporting",
      "description": "__Species:__ Red Witch\n__Height:__ 168 cm \n__Rank:__ Regular\n__Position:__ Wave Controller, Scout, Guide\n\nHwaryun is a quiet person who says little and she has a gloomy and ominous aura. She is also quite manipulative.\n\nIn Part II, she's depicted as mischievous and teasing, as she clearly mocked the Viole impostor and repeatedly called him \"Pig\". She almost always smiles in mischief and probably a little bit of arrogance. She also tends to be extremely blunt, caring very little about other peoples' feelings; though this could be considered her way of spurring a person on. This leads her to seem very harsh.\n\nHwaryun is Viole's Guide but is also the Guide for FUG's Rankers notably Ha Jinsung. ~!It was revealed that she went into the Floor of Death first, instructing another Red-haired lady to lead the way for Yuri and Khun's team.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135467-AyW5hucXmmea.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135467
      },
      "rarity": "uncommon"
    },
    {
      "id": "elaine-lo-po-bia",
      "name": "Elaine Lo Po Bia",
      "alt_names": [
        "로 포 비아 엘레인",
        "Kaiser"
      ],
      "role": "supporting",
      "description": "Lo Po Bia Elaine (로 포 비아 엘레인, Lo Po Bia Ellein) formerly known as Kaiser the Name Hunter (이름 사냥꾼 카이저, ileum sanyangkkun kaijeo; \"Name Hunter Kaiser\") is a Regular who acted as the ruler of the third station of the Hell Train located on the 39th Floor, Name Hunt, for over a thousand years on behalf of her family. She is one of the 3 top D-rank Regulars.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135468-entAvKCX4NWG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135468
      },
      "rarity": "uncommon"
    },
    {
      "id": "jin-seong-ha",
      "name": "Jin-Seong Ha",
      "alt_names": [
        "하 진성",
        "Ha Jin-Sung",
        "Sanada Yutaka (真田ユタカ)",
        "Slaughterer of the Ha Family",
        "Candy Turtle"
      ],
      "role": "supporting",
      "description": "Jin-Seong Ha is a High Ranker of the Ha Family and a member of FUG. Jinsung has a carefree and fun-loving attitude, although this also serves as a mask to hide his true intentions. Since meeting Baam, his character has mellowed slightly to the point where he feels regret at the FUG's treatment of Baam.\nAs a member of the Ha Family and one of the top 100 High Rankers, Jinsung is an incredibly powerful High Ranker, extremely skilled with martial arts and incredibly physically powerful, his status heightening the standards one would expect of him.\n\nAdditionally, even the Elders and Slayers of FUG are wary of angering him, speaking volumes about his strength, with Khel Hellam commenting it was a waste to lose someone as powerful as Jinsung and Kallavan noted that Jinsung is far stronger than Karaka, one of the Slayers. In fact, he is such a monster that Hwa Ryun stated that even a Slayer would have trouble against him in a serious fight.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135469-26GzJx3bIxnH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135469
      },
      "rarity": "uncommon"
    },
    {
      "id": "anaak-jahad",
      "name": "Anaak Jahad",
      "alt_names": [
        "아낙자하드",
        "アナク・ザハード",
        "Anak Zahard"
      ],
      "role": "supporting",
      "description": "Anaak is introduced in the second floor, where she forms a team with Shibisu and Hatz.\n\n~!She introduces herself as one of Jahad's Princesses, but it's later revealed that she's actually the daughter of the real Anaak Jahad, who was impregnated by her lover and ran into hiding. Though she is only a demi-princess because of the diluted Jahad's blood in her, she used to possess two of the 13 Month Series at one point; something only a few Princesses have accomplished. She is climbing the Tower for revenge.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135470-4glp1GObkU7P.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135470
      },
      "rarity": "uncommon"
    },
    {
      "id": "eduahn-khun",
      "name": "Eduahn Khun",
      "alt_names": [
        "쿤 에드안",
        "Koon Eduan"
      ],
      "role": "supporting",
      "description": "Eduahn is a High Ranker, currently in the 6th ranking. He is the head of the Khun Family, one of the 10 Great Families, and also the father of numerous children from the Khun Family, such as Aguero Agnis.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135471-fJftBiJajXrb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135471
      },
      "rarity": "uncommon"
    },
    {
      "id": "wangnan-ja",
      "name": "Wangnan Ja",
      "alt_names": [
        "자왕난",
        "Oujinaru (王野成)",
        "Yellow Prince"
      ],
      "role": "supporting",
      "description": "Ja Wangnan aspires to be the king of the whole Tower. He values his determination in life more than anyone else's desires. He plans to scale up the Tower's Floors and reach the true top of the Tower, unlike those who have given up.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135472-8gshcVPWGP2s.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135472
      },
      "rarity": "uncommon"
    },
    {
      "id": "ran-khun",
      "name": "Ran Khun",
      "alt_names": [
        "쿤 란",
        "Ran Koon"
      ],
      "role": "supporting",
      "description": "Ran Khun is a Regular currently climbing the Tower. He was formerly Khun's teammate and was also formerly a member of the FUG team created for Jue Viole Grace. He often describes situations or people that are troublesome as 'annoying'. After the events of the Workshop Battle, he formed into a new team with Khun's direction. He is also from the same branch of the Khun family as Mascheny Jahad.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135474-2DfQO8OKNiNr.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135474
      },
      "rarity": "uncommon"
    },
    {
      "id": "ehwa-yeon",
      "name": "Ehwa Yeon",
      "alt_names": [
        "연이화",
        "Yeon Family's Flare",
        "Yeon Yihwa",
        "Rika Ren (王野成)"
      ],
      "role": "supporting",
      "description": "Ehwa Yeon, known by some as the \"Yeon Family's Flare\", is a member of the Yeon Family one of the 10 Great Families. She is a Regular climbing with the rest of her team, having recently participated in the Workshop Battle.",
      "metadata": {
        "gender": "female",
        "age": "18-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135475-XyLwecfoZB50.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135475
      },
      "rarity": "uncommon"
    },
    {
      "id": "white",
      "name": "White",
      "alt_names": [
        "화이트",
        "Hoaqin"
      ],
      "role": "supporting",
      "description": "The tenth Slayer of FUG, one of the 2nd generation of Slayers and until the latter events of the Hell Train, only his name and soul remained while his body had been lost. It was revealed during the Dallar Show that Hoaqin and his other siblings, in their combined form, was actually White.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135476-SyoPUI344NTM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135476
      },
      "rarity": "uncommon"
    },
    {
      "id": "boro",
      "name": "Boro",
      "alt_names": [
        "보로"
      ],
      "role": "supporting",
      "description": "Boro (보로, Boro) is a D-rank Fisherman and an experienced level Shinsoo Martial Artist. Boro had already boarded the Hell Express twice in the past.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135477-LOrNkfpJGVFv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135477
      },
      "rarity": "uncommon"
    },
    {
      "id": "gustang-po-bidau",
      "name": "Gustang Po Bidau",
      "alt_names": [
        "포 비더 구스트앙"
      ],
      "role": "supporting",
      "description": "__Sobriquet__: Aloof Wave\n__Rank__: 14\n\nPo Bidau Gustang is the head of the Po Bidau Family, one of the 10 Great Warriors and the first living being to systematically record Shinsoo. Po Bidau Gustang is the Tower’s most famous Wave Controller and writer. Excluding the eccentrics within The Workshop, he probably knows the most about The Tower. He is shown to be an arrogant individual, with such great reputation and influence in his family, that even his family members think he has omniscient intellect.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135478-hC2ZpgUpgtUS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135478
      },
      "rarity": "uncommon"
    },
    {
      "id": "garam-jahad",
      "name": "Garam Jahad",
      "alt_names": [
        "가람 자하드",
        " Gahrahm Zahard",
        "Hermit in the North City",
        "The Princess of the Deep Colored Sea"
      ],
      "role": "supporting",
      "description": "She's one of the princesses of Jahad. She is known as the Hermit in the North City of the 43rd Floor and the Princess of the Deep Colored Sea, she is also the owner of Blue August and Indigo July.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b136221-GTdd5fcMV4FT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 136221
      },
      "rarity": "uncommon"
    },
    {
      "id": "lero-ro",
      "name": "Lero-Ro",
      "alt_names": [
        "레로-로",
        "レロ・ロー"
      ],
      "role": "supporting",
      "description": "Lero-Ro is a former Examiner of the Second Floor. He is an exceptionally strong Ranker, to the point that even Quant, also a former Test Administrator (and a haughty one), would constantly boast about his strength. He was supposedly the strongest Second Floor Test Administrator and is particularly skilled in the use of Shinsoo. He was also the Light Bearer position instructor. He is fairly old, older than Yuri Zahard, as he stated that Anak Zahard didn't live up to a Princess's chaotic expectations like Yuri Zahard did, whom he met when they were both Regulars. He and Quant are awkwardly described as a \"Set Menu\", explained by the fact that Lero-Ro and Quant climbed the Tower together like a team. He is apparently quite famous, and he took over 300 years to climb the Tower.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137948-NYeFyFDeIoHd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137948
      },
      "rarity": "uncommon"
    },
    {
      "id": "sachi-faker",
      "name": "Sachi  Faker",
      "alt_names": [
        "사치 페이커"
      ],
      "role": "supporting",
      "description": "Sachi Faker, also known as the \"Ticket Hunter\", is a D-rank Regular and part of the 3 top predators within the Hell Express. He is apparently the one that Regulars should be most afraid of at the first station.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137949-1xsLbOVxvNcY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137949
      },
      "rarity": "uncommon"
    },
    {
      "id": "evan-edrok",
      "name": "Evan Edrok",
      "alt_names": [
        "에반 에드록",
        "エヴァン・エドロック"
      ],
      "role": "supporting",
      "description": "Evan Edrok is a High Ranker as well the Chief Guide of Zahard Royalty, which is a unique position in the Tower. He always seems to follow his partner, Ha Yuri Zahard.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137950-OIBBqjzDidge.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137950
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-23T23:19:58.502Z"
}