{
  "work_id": "real",
  "count": 11,
  "characters": [
    {
      "id": "tomomi-nomiya",
      "name": "Tomomi Nomiya",
      "alt_names": [
        "野宮朋美"
      ],
      "role": "protagonist",
      "description": "Nomiya used to be the captain in the basketball team of his institute before he left. He had an accident while taking a girl for a ride on his motorbike some time ago and now he often visits her because he feels guilty. He&#039;s now trying to make his life better while helping people and trying to help in whatever he can in a wheelchair basketball team.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8732-W6z3WCk52BZv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8732
      },
      "rarity": "epic"
    },
    {
      "id": "kiyoharu-togawa",
      "name": "Kiyoharu Togawa",
      "alt_names": [
        "戸川清春",
        "Vince",
        "Gawa"
      ],
      "role": "protagonist",
      "description": "Forced to spend all of his free time after school practicing the piano, Togawa was something of an outcast to the rest of his junior high classmates. During the last PE class of the first semester, Togawa agrees to race the 100M dash against the fastest boy in his class and nearly beats him, earning an invitation to the school&#039;s track team. Togawa soon dedicates his life to becoming the fastest sprinter in the nation, but just as his goal seems in reach, he is diagnosed with osteosarcoma and loses his right leg below the knee. Togawa spends much of his time after the amputation in isolation, feeling his life is over until meeting Tora, an older man with an identical disability. Tora, a cool jet-setting tattoo artist, serves as a mentor to Togawa and introduces him to the world of wheelchair basketball through his team the Tigers. Togawa is a fiercely competitive player, and once left the team because he felt the other players weren&#039;t as serious as he was. Missing the game, Togawa returns to the Tigers, yet provokes a team mutiny early in the series because of his often &quot;unrealistic expectations.&quot; Further conflicts arise when Togawa is offered a spot on the Japanese national team and is invited to join the Dream, the Tigers&#039; arch-rivals. Togawa is rated a &quot;4.5&quot; on the wheelchair basketball point scale.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12236-B3o8Lhd3sZMl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12236
      },
      "rarity": "epic"
    },
    {
      "id": "hisanobu-takahashi",
      "name": "Hisanobu Takahashi",
      "alt_names": [
        "高橋久信"
      ],
      "role": "protagonist",
      "description": "At the start of the manga, Takahashi is a typical high school alpha male-- captain of the basketball team, popular with girls, effortlessly smart, and a bully to other &quot;inferior&quot; students. In an effort to give his girlfriend a ride home after school, he steals a bicycle, is chased into traffic, and is hit by a garbage truck, rendering him paralyzed from the chest down. Realizing that his popular days are over, Takahashi feels that he has nothing to live for, and that he has dropped from an &quot;A&quot; class person to lower than an &quot;E&quot; class (Takahashi is obsessed with ranking the people around him - in ranks from A to E, with A being the best). Nomiya, a former teammate, is one of the few visitors Takahashi receives, and the visit is initially enough to upset Takahashi and inspire him to rehabilitate. After realizing he will never recover, however, Takahashi gives up and refuses to help himself, even going so far as to tell his mother to die and never come back. The hospital staff calls Takahashi&#039;s father, hoping that a visit to the country will help in his recovery, but Takahashi hasn&#039;t seen his father in eight years and the visit remains highly uncomfortable. After spending time with his father, Takahashi breaks down and admits that he has a lot of unexplored anger and resentment towards his father for abandoning the family.\n\n(Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/17211.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17211
      },
      "rarity": "epic"
    },
    {
      "id": "kumi-azumi",
      "name": "Kumi Azumi",
      "alt_names": [
        "安積久美"
      ],
      "role": "supporting",
      "description": "Azumi is Togawa&#039;s childhood friend.    At the time, it seems they liked each other a lot, Togawa promising himself to tell her &quot;when [he] beats 11 seconds&quot;. Unfortunately, this race was the last one he participated to as the sarcoma in his leg prevented him from finishing it, thus, not beating 11 seconds. With him in the athletic class, she was the only one to stubbornly persist in visiting him, though his father close them up from anyone&#039;s eye, to protect his son.    After his meeting with Tora, he accepts her presence showing her his amputated leg, and she surprises him when she names the procedure, indicating him she did research about it.    She is the Tigers&#039; manager, often playing the peacemaker between Togawa and his teammates, given he has temper.    She met Nomiya in driving school, where she admits she is trying to have her licence so that she can drive Togawa to games and practices.    She is shy and self conscious, though can get quite angry (in her thoughts) when Togawa doesn&#039;t acknowledge her efforts with dealing with him.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33473.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33473
      },
      "rarity": "rare"
    },
    {
      "id": "katsuta-tora",
      "name": "Katsuta Tora",
      "alt_names": [
        "勝田虎"
      ],
      "role": "supporting",
      "description": "Tora is a tattooist and a player for the Tigers&#039; team in its beginnings. He has a huge tiger tattoo on his back, reminding of his name which also means &quot;tiger&quot;. He is the one making Togawa stand up for himself and fight in life after his amputation.    Tora is a jolly character full of strength. Like Togawa, he has a &quot;rotation&quot; for his amputated leg, but that doesn&#039;t seem to faze him. He meets Togawa while this one is performing a check for his operation, and knows already his name, barely introducing himself and telling Togawa to use a wheelchair before speeding away. When Yama takes Togawa to one of the Tigers&#039; session, Tora&#039;s strength and speed astonish him, when he thought he could no longer feel anything that could compete with the feelings he had while running.    When Togawa comes back to see the Tigers after crying after Azumi, Tora states it&#039;s &quot;good, excellent&quot; (the crying after a girl, while Togawa tries denying everything), puzzling everyone, then makes Togawa drive a wheelchair, integrating him by making him chasing them while he knows Togawa isn&#039;t good with wheeling a chair, thus considering him equal to the rest.    He then brings him to his tattoo shop, where Togawa has a fright given that Tora&#039;s apprentices mistake Togawa for Tora and pounce on him. Getting him a bit drunk, Tora manages to make Togawa spill everything he has bottled up since his amputation, particularly his feelings towards his father, feeling he is &quot;nothing but a baggage to him&quot;. Once he&#039;s finished, Tora tells him to fight for himself no matter the judgment of others, and gives him his basketball wheelchair, as &quot;brother with the same leg&quot;. The day after, Togawa asks him for a star tattoo on his chest, as proof for his new life, being the last client of Tora&#039;s shop, considering Tora is going to travel around the world right after.    Tora is indubitably the one that had the biggest influence on the turn of Togawa&#039;s life right after his amputation, showing him the world doesn&#039;t end after this. This is in his memory that Togawa doesn&#039;t want the Tigers to end or even leaving them, though the Dreams&#039; manager, a national team, wants him to.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33506.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33506
      },
      "rarity": "rare"
    },
    {
      "id": "yamauchi-hitoshi",
      "name": "Yamauchi Hitoshi",
      "alt_names": [
        "山内仁史",
        "Yama"
      ],
      "role": "supporting",
      "description": "Yama meets Togawa in the same time as Tora. He is also in the Tigers&#039; team and introduces Togawa to it. Yama has an illness that makes him lose little by little the use of his muscles.     Yama was the manager of the Hanazawa Middle School track team before his illness prevented him from. He knows every national 100m race winner, even stating that the last one was won by Togawa as, before he stopped because of his leg, he &quot;ran the fastest&quot;. He talks to Togawa about his illness (saying he will not live after 20) without being resentful, what Togawa doesn&rsquo;t understand, being depressive after his own operation. Yama tells him that &quot;nobody knows why we&#039;re alive. We don&#039;t have time to bother&quot;.    When Yama can hardly go out of his home, Togawa often visits him, always with a remainder of the Tigers, and Yama is always cheerful about it. He once assumed Azumi and Togawa were together, saying they were &quot;a nice couple&quot; and asking about their engagement, embarrassing them both.    As the disease progresses, Yama becomes very negative and bitter, making Togawa distressed. To help him, Togawa tells him how much of a hero he is to him, showing so much normality when he knew he was doomed, and helping him too.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b33507-uGluUuNgx0qj.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33507
      },
      "rarity": "rare"
    },
    {
      "id": "mitsuru-nagano",
      "name": "Mitsuru Nagano",
      "alt_names": [
        "長野満"
      ],
      "role": "supporting",
      "description": "A huge 190 cm tall wheelchair basketball player who originally schools Nomiya and Togawa when they try to hustle money on the basketball court. Since Togawa has never lost a game to another wheelchair basketball player before, he is inspired to rejoin the Tigers in order to get revenge on Nagano. Though Japanese, Nagano attends New South Wales University in Australia and calls everyone \"mate.\" Impressed by Togawa's skills, Nagano eventually joins the post-mutiny Tigers.\n\n(Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42180.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42180
      },
      "rarity": "rare"
    },
    {
      "id": "natsumi-yamashita",
      "name": "Natsumi Yamashita",
      "alt_names": [
        "山下夏美",
        "Nacchan (なっちゃん)"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b77091-9jZexcwz0Phk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 77091
      },
      "rarity": "rare"
    },
    {
      "id": "shiratori-kazuo",
      "name": "Shiratori Kazuo",
      "alt_names": [
        "白鳥加州雄",
        "The Scorpion",
        "Scorpion Shiratori"
      ],
      "role": "supporting",
      "description": "A pro-wrestling heel working his way back to his feet after a traffic accident.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b195188-0hFbVINJS9K8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 195188
      },
      "rarity": "rare"
    },
    {
      "id": "hisayuki-takahashi",
      "name": "Hisayuki Takahashi",
      "alt_names": [
        "高橋久行"
      ],
      "role": "supporting",
      "description": "Takahashi's father. During Takahashi's childhood, he was a typical salaryman who worked long hours and drove an expensive car. He also introduced his son to the world of basketball, hand-crafting a backboard and teaching him several techniques. Takahashi lived for playing basketball with his father, and was devastated when he abandoned the family 8 years before the story. Fed up with the salary man lifestyle, Takahashi's father moved to the country and is currently living a much simpler life making and selling pottery. After Takahashi's accident, his father has become responsible for his son's care, refusing to give in to Takahashi's outbursts and cynicism.\n\n(Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b202659-MVMLx9FygdYQ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 202659
      },
      "rarity": "rare"
    },
    {
      "id": "fumika-honjou",
      "name": "Fumika Honjou",
      "alt_names": [
        "本城ふみか"
      ],
      "role": "supporting",
      "description": "Fumika is one of the few people who visit Takahashi in the hospital after his accident (perhaps because she feels somewhat responsible for what happened). Takahashi doesn't think very highly of her (ranking her a \"C\" at best), but is somewhat surprised to find that she still considers them a couple despite his condition. She tells Takahashi how her dog, Angelina, will also have to use a wheelchair-like device, and that just because someone is \"damaged\" does not mean their life is over.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b202724-uZu8w62aaPNB.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 202724
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-25T01:15:24.583Z"
}