{
  "work_id": "arifureta-from-commonplace-to-worlds-strongest",
  "count": 15,
  "characters": [
    {
      "id": "yue",
      "name": "Yue",
      "alt_names": [
        "ユエ",
        "Yue Nagumo"
      ],
      "role": "protagonist",
      "description": "Yue is a vampire who was imprisoned in the abyss. She was betrayed by her uncle and peers because of her monstrous magic and regeneration that made her nearly immortal.\n\nWith a fateful encounter, Yue met Hajime in a sealed room in the abyss. After being rescued, Yue was the person who suppressed Hajime's madness before he became a monster and she soon became Hajime's \"special\" person after what transpired in the Abyss.\n\nHer appearance was described to be like the highest grade bisque doll with blonde hair and crimson eyes. She is 323 years old despite her small physique because she is a Vampire Princess. Her name Yue isn't her real name and was only given by Hajime so that she could leave her dark past and move on.\n\n~!Her real name is Aleytia.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b132847-rxYUEsbcLxTm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 132847
      },
      "rarity": "epic"
    },
    {
      "id": "hajime-nagumo",
      "name": "Hajime Nagumo",
      "alt_names": [
        "南雲ハジメ",
        "Otaku",
        "Love Smashers",
        "Duelist Smasher Whitehead",
        "Master",
        "Papa"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm\n\nHajime was a complete otaku and always came to class with a sleepy expression. He was always bullied and was disliked by both of his male and female classmates for being close to their idol-like classmate Kaori. After wishing for his annoying classmates to be summoned to another world, the next thing he saw was they were on top of a pillar like structure in another world to become heroes.\n\nHe obtained the job of \"Synergist\" and continued to be bullied due to also being weak in this new world. He eventually fell into an abyss due to being hit by a classmate's fireball where he survived though a hell-like environment to become the powerful man he is today.\n\nHajime at the beginning of the story is said to have black hair and also has a slim body. He also had a kind face and attitude. But after falling in the abyss and eating a wolf-like monster, his body began to violently degenerate. When he drunk the sacred water, it made his body heal by destroying his bones and muscles then healing over and over again until he got a very muscular body due to overcompensation.\n\nDue to the stress of breaking and healing, his hair turned white, a victim of the Marie Antoinette syndrome. His eyes also turned red and his body gained tattoo-like red lines which is the sign of him becoming a demonic monster similar to the monsters he ate that also possessed red lines along their bodies.\n\nHis personality was at first kind though he was considered incompetent. But after falling in the abyss, he became cruel and would kill any person who wants to cause him misfortune. He would also smile in front of danger which made Shia call him a new species of monster called \"Predator.\" He may be cruel but he cares for his comrades.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b132848-HsUfgM0nr2Dz.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 132848
      },
      "rarity": "epic"
    },
    {
      "id": "shia-haulia",
      "name": "Shia Haulia",
      "alt_names": [
        "シアハウリア",
        "Worthless Rabbit",
        "Bugged Rabbit"
      ],
      "role": "protagonist",
      "description": "Shia first appeared when Hajime and Yue were traveling in the Raisen Grand Canyon while being chased by a monster like a \"shameless rabbit.\" She was in this situation because she foresaw Hajime would help her family. She soon became their traveling companion in the long run, having the attitude to get clingy to Hajime with energetic words and actions.\n\n~!She came from a demi-human race tribe called Haulia, RabbitMan. She was described as having a body with beautiful curves, \"melon\" sized chest, grey hair having traces of blue pigments, blue eyes and of course bunny ears. She was discriminated by her own race because she was born different as a demi-human being able to use magic which resulted to Haulia tribe's banishment.\n\nShia wields a war hammer \"Doryukken\" made, named and enhanced by Hajime. Her age is 16 and has a job class of Diviner and also known for her Physical strengthening and \"Foresight\" ability.!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b132850-MQx1CPfMYGPC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 132850
      },
      "rarity": "epic"
    },
    {
      "id": "tio-klarus",
      "name": "Tio Klarus",
      "alt_names": [
        "ティオ・クラルス",
        "Tio Clarce",
        "Hopeless Pervert"
      ],
      "role": "protagonist",
      "description": "Tio is a \"pervert\" with the main status of M but she is honest and the words this one speakeas are similar to the old legends. Her \"M\" personality was made into this because she was defeated by Hajime's party in the northern mountains of the village of Ul. She's loyal and devoted herself to Hajime to become his slave and calls him since then \"Master.\"\n\n~!\nTio originally came from the Ryujin tribe Clarce, half-dragon. Her magic and defense are significantly high especially in her Dragon form, even Hajime's party attacks only cracked the scales of this dragon. She is aged 563 years old and respected by Yue but not for so long. Her appearance is a woman of her 20's with \"watermelon\" chests and golden eyes. Her dragon form is a few meters long with golden eyes and has black dragon scales. Her job class is Guardian.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b132852-BDazhNHpH8ZA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 132852
      },
      "rarity": "epic"
    },
    {
      "id": "kaori-shirasaki",
      "name": "Kaori Shirasaki",
      "alt_names": [
        "白崎香織"
      ],
      "role": "supporting",
      "description": "Kaori is one the most caring personalities in the series. She is a classmate of Hajime's back in their original world. She admires Hajime for his \"strong\" personalty and is the only classmate who pays attention to Hajime's existence in class even if she is popular in their school.\n\nWhen summoned to another world, she receives the \"Healer\" job.\n\n~!\nKaori was unable to notice her love for Hajime until he fell in the abyss which inspired her to become stronger in order to search for him. After reuniting with Hajime, she then joins their dungeon expeditions after confessing to him.!~\n\n~! In volume 6, while Hajime is off fighting the first of the God's Apostles alone. Kaori becomes gravely injured back at the capital while fighting off one of her classmates. After Hajime wins the fight he learns of Kaori's weakened state and decides to transfer the soul of Kaori into the body of the apostle. In doing so Kaori becomes stronger all across the board and over time she learns to use the same abilities the apostle used against Hajime. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b132849-DWYOwdlxsEqV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 132849
      },
      "rarity": "uncommon"
    },
    {
      "id": "myuu",
      "name": "Myuu",
      "alt_names": [
        "ミュウ"
      ],
      "role": "supporting",
      "description": "A young girl from the Sea-Dweller Tribe who got kidnapped to be sold as a slave, but was saved by Hajime Nagumo and Shea Haulia while they came across her in Fuhren. Initially,​ she had been calling Hajime as \"Onii-chan\", but later changed to call him \"Papa\".",
      "metadata": {
        "gender": "female",
        "age": "4",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n132851-xadySjME94DK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 132851
      },
      "rarity": "uncommon"
    },
    {
      "id": "shizuku-yaegashi",
      "name": "Shizuku Yaegashi",
      "alt_names": [
        "八重樫 雫",
        "Shizushizu",
        "Onee-sama"
      ],
      "role": "supporting",
      "description": "Kaori's best friend. She's the childhood friend of Kouki and her family runs a dojo.\n\nShizuku is a hardworking, kind and caring girl who passes her time on practicing her swordsmanship. She is regarded as a cool and stoic beauty, but actually has a girlish side that likes cute things, such as the color pink, as well as cute animals like cats and bunnies. She has often hid her true feelings and would put up a brave face, as a front so other people did not worry about her.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b141266-XbfZ50w8R7fN.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 141266
      },
      "rarity": "uncommon"
    },
    {
      "id": "aiko-hatayama",
      "name": "Aiko Hatayama",
      "alt_names": [
        "畑山愛子",
        "Ai-chan"
      ],
      "role": "supporting",
      "description": "She is the Homeroom Teacher who along with her students from Japan got involved in the Summoning Incident, and ended up in Tortus. She is a responsible teacher and cares for her students a lot.\n\n(Source: Wikia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142270-OGNqDfkk46tu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142270
      },
      "rarity": "uncommon"
    },
    {
      "id": "nia",
      "name": "Nia",
      "alt_names": [
        "ニア"
      ],
      "role": "supporting",
      "description": "Nia is Shizuku Yaegashi's maid.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144707-jk4JtNGHgDfu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144707
      },
      "rarity": "uncommon"
    },
    {
      "id": "taeko-sugawara",
      "name": "Taeko Sugawara",
      "alt_names": [
        "菅原妙子"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b148618-X70ynqKJIIzu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 148618
      },
      "rarity": "uncommon"
    },
    {
      "id": "cam-haulia",
      "name": "Cam Haulia",
      "alt_names": [
        "カム・ハウリア"
      ],
      "role": "supporting",
      "description": "He is the chieftain of the Haulia tribe and is gentle at first. But after they were trained by Hajime he became cruel and one of the best assassins in their tribe even defeating a group of 50 Bear-man tribe.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b148619-NbZUL6Nlhc9X.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 148619
      },
      "rarity": "uncommon"
    },
    {
      "id": "kouki-amanogawa",
      "name": "Kouki Amanogawa",
      "alt_names": [
        "天之河光輝",
        "Hero",
        "Masochist Hero",
        "Ranger Red"
      ],
      "role": "supporting",
      "description": "He is one of the students from Japan who got involved in the summoning incident, and ended up in Tortus along with his other classmates. He is somewhat like the leader of the whole class, as most of the students look up to him. This is further enforced by him being bestowed with the rare job as the Hero.\n\n~!In the After Story, Kouki becomes filled with immense guilt over his past behavior and actions which prompts him to drop out of high school and wander around Tortus, immediately taking on bounty jobs to kill monsters as an act of atonement to the point of recklessness.!~",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b218390-h7cZHgGzcMVn.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 218390
      },
      "rarity": "uncommon"
    },
    {
      "id": "kousuke-endou",
      "name": "Kousuke Endou",
      "alt_names": [
        "遠藤浩介",
        "God's Apostle"
      ],
      "role": "supporting",
      "description": "Kousuke Endou is one of the students from Japan who got involved in the Summoning Incident and ended up in Tortus along with his other classmates. He is friends with Jugo Nagayama and Kentarou Nomura and was part of Nagayama's party during the training in Orcus Dungeon. He also has a very weak presence and can't be noticed by labyrinth monsters or automatic doors.\n\n~!After coming back to Earth, he became known as the \"Right-Hand of the Godslaying Demon King\" (Hajime Nagumo) and obtained the skill \"Abyss Lord\" which—when active—causes his personality to become that of a chūni, causing him to do things that are considered completely pointless—such as turning on the spot, pushing up his sunglasses and making embarrassingly cool poses—and say things in an over-dramatic manner.!~\n\n~!After falling in love with the rabbitmen Lana Haulia, a member of the Haulia Tribe, he keeps trying to win her over until she gave him two extremely difficult conditions that would make her consider going out with him. Despite everyone believing it would be impossible for him, Kousuke manages to successfully clear a Labyrinth and land a scratch on Hajime in combat (who was said to be fighting him seriously). This impressive display of dedication to his crush earned Hajime’s respect. After that, he was given the name \"Kousuke E. Abyssgate\" and was accepted into the Haulia Tribe.!~",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b266647-MkSKaSe2sOir.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 266647
      },
      "rarity": "uncommon"
    },
    {
      "id": "meld-loggins",
      "name": "Meld Loggins",
      "alt_names": [
        "メルド・ロギンス"
      ],
      "role": "supporting",
      "description": "He is the Knight Commander of the Heiligh Kingdom. He was responsible for overseeing the training of the summoned heroes from the other world.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b280433-j6KYptApLa2f.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 280433
      },
      "rarity": "uncommon"
    },
    {
      "id": "cattleya",
      "name": "Cattleya",
      "alt_names": [
        "カトレア",
        "Katorea"
      ],
      "role": "supporting",
      "description": "She was a demon under the command of Freid Bagwa, assigned with conquering the Great Orcus Labyrinth and to either recruit or kill the hero and his party, but was killed by Hajime Nagumo.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b280434-jCpDYA9kj5yr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 280434
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-25T04:22:48.696Z"
}