{
  "work_id": "high-school-of-the-dead",
  "count": 15,
  "characters": [
    {
      "id": "takashi-komuro",
      "name": "Takashi Komuro",
      "alt_names": [
        "小室孝",
        "Taka"
      ],
      "role": "protagonist",
      "description": "__Weight:__ 58 kg\n\nA 17 year old sophomore high school student, Takashi is in the same class as Rei whom he has been friends with since childhood,He's loved her ever since she made a childhood promise to marry him when they were older. However it was his hesitance and ignorance about her feelings that caused tension in their friendship which led to her starting to date his friend Hisashi. He was one of the first people to notice that something was wrong in the school and quickly took action to escape with his friends. His relationship with Rei was shaken further when he was forced to kill her boyfriend after he was bitten and had turned into a zombie. Soon afterwards their relationship was amended. His resolve to protect Rei at all costs and everyone else in the group earned him their respect and admiration as a leader despite his own feelings of inadequacy. He often acts brash and will go out to risk his life to save or protect someone on a whim. Similar to Saeko, Takashi confessed that he's found an exhilaration in killing \"them\".  Though initially depicted as a poor student who often skips class, he's proven to be a very reliable person that all the characters can count on. Saya Takagi has once mentioned that he and Kohta are the most likely to snap if things keep going the way they are. Like the rest of the group, Takashi is determined to find his parents and to make sure that they're safe.   (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/6045-uXrSnt8CwMFz.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6045
      },
      "rarity": "epic"
    },
    {
      "id": "rei-miyamoto",
      "name": "Rei Miyamoto",
      "alt_names": [
        "宮本麗"
      ],
      "role": "protagonist",
      "description": "__Height:__ 164 cm \n__Weight:__ 50 kg \n\nClassmate and childhood friend of Takashi, they've known each other since kindergarten. When they were little she promised that one day she would marry him. Despite liking Takashi, their relationship was at odds at the beginning of the manga due to his indecisiveness. It was then that she started dating one of his friends, Hisashi, since he wouldn't make a move. As the story progressed they ended up reconciling their relationship. She doesn't find it above herself to reprimand Takashi for acting carelessly. She worries about his well-being yet admits that his selflessness nature is one reason why she fell in love with him. Headstrong and reliable, Rei has proven to be a skilled combatant and strong asset to the group.  Initially in the same year as Saeko, Rei was held back despite being an excellent student. Her father- a police detective- had been investigating the corruption behind the father of Shido, one of the teachers at her school. As a result of this he held her back purposefully. Rei bears a lasting grudge against him and feels uneven whenever he's around.  After having escaped the high school and resting at the family mansion of Saya, she and the group are in search of their parents.   \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6044-K2II4IU7obFL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6044
      },
      "rarity": "epic"
    },
    {
      "id": "saeko-busujima",
      "name": "Saeko Busujima",
      "alt_names": [
        "毒島冴子"
      ],
      "role": "protagonist",
      "description": "__Height:__ 172 cm \n\nA high school senior and president of the school's kendo club, she is extremely skilled with a bokken and close combat. Calm and collected with a sense of pride in her skills and those that she's with, Saeko is among the most reliable of the group. Everyone can count on her combat skills to pull them through a tough spot if need be. Not much is known about her family except for her father who had traveled abroad on a self-defense conference before the advent of the Outbreak. She has shown fondness towards Takashi and believes in his abilities to get them through the crisis.   \n\n~!Four years prior to the start of the story, a man had attempted to assault her. Armed with her bokken, she easily disposed of the would-be assailant, breaking several of his bones before the police came. This experience revealed her sadistic tendencies; she enjoyed holding the power to inflict pain on another human being. In addition to her reliance on killing the undead in order to survive, Saeko continually struggles with this part of her self, which causes momentary weaknesses in her otherwise strong demeanor. After telling Takashi her story and encountering a group of undead afterwards, for a second Saeko considers letting herself get taken away. She is stopped by Takashi who restores her confidence and resolve. After this she accepts herself and promises to continue fighting with Takashi whom she now counts on to be responsible for her actions.!~",
      "metadata": {
        "gender": "female",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6043-DNEJrW4QOLG2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6043
      },
      "rarity": "epic"
    },
    {
      "id": "saya-takagi",
      "name": "Saya Takagi",
      "alt_names": [
        "高城沙耶"
      ],
      "role": "protagonist",
      "description": "__Height:__ 155 cm  \n__Weight:__ 52 kg  \n\nFirst making her escape with fellow classmate Kohta Hirano, she is the daughter of an influential Uyoku dantai politician and her family is deeply involved in Japan's politics. A self-proclaimed genius, Saya's knowledge, and deductive capabilities have allowed the group to escape from harm. She was among the first to conclude that \"they\" were attracted to only sound. Despite coming from a prestigious family she despises her parents whom she thought had given up on her in this crisis. It was before their escape from the mansion that she managed to make up with her parents. Other than Rei, she is the only one who has a history with Takashi Komuro since they were children and is assumed to having deeper feelings for him.  Slightly self-conscious, she detests the fact that people neither address her by her first name nor look her in the eyes while speaking. The only exception to this is Kohta with whom she has a strange friendship. Saya's grown very attached to Alice and acts as a mother figure in this time of crisis. She does her best to keep intact Alice's innocence and will severely scold anyone who would dare tarnish that to any degree.\n\n(Source: Wikipedia, HotD wiki)",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6048-v6MbWVJrqsZG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6048
      },
      "rarity": "epic"
    },
    {
      "id": "kouta-hirano",
      "name": "Kouta Hirano",
      "alt_names": [
        "平野コータ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 158 cm  \n__Weight:__ 88.8 kg  \n\n A 16-year-old sophomore student who was often bullied in school, Kouta is a gun otaku and knows the ins and outs of the firearms and any military-related equipment that the group may come​ across. At the beginning of the story he helped Saya Takagi escape danger, though only did so by following her orders. His skills as a marksman have proven to be a valuable asset to keeping everyone alive. On a one-month trip to America he was trained by the US military contractor Blackwater USA which furthered his obsession over weapons.   His crush on Saya is one-sided as he on occasion tries to ask her out only to be rejected. Before leaving the family mansion of Saya, her father entrusted her safety to him and Takashi. Saya Takagi has once mentioned that he and Takashi are the most likely to snap if things keep going the way they are. He's grown very attached to Alice with whom he is often around playing with.   The character Kouta Hirano from the manga series Highschool of the Dead is based on the famous mangaka with the same name that made \"Hellsing\", Kouta Hirano.   \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6047-mkDdsaQHjFng.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6047
      },
      "rarity": "epic"
    },
    {
      "id": "shizuka-marikawa",
      "name": "Shizuka Marikawa",
      "alt_names": [
        "鞠川静香"
      ],
      "role": "protagonist",
      "description": "__Height:__ 174 cm \n__Weight:__ 58 kg  \n\nThe school nurse at Fujimi High School, she is rather ditsy as compared to the rest of the girls in the group. Her large bust size is often used as a comical element in the story. A 26-year-old bachelorette, she lives with Rika Minami, a sniper of Japan's Special Assault Team. Her home was used as a safe haven for the group once they escaped high school. As a nurse, she is responsible for the health and care of everyone in the group and is efficient at doing so. Despite being the only adult in the group, she is emotionally fragile and doesn't know what will become of her life since the Outbreak started. Like the rest of the main characters, Shizuka worries that she will never see her family or friends again.\n\n(Source: Wikipedia, HotD wiki)",
      "metadata": {
        "gender": "female",
        "age": "27",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6046-Ay3cdQMsDdFv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6046
      },
      "rarity": "epic"
    },
    {
      "id": "alice-maresato",
      "name": "Alice Maresato",
      "alt_names": [
        "希里ありす",
        "Munchkin",
        "Arisu"
      ],
      "role": "protagonist",
      "description": "Only 7 years old she was saved from being attacked by several undead by Takashi after her father was killed by members of a household who wouldn't allow them safety. Innocent and passive, Alice is the only member of the group that maintains a cheerful attitude despite all their troubles and the loss of her parents. Looking up to everyone in the group as a bigger brother and sister, she is unwilling to leave them even if it's for her own safety.  Alice is often seen playing around with a small dog named Zeke whom they had picked up while saving Alice, and Kohta who she has grown fairly attached too. Presiding over her as a mother figure is Saya whom she has also grown attached too. Later in the series, Alice often aids Kouta by handing him magazines for his firearm while the group is under attack. \n\n (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "age": "7",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b25342-yG7tXRbou7TZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 25342
      },
      "rarity": "epic"
    },
    {
      "id": "hisashi-igou",
      "name": "Hisashi Igou",
      "alt_names": [
        "井豪永"
      ],
      "role": "supporting",
      "description": "Rei&#039;s classmate and boyfriend, he, Takashi, and Rei were among the first to try and escape the rampage at the school. On their way out of class he was bitten by an infected teacher and subsequently turned into one of &quot;them&quot; afterward​. Aware of his fate he instructed Takashi to kill him just as he turned. A brief bitterness between Rei and Takashi occurred as a result of his death.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b19711-fisySYIZfHkN.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 19711
      },
      "rarity": "rare"
    },
    {
      "id": "rika-minami",
      "name": "Rika Minami",
      "alt_names": [
        "南リカ"
      ],
      "role": "supporting",
      "description": "Rika is the chief of first squadron in the prefecture police and an expert sniper in the Special Assault Team sent to clear the nearby airport of any zombie stragglers. She is close friends with Marikawa Shizuka and has the desire to go and save her from the outbreak of zombies. Unknown to her, they had stayed at her residence and have fled in her Humvee. She has been held up in the same airport alongside surviving passengers who were supposed to fly out with surviving Special Assault Team and Special Security Team operatives alongside airport security guards, customs officers and firefighters in clearing the airport of any stragglers by reducing the zombie strength. When her partner/observer helped her use the jet fuel in a tanker to immolate the zombies. She later receive a phone call from Shizuka and they have a very brief conversation before the whole area goes into a massive blackout due to an EMP surge that cuts off all communications and vehicle engines. She has not been seen from since, and it is unknown what happened to her afterwords.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b32736-sxV9oBwVumZI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 32736
      },
      "rarity": "rare"
    },
    {
      "id": "kouichi-shidou",
      "name": "Kouichi Shidou",
      "alt_names": [
        "紫藤浩一"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b32744-BQVEfAVbHWdL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 32744
      },
      "rarity": "rare"
    },
    {
      "id": "kyouko-hayashi",
      "name": "Kyouko Hayashi",
      "alt_names": [
        "林京子"
      ],
      "role": "supporting",
      "description": "Appears in episode 1.   ~!She is among the first to be seen bitten by \"them\"!~  In the manga, it is said she was the ping pong club&#039;s adviser.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b34797-zxfPhZpGPlsE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34797
      },
      "rarity": "rare"
    },
    {
      "id": "toshimi-niki",
      "name": "Toshimi Niki",
      "alt_names": [
        "二木敏美"
      ],
      "role": "supporting",
      "description": "Toshimi Niki is a student at Fujimi Academy and the best friend of Mizusu Ichijou  ~!Durining the outbreak at school, Toshiki and Mizusu are first seen trying at escape while holding hands as a friendship. As they try to escape, one of them grabs her in near stars pull her behind and got bitten. Toshimi begs Mizusu to save her. But Mizusu refuses and kick her in the process!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b34798-nrfvHWxPtRNX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34798
      },
      "rarity": "rare"
    },
    {
      "id": "misuzu-ichijou",
      "name": "Misuzu Ichijou",
      "alt_names": [
        "一条美鈴"
      ],
      "role": "supporting",
      "description": "Misuzu is shortly seen in the first episode running with her friend, Toshimi.  ~!Zombies grab Toshimis leg and she screams for help but Misuzu kicks her to the zombies yelling at her to let go. Zombies come up behind Misuzu and it&#039;s assumed she get&#039;s killed by them.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b34799-cQDLvKsMza1x.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34799
      },
      "rarity": "rare"
    },
    {
      "id": "tejima",
      "name": "Tejima",
      "alt_names": [
        "手島"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b34800-dHJXQdxtDCWK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34800
      },
      "rarity": "rare"
    },
    {
      "id": "wakisaka",
      "name": "Wakisaka",
      "alt_names": [
        "脇坂"
      ],
      "role": "supporting",
      "description": "Appears in episode 1   ~!He bites Hisashi!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b34801-7lpEMBLegtOV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34801
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T22:17:17.242Z"
}