{
  "work_id": "when-they-cry",
  "count": 15,
  "characters": [
    {
      "id": "keiichi-maebara",
      "name": "Keiichi Maebara",
      "alt_names": [
        "前原圭一",
        "K",
        "Kei-ichi",
        "K1"
      ],
      "role": "protagonist",
      "description": "Keiichi is the son of a famous and extremely wealthy artist and has recently moved to Hinamizawa after an array of unfortunate events in his hometown. His charismatic, lively attitude and talented tongue allow him to quickly fit in the town and make new friends and also win some club activities. Though he can be somewhat shy and is easily spooked at times. \n~! In the first couple arcs, paranoia drives him to murder his friends and others, but in the other arcs, he gains inner strength and faith in his friends, enough to change the fate of Hinamizawa, sometimes by remembering the events of Onikakushi-hen.!~ When in need of a weapon, he wields Satoshi's old bat. Keiichi often receives the butt of the jokes in the club's activities from which he was the correct answer to some games they play, to wearing embarrassing costumes whenever he loses punishment games. Keiichi has brown hair with dark blue eyes and is described as charismatic to others.  During his school days, he wears a red shirt under a white one, black pants, a belt, and red shoes. However, during his free days, he wears a black sleeveless shirt under a short red one, green shorts with a blue belt, and shoes.",
      "metadata": {
        "gender": "male",
        "age": "14",
        "dateOfBirth": "1969-04-13"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1851-stMK6YF2jvhS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1851
      },
      "rarity": "epic"
    },
    {
      "id": "rena-ryuuguu",
      "name": "Rena Ryuuguu",
      "alt_names": [
        "竜宮レナ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 158 cm (5'2'')\n\nRena is a girl who returned from Ibaraki to Hinamizawa one year ago and now is in the same grade level as Keiichi. She is very kind and capable and takes care of Keiichi and her friends whenever possible, but is also naive and is usually subject to light teasing by Keiichi. She is distinguished by her obsession with things she perceives as adorable, calling them kāii (かぁいい), a slurred form of kawaii (かわいい) meaning \"cute.\" Those tend to be moekko characters or items she finds while scouring the local dump, which are not considered cute by others. Despite this disarming trait, Rena is shown to be amazingly observant and perceptive about the things around her.",
      "metadata": {
        "gender": "female",
        "age": "13-15",
        "dateOfBirth": "1969-07-28"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1427-28AR4oy0y2Hw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1427
      },
      "rarity": "epic"
    },
    {
      "id": "mion-sonozaki",
      "name": "Mion Sonozaki",
      "alt_names": [
        "園崎魅音",
        "Mi-chan",
        "Old Man",
        "Uncle Mion"
      ],
      "role": "protagonist",
      "description": "Mion is the oldest kid in Keiichi's class. As the elder, she is the class president and everyone looks up to her as the leader. She acts like a perverted tomboy and calls herself old man, but has a hidden girlish side. Mion is next in line to be the head of the Sonozaki household, one of the Three Families which holds tremendous influence in Hinamizawa. Often when playing games with her fellow club members she is known for her ruthlessness, often coming up with the most embarrassing penalties for the losers.  Mion also serves as the leader of the main characters' gaming club. \n\n~!Mion is more stable than the other club members, and as such has never herself succumbed to Hinamizawa Syndrome!~",
      "metadata": {
        "gender": "female",
        "age": "14-15",
        "dateOfBirth": "1968-07-10"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1611-z9SVkC9loi4y.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1611
      },
      "rarity": "epic"
    },
    {
      "id": "rika-furude",
      "name": "Rika Furude",
      "alt_names": [
        "古手梨花"
      ],
      "role": "protagonist",
      "description": "Rika Furude is one of the younger students in Keiichi's school, and is in the same grade level as Satoko. Naturally, she is great friends with her, as they live together in the same house. She is revered by the villagers as the heir of the local shrine, and plays the role of a miko in the annual Watanagashi Festival. She has been the head of the Furude house since her parents died, but rarely attends town meetings due to her young age. While she does not speak a lot, she likes to say nonsense words such as \"mi~\" and \"nipa~\" and often ends her sentences with \"-nano desu\", which inflames Rena's passion for cute things. Despite her young appearance, she is rather calm and reserved-usually serving as the voice of reason amongst the club members. However, she can be calculating if she wishes. \n \n~!It is later revealed that Rika is the \"Queen Carrier\" of the lethal Hinamizawa Syndrome, and in turn keeps the virus under control and prevents it from spreading. Any that leave her presence will exhibit symptoms of the disease, which explains why anyone who leaves Hinamizawa is immediately stricken. According to the late Doctor Takano's research, in the event of Rika's death, within days the entire village of Hinamizawa will fall victim to the disease, and it is also said to spread to neighboring villages if this occurs. For this reason, Rika is sought out and mysteriously murdered in each arc.  She has lived for hundreds of years and she's the only one (together with Hanyuu) who is aware of the time loop, although her friends eventually become aware of their deeds in previous worlds.!~",
      "metadata": {
        "gender": "female",
        "age": "6-16",
        "dateOfBirth": "1971-08-21"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1534-CtOvaSPOMZne.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1534
      },
      "rarity": "epic"
    },
    {
      "id": "satoko-houjou",
      "name": "Satoko Houjou",
      "alt_names": [
        "北条沙都子"
      ],
      "role": "protagonist",
      "description": "Satoko is a younger classmate in Keiichi's school. She has a distinctive style of speech, ending all of her sentences with 'wa' which, at times, is grammatically incorrect. In spite of her young age, she is quite clever in setting up traps, and likes to practice on Keiichi.  Despite her extremely energetic and playful disposition she is actually quite the crybaby, which Mion and Keiichi often tease her about. Satoko is also very close with Rika, who she lives with. \n\n~!Although her personality is quite energetic and mischievous during the events of the games, Satoko's past was full of trauma; her parents died in an accident, she was abused by her foster parents (her aunt and uncle), and her beloved brother Satoshi disappeared. However, in Matsuribayashi-hen, Irie suggested she killed her parents, as she had a bad relationship with them and felt threatened, and so to her it was an act of self-defense. She is suffering from the Hinamizawa Syndrome at that time, and though Takano wanted to disect her alive for study, Irie fought to save her life. She is one of the few characters to ever recover from Level 5 of the Syndrome, but has to take shots on a regular basis. Though she greatly misses Satoshi, and feels that by being strong he will return, she comes to regard Keiichi as her new \"nii-nii\" (a cute term for older brother), and once even regards Shion as \"nee-nee\" (a cute term for older sister).!~  \n\n~!In Gou, it is revealed that like Rika, Satoko has started living in loops in order to get her wish to stay in Hinamizawa with Rika.!~\n\nShe dislikes Japanese pumpkin, and cannot tell the difference between cauliflower and broccoli.",
      "metadata": {
        "gender": "female",
        "age": "11-17",
        "dateOfBirth": "1971-06-24"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1612-lL5sulSea1fZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1612
      },
      "rarity": "epic"
    },
    {
      "id": "shion-sonozaki",
      "name": "Shion Sonozaki",
      "alt_names": [
        "園崎詩音",
        "Shi-chan",
        "Nee-Nee"
      ],
      "role": "protagonist",
      "description": "Shion is Mion's identical twin sister, who currently resides in Okinomiya. In spite of their different personalities, she and Mion often switch places, and it can be difficult to distinguish between them. \n\n~!Their first switch took place when they were little. Right before tattooing the symbol of an oni, which is reserved for the older sister, she was mistakenly identified as Shion, the younger sister, which means that she was actually born as Mion Sonozaki, the older sister. Since then, she switched her identity of Mion with Shion, the younger sister. !~  \n\nShe was sent by the Sonozaki family to a private boarding school, but escaped and returned to live near her hometown, where she lives with Kasai. In spite of all this, she and Mion maintain a close relationship. In most of the arcs, she is at a different school from the other main characters, and therefore appears less frequently.  She works as a waitress at the Angel-Mort restaurant and is the manager's assistant for the Hinamizawa Fighters little league team. She is often seen carrying a taser, and also wears yellow ribbon in her hair. She is also shown to be good with guns, along with Kasai, in Matsuribayashi-hen.    \n\n~! She was in love with Satoshi, and blames the Three Families of Hinamizawa for his disappearance in Watanagashi-hen and Meakashi-hen (the latter told from her point of view); this, along with a different demonic sadistic personality she manifested in her grief, drove her to mass murder, which led to psychosis. One of the last words that Satoshi and her exchanged before he disappeared was a promise to take care of Satoko. In Watanagashi-hen and, more explicitly, Meakashi-hen, her resentment toward Satoko for her role in his disappearance causes her to forget this promise and murder her, only to remember too late; however, in subsequent arcs, she has taken the promise to heart to the point were she is willing to give up her life for Satoko.!~",
      "metadata": {
        "gender": "female",
        "age": "14-15",
        "dateOfBirth": "1968-07-10"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1313-wLhW5uDxdhqA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1313
      },
      "rarity": "epic"
    },
    {
      "id": "satoshi-houjou",
      "name": "Satoshi Houjou",
      "alt_names": [
        "北条悟史",
        "Nii-Nii"
      ],
      "role": "supporting",
      "description": "Satoshi is the older brother of Satoko Houjou. Although he is currently missing, his past influence is the key to the actions of several characters in Higurashi. Similar to Satoko, he cannot distinguish the difference between cauliflower and broccoli. Because of this, it can be inferred that both Satoshi and Satoko are color-blind. Satoshi is referred to by Satoko as Nii-Nii, a childish form of the Japanese word ani (兄, ani meaning older brother).  ~!It is revealed in Matsuribayashi-hen (Festival Accompanying Chapter), that Satoshi is in fact alive. Shion Sonozaki learned from Kyosuke Irie, that he has been kept in the underground levels of the Irie Clinic. Satoshi is sedated and restrained, undergoing treatment for Level Five Hinamizawa Syndrome, which surfaced after he had killed his aunt on the night of the Watanagashi.!~(from Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1852-O8PeTxF1DodX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1852
      },
      "rarity": "rare"
    },
    {
      "id": "kuraudo-ooishi",
      "name": "Kuraudo Ooishi",
      "alt_names": [
        "大石蔵人",
        "Cloud",
        "Oyashiro-sama's Messenger",
        "Kura-chan"
      ],
      "role": "supporting",
      "description": "Kuraudo Oishi is a veteran police investigator at Okinomiya who has vowed to solve the mystery of the Hinamizawa murders before his retirement, due to personal reasons. Due to his uncouth tactics and the lengths that he goes to in order to solve the mystery, he is looked upon as a nuisance by the villagers. \n~!He approaches one of the main characters to become his informant in several arcs, and is sometimes unwittingly responsible for triggering their paranoia.!~",
      "metadata": {
        "gender": "male",
        "age": "59",
        "dateOfBirth": "1923-11-15"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3775-CQOkJnyiCThk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3775
      },
      "rarity": "rare"
    },
    {
      "id": "miyo-takano",
      "name": "Miyo Takano",
      "alt_names": [
        "鷹野三四"
      ],
      "role": "supporting",
      "description": "Miyo is a nurse at the village clinic who has a keen interest in Hinamizawa's past and culture, recording all her speculation in notebooks. At times, her storytelling can be very mysterious and chilling—she seems to enjoy putting people on edge.   ~! In the first six arcs, she consistently disappears on the night of Watanagashi, and an incinerated body thought to be hers is found in the mountains. Later, however, it turns out that she is the mastermind of the events taking place in Hinamizawa who wants to murder Rika so she can prove her grandfather's research. Since her will and manipulations are so strong as to affect the people in the village both directly and indirectly, she infact fakes her death through the first six arcs of the story (the corpse in the barrel being a stolen corpse), and murders Rika in three of the arcs which she uses in line with her \"Queen Carrier\" theory to execute the Great Hinamizawa Disaster.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4934-hyXYSNh1Yqtu.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4934
      },
      "rarity": "rare"
    },
    {
      "id": "toshiki-inukai",
      "name": "Toshiki Inukai",
      "alt_names": [],
      "role": "supporting",
      "description": "Toshiki is the grandson of the chief of the dam&#039;s construction.   In episode 14, he is kidnapped by some anonymous guys.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6478-5X4T0zS09oqk.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6478
      },
      "rarity": "rare"
    },
    {
      "id": "rumiko-chie",
      "name": "Rumiko Chie",
      "alt_names": [
        "知恵留美子",
        "Curry Demon"
      ],
      "role": "supporting",
      "description": "Rumiko is the female teacher of Keiichi's class, who is a parody character of Tsukihime's Ciel-Senpai (permission for her usage was given by Type-Moon). The seiyū for her character in the anime series is the same as the seiyū of Ciel from the Tsukihime anime. Going along with the parody, her favorite food is curry rice, just like Ciel, and will go to great and somewhat scary, lengths to uphold the honor of curry, which is shown in the Higurashi no Naku Koro ni Rei OVA, where she becomes enraged by Keichi's \"offense\" to curry. On a stronger note, she is seen wielding wooden T's, shapped, and held, in exactly the same fashion as the Black Keys from Tsukihime.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6696-hxF6CrBnVSYE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6696
      },
      "rarity": "rare"
    },
    {
      "id": "mamoru-akasaka",
      "name": "Mamoru Akasaka",
      "alt_names": [
        "赤坂衛"
      ],
      "role": "supporting",
      "description": "Mamoru is the main character in Himatsubushi-hen. He is a young police investigator at the Metropolitan Police Department in Tokyo. He befriended Rika while investigating a case in Hinamizawa four years ago, all due to a prophecy about his wife which came true, though he just brushed it off as coincidence.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7183-JpCfOWyceYlW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7183
      },
      "rarity": "rare"
    },
    {
      "id": "kyousuke-irie",
      "name": "Kyousuke Irie",
      "alt_names": [
        "入江京介",
        "Manager"
      ],
      "role": "supporting",
      "description": "Kyosuke is the head doctor of the village clinic. Despite his young age and the fact that he has a severe maid fetish, he is highly respected in the community. \n\nHe cheerfully makes house calls and seems to truly care about everyone's health. He has (half-jokingly) admitted that he wishes to marry Satoko when she is older, but is not above chasing after Rika when she is wearing one of the uniforms from the restaurant Angel Mort. In addition, he is the manager of the village's baseball little league team, the Hinamizawa Fighters. \n\n~!In the past, he has performed lobotomies without consent, which led to him being banished from the medical academic society in Tokyo. He is recruited by Takano to direct research the Hinamizawa Syndrome, which he feels will redeem himself. It is later revealed that he works under Miyo in research, where he is trying to find a cure for Hinamizawa Syndrome, while not knowing of his employer's true desires.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7445-X8OacDAXCwqK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7445
      },
      "rarity": "rare"
    },
    {
      "id": "teppei-houjou",
      "name": "Teppei Houjou",
      "alt_names": [
        "北条鉄平"
      ],
      "role": "supporting",
      "description": "Teppei is Satoko and Satoshi's uncle/foster father. He and his wife were forced to take care of Satoko and Satoshi after the death of their parents, but they abused them. He currently lives in Okinomiya. According to Kasai, he is a pimp and uses his lover Rina to swindle men out of their money.   ~!He is killed by Keiichi in Tatarigoroshi-hen and by Rena in Tsumihoroboshi-hen, in their attempts to protect Satoko and Rena's father respectively.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b9464-o4p2oDIloadU.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9464
      },
      "rarity": "rare"
    },
    {
      "id": "oryou-sonozaki",
      "name": "Oryou Sonozaki",
      "alt_names": [
        "園崎お魎",
        "Oni-baba",
        "Mistress of the Night",
        "Ryou Sonozaki",
        "園崎両"
      ],
      "role": "supporting",
      "description": "Oryou is the grandmother of Mion and Shion as well as the current head of the Sonozaki family. Although usually harsh and vulgar during her dealings with people, she has a bit of a softer side that she rarely lets out.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b9481-A5LPr9vcwiOm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9481
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-26T02:34:10.728Z"
}