{
  "work_id": "tomie",
  "count": 1,
  "characters": [
    {
      "id": "tomie",
      "name": "Tomie",
      "alt_names": [
        "富江"
      ],
      "role": "protagonist",
      "description": "Tomie enjoys the effect her beauty has on men, and seeks to seduce them, but feels no emotional attachment to any of her lovers. Once she no longer has an immediate use for a man, she'll discard him, a pattern that has led to several of her deaths. She's also jealous when attention is given to other women, and works to break up established couples if presented an opening. Extremely self-centered, she thinks nothing of manipulating others for her pleasure.    \n\nLittle is known of Tomie's true background, not even her family name. It is not known how she gained her powers, or even if she was aware of them prior to 1986. According to witnesses, she aged normally to that point, and seemed a standard if very pretty and flirtatious girl. On a field trip to Inariyawa, a small mountain near her school, Tomie was pressuring a teacher she'd been having sex with to leave his wife and marry her, when a male classmate who'd become obsessed with Tomie accosted her. She taunted the boy, and in the ensuing scuffle, Tomie fell over a cliff. Believing Tomie dead, the teacher decided to cover up the accident by chopping up the girl's body with the aid of the boys of the class. It turned out she wasn't quite dead, so this became a particularly gruesome task. The class then scattered the body parts where they would, in theory, not be found.  Some parts were found, identified as Tomie's, and cremated. Her death was blamed on a psychopath, and a funeral was held. Which made it rather a shock when Tomie walked into class the next day as if nothing had happened. Her reappearance drove the more susceptible members of the class to madness, and when two of them tried to go to the police, the others turned violent in an attempt to stop them. Tomie disappeared shortly thereafter.  \n\nTomie then began appearing in widely separated locations around Japan, inspiring men to passion and murder. She apparently died several more times, but always turned up alive again. Due to the police's stubborn refusal to credit these stories, no concerted effort was made to capture Tomie at least until 1995.   \n\n([Source](https://www.herogames.com/forums/showthread.php?t=47566))",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b19174-GmwTy7yYcWe0.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 19174
      },
      "rarity": "epic"
    }
  ],
  "updated_at": "2025-12-25T09:59:44.198Z"
}