{
  "work_id": "jojos-bizarre-adventure-tv",
  "count": 46,
  "characters": [
    {
      "id": "jonathan-joestar",
      "name": "Jonathan Joestar",
      "alt_names": [
        "ジョナサン・ジョースター",
        "JoJo"
      ],
      "role": "protagonist",
      "description": "__Height:__ 195 cm \n__Nationality:__ British \n__Occupation:__ Archaeologist \n\nBorn the unique son of the wealthy businessman George Joestar I, Jonathan is an honest, kind, and positive man whose life is fraught with tragedy after meeting his adopted older brother - and series antagonist - Dio Brando. In his battle against Dio, Jonathan becomes a Ripple user under the tutelage of the master Will Anthonio Zeppeli.\n\n**Part 5:**~!Jonathan is the biological father of Giorno Giovanna, the protagonist of Vento Aureo, as well as a handful of other illegitimate offspring.!~\n\n(Source: JoJo Wikia)",
      "metadata": {
        "gender": "male",
        "age": "12-20",
        "dateOfBirth": "1868-04-04"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8087-GTrObHQvujB5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8087
      },
      "rarity": "legendary"
    },
    {
      "id": "dio-brando",
      "name": "Dio Brando",
      "alt_names": [
        "ディオ・ブランドー"
      ],
      "role": "protagonist",
      "description": "__Height:__ 195 cm (6'5\")\n__Race:__ Human (formerly), Vampire (onwards)\n__Nationality:__ British\n\nDio is an immortal vampire and the arch rival of the Joestar clan.\n \n__Series 1: Phantom Blood__ \n~!Dio is the son of Dario Brando, an alcoholic and abusive father. Back when Dio was just a boy, he was brought into the household of George Joestar after the mysterious death of his father, so as to repay the debt he owed Dio's father for saving his life. But soon Dio's personality caused trouble for George's young son, Jonathan Joestar. Even more of a sociopath than his father, Dio was resolute to shatter Jonathan's spirit and take his place as the favored son, even going so far as to arrange for Jonathan's dog Danny to be burned to death. Initially, Dio is able earn the trust of the patriarch of the Joestar family through deceit (and at Jonathan's expense). However, his plans of taking over the Joestar household were discovered by Jonathan when he discovered that not only had Dio poisoned his biological father to death, he was doing the same to his adoptive father, all to take the Joestar estate for his own.  Determined not to be stopped, and understanding the potential to enjoy power over all things instead of just the Joestar estate, Dio wears and activates the Stone Mask, becoming a nearly unstoppable vampire. His gains supernatural abilities such as being able to walk on walls, and regenerating his body faster than fire can consume it. He is able to create two fluid jets from his eyes powerful enough to slice stone and kill living things. He is also able to vaporize his body fluid rapidly enough to freeze anything he touches. However, this is at the expense of having his body be sustained by sheer willpower alone, rather than vital energy. A sufficiently powerful vital force--specifically, sunlight or the Hamon force--will negate the sustaining force's presence and disintegrate the long-unliving body. Like all Jojo vampires, Dio sucks blood through tentacles in his fingers and has been seen at least once drinking blood from an unnamed girl.  At the end of Series 1, Dio's body was destroyed, but his severed head managed to kill Jonathan Joestar and together they sank to the bottom of the Atlantic Ocean.!~ \n\n__Series 3: Stardust Crusaders__ \n~!100 years later, at the bottom of the sea, Dio's severed head reattached itself to Jonathan Joestar's lifeless body (giving Dio the same star birthmark as the members of the Joestar family). Dio's casket is recovered by fishermen, who are implied to have been killed by Dio as he awakened. He finds that he is now in the year 1985. After he returns to land he develops a Stand (a sort of ghostly bodyguard), giving him vastly powerful new abilities on top of his vampiric powers. For most of Series 3, Dio is out of scene and in the shadows, and the question of exactly what his Stand \"The World\" can do is a mystery.  In Series 3, many of Dio's offensive vampiric abilities do not appear, though he displays a new ability described as \"evil implants\"; parasites generated in his hair that attach themselves to and brainwash victims, finding early success with Kakyoin and Polnareff. Dio's Stand \"The World\", as a sort of brother power to \"Star Platinum\", possesses great speed and strength and, crucially, is able to stop time, making Dio appear to teleport or move at impossible speed. Dio's ambition is to create a perfect world for himself and his servants. In the interim, he seeks to drain for himself the blood of the Joestar lineage, which will help him to fully fuse with Jonathan Joestar's body and take better control of The World. Once he does this, his powers will gradually increase, until he is able to stop time for as long as he likes. In the beginning of the story arc Dio's World, Dio mainly battles Kakyoin and Joseph. Kakyoin succeeds in leading Dio into a vast barrier created by his Stand, trapping him. Dio uses The World to stop time, allowing him to ignore the barrier and approach Kakyoin to deliver a fatal blow. Before dying, Kakyoin deduces the The World's time-stop ability and uses his last strength to give Joseph this message. Joseph then warns this to Jotaro before he is also killed by Dio.  After a long battle between Dio and Jotaro, Jotaro finds his own ability to stop time just before Dio drops a steamroller on him, proceeding in time-stop to break Dio's leg. Jotaro's intention was for the two to end the fight with a final blow once Dio's leg had healed. Dio, determined not to lose, squirts blood from his open leg into Jotaro's eyes. Dio then attempts a final kick with The World, which Jotaro blindly counters with a punch from Star Platinum. Star Platinum's hand breaks on The World's leg, but the punch sends a fissure through The World and through Dio, shattering Dio completely above the waist. Jotaro and doctors from the Speedwagon Foundation (an oil and medicine company loyal to the Joestar family) transfer the blood from Dio's lower half to Joseph Joestar, reviving him. Later, they lay Dio Brando's remains in the Sahara Desert to evaporate with the rising sun.!~ \n\n__Series 6: Stone Ocean__ \n~!In Part 6, it is revealed to the Joestars that his reemergence was planned to create a perfect world when the moon reached a certain angle and time. He stumbled upon Enrico Pucci not long before Part 3 and \"healed\" his disfigured foot for him. After piercing Pucci with a Stand arrow, the two spent considerable time together, plotting and scheming. He questioned Pucci's loyalty to him, wondering why he didn't use Whitesnake to remove The World from him. Pucci had explained that he loved Dio as he had loved God, and thus worshipped him too much to betray him. Ensuring that he wouldn't completely fade, he left one of his bones in Pucci's care. Dio's presence continues to haunt the series, emerging in flashbacks and his disfigured sons. His bone played a vital plot element for the first half of Part 6, an odd green baby inheriting a Stand to merge with it.!~",
      "metadata": {
        "gender": "male",
        "age": "13-121",
        "dateOfBirth": "1867-04-10"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4004-w0OtWuvjhftG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4004
      },
      "rarity": "legendary"
    },
    {
      "id": "joseph-joestar",
      "name": "Joseph Joestar",
      "alt_names": [
        "ジョセフ・ジョースター",
        "JoJo",
        "Josef Joestar",
        "Mr. Joestar",
        "Old Man",
        "Geezer"
      ],
      "role": "protagonist",
      "description": "__Height__: 195 cm (6'5\")\n\nJoseph Joestar begins as a young Englishman in New York, with his grandmother Erina. However, an attack by Straits and the disappearance of Robert Edward O Speedwagon soon involve him in the greater chain of events.",
      "metadata": {
        "gender": "male",
        "age": "18-78",
        "dateOfBirth": "1920-09-27"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6356-RImEfUfHpC58.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6356
      },
      "rarity": "legendary"
    },
    {
      "id": "caesar-zeppeli",
      "name": "Caesar Zeppeli",
      "alt_names": [
        "シーザー・アントニオ・ツェペリ",
        "Caesar-chan",
        "Caesarino"
      ],
      "role": "protagonist",
      "description": "__Height:__ 186 cm\n\nThe grandson of Will A. Zeppeli. He is a blond, suave ladies' man, as well as a skilled Ripple user. He was taught by Lisa Lisa, and currently lives in Italy. He is rather cool and collected, especially compared to Joseph, with whom he is grudgingly paired to fight the Pillar Men. But over time Joseph starts to grow on him so much he is able to understand his strange thought pattern.\n\n~!When Caesar was young his father suddenly left with no explanation. Because of this Caesar grew up hating his father thinking he was out living a new life. One day when Caesar spots him walking he tails him with the intention of killing him. Caesar spots a jewel not knowing that it was the activation of Wham's trap and his father pushes him out of the way, sacrificing himself for Caesar.  This leads to Caesar going ahead of the rest of the group to fight Wham, where he meets the ultimate fate, but not before doing his fair share of damage and ripping off Wham's lip piercing, sending it in a Ripple bubble for Joseph before his body is crushed by a rock.!~",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21959-Cm9Rlh0EFAQw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21959
      },
      "rarity": "legendary"
    },
    {
      "id": "will-a-zeppeli",
      "name": "Will A. Zeppeli",
      "alt_names": [
        "ウィル・A・ツェペリ",
        "Baron Zeppeli"
      ],
      "role": "supporting",
      "description": "Will A. Zeppeli was on a ship with a crew studying Aztec ruins when he was younger when his father put on the mask and killed everyone in the crew but his son. After this horrific event, Zeppeli travels the world in order to destroy the mask, and sees a man cure someone using the Ripple. Zeppeli is then directed to his master Tonpetty, who teaches him to use the Ripple. However, Tonpetty foresees Zeppeli's death during his training, warning him that should he complete his training he will surely die. Zeppeli doesn't share this fact until the fight with Tarkus, where he afterwards gives his power to Jonathan, whom he trained after the Joestar's house burns down. His grandson is Caesar Anthonio Zeppeli.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/18062-FjIMwcBJra9L.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18062
      },
      "rarity": "rare"
    },
    {
      "id": "erina-pendleton",
      "name": "Erina Pendleton",
      "alt_names": [
        "エリナ・ペンドルトン"
      ],
      "role": "supporting",
      "description": "Erina is a young girl from [Jonathan Joestar](https://anilist.co/character/8087/)'s hometown. ~!She becomes his love interest then wife. She is the mother to [George Joestar II](https://anilist.co/character/130262/), and the grandmother and guardian to [Joseph Joestar](https://anilist.co/character/6356/).!~\n\n(Source: JoJo Wikia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21937-mwAbJAgxE8yP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21937
      },
      "rarity": "rare"
    },
    {
      "id": "robert-e-o-speedwagon",
      "name": "Robert E. O. Speedwagon",
      "alt_names": [
        "ロバート・E・O・スピードワゴン"
      ],
      "role": "supporting",
      "description": "Robert E. O. Speedwagon is a major ally featured in the 1st part of JoJo's Bizarre Adventure, Phantom Blood, and then the 2nd part, Battle Tendency. Formerly a Londoner thug residing in Ogre Street, Speedwagon befriends Jonathan Joestar and, despite remaining a powerless human, becomes a loyal ally to the Joestar Family during his whole life and beyond thanks to the company he's founded: the Speedwagon Foundation. His company supports the Joestars in Stardust Crusaders, Diamond is Unbreakable, and Stone Ocean.\n\n(Source: JoJo Wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n21938-7iTMOJ4i6ET8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21938
      },
      "rarity": "rare"
    },
    {
      "id": "george-joestar-i",
      "name": "George Joestar I",
      "alt_names": [
        "ジョージ・ジョースターI世"
      ],
      "role": "supporting",
      "description": "George is Jonathan Joestar's father and, after a tragic misunderstanding, adopts Dio Brando in his family, kick-starting the events of the first six parts of the series.\n\n(Source: JoJo Wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n21956-Mv5FsZ4EnKzs.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21956
      },
      "rarity": "rare"
    },
    {
      "id": "smokey-brown",
      "name": "Smokey Brown",
      "alt_names": [
        "スモーキー・ブラウン"
      ],
      "role": "supporting",
      "description": "A young boy living in New York. Joseph saves him from brutal, racist policemen, and he sticks around long enough to watch the battle against Straits. He also shows up at the end of Part 2 with Rudolf von Stroheim's cavalry. Smokey is initially shown with a pigtail in Volume 5, which mysteriously disappears in the rest of the series.  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n21957-DHiP7omcHM5H.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21957
      },
      "rarity": "rare"
    },
    {
      "id": "rudol-von-stroheim",
      "name": "Rudol von Stroheim",
      "alt_names": [
        "ルドル・フォン・シュトロハイム"
      ],
      "role": "supporting",
      "description": "Stroheim is the commander of the Wehrmacht forces who discovered Santana in Mexico.    ~!He is appropriately militaristic and menacing, but is also responsible for not only saving the life of Robert E. O. Speedwagon, but also for trying to help Joseph Joestar defeat Santana by blowing himself (and the enemy) up. He returns later as a cyborg to assist in the fight against Cars were he is sliced to pieces by Cars. He later returns again with a squad of soldiers to aid Joseph when an army of vampires tries to attack him. Later, when Joseph takes a plane to try and send Cars into a volcano, he saves him by jumping out the cockpit, breaking his legs as a direct result. He dies in 1943 in the front during the Battle of Stalingrad as a German soldier. He is the one who made Joseph's prosthetic cyborg hand.!~ (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n21958-RvVcFEHfOrKV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21958
      },
      "rarity": "rare"
    },
    {
      "id": "lisa-lisa",
      "name": "Lisa Lisa",
      "alt_names": [
        "リサリサ"
      ],
      "role": "supporting",
      "description": "__Birthday:__ ~!Dec, 1888!~\n__Age:__ ~!50!~\n__Height:__ 175 cm \n\nA mysterious Ripple user whom Joseph Joestar meets in Venice, Lisa Lisa reveals herself to be his friend Caesar Zeppeli's mentor. She trains Joseph in the ways of the Ripple and joins in the fight against the Pillar Men, as a powerful Ripple user in her own right.   \n\n~!It is eventually revealed that she is Joseph's long-lost mother, despite her youthful appearance. Her real name is Elisabeth Joestar and she is the infant Jonathan Joestar saved at the end of Phantom Blood and gave to his widow Erina to raise. She was subsequently adopted by the Ripple user Straits, and learned the art of the Ripple from him. As a young adult, Elisabeth eventually married George Joestar II, and they had one child. After George had been killed by a vampire, Elisabeth murdered her husband's killer and burned him to ash, but he happened to be a high ranking military official. In order to avoid retaliation, the Speedwagon Foundation helped her to erase all evidence of her existence.   She is gravely wounded in her one-on-one struggle with Kars, but manages to survive. She later tells Joseph her relation to him personally, at his own funeral. She eventually remarries.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21960-3stfLc0uwgoT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21960
      },
      "rarity": "rare"
    },
    {
      "id": "straits",
      "name": "Straits",
      "alt_names": [
        "ストレイツォ",
        "Straizo"
      ],
      "role": "supporting",
      "description": "Straits is another of Tonpetty's followers. He aided Jonathan in the fight against Dio and his minions.  He, along with Dire, were named after the band Dire Straits.  ~!When Santana was discovered in the 1930s during Part 2, he betrayed Speedwagon and donned one of the newly discovered Stone Masks. He explained that he had always envied Dio's strength and beauty and, as a result, desired to stop his aging process. He died after battling and losing to Joseph Joestar in New York City, overloading his own vampire body with Ripple energy. He is also the adoptive father of Lisa Lisa. !~  \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21961-9JPMSyptHeWe.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21961
      },
      "rarity": "rare"
    },
    {
      "id": "suzie-q",
      "name": "Suzie Q",
      "alt_names": [
        "スージーＱ",
        "Suzie Quatro"
      ],
      "role": "supporting",
      "description": "__Height:__ 168 cm \n\nThe female assistant to Lisa Lisa. Suzie Q is a slightly ditzy girl who worries for her friends. Evidently this carefree personality has not diminished even in the events of Stardust Crusaders, when she is shown enthusiastically recording her sightings in Japan on a camcorder when on a trip to see her daughter.   ~!She is introduced as the female assistant to Lisa Lisa. When she first appears, she is taken over by the remains of Esidisi and attacks her friends. Thanks to a combination attack by Caesar and Joseph, she is saved with only minor injury. She marries Joseph in 1939.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21962-74U6QodPnwtC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21962
      },
      "rarity": "rare"
    },
    {
      "id": "santana",
      "name": "Santana",
      "alt_names": [
        "サンタナ"
      ],
      "role": "supporting",
      "description": "He is discovered in a Mexican pyramid in 1938. He is then awakened and studied by a Nazi vampire study team in an underground base. The team, led by Major Stroheim, conducts live human experiments with the stone mask to try to strengthen the Nazi Army. The team awakens Santana in an advanced isolation room fortified with steel plates, and conduct behavioral experiments on him. They soon find that Santana feeds on vampires and is able to absorb food from the surface of his body. The team then is shocked by Santana's escape from the isolation room. Santana breaks many of his own bones in order to squeeze himself into the 4-by-20 cm ventilation outlet of the room, and does all this at a speed faster than human eyes can perceive. The team shoots Santana with machine guns, only to find that Santana has learned their language and the mechanisms of their weapons from only minutes of contact. He then easily disposes of the Nazis who disturbed his sleep, and even manages to stay alive after being attacked, exposed to sunlight, and blown up. He is named after the long-lived rock group Santana. He is the only member of the Pillar Men to survive, and is theoretically still alive throughout all of the arcs. However, due to his vastly-improved Ripple power, it is possible that Joseph killed him after returning to America.  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n21963-oQKcN4QHHOpK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21963
      },
      "rarity": "rare"
    },
    {
      "id": "acdc",
      "name": "ACDC",
      "alt_names": [
        "エシディシ",
        "Esidisi",
        "Esidisi of the Flame"
      ],
      "role": "supporting",
      "description": "ACDC is one of the Pillar Men that were discovered by Nazis in Rome. Like Wham and Cars, ACDC is very confident in his powers and abilities and see humans as inferior. However, he has a more violent temper than the others to the point that he has to cry and sob to calm himself down.  He is named after Australian Hard rock band AC/DC.   ~!ACDC uses \"the skill of fire\". He raises his body temperature in order to heat his blood to 500°C. He then extends his blood vessels out of his body and makes them into long, prehensile needles with which he injects his hot blood into enemies, dissolving them from within. Even if the blood isn't injected directly, it can still eat through flesh and metal alike if sprayed on a target from the outside. AC/DC has been shown to have an extremely erratic temper, sobbing at the sight of his own severed arm, only to calm himself near-instantly and replace it with the arm of Loggins. He himself stated that he has a more explosive temper than either of his brethren, and claims to openly express any rage or sorrow he feels so he doesn't lose his self-control.  ACDC had traveled to ancient China and knew Sun Tzu's theory that \"all warfare is based on deception\". In his battle with Joseph Joestar, he tries to intimidate him by disabling Joseph's deceptive tactics.  ACDC cuts the hidden rope through which Joseph plans to send Ripple energy to hurt him. Nevertheless, he falls for Joseph's more sophisticated deception, for Joseph has predicted his action and employed the cut-and-restore rope trick on the rope.  His bones and muscles are destroyed, but his brain and blood vessels possess Suzi Q, who takes the Red Stone of Aja and sends it to Cars in Switzerland. ACDC then prepares to turn Suzi Q into a \"blood bomb\", planning on pressurizing his boiling blood until her body bursts, killing himself and Joseph's group in the process. Joseph and Caesar attack Suzi Q at the same time. While their Ripples cancel each other out and keep Suzi Q unharmed, ACDC is destroyed.!~ (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21964-nA0cw9XBwitK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21964
      },
      "rarity": "rare"
    },
    {
      "id": "wamuu",
      "name": "Wamuu",
      "alt_names": [
        "ワムウ",
        "Wham"
      ],
      "role": "supporting",
      "description": "Wamuu is introduced as a servant to both Esidisi and Kars. He is a very strong and honorable warrior who possess the power of the wind, and also reflexively attacks anyone who steps on his shadow. If he goes blind, he can grow a horn on his forehead and sense sound waves with it. He can also draw air into his body and blast it through the tip of the horn, creating a highly-destructive \"wind scalpel\". He is also extremely honorable, stopping himself from defeating a defenseless Joseph Joestar when he said that with a month to train he could beat Wham.    ~!Later on, he engaged in battle with Caesar Anthonio Zeppeli and killed him, but not before he managed to rip off Wham's lip piercing containing the poison within Joseph. In another display of honor, Wham allowed the antidote to stay where Joseph could get it out of respect for Caesar's valiant effort. Later challenging Wham to battle to avenge Caesar, they engaged in a deadly Roman chariot race, with Wham initially getting the upper hand. After Joseph managed to counter Wham's wind scalpel, he was left as nothing more than a head with the Ripple energy slowly killing him. After Joseph gave Wham some of his own blood to ease his pain, he used the last of is strength to destroy a group of vampires that attempted to kill Joseph. Wham then vanished in a gust of wind, with Joseph giving an unconscious salute to him.!~ He is named after the 80s duo featuring George Michael, Wham!.  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21965-waQaIDkSC77a.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21965
      },
      "rarity": "rare"
    },
    {
      "id": "kars",
      "name": "Kars",
      "alt_names": [
        "カーズ",
        "Cars"
      ],
      "role": "supporting",
      "description": "Cars is the leader of the Pillar Men. He is intelligent, ruthless, and single-minded in his dedication to obtaining the Red Stone of Aja. Strangely, despite his apathy towards humans and willingness to kill them, he has been shown to be more compassionate for other living beings. In Switzerland, he sliced a car that was about to hit a puppy in half, and later on maneuvered himself during a long fall to miss a patch of flowers near the bottom of the cliff. Cars' power is that of light; he is able to produce bladed appendages from his arms and use these to reflect blinding light toward his enemies. He also has the same powers over his body that all the Pillar Men share.    ~!When he gains the power of the stone mask, he becomes invulnerable to sunlight, and also gains some abilities on a genetic level; he can produce living creatures and control them, and can mutate his body into various forms. He outlasts his comrades and eventually does gain almost unlimited power as the ultimate \"evolved\" man through the Red Stone of Aja and a stone mask. In a final confrontation, he succeeds in severing Joseph's hand but is eventually blown into space by a volcanic eruption as well as an ultimate Ripple attack from Joseph. Being immortal, he does not die; however he is unable to return to Earth after being thrown out of orbit. Trapped in the void of space for eternity, he eventually stops thinking and desires death.!~ He is named after the 80's new wave group The Cars.  (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n21966-ZvYmd1Dwp613.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21966
      },
      "rarity": "rare"
    },
    {
      "id": "narrator",
      "name": "Narrator",
      "alt_names": [
        "ナレーター",
        "語り手",
        "ナレーション",
        "Narrador",
        "Rozprávač",
        "Vyprávěč",
        "Dış ses",
        "Narratore",
        "Pripovjedač",
        "Narradora",
        "Рассказчик",
        "Người dẫn chuyện",
        "Tagapagsalaysay",
        "내레이터",
        "Erzählperson",
        "מספר",
        "Narrátor",
        "讲述人",
        "راوي",
        "Forteller",
        "Berättare",
        "Αφηγητής",
        "Narrateur",
        "なれーしょん",
        "旁白",
        "Narrato"
      ],
      "role": "supporting",
      "description": "This character page is set to represent and list all narrators, which haven't been given a visual representation of themselves in their respective work. \n\nPlease add other narrator characters, which were given a visual representation of themselves, separately from this narrator page.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36309-6KM0riV4lqfN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36309
      },
      "rarity": "rare"
    },
    {
      "id": "dire",
      "name": "Dire",
      "alt_names": [
        "ダイアー"
      ],
      "role": "supporting",
      "description": "Dire is a minor ally featured in Phantom Blood.\n\nDire is a Ripple disciple under the Ripple Master Tonpetty and is a very close friend of Will Anthonio Zeppeli.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74057-7SVzc5bAOSdm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74057
      },
      "rarity": "rare"
    },
    {
      "id": "tompetty",
      "name": "Tompetty",
      "alt_names": [
        "トンペティ",
        "Tonpeti",
        "Tompeti",
        "Tonpetty"
      ],
      "role": "supporting",
      "description": "Tonpetty is a minor ally featured in Part I: Phantom Blood. He is a Ripple master who trained Will Anthonio Zeppeli as well as Straizo and Dire.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74097-I4hre57ad84b.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74097
      },
      "rarity": "rare"
    },
    {
      "id": "dario-brando",
      "name": "Dario Brando",
      "alt_names": [
        "ダリオ・ブランドー"
      ],
      "role": "supporting",
      "description": "Dario is the father of Dio Brando. An alcoholic and abusive man, he is primarily responsible for contributing to Dio's descent into evil. After a tragic misunderstanding, George Joestar I decides to give him a favor and adopts his son Dio into the Joestar Family.\n\n(Source: JoJo Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74099-L9f89j4jraUQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74099
      },
      "rarity": "rare"
    },
    {
      "id": "wang-chung",
      "name": "Wang Chung",
      "alt_names": [
        "ワンチェン",
        "Wan Chen",
        "Wang Chan"
      ],
      "role": "supporting",
      "description": "Wang Chan is a minor antagonist featured in Part I: Phantom Blood  Personality   As a human, Wang Chan has shown a greedy personality, selling a poison to Dio Brando without any regard for its use and heading back to the Joestar mansion to salvage for treasures and antiques. Upon becoming a vampire, however, he becomes entirely devoted to Dio's wishes.  Synopsis   Originally only known as the \"Oriental Man\", he owned a curiosity shop on Ogre Street. Wang Chang sold Dio the poison which Dio used in his murder of Dario Brando and his attempted murder of George Joestar, although Wang was not concerned with what the poison was to be used for. He told Dio, without much, if any, intent to provoke him, of a man in his own land who had a similar birthmark to Dio's who had had a harsh life, but in the end lived to be over 183.   Sometime after, he was was captured by Jonathan Joestar and taken to the the Joestar Manor. When he is used in an attempt to force Dio to go with the police, he again mentions his fortune telling, saying that Dio is far too lucky to fully have to give up this early. Dio uses George's blood to become a vampire, taking Wang Chan as his subordinate when the latter goes to search the Joestar manor for valuables.   Dio trusts him enough to be responsible for his head and implanting it onto Jonathan's body. This did not go according to plan, however as Jonathan use the last of his strength to crush Wang Chan's head and sent a ripple to take control of his body, and made him sink the ship of zombies by grinding his body into the machinery.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74101-DnFd7wYsk5BF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74101
      },
      "rarity": "rare"
    },
    {
      "id": "jack",
      "name": "Jack",
      "alt_names": [
        "切り裂きジャック",
        "Jack the Ripper"
      ],
      "role": "supporting",
      "description": "Jack is a serial killer who meets Dio Brando and is transformed into a Zombie sent to fight the Joestar Group. He was inspired by the historical figure of the same name.\n\n(Source: JoJo Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74105-lLpzu5q6pwbo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74105
      },
      "rarity": "rare"
    },
    {
      "id": "tarkus",
      "name": "Tarkus",
      "alt_names": [
        "タルカス"
      ],
      "role": "supporting",
      "description": "Tarkus the \"Dark Knight\" was a knight from 16th Century Great Britain who was executed after losing a war. Resurrected as a Zombie by Dio Brando, he is wholeheartedly loyal to his new master and fights the Joestar Group.\n\n(Source: JoJo Wikia)",
      "metadata": {
        "gender": "male",
        "age": "300+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74109-KiX6nLKONYw4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74109
      },
      "rarity": "rare"
    },
    {
      "id": "bruford",
      "name": "Bruford",
      "alt_names": [
        "ブラフォード",
        "Blueford",
        "Bluford"
      ],
      "role": "supporting",
      "description": "Bruford is an antagonist featured in Part I: Phantom Blood. He is a vampire made from the centuries-old corpse of a brave and powerful warrior of ancient Britain. Along with Tarkus, Bruford was one of \"The Dark Knights\". He also had unusual battle prowess and powers associated with his dark hair.    \n~!Bruford and Tarkus were successful in the Challenge of the 77 in 1563, two of only five challengers to succeed in history. Prior to their corruption, Bruford and Tarkus were members of the Tudor Dynasty and retainers of Mary Stuart. Eventually they were beheaded for supporting Mary against her political rival, Elizabeth. However, Elizabeth's deception to force them to surrender led to a strong sense of betrayal that made them susceptible to manipulation by Dio.!~   \n~!The pair were eventually resurrected as vampires by Dio Brando to oppose Jonathan Joestar, Will A. Zeppeli, and Robert Speedwagon. Bruford's manipulation of his hair poses much challenge to Jonathan, eventually leading to them fighting underwater, until Jonathan swims downward to find air bubbles beneath the rocks, enabling him to draw breath and hit Bruford with a ripple overdrive. Moments before he disintegrates from the ripple, Bruford gives Jonathan his sword, Luck and Pluck. However, his corpse is kicked aside by a wrathful Tarkus, who attempts to finish off Jonathan and party on his own.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74113-bwYgDlbf5oiY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74113
      },
      "rarity": "rare"
    },
    {
      "id": "tattoo",
      "name": "Tattoo",
      "alt_names": [
        "刺青"
      ],
      "role": "supporting",
      "description": "Tattoo is a rugged looking grown man with a medium sized beard and unkempt hair. His wardrobe consists mainly of a fringed leather jacket, pants, and belt. His most noticeable feature, and the obvious source of his name, is a large tattoo stretching from cheek to cheek and from forehead to nose dorsum - the tattoo appears to be either a butterfly or a design similar to a Rorschach test image.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130251-c2xA45fZ6GVY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130251
      },
      "rarity": "rare"
    },
    {
      "id": "doobie",
      "name": "Doobie",
      "alt_names": [
        "ドゥービー"
      ],
      "role": "supporting",
      "description": "Doobie is a minor antagonist featured in Phantom Blood. He is a musclebound masked zombie that Dio Brando sics on Poco's Sister after she refuses to serve him. Doobie grabs the girl and rips her dress in an attempt to assault her, but his plan is quickly ruined by an anvil thrown by Jonathan Joestar.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130252-D8DVHP2re7fu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130252
      },
      "rarity": "rare"
    },
    {
      "id": "poco",
      "name": "Poco",
      "alt_names": [
        "ポコ"
      ],
      "role": "supporting",
      "description": "Poco was a cowardly boy who got bullied by other kids, but was protected by his sister. When confronted by her about when he was going to fight back and live on his own, Poco answered that he would do this \"tomorrow\", which causes her to slap him.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130253-pMSSkJsSzKBW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130253
      },
      "rarity": "rare"
    },
    {
      "id": "donovan",
      "name": "Donovan",
      "alt_names": [
        "ドノヴァン"
      ],
      "role": "supporting",
      "description": "Donovan is a mature athletic man whose dark hair is slicked back. His skin is colored differently around his eyes, starting from a wide area on his hairline and converging to the side of the root of his nose.\n\nDonovan wears a sleeveless officer outfit.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130259-NcSoB9Rw1xoo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130259
      },
      "rarity": "rare"
    },
    {
      "id": "mario-zeppeli",
      "name": "Mario Zeppeli",
      "alt_names": [
        "マリオ ・ ツェペリ"
      ],
      "role": "supporting",
      "description": "Mario Zeppeli is characterized as hard-working, trustworthy, and a wholesome family man. Although he loved his family, Mario had to abandon them in order to investigate the Pillar Men.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130260-m2tbwmLjERYW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130260
      },
      "rarity": "rare"
    },
    {
      "id": "loggins",
      "name": "Loggins",
      "alt_names": [
        "ロギンズ"
      ],
      "role": "supporting",
      "description": "Loggins is a tall, muscular man with chiseled features and somewhat glazed eyes. He wears a tunic, an over-sized fez, and armbands.\n\nLoggins displays a very demanding demeanor when instructing Joseph and Caesar, often forcing them to do tough trials during their Ripple training. Despite this, he seems to have, along with Messina, a sense of humor as the two would often tease their disciples. \n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130261-isfIv9CVs0Ug.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130261
      },
      "rarity": "rare"
    },
    {
      "id": "messina",
      "name": "Messina",
      "alt_names": [
        "メッシーナ"
      ],
      "role": "supporting",
      "description": "Messina is a tall muscular man with short hair tied into a ponytail and a Fu Manchu mustache. He wears a long hat, a sleeveless tunic, and armbands.\n\nThough much of Messina's personality isn't focused upon, he displays the characteristics of a stern, yet effective instructor to Joseph and Caesar. Despite this, Messina seems to have a sense of humor as he, along with Loggins, would often tease his disciples during their training.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130263-Z8zzr9T0VPb8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130263
      },
      "rarity": "rare"
    },
    {
      "id": "poco-no-ane",
      "name": "Poco no Ane",
      "alt_names": [
        "ポコの姉",
        "Poco's Sister"
      ],
      "role": "supporting",
      "description": "She's the older sister of Poco and was held captive in the castle by Dio",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b154086-t3rG3tJN3gd7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 154086
      },
      "rarity": "rare"
    },
    {
      "id": "mark",
      "name": "Mark",
      "alt_names": [
        "マルク"
      ],
      "role": "supporting",
      "description": "Mark is a German soldier and a friend of Caesar Zeppeli who participated in the effort for stopping the Pillar Men's awakening.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b232362-gJrN1tvLJGIT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 232362
      },
      "rarity": "rare"
    },
    {
      "id": "kisha",
      "name": "Kisha",
      "alt_names": [
        "記者",
        "Reporter"
      ],
      "role": "supporting",
      "description": "She arrives at the cafe where Joseph and Straizo are fighting and begins to take photos, saying it would reach the front page of the newspaper. Straizo catches her off guard and uses her as a hostage to approach Joseph, vowing to kill her if the Joestar runs off. Though Joseph attempts to bluff his way out by calling her a \"floozie\" he won't risk his life to save, Straizo forces Joseph to fight him when he rips the reporter's tooth out. After being saved, the reporter punches Joseph for insulting her and then kicks him in the knee. The adrenaline from the ordeal then wears off and she screams from the delayed pain of losing her tooth.\nThis content comes from JoJo's Bizarre Encyclopedia (https://jojowiki.com), and must be attributed to its authors, as specified in the license. \nJoJo's Bizarre Wiki (the FANDOM wiki) is prohibited from using it, for repeatedly copying without giving attribution.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b232365-gPF7YAkx8cY4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 232365
      },
      "rarity": "rare"
    },
    {
      "id": "chuugoku-kenpouka",
      "name": "Chuugoku Kenpouka",
      "alt_names": [
        "中国拳法家",
        "Kempo Fighter"
      ],
      "role": "supporting",
      "description": "He originally tries to rob Jonathan Joestar in Ogre Street alongside Robert E. O. Speedwagon and Tattoo",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b233084-xteJ2UoHY3Iz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 233084
      },
      "rarity": "rare"
    },
    {
      "id": "elizabeth-i",
      "name": "Elizabeth I",
      "alt_names": [
        "エリザベスⅠ世"
      ],
      "role": "supporting",
      "description": "Elizabeth I is a queen of England and a monarch from the Tudor dynasty. In 1565, she battles her first cousin once removed, Mary Stuart, over the throne. Her betrayal of Bruford and Tarkus, two retainers of Mary, led to the two knights cursing humanity; Dio Brando uses this resentment to his advantage over three hundred years later when he revives them as zombies.\n\n(Source: JoJo's Bizarre Adventure Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b243876-AVfx0NlLNGpU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 243876
      },
      "rarity": "rare"
    },
    {
      "id": "shitsuji",
      "name": "Shitsuji",
      "alt_names": [
        "執事",
        "Butler"
      ],
      "role": "supporting",
      "description": "A butler of the Joestar Family.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b243880-8FSQ2rcuTUkf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 243880
      },
      "rarity": "rare"
    },
    {
      "id": "wired-beck",
      "name": "Wired Beck",
      "alt_names": [
        "鋼線のベック",
        "Jeff Beck"
      ],
      "role": "supporting",
      "description": "He is a Vampire created by Kars tasked with guarding the hotel Kars is hiding in and briefly battles Lisa Lisa.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b243882-Fo8mpbhF5S3u.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 243882
      },
      "rarity": "rare"
    },
    {
      "id": "adams",
      "name": "Adams",
      "alt_names": [
        "アダムス"
      ],
      "role": "supporting",
      "description": "Adams is a former human and villager from Windknight's Lot who becomes a Zombie created by Dio Brando.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b243884-DR6KCSjhsQu1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 243884
      },
      "rarity": "rare"
    },
    {
      "id": "mary-joestar",
      "name": "Mary Joestar",
      "alt_names": [
        "メアリー・ジョースタ"
      ],
      "role": "minor",
      "description": "Mary Joestar is the late mother of Jonathan Joestar and wife of George Joestar. Never shown in person in the series, the only thing known about her story is that she accompanied her husband during a trip to London and died protecting her baby when her carriage had an accident and fell into a ravine.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130250-oaNdlE65nrCa.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130250
      },
      "rarity": "uncommon"
    },
    {
      "id": "george-ii-joestar",
      "name": "George II Joestar",
      "alt_names": [
        "ジョージ・ジョースター 2世",
        "Jorge Joestar"
      ],
      "role": "minor",
      "description": "George resembles his father Jonathan and his son Joseph. He is only seen wearing a military dress uniform.\n\nAssumed to be a capable fighter pilot, George was one of the first to fly an aircraft during World War I. It's hinted that he may have had a talent for the Ripple much like his father and son, though he was never given any training to properly use it.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130262-oIA8de1uG3Td.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130262
      },
      "rarity": "uncommon"
    },
    {
      "id": "styx",
      "name": "Styx",
      "alt_names": [
        "スティクス",
        "Father Styx"
      ],
      "role": "minor",
      "description": "An alcoholic priest who discovers Dio's coffin in the boat Jonathan and Erina board.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b222600-PzpoJ0suXfwe.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 222600
      },
      "rarity": "uncommon"
    },
    {
      "id": "joutarou-kuujou",
      "name": "Joutarou Kuujou",
      "alt_names": [
        "空条承太郎",
        "JoJo",
        "Qtaro",
        "Professor Kuujou",
        "Jotaro Kujo"
      ],
      "role": "minor",
      "description": "**Height:** 195 cm (6'5\")\n__Occupation:__ Student, Marine Explorer, Oceanographer\n__Nationality:__ Japanese \n\nJoutarou is Holly Kujo's son and Joseph Joestar's grandson. In Part 3, he has a recognizable attire of a blue trenchcoat-length school uniform jacket with yellow chains on the collar. He also wears a trademark hat which, while torn in the back, often seems to blend with his hair. When Joutarou first appears, he turned himself in to the police because he believes his Stand is an evil spirit possessing him. After he is released from jail, and learns what his Stand is, Joutarou gets used to Star Platinum -- a fierce, muscular, vaguely Aztec-looking spirit with \"the precision of a machine\" and the ability to destroy virtually anything with a sledgehammer barrage of fists. He has a very tough exterior, and is even rather rough and delinquent, but he also is very dedicated, intense, and loyal. He is very intelligent, but usually lets his (or Star Platinum's) fists do the talking with the enemy, even though he often has to rely on his wits to deal with stand users' attacks. He is also known for a quick and short temper. His catchphrase is \"Yare yare daze.\" It generally relates of being bored or exasperation. In Part 3, he is the main target of Dio, who realizes that Joutarou is his greatest threat.\n\nOne of the strongest stands in the JoJo universe; Star Platinum possesses super human senses, strength, stamina, accuracy and speed. It can see for great distances and at great magnifications. The Star tarot card that Star Platinum is named after symbolizes hope. Like other physically powerful stands, Star Platinum suffers from a narrow range of activity. It can only be active within a 2-3 meter radius from Joutarou. ~!It is similar to Dio's The World stand, and, it turns out, can likewise be used to stop time, but that ability is only revealed in Joutarou's epic battle with Dio Brando when Dio was about to drop a steamroller on him.!~\n\nIn the sixth story arc Stone Ocean, Joutarou becomes an oceanologist, moves to the United States, eventually marries, and his daughter, Jolyne inherits the potential to wield Stand powers.",
      "metadata": {
        "gender": "male",
        "age": "17-40",
        "dateOfBirth": "1970-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4003-gWDSEGbeOAll.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4003
      },
      "rarity": "uncommon"
    },
    {
      "id": "holly-kuujou",
      "name": "Holly Kuujou",
      "alt_names": [
        "空条ホリィ       ",
        "Holly Joestar",
        "Seiko",
        "空条聖子"
      ],
      "role": "minor",
      "description": "Holly Kuujou née Joestar is the daughter of [Joseph Joestar](https://anilist.co/character/6356/) and mother of [Joutarou Kuujou](https://anilist.co/character/4003/).",
      "metadata": {
        "gender": "female",
        "age": "45",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n129824-xj6lCSzsoS0M.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129824
      },
      "rarity": "uncommon"
    },
    {
      "id": "danny",
      "name": "Danny",
      "alt_names": [
        "ダニー"
      ],
      "role": "minor",
      "description": "Minor character appearing in Phantom Blood. He is Jonathan Joestar's dog and childhood best friend.\n\nGeorge Joestar I bought Danny when he was a puppy when Jonathan was five years old. Danny was very afraid of unfamiliar places and strange people causing him to bite Jonathan when the young boy first approached him. For a while, Jonathan also antagonized Danny by throwing stones at him. One day, while swimming in a river, Jonathan started drowning and was saved by Danny, which made them the best of friends.\n\n~!Danny's death at the hands of Dio Brando serves as one of the primary catalysts in the lifelong rivalry between Jonathan and Dio.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b222601-I0IIkQxXg6vr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 222601
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-23T02:39:00.625Z"
}