{
  "work_id": "date-a-live",
  "count": 15,
  "characters": [
    {
      "id": "shidou-itsuka",
      "name": "Shidou Itsuka",
      "alt_names": [
        "五河士道",
        "Shin",
        "Shiori Itsuka"
      ],
      "role": "protagonist",
      "description": "__Height:__ 170 cm\n\nShidou Itsuka is a student of Raizen High School. He was adopted into the Itsuka family when he was \"abandoned\" by his mother.   ~!Shidou has the ability to seal a spirit's power. However, the reason why he possesses it is shrouded in mystery. Due to this power which was already known by Kotori Itsuka he was recruited--or rather forced--to join \"Ratatoskr\" to help and save Spirits. Instead of killing Spirits to prevent spacequake from happening, he has to seal the Spirit's powers with a kiss in order for them to co-exist with humans.  Shidou met his real sister at volume 3 which was [Mana Takamiya](https://anilist.co/character/72283). Shidou, Mana and [Kotori](https://anilist.co/character/65263) can't remember much about what happened 5 years ago because a certain \"Spirit/person\" locked their memories away, and at that time Shidou met [Origami](https://anilist.co/character/65261) and helped her which was the cause as of why Origami fell for Shidou.  Once the power of a Spirit is sealed within Shidou, he has the ability to use some portion of it, thus his resurrection power is from Kotori's abilities when he sealed Kotori's Spirit 5 years ago.!~",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65257-fBaWJ3ymyE5m.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65257
      },
      "rarity": "epic"
    },
    {
      "id": "tooka-yatogami",
      "name": "Tooka Yatogami",
      "alt_names": [
        "夜刀神十香",
        "Tohka Yatogami",
        "Princess"
      ],
      "role": "protagonist",
      "description": "__Code name:__ Princess\n__Height:__ 155 cm\n\nTooka Yatogami's name is given by Shidou the second time they met. Due to being a spirit, she is always being targeted by the AST and is aiming for the kill; because of this, she hated humans for always shunning her and thinking that she wasn't allowed to live in this world. However, her whole life changed when she met Shidou.  Even with that high and cool presence, Tooka lacks some common sense and loves food very much.   ~!Once her power was sealed, she wasn't being targeted by the AST anymore, and she started attending Shidou's high school. Her surname was given by Reine.  She was overjoyed that she could live with Shidou now, but knowing that Origami was there too, she was somehow agitated and is always having a minor quarrel with Origami (mostly because of Shidou and their feelings).!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65259-rKR5JNNWyRC0.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65259
      },
      "rarity": "epic"
    },
    {
      "id": "origami-tobiichi",
      "name": "Origami Tobiichi",
      "alt_names": [
        "鳶一折紙",
        "Super Genius"
      ],
      "role": "protagonist",
      "description": "__Height:__ 152 cm \n\nOrigami Tobiichi is a student of Raizen High School, she is known for having high grades in her entire high school, while she is studying at this high school she is also a member of AST (Anti-Spirit Team) and she's one of the most skilled ones on their team.   \n\n~!Origami is in love with [Shidou](https://anilist.co/character/65257), her love for Shidou is greatly high that she stalks him. Origami met Shidou 5 years ago when the first great space quake happened. Although Shidou doesn't remember it due to his memories being erased by a certain spirit.  Origami has a great hatred towards spirits; 5 years ago when the first great space quake happened both of her parents died due to a flame spirit appearing causing every houses to burn and fall.  At the end of Volume 3 Origami saw the flame spirit (which was [Kotori Itsuka](https://anilist.co/character/65263)) she assumed it was the spirit that killed her parents but on Volume 4 that assumption was cleared by Shidou saying that there was another spirit lingering at the time the incident 5 years ago occurred.!~",
      "metadata": {
        "gender": "female",
        "age": "16-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65261-VebXn2wCS8K8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65261
      },
      "rarity": "epic"
    },
    {
      "id": "kotori-itsuka",
      "name": "Kotori Itsuka",
      "alt_names": [
        "五河琴里",
        "Commander"
      ],
      "role": "protagonist",
      "description": "__Height:__ 145 cm  \n\nKotori is [Shidou](https://anilist.co/character/65257)'s foster sister. Kotori is the head commander of Ratatosk which teaches Shidou about the spirit and spacequakes happening. She told Shidou how to save the spirits in a peaceful manner so as to prevent the spacequake from happening.  Kotori has two modes which is depicted by the ribbon she wears. The white ribbon depicts the Imouto Mode which makes her show love for her brother. The black ribbon depicts the Commander Mode which shows her tsundere sadistic bossy nature.   \n\n~!Kotori is actually a Fire Spirit. To be exact, she became a Spirit five years ago. The reason why Shidou regenerates his wound and comes back to life is because Shidou sealed Kotori's power inside him five years ago. It was around that time that there was a third entity which was said to be the cause of Kotori becoming a Spirit and the cause of [Mana](https://anilist.co/character/72283)'s, Kotori's and Shidou's memory to be erased.  Kotori's angel, Camael, contains the power of fire. Her weapon manifests itself as either a giant flaming axe or a heat cannon.!~",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65263-SsnYAtOtAiDK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65263
      },
      "rarity": "epic"
    },
    {
      "id": "yoshino",
      "name": "Yoshino",
      "alt_names": [
        "四糸乃",
        "Hermit"
      ],
      "role": "protagonist",
      "description": "The second spirit saved by Shido. Yoshino is a shy girl who is said to be the Kindest spirit up to date. Her codename is Hermit.   ~!Other than Yoshino, she has her other personality named Yoshinon which is the rabbit in her left arm. Yoshino says it's her hero for protecting her from bad guys (which are the ASTs). It is also said that Yoshino created Yoshinon in order to restrain herself from hurting humans.!~",
      "metadata": {
        "gender": "female",
        "age": "13-14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b70603-7IKQbX4JZBIT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70603
      },
      "rarity": "epic"
    },
    {
      "id": "narrator",
      "name": "Narrator",
      "alt_names": [
        "ナレーター",
        "語り手",
        "ナレーション",
        "Narrador",
        "Rozprávač",
        "Vyprávěč",
        "Dış ses",
        "Narratore",
        "Pripovjedač",
        "Narradora",
        "Рассказчик",
        "Người dẫn chuyện",
        "Tagapagsalaysay",
        "내레이터",
        "Narratore",
        "Erzählperson",
        "מספר",
        "Narrátor",
        "讲述人",
        "راوي",
        "Forteller",
        "Berättare",
        "Αφηγητής",
        "Narrateur",
        "なれーしょん",
        "旁白",
        "Narrato"
      ],
      "role": "supporting",
      "description": "This character page is set to represent and list all narrators, which haven't been given a visual representation of themselves in their respective work. \n\nPlease add other narrator characters, which were given a visual representation of themselves, separately from this narrator page.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36309-6KM0riV4lqfN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36309
      },
      "rarity": "rare"
    },
    {
      "id": "kurumi-tokisaki",
      "name": "Kurumi Tokisaki",
      "alt_names": [
        "時崎狂三",
        "Nightmare"
      ],
      "role": "supporting",
      "description": "**Height:** 157 cm\n\nKurumi is the third spirit who appeared after Tohka and Yoshino. She has a split personality: that of a gentle, mysterious highschool girl with a slow talking pattern, and that of a psychopathic killer. She is very aggressive in her actions which makes it harder for Shidou to capture her.   ~!Kurumi has the archangel Zafkiel, and has the power to control over time. The reason why she keeps appearing after being killed by Mana countless times was because of her powers. For example, she can heal herself by turning back the time. She uses a gunblade as her weapon.  Though she always keeps getting killed by Mana, Kurumi from a different time period appeared and was considered as the most deadly of all took down Mana, Tohka, and Origami at near end of volume 3. It is said that her ultimate goal is to get the powers of the spirit inside Shidou to kill the very first spirit who appeared 30 years ago to make all spirits disappear from this world. Her angel is destroyed by Kotori in volume 4.!~   ~!The twelve Roman numerals on the clock in her left eye have different powers that only the original Kurumi can use, but by using their powers, it will cause her life to be eaten away. In order to avoid this, she kills people to obtain 'time'.!~",
      "metadata": {
        "gender": "female",
        "age": "17 (physically)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b70069-DEV7X6o2L7oG.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70069
      },
      "rarity": "rare"
    },
    {
      "id": "tamae-okamine",
      "name": "Tamae Okamine",
      "alt_names": [
        "岡峰珠恵"
      ],
      "role": "supporting",
      "description": "__Height:__ 150 cm\n__Relatives:__ [Mikie Okamine](https://anilist.co/character/85561/Okamine-Mikie) (Cousin), ~![Kyouhei Kannazuki](https://anilist.co/character/75394/Kannazuki-Kyouhei) (Husband)!~\n\n[Shidou](https://anilist.co/character/65257)'s homeroom teacher. Despite being 29 years old, she is still single. Always, when something dangerous happens, Tamae has a habit of panicking non-stop.\n\n~!Tamae fell mutually in love at first sight with Kannazuki during a marriage interview party. Ideally, his looks fulfilled her dreams of being swept away by a princely figure. As of Volume 21, Tamae is currently wearing a ring symbolizing her engagement with Kannazuki.!~",
      "metadata": {
        "age": "29",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b70605-wNfyg6soBjHZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70605
      },
      "rarity": "rare"
    },
    {
      "id": "reine-murasame",
      "name": "Reine Murasame",
      "alt_names": [
        "村雨令音"
      ],
      "role": "supporting",
      "description": "__Height:__ 164 cm\n\nShe is highly intelligent and the Analysis Officer of Ratatosk's Fraxinus Crew.  She can be more called as the Vice Commander of the crew rather than [Kannazuki Kyouhei](https://anilist.co/character/75394), it is usually her at the side of [Kotori](https://anilist.co/character/65263) managing things around the crew. She transferred to Raizen Highschool as a physics teacher and an assistant home-room teacher at [Shidou](https://anilist.co/character/65257)'s class. She has this very big eyebags which you can tell she hasn't been sleeping for years.\n\n~!At some point of time she can be reliable and take command of the directions which Shidou needs to do when dating a spirit. She acts like the \"mother\" of Shidou and the other Spirits to help them on their troubles and such.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72281-HJZMsFy574SO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72281
      },
      "rarity": "rare"
    },
    {
      "id": "mana-takamiya",
      "name": "Mana Takamiya",
      "alt_names": [
        "崇宮真那"
      ],
      "role": "supporting",
      "description": "One of the Wizards of DEM (Deus Ex Machina), an organization which provides realizer units to other wizards throughout the world to fend off spirits. When DEM was transferred to Tenguu City's AST, she was posted on that spot to deal with the Spirit called Nightmare. Mana doesn't recall much of her past and it is said that she's one of the best wizards existing.   ~!In Volume 3 it is revealed that Mana is [Shidou](https://anilist.co/character/65257)'s blood-related sister; though she can't recall much of her past 5 years ago. She has a photo of her and Shidou that reveals that Shidou is her brother. Even though Mana is one of the best wizards existing, DEM has been experimenting on her body via tests and drugs; making her capable of using other tools meant to kill Spirits. It takes a side effect on her body, but she herself doesn't know it.!~  ~!In Volume 4 she was taken into Ratatoskr for custody; in Volume 5 she joins Ratatoskr.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72283-JjeZyRd2n7I3.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72283
      },
      "rarity": "rare"
    },
    {
      "id": "hiroto-tonomachi",
      "name": "Hiroto Tonomachi",
      "alt_names": [
        "殿町広人"
      ],
      "role": "supporting",
      "description": "__Height:__ 175 cm \n\nHiroto is Shido's friend and classmate.",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n75392-5PRtcU9OYoce.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 75392
      },
      "rarity": "rare"
    },
    {
      "id": "kyouhei-kannazuki",
      "name": "Kyouhei Kannazuki",
      "alt_names": [
        "神無月恭平"
      ],
      "role": "supporting",
      "description": "__Height:__ 181cm\n\nVice Commander of Ratatoskr. Other information is still unknown except for the fact that he's a masochist and like the other crew members, he loves and respects his Commander, Kotori.  He can be stupid, but when it comes to it he acts accordingly to what needs to be done.",
      "metadata": {
        "gender": "male",
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/75394.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 75394
      },
      "rarity": "rare"
    },
    {
      "id": "kyouji-kawagoe",
      "name": "Kyouji Kawagoe",
      "alt_names": [
        "川越恭次",
        "Bad Marriage"
      ],
      "role": "supporting",
      "description": "Married and divorced five times, he's been given the title \"Master of Love\". One of several male assistants to Shido by giving a vote on the appropriate course of action Shido should take when acting.  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/86887.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86887
      },
      "rarity": "rare"
    },
    {
      "id": "masaomi-mikimoto",
      "name": "Masaomi Mikimoto",
      "alt_names": [
        "幹本雅臣",
        "Boss",
        "Shachou-san"
      ],
      "role": "supporting",
      "description": "An incubus during the nighttime. One of several male assistants to Shido onboard Fraxinus. His introductory phrase, Mahal kita is Filipino for I love you.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/86889.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86889
      },
      "rarity": "rare"
    },
    {
      "id": "hinako-shiizaki",
      "name": "Hinako Shiizaki",
      "alt_names": [
        "椎崎雛子",
        "The Nail Knocker"
      ],
      "role": "supporting",
      "description": "Described as \"bringing pain to every rival of her love\" and \"the woman who lives at 2am\", she is introduced with a voodoo doll. One of several female assistants to Shido onboard Fraxinus.  (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/86891.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86891
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T14:53:13.354Z"
}