{
  "work_id": "fairy-tail",
  "count": 220,
  "characters": [
    {
      "id": "lucy-heartfilia",
      "name": "Lucy Heartfilia",
      "alt_names": [
        "ルーシィ・ハートフィリア",
        "Luigi",
        "Lu-chan",
        "Blondie"
      ],
      "role": "protagonist",
      "description": "A mage from the Fairy Tail guild who wields Celestial Spirit magic.\n\nLucy is cheerful, clever, and often gets swept along by her disruptive guildmates when they go overboard. Empathetic, caring, and more likely to write novels than wage battles, Lucy becomes most emboldened to challenge enemies when she needs to fight for her friends. She is said to be a noisy and somewhat fussy person, and there are times when she can be naive and too easily forgiving, greedy for validation as well as overly confident at inopportune moments. However, despite any failings and instances of self-doubt, she doesn't allow herself to feel down for too long - her optimism is boundless.\n\nIn July of Earth Land year X784, Lucy is a normal 17-year-old Fioran who wishes to join the infamous mage guild, Fairy Tail - although they have a reputation for being thoroughly destructive, she admires their strength and numbers. After a fateful meeting with two members of the guild in the town of Hargeon, Natsu Dragneel and his flying blue cat, Happy, she travels with them back to Fairy Tail, located in Magnolia, to begin the adventure of a lifetime.\n\n~!Lucy's surname is quickly revealed to be quite significant, for it distinguishes her as a member of the Heartfilia family, who head a powerful and wealthy organization called the Heartfilia Konzern. The Heartfilia's connection to Celestial Sprit Magic becomes a key point later on.!~",
      "metadata": {
        "gender": "female",
        "age": "17-19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5186-izgXf2S86K9u.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5186
      },
      "rarity": "legendary"
    },
    {
      "id": "natsu-dragneel",
      "name": "Natsu Dragneel",
      "alt_names": [
        "ナツ・ドラグニル",
        "Salamander (サラマンダー)",
        "Dragon Slayer"
      ],
      "role": "protagonist",
      "description": "A mage from the Fairy Tail Guild who wields fire dragon slayer magic.\n\nNatsu has a carefree and reckless nature and, despite his constant brawls with the other members of the guild, is a fiercely loyal and protective friend. He has a particularly close and competitive relationship with Gray Fullbuster and Erza Scarlet. With the former, he has had a constant rivalry from a young age and although they often denounce each other as not being friends, they regularly watch each others' back even when they are enraged with one another. He has had the same sort of relationship with Erza - the two both being scared of her since a young age - and they seemed to have a fairly good relationship in the past as, according to Erza, they used to shower together. He befriends people rather quickly too, considering Lucy a friend and willing to team up with her only after a few days of knowing her.\n\nIgneel, a dragon, found him in the forest and ended up taking care of him. He taught Natsu how to speak, read, and use magic. But one day Igneel disappeared without a trace. Because of this, Natsu's goal in life is to find him. \n\n~!Natsu is also among the five Dragon Slayers sent to the future from four hundred years past, having an additional purpose in the assistance of the defeat of Acnologia.!~\n\n~!He is the younger brother of Zeref Dragneel, having originally died 400 years ago, being subsequently revived as his brother's most powerful Etherious: E.N.D.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5187-y1OEdRu9sPN2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5187
      },
      "rarity": "legendary"
    },
    {
      "id": "happy",
      "name": "Happy",
      "alt_names": [
        "ハッピー"
      ],
      "role": "protagonist",
      "description": "Happy is a cat with some magical power, which may be the reason for his ability to speak. He can temporarily grow wings on his back and fly, and is capable of carrying only one person in this form. Happy apparently can fly at incredible speed (As it took Eligor less than a hour to reach Clover when Happy caught up with him in mere seconds with Natsu in tow) This is also the only kind of transportation that does not make Natsu sick. When asked why, Natsu got angry and exclaimed that Happy was a friend, not a means of transportation, ironically Natsu later gets sick when Gray gives him a piggyback ride when he's injured. He's very close to Natsu and becomes friends with Lucy quickly. The three form a team at the start of the manga. Happy is a full-fledged member of Fairy Tail, and has a member stamp on his back. It's also unknown if Happy even though being a mage and a member of Fairy Tail, can use his magic offensively or not.  Happy has a very cheerful nature. Even when facing danger, he maintains a smile. Along with Lucy, he is one of the saner members of Fairy Tail and often acts as the mediator between Natsu and Gray.  Happy's original name was going to be named Freyr, after a Norse god. But Hiro Mashima felt it didn't fit him, so he change the name to Happy to fit the character.   ~!Happy is actually a magical creature that comes from Edolas. These creatures are called Exceed, and are sent to Earthland to kill the Dragon Slayers. When their mission was changed to \"kidnap the Dragon Slayers\", Happy's memory got erased. Later it was revealed that this was not the case but that they were sent there to try to save their lives from a future foreseen by the queen of the Exceed. The \"mission\" was a misunderstanding by Charle who has the same ability as the queen and did not understand what her visions meant.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5188-1jTaic3aJ7Ds.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5188
      },
      "rarity": "legendary"
    },
    {
      "id": "gray-fullbuster",
      "name": "Gray Fullbuster",
      "alt_names": [
        "グレイ・フルバスター"
      ],
      "role": "protagonist",
      "description": "__Occupation:__ Mage \n__Affiliation:__ Fairy Tail Guild \n__Team:__ Team Natsu \n__Magic:__ Ice-Make, Ice Magic, ~!Ice Devil Slayer Magic!~\n\nGray Fullbuster is a member of the Fairy Tail guild. He is an 18 year-old ice mage, practicing ice alchemy, the art of molding ice. Due to his training history, he is most comfortable in little clothing and often forgets to wear clothes or quickly takes it off, thus often being accused of being an exhibitionist. He and Natsu have a friendly rivalry, and can often be seen fighting one another. Lucy believes the nature of his magic is the reason that he and Natsu constantly bicker. His member stamp is on the right side of his chest.   \n\n~!Gray's adeptness and strength as an ice mage is quickly shown in the story. During the Lullaby of Death arc, he teams with Natsu and Erza to defeat the demon awakened from the evil spirit from the Lullaby of Death. Members of the League praise his quickness at molding ice. Later in the story, he defeats Juvia, one of the Elemental Four of Phantom Lord. This victory may have been partly influenced by Juvia's liking to Gray. Juvia comments on Gray's skill, shocked that he was able to freeze both her boiling water and the rain. After Phantom Lord's defeat, Juvia secretly spies on Gray, bringing a packed lunch for Gray while he and the guild are rebuilding the headquarters.!~  \n\nIn certain panels, Gray's necklaces looks quite similar to the Rave Stone which is a crucial part of another one of Mashima's stories, \"Rave Master.\" Mashima has stated he doesn't remember the name. He takes off his clothes because Ul made him do it as one of her teachings and now it's a force of habit.  \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4839-p2SBgjdTxHxk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4839
      },
      "rarity": "legendary"
    },
    {
      "id": "erza-scarlet",
      "name": "Erza Scarlet",
      "alt_names": [
        "エルザ・スカーレツト",
        "Titania"
      ],
      "role": "protagonist",
      "description": "An S-class mage from the Fairy Tail Guild who uses requip magic, which allows her to summon weapons and equip armor stored in another dimension. She is the strongest active female member.\n\nErza is a very strict, intimidating, and impatient person with a strong sense of justice. She has been a member of Fairy Tail since she was a kid, and shows great loyalty and dedication to Makarov and the guild.\n\n~!Erza used to be a nameless child slave where she was forced to help build a tower called the R-system. Over time Erza made friends with other slaves, one of them being a boy her age named Jellal, who gave her the name \"Scarlet\" because of the color of her hair. She was eventually able to break free and escape-- this was also the time when her magic awakened.\n\nAfter she escaped, she sought to find Fairy Tail, which she had heard about from a fellow slave named Rob who cared for her like a grandpa.!~\n\n~!She has an artificial eye, given to her by Porlyusica, used to replace her right eye which had become blind due to an injury.!~",
      "metadata": {
        "gender": "female",
        "age": "19-21",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5189-GR1xdok9SFsN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5189
      },
      "rarity": "legendary"
    },
    {
      "id": "wendy-marvell",
      "name": "Wendy Marvell",
      "alt_names": [
        "ウェンディマベル",
        "Sky Sorceress",
        "Sky Goddess",
        "Sky Dragon Slayer"
      ],
      "role": "protagonist",
      "description": "Wendy is the sky dragon slayer. She has the ability to heal and manipulate air.",
      "metadata": {
        "gender": "female",
        "age": "12",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28886-unO1rEi3zdyF.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28886
      },
      "rarity": "legendary"
    },
    {
      "id": "charles",
      "name": "Charlés",
      "alt_names": [
        "シャルル",
        "Carla",
        "Charles",
        "Charlé"
      ],
      "role": "protagonist",
      "description": "Charlés is an Exceed with the same type of magic as Happy.  Wendy found her as an egg and they have been together ever since. They are very close, and Charlés sees it as her duty to protect Wendy from danger.\n\nCharlés is strict and uptight. She disapproves of fooling around.\n\n~!Charlés, like all Exceeds, came from the parallel world Edolas. She is the Exceed's princess, daughter of Queen Shagotte. As such, she possesses the same power as her mother: precognition.!~  \n\n~!After a year of training, she learns and perfects the ability to use Transformation Magic, making her appear as a young girl around Wendy's age. In this form, Charlés's magic and precognition abilities are increased, as well as her overall hand-to-hand combat proficiency.!~",
      "metadata": {
        "gender": "female",
        "age": "6",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22723-tAU59GCaf2H4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22723
      },
      "rarity": "legendary"
    },
    {
      "id": "juvia-lockser",
      "name": "Juvia Lockser",
      "alt_names": [
        "ジュビア・ロクサー",
        "Rain Woman",
        "Juvia of the Great Sea",
        "Juvia of the Deep"
      ],
      "role": "supporting",
      "description": "Juvia made up 1/4th of the Phantom Lord's elite group, Element 4. She was sent by the guild master Jose, along with Sol, to go and capture Lucy and bring her back to him safely. Her magic seems to deal with water as she is able to control rain and other large bodies of water. In addition, her body seems to be formed from the rain that surrounds her, leaving her intact and able to reform herself after attacks. Her nickname is also Juvia of the Sea, which correlates with her water controlling magic. When angry she can also control hot water. Juvia also often refers to herself in the 3rd person. Juvia has developed a crush on Gray, and due to a misunderstanding, views Lucy as her rival in love. After being defeated by Gray, the rain above her finally clears up which she thought was beautiful.  After the fight, her deep infatuation with Gray continues, secretly following him wherever he goes. In the Tower of Heaven arc, she mentions to Gray that she is now an independent mage once more, but Gray notes that she has probably has her eyes set on Fairy Tail. She is quite willing to do anything for him.  She is the only member of the Element 4 to be shown after the Phantom Guild arc. The Spanish word \"lluvia\", which is pronounced like her name, means rain. (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b9719-xh4xqTV6byNl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9719
      },
      "rarity": "common"
    },
    {
      "id": "gajeel-redfox",
      "name": "Gajeel Redfox",
      "alt_names": [
        "ガジル レッドフォックス",
        "Iron Dragon",
        "Metal Dragon Slayer",
        "Kurogane Gajeel",
        "Gazille"
      ],
      "role": "supporting",
      "description": "Gajeel is an Iron Dragon Slayer. He's short-tempered, tenacious, and fiercely loyal and dedicated to his guild. Despite saying that he doesn't want to make friends, he tries in his own way to do so. Behind Gajeel's tough exterior is an emotional guy with a sense of humor and a love for music.\n\n~!He starts out as a member of the Phantom Lord guild, but later joins Fairy Tail.!~\n\n~!Gajeel, along with the other dragon slayers, was actually born 400 years ago, and was sent to the future as a child to help destroy Acnologia.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16893-l9HhHQ8j09H5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16893
      },
      "rarity": "common"
    },
    {
      "id": "mirajane-strauss",
      "name": "Mirajane Strauss",
      "alt_names": [
        "ミラジェーン・ストラウス ",
        "The Demon",
        "Mira",
        "She-Devil"
      ],
      "role": "supporting",
      "description": "__Title:__ The Demon\n__Occupation:__ Mage\n__Known relatives:__ Elfman Strauss; Lisanna Strauss.\n\nShe is a former S-class mage and the older sister of Elfman. When Mirajane was an S-class mage, she was known as \"The Demon.\" However, due to a past incident involving the death of her younger sister, Lisanna, Mirajane somehow lost much of her magical ability and her will to fight. Given the recent event of Elfman regaining his lost abilities and Mirajane's increased confidence, Mirajane may someday regain her abilities and move forward with her life.  Mirajane plays a motherly role within the guild, and is often seen running the bar at the guild hall. She has rarely been shown to be in a bad mood, and can tolerate all of the guild's eccentricities. However, there have been a couple events that have disturbed Mirajane, including her discovery of the stealing of an S-Class job by Natsu, Happy and Lucy, and her later disappointment with Laxus following the destruction of the guild building.",
      "metadata": {
        "gender": "female",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5190-Xql1rGKUv1ql.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5190
      },
      "rarity": "common"
    },
    {
      "id": "makarov-dreyar",
      "name": "Makarov Dreyar",
      "alt_names": [
        "マカロフ・ドレアー"
      ],
      "role": "supporting",
      "description": "Makarov is the \"Master\" of the Fairy Tail guild and is also one of the Ten Great Holy Mages. Makarov shows extreme dislike for the Council and all the rules they try to impose on guilds. He frequently attempts to balance reprimands from the council and the eccentricity of his guild. He encourages Fairy Tail to do what they feel is right, but he has shown some concern that Natsu, Erza, and Gray will someday level a whole town. His magical abilities include Titan magic, giving him the ability to grow his body parts gigantic and his body into a giant-sized version of himself, and can control various other forms of magic including fire, ice and wind, which give him an immense magical power. The members of his guild affectionately refer to him as Ji-san or grandpa. Makarov also sees all of his guild members as his own children and will do anything to protect them. He has a perverted side, shown when he states he wishes to be smashed by Lucy's breasts and subsequently spanks her many times as a punishment.  \n\nGiven his advanced age, he considers retirement, but considers Laxus as too uncaring, Gildartz impossible for some unknown reason, Mystogan as too reclusive, and Erza as too young and brash to succeed him as guild master. After hearing the damages made by the team Erza-Lucy-Grey-Natsu-Happy from Mirajane, he cried that it's impossible to retire by now.",
      "metadata": {
        "gender": "male",
        "age": "88",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5333.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5333
      },
      "rarity": "common"
    },
    {
      "id": "cana-alberona",
      "name": "Cana Alberona",
      "alt_names": [
        "カナ・アルベローナ"
      ],
      "role": "supporting",
      "description": "A member of the Fairy Tail guild who uses a type of card magic.\n\nCana is a short-tempered woman with a pure heart. She's a heavy drinker and seems to always be drinking, although she rarely gets drunk. She's one of the original members of Fairy Tail, having been a part of it since she was a kid.\n\n ~!She is the daughter of Gildarts Clive, although he doesn't know it until Cana confronts him as an adult.!~",
      "metadata": {
        "gender": "female",
        "age": "18-20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8296-QdKicnM0gSGN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8296
      },
      "rarity": "common"
    },
    {
      "id": "elfman-strauss",
      "name": "Elfman Strauss",
      "alt_names": [
        "エルフマン・ストラウス",
        "Beast Arm Elfman"
      ],
      "role": "supporting",
      "description": "Elfman is an 18 year-old mage. He is one of the physically stronger Fairy Tail mages, exhibiting the ability called \"Take Over,\" which allows him to absorb the power of monsters he defeated into his right arm, earning him the nickname \"Beast Arm Elfman.\" His member stamp is on his neck.   His skill is among the top level in Fairy Tail; however, due to past events, he is no longer able to use Take Over to transform his entire body. It is revealed that in the past, an error occurred with his full-body transformation, leading him to lose control over his actions. Lisana, his younger sister and former member of Fairy Tail, sacrificed her life to break his concentration and help Elfman regain sanity. As a result, his most recent attempts at full-body Take Over induces a flashback of his sister, breaking his concentration and causing the spell to fade. This event has also caused Elfman's heart to lock shut.    ~!During the attack on Fairy Guild by Phantom Lord, Mirajane is taken hostage while pretending to be Lucy. Elfman, determined to overcome this setback and keep his vow to \"never see his sister's tears\" helped him regain the ability of full-body Take Over, helping him defeat Sol, a member of the Elemental 4. !~ It seems both he and his sister Mirajane were badly hurt in the past due to their younger sister, Lisana, dying. It's said that Elfman's heart is locked shut because of what happened to Lisana.   Elfman is an enthusiastic character, seemingly obsessed with manliness and regularly spouting (sometimes nonsensical) speeches about manhood, and what it is to be and act like a man..",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5334-jJiCoq8kJAUB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5334
      },
      "rarity": "common"
    },
    {
      "id": "plue",
      "name": "Plue",
      "alt_names": [
        "プルー（ニコラ）",
        "Canis Minor",
        "Nicola",
        "Shabutaro"
      ],
      "role": "supporting",
      "description": "The strange creature that Haru discovered, Plue is the Rave Bearer, and is able to sense the presence of the other Rave Stones. Plue's nose also has the ability to destroy dark brings. Plue is quite fond of sweets - especially lollipops. Plue hates pudding. He has the ability to utilize the rave of conflict which powers him and Haru up.  Plue has since shown up in Fairy Tail as one of Lucy's stellar spirits (Nicola, Canis Minor) and quickly named Plue and has been noted to only agree to be summoned on Tuesdays, Wednesdays and Thursdays.  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5879.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5879
      },
      "rarity": "common"
    },
    {
      "id": "ul",
      "name": "Ul",
      "alt_names": [
        "ウル",
        "Ur"
      ],
      "role": "supporting",
      "description": "Ul is a very powerful ice mage that trained both Leon and Gray. While Ul and her first apprentice Leon were walking through a town where the evil demon Deliora had just rampaged they found one lone survivor who happened to be Gray. From that day on Ul had trained both the boys to become ice mages and even began seeing them as her own two sons.   It was later revealed that Ultear is Ul's daughter and Siegrain commented that if Ul was alive, she would most likely be one of the Ten Holy Mages.    ~!Ul sacrificed herself in a battle with Deliora that was caused by Gray. He had run away from Ul and challenged Deliora himself. In order to save Gray, Ul used Iced Shell that turns the user's body into ice and thus freezes the enemy. Even so, she didn't actually die; she was turned into an ice, and it was proven when Deliora died from being frozen in the ice for too long.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/8293.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8293
      },
      "rarity": "common"
    },
    {
      "id": "laxus-dreyar",
      "name": "Laxus Dreyar",
      "alt_names": [
        "ラクサス・ドレアー"
      ],
      "role": "supporting",
      "description": "__Affiliation:__ Fairy Tail Guild  \n__Occupation:__ S-Class Mage  \n__Team:__ Thunder God Tribe, Team Fairy Tail, Team Fairy Tail B  \n__Magic type:__ Lighting  \n\nLaxus Dreyar is the 23 year old S-Class mage of Fairy Tail guild. He is the grandson of Fairy Tail's master, Makarov Dreyar, and son of Ivan Dreyar.   Laxus is a master of Lightning magic. It allows him to produce, control and manipulate lightning and electricity at his will. Through its use, Laxus can not only generate lightning from his body, but also make it appear from almost anywhere to strike his opponents, taking them by surprise. By generating electricity on different parts of his body, he’s capable of making his attacks in melee deadlier, and of propelling himself around to gain extra momentum. The bright light from his lightning can be also used to momentarily blind enemies. In addition, much like other Elemental types of Magic, Lightning Magic allows Laxus to turn his own body into lightning, in order to evade enemy attacks, move around at high speed and strike every opponent crossing his path.  His eye color is different in the manga and the anime. In the manga, it is orange/dark yellow, while the anime portrays it as greenish blue.",
      "metadata": {
        "gender": "male",
        "age": "23",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8294-D9AMOl70Mzvc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8294
      },
      "rarity": "common"
    },
    {
      "id": "loke",
      "name": "Loke",
      "alt_names": [
        "ロキ",
        "The Lion",
        "Leo"
      ],
      "role": "supporting",
      "description": "Loke (ロキ Roki) is a member of the Fairy Tail guild. He is very flirtatious with attractive women, being top ranked \"Mage you want to have as your boyfriend\". He attempts to flirt with Lucy but after finding out that she's a Stellar Spirit mage, he quickly stops his advances. Mirajane said that something must have happened to him with a similar female Stellar Spirit mage. She also mentioned that Loke once tried to flirt with Erza, but nearly got himself killed because of it. His weapon is a magical ring and is skilled in \"hand-to-hand\" combat.  He seems to have an interest in Lucy, despite his fear and is the one who searched for Lucy's lost keys and subsequently saves Lucy from bandits.   ~!After his sudden departure from Fairy Tail, Lucy discovers that Loki is a Stellar Spirit, Leo the Lion. His master was the famous Karen Lilica, who was a member of Blue Pegasus. Since her death three years ago, he has remained in the human world, unable to return to the Spirit World because he was exiled for killing his own summoner. He reveals that prolonged stay by a Stellar Spirit in the human world leads to imminent death.  Although he says he killed Karen he did not kill her himself. Karen was abusive, vain, and arrogant towards her other Zodiac Stellar Spirit, the timid and kind Aries. One day she was about to punish Aries by forcing her to remain in the Real World for seven straight days, something that would probably kill her. Sick of Karen's apparently frequent tantrums, Loke summoned himself in Aries' place and refused to go back to the Spirit World until Karen broke both their pacts and left her house. However Karen died on a mission before she could release them. This was due to the fact that she couldn't summon any other spirits while he was already summoned and thus he blamed himself for her death.  However, although Loke had given up hope and was more than willing to die, Lucy managed to convince the Stellar Spirit King to revoke his exile. Loke is now one of Lucy's Stellar Spirits. He promised to be Lucy's backbone, and returned to the spirit world to recover. With him, Lucy now has half the Gold keys.  After recovering, Loke is seen flirting with Lucy and being nice and friendly to everybody. He declared that he has abandoned his old ways, flirting with only Lucy now. He has also self-proclaimed himself to be Lucy's knight in shiny armor.  Before Lucy got annoyed and sent him back to spirit world, he give Lucy's team tickets to a fancy hotel he had planned to take his girlfriends to. Since he can no longer stay long in the real world, he wants Lucy's team to go because he wants to thank them for all the help they've given him.!~  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8295-pFDjOHun6jUr.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8295
      },
      "rarity": "common"
    },
    {
      "id": "mystogan",
      "name": "Mystogan",
      "alt_names": [
        "ミストガン",
        "Mystgun"
      ],
      "role": "supporting",
      "description": "He is another one of the S-classed mages who puts everyone to sleep every time he comes to the guild mainly because he hates to be seen. Makarov is the only person who is left unaffected by his magic but it still makes him tired. Laxus states that he has seen his face as well. He has a bandit type mask covering the bottom half of his face and a cap covering the top with only a slit being shown between his eyes.   ~!In chapter 120, when Mystogan attempts to stop Laxus and the hall of thunder, Laxus' lightning attack causes Mystogan's mask to burn off revealing a face that resembles Jellal's. However, he denies that he is Jellal although he admits that he knew him.!~   ~!Mystogan is actually the Edolas version of Jellal, and the renegade prince of Edolas.  In chapter 189, it was revealed that Mystogan was saved as a baby by Pantherlilly which caused his exile from Extalia.  Later on in chapter 268, Jellal took over the role of Mystogan and joins Fairy Tail. It is yet unknown how long he would stay with them.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/8297.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8297
      },
      "rarity": "common"
    },
    {
      "id": "aria",
      "name": "Aria",
      "alt_names": [
        "アリア"
      ],
      "role": "supporting",
      "description": "Aria is part of the Element 4 group as well as it strongest member. He is a very large man that towers over the other members. Despite his large appearance he seems to cry a lot. Aria&#039;s magic is called Drain which drains it&#039;s opponent of his or her magic power. Once it&#039;s drained it floats in the air and eventually disappears. The greater the magic power of the opponent the more damage Drain causes. His power is so great that he has to keep his eyes closed to contan it and only opens them for the strongest of opponents. His nickname within the guild is Aria of the Sky. Aria is Italian for &quot;air&quot;. (wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b9716-rJsJvow39y9p.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9716
      },
      "rarity": "common"
    },
    {
      "id": "sol",
      "name": "Sol",
      "alt_names": [
        "ソル"
      ],
      "role": "supporting",
      "description": "Sol is part of the Element 4 group. He along with Juvia were sent to capture Lucy to bring her back to their master, Jose. He is nicknamed Sol of the earth, as shown by his name his magic consists of controlling and creating the different forms of earth (sand, rocks, etc.) he has also been shown to be able to wrap his body around a persons arm maybe even their whole body. Sol often uses French linguistics in his speech as well as talking in a rhythmic pattern, he also gives his attacks musical names mix with the French names of different kinds of earth (Roche[rock] Concerto, Pl&acirc;tre[plaster] Sonata, etc). Sol is also French for &quot;ground&quot;.     (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/9717.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9717
      },
      "rarity": "common"
    },
    {
      "id": "totomaru",
      "name": "Totomaru",
      "alt_names": [
        "兎兎丸"
      ],
      "role": "supporting",
      "description": "Totomaru is part of the Element 4 group. He&#039;s a fire mage and can manipulate it to the point where he alters the state of fire even making it cold or extremely smelly. He carries a sword which he uses for close-combat. His nickname within the guild is The Great Fire. (wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b9718-bLunwEjlHIb9.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9718
      },
      "rarity": "common"
    },
    {
      "id": "jellal-fernandes",
      "name": "Jellal Fernandes",
      "alt_names": [
        "ジェラール・フェルナンデス",
        "Siegrain",
        "Gerard",
        "Mystogan"
      ],
      "role": "supporting",
      "description": "Jellal is a young man whose most prominent features are his blue hair and a red tattoo above and under his right eye, which he has had since his childhood. He is introduced under the alias of Siegrain, a young member of the Magic Council and can be considered the main antagonist of the series.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22751-ITQZWdiz8Ym7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22751
      },
      "rarity": "common"
    },
    {
      "id": "ultear-milkovich",
      "name": "Ultear Milkovich",
      "alt_names": [
        "ウルティア"
      ],
      "role": "supporting",
      "description": "Ultear is introduced as a member of the Magic Council who apparently works for Siegrain.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23842-0pvskZRARN4y.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23842
      },
      "rarity": "common"
    },
    {
      "id": "lyon-vastia",
      "name": "Lyon Vastia",
      "alt_names": [
        "リオン・バスティア",
        "Reitei"
      ],
      "role": "supporting",
      "description": "Lyon is a former student of Ur. Like Gray, Ur trained him when he was a child to use ice magic. Since meeting Ur he came to desire surpassing her at all costs, reading her magic books in secret to learn spells more powerful than what she was teaching him. After Ur gave her life to save Gray from Deliora by encasing it in ice, Lyon blamed Gray for depriving him of his chance to surpass her.   Lyon performs his ice magic with one hand, a faster though less reliable alternative to Gray's two-hand magic. Similarly, unlike the static ice creations Gray makes, Lyon's ice takes the form of animals that can move about after their creation.    ~!He later returns as a member of Lamia Scale, along with Sherry and Rock-Iron Jura to aid their alliance in the defeat of the Oracion Six. He also changes his magic style to use both of his hands during his fight with Gray with Racer.!~ The childhood Lyon is voiced by Sayaka Narita in Japanese and by Leah Clark in English.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/23843.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23843
      },
      "rarity": "common"
    },
    {
      "id": "jose-porla",
      "name": "Jose Porla",
      "alt_names": [
        "ジョゼ・ポーラ"
      ],
      "role": "supporting",
      "description": "Jose Porla is the guild master of Phantom Lord. He wears a witch&#039;s hat that bears the Phantom Lord guild symbol. He also seems to have a pair of wings, though they are never seen being used. Jose&#039;s magic is called Shade. With it he can create ghost troopers that he can command at will. He can also create a wave of ghosts. He dislikes Fairy Tail because before it came along, Phantom Lord was the strongest guild in the country, but now they&#039;re considered equal. Thus he feels that they are upstarts who stole his guild&#039;s title as the strongest. He&#039;s said to be just as strong as Makarov.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/23844.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23844
      },
      "rarity": "common"
    },
    {
      "id": "aquarius",
      "name": "Aquarius",
      "alt_names": [
        "アクエリアス"
      ],
      "role": "supporting",
      "description": "\"The Water Bearer\" is a Celestial Spirit that is one of the 12 Golden Zodiac Keys.\n\nAquarius is a moody and ill-tempered Celestial Spirit who often threatens to kill her owner, Lucy. When summoned, Aquarius will either attack the opponent, Lucy, or both of them, depending on her mood. Despite this, Aquarius does care for Lucy's well-being, which will later be elaborated on. \nAquarius' previous master had been Lucy's mother, Layla Heartfilia. When Layla retired from her work as a Mage because of her health problems, she entrusted Aquarius' Key to another Mage with instructions to present it to Lucy if she chose to be a Celestial Spirit Mage.  Aquarius' key was the first key that Lucy ever received...Because there weren't any other children to play with, Lucy would summon Aquarius as a playmate. This greatly infuriated Aquarius, however, learning why Lucy summoned her, the Celestial Spirit couldn't help but feel bad for the girl.\n\n~! The boyfriend she mentioned in episode 1 is actually Scorpio, another stellar spirit as well. \nHer key was owned by Lucy Heartfilia until she sacrificed it in order to summon the Celestial Spirit King. Nevertheless, Lucy still owns a part of her original key. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/26799.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 26799
      },
      "rarity": "common"
    },
    {
      "id": "erigor",
      "name": "Erigor",
      "alt_names": [
        "エリゴール",
        "Shinigami",
        "Grim Reaper"
      ],
      "role": "supporting",
      "description": "Erigor was the leader of the former Eisenwald Guild; he became known as a \"Shinigami\" as he became a mage that only accepted assassination jobs. His weapon of choice is a scythe.   ~!Erigor ordered his guild members to secure Lullaby, a magic death flute, so he could kill all the Guild Masters during their meeting. Kageyama returned with the flute as Erigor took over a train and after punishing Kageyama for alerting Flies of their plans. As Team Natsu found their way to Erigor, Erigor left and had his guild deal with them while he prepared a Wind Wall to trap them in the train station. He had almost casted it as Erza Scarlet challenged him. Erigor surprisingly trapped her before the fight could be begin.  After resting awhile, Erigor headed towards the guild masters however he was stopped by Natsu Dragneel who was riding Happy. As the two began a battle of fire and wind, Erigor casted his Storm Mail spell which canceled all fire magic. As Natsu refused to be beaten (and got angrier), Erigor's storm mail wore off as Natsu's angry made his flames hotter as fire sucks up oxygen causing Erigor's wind magic to weaken. After Happy told Natsu to give up and let Gray Fullbuster take care of him, Natsu went into a mad rage and defeated Erigor.  According to police reports, Erigor escaped from being arrested (unlike his other guild mates) and hasn't been seen since.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/27788.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27788
      },
      "rarity": "common"
    },
    {
      "id": "virgo",
      "name": "Virgo",
      "alt_names": [
        "バルゴ"
      ],
      "role": "supporting",
      "description": "Maid Spirit Virgo. She initially had a contract with Everlue, but after he was arrested the contract broke.  She handed her key to Happy and told him to give it to Lucy.  She is then called by Lucy to help them out of a situation.  She explains that since she's a spirit, she takes the form that her master desires, so when she was bound to Everlue, she had a big woman form, according to her masters likes.  When shes bound to Lucy, she takes a more visually appealing form",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28116-XRYJ0Z6i8VqC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28116
      },
      "rarity": "common"
    },
    {
      "id": "taurus",
      "name": "Taurus",
      "alt_names": [
        "タウロス"
      ],
      "role": "supporting",
      "description": "Celestial spirit contracted to Lucy. Appears as a black and white minotaur wearing a speedo. Uses a double headed ax for a weapon. He also is a pervert who has a crush on Lucy.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28440-037Sr1qbOFKC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28440
      },
      "rarity": "common"
    },
    {
      "id": "cancer",
      "name": "Cancer",
      "alt_names": [
        "キャンサー"
      ],
      "role": "supporting",
      "description": "Celestial spirit contracted to Lucy. Fights by cutting with a pair of scissors. Also like to cut hair with them and alludes to having cut Lucy&#039;s hair. For some reason he always says &quot;ebi&quot;, Japanese for shrimp, at the end of his sentences.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/28441.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28441
      },
      "rarity": "common"
    },
    {
      "id": "alzack-connell",
      "name": "Alzack Connell",
      "alt_names": [
        "アルザック・コネル"
      ],
      "role": "supporting",
      "description": "Alzack Connell is originally from the West, he came to Fairy Tail as an immigrant and joined the guild. He was first introduced in chapter 2 and episode 9.   Alzack has a crush on another member of the guild named Bisca Mulan, but he is too shy to confess to her. Loke jokingly implied that if Alzack doesn't confess then he would. Alzack now sees Loke as his rival.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/28546.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28546
      },
      "rarity": "common"
    },
    {
      "id": "bisca-mulan",
      "name": "Bisca Mulan",
      "alt_names": [
        "ビスカ・ムーラン"
      ],
      "role": "supporting",
      "description": "Bisca Mulan is originally from the west, she came to the Fairy Tail Guild as an immigrant and joined up. She was first introduced in chapter 2 and episode 9. Bisca is very polite and nice to her guild mates. Bisca has great admiration for Erza Scarlet since they have similar magic. She also has a huge crush on Alzack Connell but she can't bring herself to confess.   Bisca's ability is similar to Erza except she can re-equip many different guns and use them.   (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/28548.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28548
      },
      "rarity": "common"
    },
    {
      "id": "angel",
      "name": "Angel",
      "alt_names": [
        "エンジェル ",
        "Sorano"
      ],
      "role": "supporting",
      "description": "Angel is a mage who belongs to the Oraci&oacute;n Seis guild, a Dark guild composed of highly powerful mages, as well as the only female within the group. She along with the others&#039; goal is to find the power know as Nirvana, a very destructive power that was sealed away long ago. She a highly accomplished Celestial Spirit Mage however no better then Karen Lilica as she treats her spirit just as cruelly as the former Blue Pegasus member. Incidentally she was also the murderer of Karen herself.     She is also celestial spirit mage whose spirits are apparently fed up with her since meeting Lucy. She has the ability to summon two celestial spirits at the same time.    Gemini: Her formerly most used Celestial Spirit who is able to copy peoples&#039; looks, memories and powers at will. Their names are Gemi and Mini. They have recently been transferred to Lucy&#039;s possession.    Scorpio: A man with a large, gun-like scorpion tail who refers to himself in the plural first person. He is Aquarius&#039; boyfriend.    Aries: Karen&#039;s old Celestial Spirit used on Loke, acquired from Karen after Angel killed her. Her abilities are unknown.    Caelum: A spirit that can be wielded like a cannon as well as a sword.     (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28559-EP4u5YazeHmf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28559
      },
      "rarity": "common"
    },
    {
      "id": "midnight",
      "name": "Midnight",
      "alt_names": [
        "ミッドナイト",
        "Brain II",
        "Macbeth"
      ],
      "role": "supporting",
      "description": "Midnight is a mage which belongs to the Oración Seis guild, a dark guild composed of highly powerful mages whose goal is to find a power known as Nirvana, a very destructive power that was sealed away long ago. Not much is know about Midnight currently that not even the Blue Pegasus Guild, who were monitoring the Oración Seis, have much information about him outside his name.  He thinks of Brain as his own father, but they are not related.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n29113-GXxSkNjJ7XFe.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29113
      },
      "rarity": "common"
    },
    {
      "id": "ikaruga",
      "name": "Ikaruga",
      "alt_names": [
        "斑鳩"
      ],
      "role": "supporting",
      "description": "Ikaruga is a member of the Trinity Raven, a group commanded by Jellal from Death&#039;s Head Caucus. Her appearance is roughly that of a geisha though her power are more in line with that of a samurai. Ikaruga is able to cut practically everything. Besides, she likes to create a dramatic atmosphre using the poetic manner of speech.   ~!She confronted Shou as he tried to escape from the Tower of Paradise with Erza (who was in card form at the moment) and attacked them out of nowhere. Luckily her attacks distorted the power around the card holding Erza, allowing Erza to escape and confront Ikaruga. Erza used all type of her armors against her but each was cut to pieces by Ikaruga&#039;s blade. Eventually Erza was only down to a pair of pants around her waist and cloth around her upper body. Ikaruga thought of it as an easy win, and the two attacked one another. However much to her surprise Erza was able to deal a mortal blow and defeats her.  While their fates were not shown in the manga. In the anime its revealed she and other members of Trinity Raven managed to fly away from Tower of Heaven.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29115.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29115
      },
      "rarity": "common"
    },
    {
      "id": "sherry-blendy",
      "name": "Sherry Blendy",
      "alt_names": [
        "シェリー・ブレンディ"
      ],
      "role": "supporting",
      "description": "Sherry Blendy is a mage who belong to Lamia Scale, though as first it was was stated she was a former member. She first introduced as one of Reitei Lyon's allies in the Galuna Island arc. She later appears with Leon and Jura Nekis as the representatives of Lamia Scale, apparently having rejoined. She very infatuated with Lyon and most of her actions are based off her love of him.   ~! After their mission to stop Nirvana, she appears to have developed a crush on Ren Akatsuki. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29118.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29118
      },
      "rarity": "common"
    },
    {
      "id": "lyra",
      "name": "Lyra",
      "alt_names": [
        "リラ"
      ],
      "role": "supporting",
      "description": "Lyra is a Celestial Sprit summoned by Lucy Heartfillia. First summoned in Episode 12, she is a singer and a harp player whose songs reflect the heart and feelings of those who listen.  Lyra is also very well versed in the ways of magic and can only be summoned by Lucy three days a month according to their contract.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29406.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29406
      },
      "rarity": "common"
    },
    {
      "id": "sagittarius",
      "name": "Sagittarius",
      "alt_names": [
        "サジタリウス",
        "The Centaur",
        "The Archer",
        "The Man-Horse"
      ],
      "role": "supporting",
      "description": "Sagittarius is a Celestial Spirit who wears a horse costume that is currently owned by Lucy Heartfilia. Sagittarius&#039; weapon of choice is a bow and arrow, of which he is very skillful.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29489-Q01GRdm0hdlI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29489
      },
      "rarity": "common"
    },
    {
      "id": "levy-mcgarden",
      "name": "Levy McGarden",
      "alt_names": [
        "レビィマグガーデン"
      ],
      "role": "supporting",
      "description": "__Height:__ 155cm \n__Magic:__ Solid Script Mage\n\nLevy is a member of the Fairy Tail Guild's team Shadow Gear, along with Jet and Droy. She has a cheerful personality, being able to get along with many other guild members. Levy loves to read books, she and Lucy Heartfilia quickly became friends through their mutual love for books. Levy read the novel that Lucy is working on and is the only person who has done so by consent.\nLevy's magic is called Solid Script. Which allows her to make words solid and then throw the words at her opponent. For instance, if the word fire were to be thrown at her opponent the victim would feel as if he were hit by a fireball.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29493-XcqFX69oipzX.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29493
      },
      "rarity": "common"
    },
    {
      "id": "jet",
      "name": "Jet",
      "alt_names": [
        "ジェット"
      ],
      "role": "supporting",
      "description": "Jet is a member of the Fairy Tail Guild's team Shadow Gear, along with Levy and Droy. His magic, God's Leg, is a type of magic which dramatically increases his speed.  His real name is Sarusuke, with his nickname 'Jet', presumably coming from his type of magic.  - fairytail.wikia.com",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29490.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29490
      },
      "rarity": "common"
    },
    {
      "id": "droy",
      "name": "Droy",
      "alt_names": [
        "ドロイ"
      ],
      "role": "supporting",
      "description": "Droy is a member of Fairy Tail Guild's team Shadow Gear, along with Levy and Jet.  Droy controls Rapid-Growing Plants to battle. He wears something called \"Live-Coal\" containers holding seeds for his magic.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29491.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29491
      },
      "rarity": "common"
    },
    {
      "id": "gildarts-clive",
      "name": "Gildarts Clive",
      "alt_names": [
        "ギルダーツ・クライヴ"
      ],
      "role": "supporting",
      "description": "Gildarts Clive is one of the Fairy Tail Guild&#039;s S-Class mages. Gildarts is widely accepted by all the members as the strongest member in the guild under Makarov. Whether or not he is as powerful as Makarov is widely debated. He is frequently absent in the guild due to the nature of the requests he receives. He is widely referred by members of the Fairy Tail Guilds as &quot;that geezer&quot;. Gildarts went out of the guild 3 years ago to carry out his job, and recently has returned to the guild. He is rumoured to have taken both a 10-year-job as well as a 100-year-job, which is classified above the SS rank jobs as the difficulty is ranked on how long it would take for completion.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29502-znlVXVdXEQqg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29502
      },
      "rarity": "common"
    },
    {
      "id": "bickslow",
      "name": "Bickslow",
      "alt_names": [
        "ビックスロー",
        "Bixlow"
      ],
      "role": "supporting",
      "description": "__Occupation:__ Mage\n__Affiliation:__ Fairy Tail\n__Team:__ Thunder Legion\n__Magic:__ Seith Magic, Figure Eyes\n\nBickslow, also spelled Bixlow, is a mage who belongs to the guild Fairy Tail. He, along with Freed Justine and Evergreen, make up the Thunder Legion. Like the other members of the Thunder Legion, he has great respect for Laxus Dreyar and has been shown to go against Fairy Tail on Laxus' command. Bickslow has a lighthearted personality and has the tendency to laugh out loud and stick out his tongue. The magic he uses allows him to control and see souls; he refers to the dolls that he controls as his \"babies.\" His dolls tend to repeat the last word they spoke when they complete their sentences.",
      "metadata": {
        "gender": "male",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29752-j9In6z6TGNwL.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29752
      },
      "rarity": "common"
    },
    {
      "id": "freed-justine",
      "name": "Freed Justine",
      "alt_names": [
        "フリード・ジャスティーン ",
        "The Dark"
      ],
      "role": "supporting",
      "description": "A 20-year-old member of the Fairy Tail Guild who doesn't show his face often, but is skilled enough to be a S-Class Mage (stated by Erza). Laxus Dreyar calls him Freed the Dark. He hadn't been to the guild for half a year, and hadn't met any of the newer members like Lucy Heartfilia. During Fairy Tail's battle with Phantom Lord Guild, he was off in another town. \n\nHe is part of the Raijinshuu, a group of mages who act as servants to Laxus, with Freed as the self-proclaimed captain. He is known as one of the \"Mystery Men\" along with Mystogan and Gildarts. His magic style is Enchantments. Fried seems to be the most quiet of the Raijinshuu. He also seems to care for his former friends as he questioned Laxus when Laxus told him to kill other Fairy Tail members if he must. He seems to respect Laxus as he does whatever Laxus says even killing other guild members if he is ordered. When Mirajane shouts at him saying weren't they friends, Freed closes his eyes and replied \"we were once\". After Laxus left Fairy Tail, he shaved his head, though it grew back to normal as seen in chapter 165.  \n\nFreed's magic allows him to write runes that, depending on what is written, will actually effect its target, though Freed's magic seems to do more with inflicting pain and suffering on his opponents. It was first used during the Battle of Fairy Tail, where Freed's enchantments were used as traps do have the guild members fight each other to escape. Contrary to Makarov's theory that his magic needed some time to complete, Freed was shown to be able to easily write characters with his sword to produce its effects.  \n\n(Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29754.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29754
      },
      "rarity": "common"
    },
    {
      "id": "evergreen",
      "name": "Evergreen",
      "alt_names": [
        "エバーグリーン",
        "Ever"
      ],
      "role": "supporting",
      "description": "Evergreen (Ebāgurīn) is a 20 year-old member of Fairy Tail and a member of the team, Raijinshuu. As a child, it was her dream to be a fairy, so she joined Fairy Tail only for the name, with no interest in other things. She was lonely and anti-social as a child, due to her eyes being able to turn others into stone when looking into them. Her glasses suppress and control it because of its immense power. Recently, it has been revealed that she also uses exploding dust in combat. Because of her abilities, she was invited to join the Raijinshuu. Her Fairy Tail stamp is located on her right bosom.  Evergreen's primary magic is her Stone Eyes, which turn anyone who looks into them into stone. This ability is very similar to the mythological monster, Medusa. Overtime, those turned to stone will turn to dust, and she is supposedly able to turn them to dust upon her own command. Evergreen wears glasses so as to contain her powers in public.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29755-wZBPALuFyi90.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29755
      },
      "rarity": "common"
    },
    {
      "id": "fukurou",
      "name": "Fukurou",
      "alt_names": [
        "梟"
      ],
      "role": "supporting",
      "description": "Fukurou is a member of the Trinity Raven, a group part of the assassin guild Skull Order working under G&eacute;rard. Fukurou&#039;s appearance is one of the most bizarre seen so far in series, having the body of a man but the head of an owl as well as have rockets strapped to his back. He also fancies himself a warrior of justice despite the fact he working for the antagonist.     One of the Trinity Raven, Fukurou has the most abilities of the trio. His owl head allow him to see in the dark and the rocket pack allows him to move at high speed he also proficient at hand to hand combat. But his most unusual technique is the ability to eat his opponents and take their magic as his own, once he digested them they become permanently part of his power. However the strength of the power isn&#039;t always as powerful as the original welder, proven when Fukurou uses Natsu&#039;s fire breath on Gray and has no effect on him.     (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29756.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29756
      },
      "rarity": "common"
    },
    {
      "id": "cobra",
      "name": "Cobra",
      "alt_names": [
        "コブラ",
        "Erik"
      ],
      "role": "supporting",
      "description": "Cobra is a member of the Oración Seis, a dark guild composed of highly powerful mages. He, along with the other Oración Seis, seek to find Nirvana, a destructive magic power that was sealed long ago. Cobra is accompanied by a huge snake, Cuberios, whom he considers to be his only friend.   ~!He is a poison dragon slayer, because he injected lachryma in his body. In fact, he did it in order to be able to talk to Cuberios.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/30009.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30009
      },
      "rarity": "common"
    },
    {
      "id": "lisanna-strauss",
      "name": "Lisanna Strauss",
      "alt_names": [
        "リサーナ・ストラウス "
      ],
      "role": "supporting",
      "description": "Lisanna is the younger sister of both Elfman and Mirajane, and is also a member of Fairy Tail, like her siblings her magic is take over. Her member stamp was on her upper left shoulder and now is on Left Thigh.   ~!It is also very possible that Lisanna, Elfman and Mirajane operated in a three man group similar to Shadow Gear. She lost her life while trying to revert Elfman after his full-body Take Over went awry. He quickly lost control of himself and went on a rampage. Lisana gave her life trying to calm him down and stop his rampage. How she actually was able to do this is unknown. The mental and emotional trauma that Elfman and Mirajane both experienced after Lisana's death crippled their powers considerably. Mirajane lost her S-class rank and has not fought since. Elfman suffered major emotional damage and was incapable to cast his full body takeover spell for some time. When he did try casting it, a flashback to Lisana caused him to lose concentration. When Lisanna was younger, she seemed to be very kind like Elfman and unlike Mirajane. She wanted to help Natsu Dragneel raise an unknown egg to see what comes out of it, being a little more knowledgeable in it then Natsu. After seeing a softer side of the usually flamboyant Natsu, she stated that he was a lot like her sister and joked that perhaps later she should become his bride which predictably freaked him out. It is shown that while the Earth Land version of Lisanna is deceased, the Edoras version of Lisanna is still alive. Like her Earth land counterpart, she seems just as friendly and caring, as seen when she scolds Lucy for bullying Natsu and tells Jet and Droy not to pick on Elfman. When Natsu and Happy see her they both shed tears and tried to hug her in joy, this freaked her out. She doesn't seem to have the massive crush her Earth Realm counterpart has on Natsu.!~   ~!In chapter 199, it is told that the Earth Realm Lisanna was sucked into Edoras and didn't die. After she was taken back to the Earthland by the reverse anima. She was found by PantherLily and taken to Natsu and the others. There she explained everything to them and go back to the Fairy Tail Guild!~",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b30225-E6CfhyR2ZrpN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30225
      },
      "rarity": "common"
    },
    {
      "id": "kageyama",
      "name": "Kageyama",
      "alt_names": [
        "カゲヤマ"
      ],
      "role": "supporting",
      "description": "Kageyama is a former member of the Dark Guild Eisenwald and one of their elites. Kageyama is one of Erigor's best men. He is a user of shadow magic and has the ability to unseal magical seals.\n\n(Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b30387-1TIKl69HLnNM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30387
      },
      "rarity": "common"
    },
    {
      "id": "shou",
      "name": "Shou",
      "alt_names": [
        "ショウ"
      ],
      "role": "supporting",
      "description": "Shou (ショウ Shō) is a childhood friend of Erza, having known her during the days she and their friends were kept as slaves and forced to build the Tower of Paradise. As he was is the youngest of the group, he the most sensitive to whats going on around him. He also the closest to Erza calling her &quot;nee-san&quot; (big sister).",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/30454.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30454
      },
      "rarity": "common"
    },
    {
      "id": "bora",
      "name": "Bora",
      "alt_names": [
        "ボラ",
        "Bora the Prominence "
      ],
      "role": "supporting",
      "description": "Bora was once a mage that worked for the Titan Nose Guild but he was kicked out for using magic to aid in thievery. After this he started his own gang and continued his thievery under the guise of &quot;Salamander&quot;. At one point, he was Juvia Loxar&#039;s boyfriend or friend for a short time but he became annoyed with her rain so he broke up with her. The relationship was apparently very short.     fairytail.wikia",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31142.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31142
      },
      "rarity": "common"
    },
    {
      "id": "romeo-conbolt",
      "name": "Romeo Conbolt",
      "alt_names": [
        "ロメオ・コンボルト"
      ],
      "role": "supporting",
      "description": "Macao Conbolt's son, Romeo  was frequently bullied for having a father in the Fairy Tail Guild so Romeo begged his father to take an \"amazing job\" to make him look good. After Macao didn't return for a week, Romeo assumed the worst and begged Makarov to send him some help. After he refused, Natsu Dragneel left to find him alongside Happy and Lucy Heartfilia. When they brought him back, Romeo was extremely happy to see his father alive.   (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31143.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31143
      },
      "rarity": "common"
    },
    {
      "id": "horologium",
      "name": "Horologium",
      "alt_names": [
        "ホロロギウム ",
        "The Clock"
      ],
      "role": "supporting",
      "description": "Horologium is a Celestial Spirit that is owned by Lucy Heartfilia. He keeps people safe within his clock body and he narrates for those inside him. He can be used in both non-combat and combat situation. Lucy uses him as shelter and transporter when traveling in snowy area. In combat, he can protect the person inside him with his hard-wooden body. However, beside defense purpose, Horologium does not seem to have combative moves. He is also mostly on a time limit whenever he is out and will transport back to the Spirit World once the time is up leaving his occupant behind, regardless of any danger they&#039;re in.     fairytail.wikia",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31144.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31144
      },
      "rarity": "common"
    },
    {
      "id": "macao-conbolt",
      "name": "Macao Conbolt",
      "alt_names": [
        "マカオ・コンボルト "
      ],
      "role": "supporting",
      "description": "Macao Conbolt is one of the older mages of the Fairy Tail Guild, being 36. He uses a special flame, the purple flare, which cannot be blown off by wind or water. He's also very skilled in transformation magic, an ability which can even deceive an equal expert such as Mirajane. He's divorced and is dating a younger girl. It's said that he's very popular among young girls and he even had Cana Alberona falling for him in the past. He has one son, Romeo whom he cares a lot about.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31146.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31146
      },
      "rarity": "common"
    },
    {
      "id": "kaby-melon",
      "name": "Kaby Melon",
      "alt_names": [
        "カービィ・メロン"
      ],
      "role": "supporting",
      "description": "Kaby Melon is the son of Zekua Melon. He hired Natsu, Happy, and Lucy to destroy the Daybreak book. However, they only recovered the book, which held a coded letter from Zekua, instead of destroying it, so they did not claim the reward.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31149.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31149
      },
      "rarity": "common"
    },
    {
      "id": "everlue",
      "name": "Everlue",
      "alt_names": [
        "エバルー"
      ],
      "role": "supporting",
      "description": "Duke Everlue is the main antagonist of the Daybreak arc. A corrupted politician, he holds absolute power and influence over the nearby town of Shirotsume.  Everlue is a conceited and selfish man who declares himself to be highly-cultured and superior to everyone around him. He keeps a massive collection of books to flaunt his avid love for literature, though Lucy refers to him as an enemy of literature for blackmailing novelist Kemu Zaleon into writing a novel with Everlue as the main character. He is also extremely greedy and possessive, deeming anything he owns to be his alone and refuses to give it away or let anyone touch it even if he sees it as worthless.  Everlue has a rather twisted sense of beauty: He views otherwise, unattractive women to be beautiful, and declares ordinary-looking girls such as Lucy to be ugly. As a mage who specializes in Diver magic, he has a tendency to appear anywhere by bursting through the ground. He owned Virgo before Lucy had it.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31151.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31151
      },
      "rarity": "common"
    },
    {
      "id": "zekua-melon",
      "name": "Zekua Melon",
      "alt_names": [
        "ケム・ザレオン",
        "Kemu Zaleon"
      ],
      "role": "supporting",
      "description": "Zekua Melon was a former wizard, adventure novelist, and the father of Kaby Melon. He was blackmailed by Duke Everlue to write an adventure book about the Duke, or lose his and his family&#039;s citizenship. He instead wrote a letter to Kaby, and used a spell to encode it as the aforementioned novel.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31152.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31152
      },
      "rarity": "common"
    },
    {
      "id": "wakaba-mine",
      "name": "Wakaba Mine",
      "alt_names": [
        "ワカバ・ミネ "
      ],
      "role": "supporting",
      "description": "Wakaba Mine is a 36-year-old veteran mage who uses smoke magic. He has been in the Fairy Tail Guild for a very long time and has made many memories with many of the older guild members like Reedus Jonah and his rival Macao Conbolt. He also has a wife, but he doesn't like her at all.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31153.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31153
      },
      "rarity": "common"
    },
    {
      "id": "nab-lasaro",
      "name": "Nab Lasaro",
      "alt_names": [
        "ナブ・ラサロ "
      ],
      "role": "supporting",
      "description": "Nab Lasaro is one of the many mages of Fairy Tail.     Not much is known about Nab Lasaro, except that he seems to hang around the Request Board often, even though he dosen&#039;t get much jobs or missions to do. He shouts at Natsu when he breaks the Mission board, knowing Natsu Dragneel was going to do something bad. He also says he prefers solo missions when Lucy asked him to go on a mission with her    Fairy tail wiki",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31154.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31154
      },
      "rarity": "common"
    },
    {
      "id": "vijeeter-ecor",
      "name": "Vijeeter Ecor",
      "alt_names": [
        "ビジター・エコー "
      ],
      "role": "supporting",
      "description": "Vijeeter Ecor is a member of the Fairy Tail guild.  Vijeeter serves mostly as a back-ground character, and is seen most of the time dancing. However he has been seen in all of the manga's arcs along with the rest of the guild during there celebrations. He participated in the war against Phantom Lord and had a a fight against Nab Lasaro during the Fighting Festival arc. It is presumed that Nab defeated Vijeeter since he wasn't among the members who Bixlow took down, but Nab was.  (Source: Fairytail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31155.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31155
      },
      "rarity": "common"
    },
    {
      "id": "bob",
      "name": "Bob",
      "alt_names": [
        "ボブ"
      ],
      "role": "supporting",
      "description": "Bob is the founder and the Guild Master of the Blue Pegasus Guild. Bob, for some reason, tries to look very feminine. It is unknown exactly how strong he is or what magic he uses, but he seems to be friends with Makarov. It is also notable that Karen Lilica seemed to be afraid of him.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31156.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31156
      },
      "rarity": "common"
    },
    {
      "id": "goldmine",
      "name": "Goldmine",
      "alt_names": [
        "ゴールドマイン"
      ],
      "role": "supporting",
      "description": "Goldmine is the master of the Quatro Cerberus Guild. He apparently is friends with Fairy Tail Guild master Makarov.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31157.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31157
      },
      "rarity": "common"
    },
    {
      "id": "reedus-jonah",
      "name": "Reedus Jonah",
      "alt_names": [
        "リーダス・ジョナー"
      ],
      "role": "supporting",
      "description": "Reedus Jonah is one of the mages of the Fairy Tail Guild.  Reedus doesn't seem to be very brave seen when he stated he was \"afraid\" of Laxus Dreyar when Makarov noticed him hiding in the building, however he will do important jobs if asked, like protecting Lucy in the Phantom Lord Arc and finding help in the Fighting Festival Arc. He loves to draw happy scenes like when Happy was first born. Reedus also likes to portray other people, like drawing Mirajane and Fried just for having good looks.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31158.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31158
      },
      "rarity": "common"
    },
    {
      "id": "yuka-suzuki",
      "name": "Yuka Suzuki",
      "alt_names": [
        "ユウカ・スズキ",
        "Wave-Motion Yuka"
      ],
      "role": "supporting",
      "description": "Yuka Suzuki, also known by his nickname Wave-Motion Yuka, is a former mage of Lamia Scale and one of Lyon Bastia&#039;s allies during the Galuna Island arc. He served as the guild anti-mage as his magic could cancel out others.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31167.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31167
      },
      "rarity": "common"
    },
    {
      "id": "toby-horhorta",
      "name": "Toby Horhorta",
      "alt_names": [
        "トビー・オルオルタ"
      ],
      "role": "supporting",
      "description": "Toby is one of Lyon Bastia's allies during the Galuna Island arc, he also a mage of the Lamia Scale Guild.  He uses poisonous claws called \"Mega Jellyfish\" in battle.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31169.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31169
      },
      "rarity": "common"
    },
    {
      "id": "porlyusica",
      "name": "Porlyusica",
      "alt_names": [
        "ポーリュシカ "
      ],
      "role": "supporting",
      "description": "Porlyusica is a lonely old healer living in a forest outside of Magnolia town. She is withdrawn and reclusive because she doesn&#039;t like humans, suggesting she is not one herself   ~!She is the Grandine from Edolas. However in no way can she transform into a dragon, she is 100% human. Revealed in chapter 260.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31192.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31192
      },
      "rarity": "common"
    },
    {
      "id": "max-alors",
      "name": "Max Alors",
      "alt_names": [
        "マックス・アローゼ"
      ],
      "role": "supporting",
      "description": "Max Alors is a lesser member of the Fairy Tail Guild but apparently he is in charge of all the social activities, given his love for talking to people. He specializes in sand based magic.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31193.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31193
      },
      "rarity": "common"
    },
    {
      "id": "warren-rocko",
      "name": "Warren Rocko",
      "alt_names": [
        "ウォーレン・ラッコー"
      ],
      "role": "supporting",
      "description": "Warren Rocko is a member of the Fairy Tail Guild who uses telepathy, a magic that allows one to converse mind-to-mind. In battle, it's possible for him to read his opponent's mind. Although he may not look it, he is classified as one of the more powerful wizards in the guild, and he has gone on a huge number of jobs alone. His fear of heights causes him many problems. At one point he took a girl on a date, but as they were crossing a bridge, his mental shouts of \"Help, save me!!! I'm scared!!!\" were heard by everyone in the town. His design is similar to the character Branch from Rave Master.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31194.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31194
      },
      "rarity": "common"
    },
    {
      "id": "laki-olietta",
      "name": "Laki Olietta",
      "alt_names": [
        "ラキ・オリエッタ"
      ],
      "role": "supporting",
      "description": "Laki Olietta is an 18-year-old mage who uses wood-based magic, and can instantly reshape wood into a form of her choice. Due to this ability, she helped a lot with the rebuilding of the Fairy Tail Guild after it was vandalized by the Phantom Lord Guild. She likes glasses and wears them herself, and she has a dislike for perverts. Laki also has funny ways of expressing herself, for example she refers to getting a haircut as \"chopping hair\", eating as \"feeding your stomach\", and sleeping as \"whittling away the defenseless hours\". She seems to have a slightly sadistic side, as she keeps a large amount of torture devices in her room in Fairy Hills.",
      "metadata": {
        "gender": "female",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b31195-mA89B4rTVjUZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31195
      },
      "rarity": "common"
    },
    {
      "id": "aries",
      "name": "Aries",
      "alt_names": [
        "アリエス"
      ],
      "role": "supporting",
      "description": "Aries is a timid female, very softspoken and shy. In the past, Karen the Celestial Spirit mage forced her to do many horrible things and generally abused her, such as using her as a shield (Because, apparently, she has no fighting abilities) and using her to lead away all of her boyfriends instead of simply refusing them.   ~!Loke arc  Three years prior to the story, Aries was owned by Karen Lilica. In Loke's flashback, Aries was treated horribly by Karen. She used her to keep her \"boyfriends\" away from her. She tries to protest but she is too intimidated by Karen. Blue Pegasus Guildmaster Bob sees this and warns Karen to take care of her spirits. In a rage, she accuses Aries of ratting her out and apparently physically assaults her, although all that is seen is Aries getting shoved to the floor.  Karen threatens to keep Aries in the human world for a week, but before Karen can act on this threat, Loke steps in by summoning himself to take Aries' place (Since Karen could only maintain one spirit at a time) and tells the Celestial Spirit Mage to break her contracts with Aries and himself. When she refuses, Leo threatens to remain in the human world until she agrees, rendering Karen unable to summon any other Celestial Spirits. Karen continues to refuse, since she believes that he cannot remain in the human world for a long time; however, Leo leaves her with the ultimatum and goes to a deserted chapel where he stays for three months, attempting to get Karen to break the contracts. When Leo returns, he learns that Karen was killed on a mission and that Aries' key was taken.  Oracion Seis arc  After an exchange in the Spirit World, Aries is summoned to battle with Loke and Lucy Heartfilia. Despite the two not wanting to fight one other, they choose to fight for the sake of their pride, and the battle begins. However, due to Aries' non-combative nature, she fights a losing battle to Loke. As the battle progresses, Angel summons Caelum and uses it to blast through Aries and hit Loke, causing them both to return to the Celestial World for healing. After her defeat, Angel is arrested and her contracts with her spirits are broken. Aries, along with Scorpio and Gemini, seek out Lucy and form contracts with her instead.  Edoras arc  Lucy summons Aries to prevent the Edoras soldiers from capturing her and her friends. Aries then proceeds to attack the soldiers with a technique called \"Wool Bomb\", which allows Lucy and company to escape.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33457.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33457
      },
      "rarity": "common"
    },
    {
      "id": "crux",
      "name": "Crux",
      "alt_names": [
        "クルックス"
      ],
      "role": "supporting",
      "description": "Crux is a Celestial Spirit owned by Lucy Heartfilia. It is unknown if Crux can be used for combat purposes. However, it is known that Crux has the ability to search for information about Celestial Spirits and their owners by sleeping. His nickname is Crumudgeon.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33458.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33458
      },
      "rarity": "common"
    },
    {
      "id": "celestial-spirit-king",
      "name": "Celestial Spirit King",
      "alt_names": [
        "星霊王"
      ],
      "role": "supporting",
      "description": "The Celestial Spirit King (星霊王 Seirei-ō) who rules all of the spirit world and enforces the rules among all the spirits. He is the most powerful of all the spirits although it is unknown if he gives out his key to humans or even if he has one.    (Source: http://fairytail.wikia.com/wiki/Celestial_Spirits#Celestial_Spirit_King)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33516.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33516
      },
      "rarity": "common"
    },
    {
      "id": "scorpio",
      "name": "Scorpio",
      "alt_names": [
        "スコーピオン"
      ],
      "role": "supporting",
      "description": "Scorpio is a Celestial Spirit that is one of the 12 Golden Zodiac Keys. His key is currently owned by Lucy. He is also Aquarius&#039;s boyfriend with which he has a happy relationship. His weapon appears to be a large, strange gun shaped like a scorpion&#039;s tail.     Scorpio has a strange manner of speaking which is similar to the third person where as he says &quot;We are&quot; in the beginning of each sentence. Scorpio has also a habit of folding his middle and ring fingers back while keeping his index and little fingers extended, mimicking the pincer claws of a scorpion.     Unlike Aquarius, Scorpio hasn&#039;t shown any hostility or dislike towards Lucy. In fact he seems to genuinely respect and care for Lucy.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33522.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33522
      },
      "rarity": "common"
    },
    {
      "id": "gemi",
      "name": "Gemi",
      "alt_names": [
        "ジェミー",
        "Gemini"
      ],
      "role": "supporting",
      "description": "Gemini or Gemi and Mini are Celestial Spirits and one of the 12 Golden Zodiac Keys. They possess the ability to mimic the appearances and abilities of others.     (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33523.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33523
      },
      "rarity": "common"
    },
    {
      "id": "mini",
      "name": "Mini",
      "alt_names": [
        "ミニー",
        "Gemini"
      ],
      "role": "supporting",
      "description": "Gemini or Gemi and Mini are Celestial Spirits and one of the 12 Golden Zodiac Keys. They possess the ability to mimic the appearances and abilities of others.      (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33524.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33524
      },
      "rarity": "common"
    },
    {
      "id": "karen-lilica",
      "name": "Karen Lilica",
      "alt_names": [
        "カレン・リリカ"
      ],
      "role": "supporting",
      "description": "Karen Lilica is a mage who belonged to the Blue Pegasus Guild, as well as being a famed Celestial Spirit mage and former owner of Aries and Loke.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b33525-hEjaQNnom1qQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33525
      },
      "rarity": "common"
    },
    {
      "id": "pantherlily",
      "name": "Pantherlily",
      "alt_names": [
        "パンサー・リリー",
        "Lily"
      ],
      "role": "supporting",
      "description": "Pantherlily is an Exceed that works for the kingdom of Edoras as the Magic Militia's First Division Commander of the Royal Army. He seems to have a grumpy disposition and detests noisy people. He first appears by demanding that Byro and the hyperactive Hughes quiet down. (Although Sugarboy noted that Pantherlily was in a nastier mood than usual).  Pantherlily has shown the ability that all Exceed have, Aera. He wields a huge sword and shows massive strengTogether with Akaoni and Majorina, are the three commanders of Bad End Kingdom. His appearance is that of a wolf, and his character is probably based on the Big Bad Wolf from fairytales like The Three Little Pigs and Little Red Riding Hood. A defining feature is his unique laugh of \"Uruffufu\".   ~! At the end of the Edolas arc, Pantherlily is sent to Earthland as well as the rest of the Exceed. There he takes on a small 'chibi' form similar to that of Carla and Happy and takes the role of being Gajeel's cat, resulting in all three Fairy  Tail dragon slayers having trademark talking cat companions.  While he is in his 'chibi' form most of the time, he can still transform into his humanoid form. He refrains from doing this too often however as it drains a lot of magical power from his body.!~  (Source: fairytail wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n33526-zvLiNNJY0BYO.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33526
      },
      "rarity": "common"
    },
    {
      "id": "brain",
      "name": "Brain",
      "alt_names": [
        "ブレイン"
      ],
      "role": "supporting",
      "description": "The Leader of Oracion Seis. When he tried to use Nirvana to take over the guilds he fought Jura, one of the Ten Saint Wizards and lost.  Inside him dwells another, more evil and dangerous personality, known as Zero",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/34392.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34392
      },
      "rarity": "common"
    },
    {
      "id": "simon",
      "name": "Simon",
      "alt_names": [
        "シモン"
      ],
      "role": "supporting",
      "description": "One of the childhood friends of Erza. Simon had a crush for Erza when they were kids. He was the first to find out about Jellal's real intentions and has always believed in Erza.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/34457.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34457
      },
      "rarity": "common"
    },
    {
      "id": "millianna",
      "name": "Millianna",
      "alt_names": [
        "ミリアーナ"
      ],
      "role": "supporting",
      "description": "Millianna is one of Erza's childhood friends from their days as slaves working at the Tower of Heaven, and she worked as one of Jellal's minions for a time. She is an avid cat lover, having decorated her entire room with a cat theme; her love of felines is to the point that she refuses to hurt anything that even resembles a cat, even if she knows that it is not a cat.   ~!Millianna is one of the five team members representing Mermaid Heel in the Grand Magic games. Though she enters under a cape to hide her identity  She is seen wishing Kagura good luck before her match with Yukino. After Yukino mentions betting their lives in their match, Millianna is a little worried about whether Kagura will be okay. Though when the fight starts, Kagura easily gets an advantage and she says that the moment Kagura draws her sword it would be cataclysm  After the second day ends she decides to reveal herself to Erza and they immediately hug once seeing each other again after so long. Later they sit and have a chat. She mentions that Kagura is strong and how there is a chance that she may be stronger than Erza if she had gotten serious. She then reveals the reason behind the name of Kagura's sword and the real reason she decided to join Mermaid Heel. She says that like Kagura, she hates Jellal due to him making her a slave and that Jellal killed Simon, and therefore unforgivable!~  Millianna is noted for her cat-like appearance. She is an average tall woman who also has a curvaceous figure. She has cat-like ears, eyes, nose, and mouth, has brown hair tied into two ponytails and has whisker-like tattoos. She wears a yellow jacket with white stripes and black trimmings. She also wears a pink dress with a white bow tie on it and light-pinkish ruffles on the lower portion, a choker with a bell on it, and white leggings.  Prior to times-skip Millianna's appearance seems to have change throughout the years. Her hair is arranged in a messy way. She still retained her cat-like appearance still wearing a choker with a bell attached unto it. Her attire consists of a hooded cape, long striped leggings, evening gloves, tight and small shorts with a belt and boots. She seems to have no upper attire revealing her bikini top uncovered.  Millianna is a very cheerful, peppy person. She has a great love for cats and refuses to see them harmed in any way. She also tries to mimic a cat, from dressing up like one, to meowing. Millianna is close with the rest of her friends, and was very apologetic towards Erza after the events at the Tower of Heaven.  (Source: fairytail.wikia.com)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b34712-hvTfTN2uNaPW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34712
      },
      "rarity": "common"
    },
    {
      "id": "wally-buchanan",
      "name": "Wally Buchanan",
      "alt_names": [
        "ウォーリー・ブキャナン "
      ],
      "role": "supporting",
      "description": "Wally considers himself a &quot;Dandy&quot; man and tries to make himself look dandy (=cool) every chance he gets. He also teaches others to be dandier (For example, he says to Milliana that talking cats are not unique, but they are cats because they are talking.) Even his word bubbles are drawn in a square style.    Wally mostly wields a pistol (in the anime his arm changes into a gun instead) that shoots out different magic bullets depending on if he want to kill or simply harm his targets. His main magical ability is teleportation in which in turns himself into a million blocks and moves from one place to the other. He can also use the squares to attack as well separate his body parts to attack independently.      ~!Wally is also Richard&#039;s younger brother, who is also known as Hot Eye, from the Oracion Seis.!~  Source: fairytail.wikia.com",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/34713.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34713
      },
      "rarity": "common"
    },
    {
      "id": "vidaldus-taka",
      "name": "Vidaldus Taka",
      "alt_names": [
        "ヴィダルダス・タカ"
      ],
      "role": "supporting",
      "description": "Vidaldus Taka is a mage who is part of Trinity Raven, a group working under Jellal that belong to the assassins guild called the Death&#039;s Head Caucus. Vidaldus&#039; appearance is that of a rock star who always seems to be swinging his hair around wildly.    Source: fairytail.wikia.com",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/34714.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34714
      },
      "rarity": "common"
    },
    {
      "id": "hibiki-laytis",
      "name": "Hibiki Laytis",
      "alt_names": [
        "ヒビキ・レイティス",
        "Hundred Night Hibiki"
      ],
      "role": "supporting",
      "description": "A member of the Blue Pegasus Guild.  Consistently places highly in weekly sorceror`s \"Mage i`d i like as boyfriend ranking\". It seems that he`s the reason so many female mages apply to join Blue Pegasus.  \"Archive\", in addition to allowing him to compress information into magical data and send it to a target party, also has information management and practical combat applications.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/35202.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 35202
      },
      "rarity": "common"
    },
    {
      "id": "narrator",
      "name": "Narrator",
      "alt_names": [
        "ナレーター",
        "語り手",
        "ナレーション",
        "Narrador",
        "Rozprávač",
        "Vyprávěč",
        "Dış ses",
        "Narratore",
        "Pripovjedač",
        "Narradora",
        "Рассказчик",
        "Người dẫn chuyện",
        "Tagapagsalaysay",
        "내레이터",
        "Narratore",
        "Erzählperson",
        "מספר",
        "Narrátor",
        "讲述人",
        "راوي",
        "Forteller",
        "Berättare",
        "Αφηγητής",
        "Narrateur",
        "なれーしょん",
        "旁白",
        "Narrato"
      ],
      "role": "supporting",
      "description": "This character page is set to represent and list all narrators, which haven't been given a visual representation of themselves in their respective work. \n\nPlease add other narrator characters, which were given a visual representation of themselves, separately from this narrator page.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36309-6KM0riV4lqfN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36309
      },
      "rarity": "common"
    },
    {
      "id": "ivan-dreyar",
      "name": "Ivan Dreyar",
      "alt_names": [
        "イワン・ドレアー "
      ],
      "role": "supporting",
      "description": "__Name:__ Ivan Dreyar      __Eye &amp; Hair color:__ Black   __Affiliations:__ Raven Tail Guild, Fairy Tail Guild (previously)   __Occupation:__ Mage   __Title:__ Guild Master of Raven Tail guild   __Relatives:__ Makarov (father), Laxus Dreyar (son)    Ivan Dreyar is the father of Laxus Dreyar and the son of Makarov and master/founder of the Raven Tail Guild.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/36554.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36554
      },
      "rarity": "common"
    },
    {
      "id": "karakka",
      "name": "Karakka",
      "alt_names": [
        "カラッカ "
      ],
      "role": "supporting",
      "description": "Karacka is a member of the Dark Guild Eisenwald.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/36684.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36684
      },
      "rarity": "common"
    },
    {
      "id": "jude-heartfilia",
      "name": "Jude Heartfilia",
      "alt_names": [
        "ルーシィの父"
      ],
      "role": "supporting",
      "description": "Mr. Heartfilia is the father of Lucy Heartfilia and was one of the wealthiest company owners known in the country of Fiore. His deceased wife is Layla Heartfilia. In the past, he neglected his daughter and put all his time and effort into his company. Because of this, Lucy felt rejected and nurtured a grudge against her father, and eventually she decided to run away.\n\n~!In the X791 arc, one month before Lucy's return to Magnolia, Jude passes away and Lucy is told this heartbreaking news by the receptionist at the Love & Lucky guild. Later, it is revealed that Jude sent birthday presents to Lucy every year, even after she disappeared, and also wrote letters, hoping that she'd read them one day. He expressed his desire to see her again and called her his pride, finishing off the last letter by telling her that he had always loved her.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/36685.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36685
      },
      "rarity": "common"
    },
    {
      "id": "rayule",
      "name": "Rayule",
      "alt_names": [
        "レイユール"
      ],
      "role": "supporting",
      "description": "Rayule is a member of the Dark Guild, Eisenwald.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/36686.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36686
      },
      "rarity": "common"
    },
    {
      "id": "ren-akatsuki",
      "name": "Ren Akatsuki",
      "alt_names": [
        "レン・アカツキ",
        "Empty Night Ren"
      ],
      "role": "supporting",
      "description": "Ren Akatsuki is one of the mages who belong to the Blue Pegasus Guild's team The Trimens.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/36687.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36687
      },
      "rarity": "common"
    },
    {
      "id": "sue",
      "name": "Sue",
      "alt_names": [
        "スー"
      ],
      "role": "supporting",
      "description": "Sue is a member of Phantom Lord Guild under Gajeel&#039;s command.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/36688.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36688
      },
      "rarity": "common"
    },
    {
      "id": "yajima",
      "name": "Yajima",
      "alt_names": [
        "ヤジマ"
      ],
      "role": "supporting",
      "description": "Yajima is a former member of the Magic Council, and a close friend of the Fairy Tail Guild Master, Makarov. He is currently the owner and chef of the 8-Island restaurant in Hargeon Town.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/36689.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36689
      },
      "rarity": "common"
    },
    {
      "id": "eve-tilm",
      "name": "Eve Tilm",
      "alt_names": [
        "イヴ・ティルム",
        "Holy Night Eve"
      ],
      "role": "supporting",
      "description": "Eve was once trained to be one of the Magic Council's knights but since the council dissolved, Eve was left out of a job. With this he recently joined Blue Pegasus and was invited to join the Trimens.   ~! __Oración Seis arc:__ Eve, along with Hibiki Laytis and Ren Akatsuki, acts as a greeter to the other members of the Light Team, though the three of them are more womanizers than anything, instantly trying to woo Lucy Heartfilia and Erza Scarlet (and later Wendy Marvell). After briefing the others on who the Oración Seis are, the group (save Jura Nekis and Ichiya Wanderlei Kotobuki) take off to find them. Soon after, they are quickly beaten and nearly left for dead, but at the last minute they are saved by Jura and healed by Ichiya afterwards. The alliance then regroups and splits up to find the Oración Seis' base and rescue Wendy and Happy who were both taken by Brain.  Eve stays with Ren as they near the hideout but run into Dark Unicorn, one of the dark guilds allied with the Oración Seis, however unlike the Oración Seis, the two were easily able to defeat them. When Nirvana is activated, he and Ren split up. Eve goes towards the direction of black light shooting off from Nirvana, but is stopped by Midnight who easily defeats him.  He later assists his teammates along with Lyon Bastia and Sherry Blendi to stop Zero from destroying the Cait Shelter Guild. As they succeed, they regroup with the others as they defeat Zero and destroy Nirvana where they learn Cait Shelter's secret. As they depart, he and Hibiki save Ren from Lyon.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/36718.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36718
      },
      "rarity": "common"
    },
    {
      "id": "mest-gryder",
      "name": "Mest Gryder",
      "alt_names": [
        "メスト・グライダ",
        "Doranbalt"
      ],
      "role": "supporting",
      "description": "Is a mage of Fairy Tail and Mystogan&#039;s disciple who is a current participant in the S-Class Wizard Promotion Trial.     ~!The truth is that he&#039;s a secret agent from Magic Council infiltrating Fairy Tail, which is the most troublesome mage guild. He can use magic that alters memories and teleportation. His real name is Doranbalt.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/36907.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36907
      },
      "rarity": "common"
    },
    {
      "id": "bozu",
      "name": "Bozu",
      "alt_names": [
        "ボーズ"
      ],
      "role": "supporting",
      "description": "Bozu is a member of Phantom Lord Guild under Gajeel's command. He is a character only featured in the anime.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b37394-O3e8yfPgobr8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37394
      },
      "rarity": "common"
    },
    {
      "id": "zeref",
      "name": "Zeref",
      "alt_names": [
        "ゼレフ",
        "The Black Mage",
        "Grotesque fairy"
      ],
      "role": "supporting",
      "description": "The legendary dark mage Zeref is a human wizard known to history as the strongest and most evil mage to ever walk the earth. He lived over 400 years ago, but even to the present day his legacy continues in the form of other dark wizards and dark guilds who worship Zerefs power. In fact most dark guilds were founded and operate under the pretense of reviving Zeref, and helping him to conquer the world. Not only was he an incredibly strong mage, but he was also regarded as a genius, and he used his immense intellect to try to research and discover new magic, regardless of his status as the most powerful human alive. He is also responsible for the creation of tens of thousands of demons by means of his living magic, and these demons continue to roam the earth, leaving trails of destruction behind them. Aside from living magic, Zeref was also a skilled user of death magic.~!At an unspecified point in time, Zeref created the Alvarez empire, which is an empire comprised of all 730 magic guilds of Alakitasia that Zeref brought together by means of martial force. There he is known as Emperor Spriggan. He is regarded by his citizens as a great and kind ruler, but also a fearsome and powerful one. He created an elite group of the most powerful mages in the empire, and they bear the name the Spriggan 12.!~~!400 years ago, Zeref's parents and little brother were killed by dragons. He then proceeded to study magic at Mildian Magic Academy where he studied the connections between life, death, and magic in the hopes of resurrecting his lost brother. He continued to study this and created the R-System and Eclipse Gate against the wishes of his superiors, who feared the wrath of Ankhseram (the god of life and death). At the time, he was a very caring and smart boy, but then Ankhseram cursed Zeref with the curse of contradiction (the more he values human life, the more the people around him will die), as well as immortality. Since then he has searched the earth and created countless demons, even the Etherious so that he may somehow die, however he has been unsuccessful. The time Zeref has spend under the curse of contradiction has slowly begun to take its toll on Zerefs mind, and he has begun to develop symptoms of a split personality, one personality being his original kind self, but the other being a mage who believes humans no longer deserve to live (as they have repeated the same mistakes of useless fighting and wars over and over throughout the many years he’s been alive).!~~!Over his many years, Zeref had encountered Fairy Tails first master Mavis on multiple occasions. They took a liking to each other, with Mavis denying Zerefs claim that he was a monster exactly like the legends of him say. Mavis was eventually placed under the very same curse as him, and she grew into an unstable mind set. Zeref attempted to comfort her when she told him of this, and they decided to live together to search for a way to end the curse. They had fallen in love, but as they shared their first kiss, the curse of contradiction took effect, with Zerefs curse becoming the dominant of the 2 and consequently, Mavis is killed. Zeref was emotionally scarred by the death of the woman he loved, and he embarked on his seemingly endless journey to find death once again.!~~!Zeref eventually found a way to revive his younger brother, Natsu, and in doing so, also created a demon with the potential to kill him like he wanted. The new demon was named E.N.D, Etherious Natsu Dragneel (Natsu being Zeref's younger brother, and Zeref's surname being Dragneel).!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/37720-WfpaYoeW2OkV.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37720
      },
      "rarity": "common"
    },
    {
      "id": "ichiya-vandalay-kotobuki",
      "name": "Ichiya Vandalay Kotobuki",
      "alt_names": [
        "一夜=ヴァンダレイ=寿 "
      ],
      "role": "supporting",
      "description": "Ichiya is one of the top mages of the Blue Pegasus Guild, as well as the leader of The Trimens (composed of Hibiki Laytis, Ren Akatsuki and Eve Thylm). Like the rest of his group he is a womanizer but, unlike them, is nowhere near as handsome, though he thinks of himself as such.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b37771-JbtAOruvH9P9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37771
      },
      "rarity": "common"
    },
    {
      "id": "racer",
      "name": "Racer",
      "alt_names": [
        "レーサー",
        "Sawyer"
      ],
      "role": "supporting",
      "description": "Racer is the codename of one of the six powerful Dark Mages who composed the Oraci&oacute;n Seis guild, whose goal was to find Nirvana, a highly destructive power that was sealed away long ago.  ~! In the anime Racer doesn&#039;t have a dagger, he uses an icicle, that was produced by Lyon. Also, in the anime, he survived the blast of the explosive Lacrima, and a scene was added showing Lyon shielding him as an explanation. !~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/37772.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37772
      },
      "rarity": "common"
    },
    {
      "id": "hoteye",
      "name": "Hoteye",
      "alt_names": [
        "ホットアイ",
        "Richard",
        "Hoteye of the Heavenly Eyes"
      ],
      "role": "supporting",
      "description": "Hoteye (or Hoteye of the Heavenly Eyes), real name Richard, is a member of the Oraci&oacute;n Seis, a dark guild composed of highly powerful mages whose goal is to find Nirvana, a destructive power that was sealed away long ago. Is highly obsessed with money.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/37773.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37773
      },
      "rarity": "common"
    },
    {
      "id": "hughes",
      "name": "Hughes",
      "alt_names": [
        "ヒューズ"
      ],
      "role": "supporting",
      "description": "Hughes is the Magic Militia Third Division Commander in the Royal Army of Edolas.\n\nHughes is a young man with strange arrow-like eyebrows (shaped like clock hands), and has shiny dark blue hair which makes it seem white depending on where the light source is coming from; either that or his hair is 2-toned; it also has long bangs that obscure both his forehead and temples.\n\n~!Hughes seems to find many things astounding, repeating the word \"amazing\" several times in the space of a few pages, be it from the attractions features in the theme park that he controls, to the magic-based abilities exhibited by citizens of Earthland. However, he can be serious when he wants to be, to the point that he can initiate a battle by openly declaring that he will end the lives of his opponents.    When calm and out of the battlefield, Hughes is easy-going and playful, and even then, he sometimes play with his adversaries from time to time. His love for the amusement granted by the dying Magic in Edolas motivates him to resort to any means to obtain more of it, even at the cost of Earthland Mages, revealing a heartless and sadistic side.    He also appears to have zero perversive tendencies, showing absolute indifference to a bikini-clad Lucy after Natsu convinced her to take part in her \"sexy strategy\".     is first seen with the rest of the Royal Captains, and telling Erza how amazing the converted Earthland Lacrima is. He is then seen taunting the imprisoned Natsu and Wendy, telling them that the exceed (Happy and Charle) have been returned to their homeland, and that Lucy is probably set to be executed. After that, he attends a meeting with Faust, Coco, Byro, Sugarboy, and Patherlily, leaving when dismissed. He is seen staring at Lucy, Charle, and Happy after they have escaped, along with the rest of the Royal Captains from the ground.    Hughes later reappears with Sugarboy at an amusement park inside the castle. He attacks Natsu, Gray, and Lucy with what appears to be a rocking Viking ship. He then comments on how the magic from Edolas is going to disappear really soon, and how he won&#039;t let anyone get in his way of obtaining more magic. He manages to get Natsu on one of the roller coasters which he explains can accelerate at a velocity that can de-stabilize anyone on-board after a few minutes. Only to realize that Natsu has already been disabled, much to his own surprise and amusement. Later Lucy is thrown up too and the two land in the park's water. Hughes then reveals he controls everything in the park including the water and attacks Natsu and Lucy with it. The water washes Natsu and Lucy to the Monster Academy, and Hughes finds (after some difficulty) them there. Lucy uses a \"sexy strategy\" against Hughes in an attempt to bring his guard down, but it fails and he sends his monsters after her. He then uses his monsters, such as the mummy and the Frankenstein's monster, to battle against Natsu by wrapping its linen around the Dragon Slayer, only for Natsu to engulf himself in flames, incinerating the mummy's bondage, shocking Hughes yet again. But not enough to deter him as he sends more monster minions against Natsu, diverting their attention away from Lucy (who then was able to make a clean escape); for a moment, their sheer numbers appear to have allowed them the upper hand. However, the monsters are scared off by Natsu, who somehow summons a dragon. Hughes shows utmost shock at Natsu&#039;s move. Later, Hughes was punched against a wall by Natsu, crashing into Byro (whose head was against it on the other side) in the process. Both he and Byro have been defeated. At the very end, when Anima is sucking out the magic and the Earth Land mages and Exceed, he is seen with Sugarboy and Byro.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b37779-9fOYBz63LopF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37779
      },
      "rarity": "common"
    },
    {
      "id": "erza-knightwalker",
      "name": "Erza Knightwalker",
      "alt_names": [
        "エルザ・ナイトウォーカー ",
        "Edolas Erza",
        "Fairy hunter"
      ],
      "role": "supporting",
      "description": "Erza Knightwalker is part of the Edolas Kingdom and is a Royal Army Captain of the 2nd Magic War Division. She is the Edolas counterpart of Erza Scarlet. Her counterpart's surname, \"Scarlet\" was replaced with \"Knightwalker\".    ~!Unlike her Earth Land counterpart, Edolas Erza is sadistic, cruel, and would kill with a smile. Showing no sympathies towards her enemies and kills without mercy, she had been involved in killing over half of the members of Edolas Fairy Tail, thus earning the title Erza the Fairy Hunter. She seems to take great pride of this title bestowed upon her; as a result, she took it as a personal insult when Lucy told Knightwalker that her Earthland counterpart happens to be a staunch ally of the Earthland Fairy Tail Guild whose loyalty to her friends was also unquestionable. This led to her becoming more hostile than she already was towards Lucy, she even opted to kill her by dropping her from a great height.   Knightwalker also appears to value her pride as a Captain for the Royal Army; and Charle making her prostrate herself by kneeling down to the floor seemed to be a real blow to her ego that when Pantherlily informed her of Happy and Charle's rebel status (and that was made even worse by the fact that Charle wheedled information from her only mere moments ago regarding the location of Natsu and Wendy through trickery by claiming to be the daughter of Shagote), the latter became the first whom she targeted to kill. However her streak of fighting has made her overly arrogant and she doesn't seem to take losing lightly as seen when Erza Scarlet managed to temporarily beat her off screen. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n37814-TMpcsYvJ1Q21.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37814
      },
      "rarity": "common"
    },
    {
      "id": "layla-heartfilia",
      "name": "Layla Heartfilia",
      "alt_names": [
        "レイラ・ハートフィリア"
      ],
      "role": "supporting",
      "description": "She and Lucy's father were originally part of a merchants' guild called 'Love &amp; Lucky' where they two met and decided to become independent when Layla became pregnant with Lucy. They chose her name when they noticed that the sign for the guild had the letter K missing so that it read 'Love &amp; Lucy'; it made an impression on them so they decided to name their daughter after it.   In her home, Lucy kept a good relation with the staff in the estate and presumably her mother until she passed away when Lucy was around the age of ten on 7-7-X777, the same day that the dragons disappeared. She was 29 when she died.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/37965.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37965
      },
      "rarity": "common"
    },
    {
      "id": "precht-gaebolg",
      "name": "Precht Gaebolg",
      "alt_names": [
        "ハデス",
        "Purehito",
        "Hades"
      ],
      "role": "supporting",
      "description": "Hades is the leader of the Grimoire Heart Dark Guild, whose goal is to unseal Zeref. He seems to be calm and confident man who shows no signs of fear to his enemies, especially Makarov. He was described by Makarov as a \"great Master who taught harmony and led the Guild to the proper path.\"\n\n~!Hades, known as Precht back then, became the second Master of Fairy Tail after Mavis Vermilion. Some time later, in the Year X736, Precht appointed Makarov (40 years old at that time) as the third Master and his successor, much to the man's dismay. Ignoring Makarov's claims that he wasn't fit for it, he praised Makarov's love for his allies and his capability to believe, claiming that he would have made Fairy Tail into a good Guild. He then left on a journey. On such journey, he traced the roots of Magic back to Zeref, where he saw what can be called the \"Essence of Magic.\" It is presumably around this point that he reformed his ways and became a Dark Mage, and then founded Grimoire Heart.!~\n\n~!He was later killed by Zeref.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/38961.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38961
      },
      "rarity": "common"
    },
    {
      "id": "faust",
      "name": "Faust",
      "alt_names": [
        "ファウスト",
        "Edolas King"
      ],
      "role": "supporting",
      "description": "Faust is the king of Edolas, ruling the land of the parallel world to Earth Land (the original setting of Fairy Tail).\n~!He is Mystogan's father and the main antagonist of the Edolas arc.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b38962-7YQYjvuKD6Jr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38962
      },
      "rarity": "common"
    },
    {
      "id": "meredy",
      "name": "Meredy",
      "alt_names": [
        "メルディ",
        "Meldy"
      ],
      "role": "supporting",
      "description": "Meredy is a member of Grimoire Heart and one of the members of the Seven Kin of the Purgatory. She first joins it after Ultear, Zancrow and Kain find her in a destroyed city crying. Ultear takes her in because she senses that she has great magical potential and thinks she resembles herself. From that day she has considered Ultear her mother.   Meredy seems to have two distinct personalities. The first one, is her stoic, mature, calm, emotionless and seemingly lifeless manner. The other is her childish side which she displays once she arrives on Tenrou Island.   Later, she develops a stronger sense of friendship when Juvia teaches her the lesson that; she must live for the people she cares for.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n39043-wwwOeCY3pIy7.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 39043
      },
      "rarity": "common"
    },
    {
      "id": "zancrow",
      "name": "Zancrow",
      "alt_names": [
        "ザンクロウ"
      ],
      "role": "supporting",
      "description": "Zancrow was a member of one of the most powerful Dark Guilds, Grimoire Heart and was one of the Seven Kin of Purgatory. He is a Flame God Slayer magic user.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/39044.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 39044
      },
      "rarity": "common"
    },
    {
      "id": "zato",
      "name": "Zato",
      "alt_names": [
        "ザトー"
      ],
      "role": "supporting",
      "description": "Zato is a member one of the Dark Guilds, Naked Mummy. He looks like a monkey and has a giant Afro. Zato is first shown in a bar, in an unknown city, got beaten by Laxus because of mocking him, due to the Phantom Lord events.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40108.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40108
      },
      "rarity": "common"
    },
    {
      "id": "grandine",
      "name": "Grandine",
      "alt_names": [
        "グランディーネ"
      ],
      "role": "supporting",
      "description": "The Sky Dragon and foster mother of Wendy Marvell. Grandine seems to enjoy poking at people&#039;s sensitive areas. She is unafraid of making other dragons unhappy by bringing things up that are most likely a sore subject to them.At one point in her life, she found and raised a human girl named Wendy Marvell. Grandeeney taught Wendy the ancient Sky Dragon Slayer Magic and some healing Magic. However, on July-7-X777, Grandeeney disappeared, like all other revealed dragons in the series. and left Wendy for unknown reasons.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n40156-rbTMIOGPoseV.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40156
      },
      "rarity": "common"
    },
    {
      "id": "igneel",
      "name": "Igneel",
      "alt_names": [
        "イグニール",
        "Salamander"
      ],
      "role": "supporting",
      "description": "Fire Dragon and foster father of Natsu Dragneel Igneel has been shown to be a loving parental figure towards Natsu, though leaving him to fend for himself leads one to doubt this. Despite leaving him, Igneel is shown to be incredibly protective of Natsu as he watches him from afar.   Contrary to his loving self, Igneel can also be very fierce when he wants to be. He has also shown some arrogance, referring to himself as &quot;the one and only Igneel&quot; during Grandeeney&#039;s visit.   According to Grandeeney, like Natsu, Igneel has a tendency to take things to excess. He taught Natsu how to write, speak, and how to use the fire-brand style of Magic known as &quot;Dragon Slayer Magic &quot;, an ancient form of Magic that gives the user the traits of a dragon.For some still unknown reason, Igneel disappeared one day without saying a word to Natsu on the 7th July of X777 (along with the other dragons like Grandeeney and Metalicana, Wendy Marvell&#039;s and Gajeel Redfox&#039;s foster dragon parents, respectively), leaving Natsu to fend for himself. Natsu&#039;s dream is to be able to meet with Igneel again and he searches for clues of his whereabouts.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n40157-g0mcplX9XssJ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40157
      },
      "rarity": "common"
    },
    {
      "id": "capricorn",
      "name": "Capricorn",
      "alt_names": [
        "カプリコーン",
        "Caprico"
      ],
      "role": "supporting",
      "description": "Caprico is a member of dark guild, Grimoire Heart, and one of the Seven Kin of Purgatory. He used a Lost Magic known as Human Subordination, which allowed him to weaken nearby humans' physical and Magical abilities, as well as to enslave humans to make them fight for him, allowing him to summon them as he wished: in short, a reversed version of Celestial Spirit Magic, which allowed him to keep the upper hand in a battle against four of Fairy Tail's top Mages.   ~!Actually Caprico is a Celestial Spirit (one of the 12 Golden Zodiac Keys) that was possessed by Zoldeo, the real member of the Seven Kin of Purgatory of the Dark Guild Grimoire Heart.  In the past, he was contracted with Layla Heartfilia. However, Layla became fatigued and decided to retire from her life as a Mage. She entrusted her three spirits (Aquarius, Capricorn and Cancer) to three new owners. One of the recipients is Zoldeo who took Capricorn's key. However, Capricorn made a pact with Layla, promising to give his strength to Layla's child if the child decides to pursue the path of Magic. At first, Zoldeo agreed to the pact but gradually became swallowed up by darkness and used his Magic on Capricorn, breaking a taboo and ending up possessing Capricorn's body. Due to this, Capricorn is able to stay in the Human World for 17 years.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40159.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40159
      },
      "rarity": "common"
    },
    {
      "id": "rustyrose",
      "name": "Rustyrose",
      "alt_names": [
        "ラスティローズ"
      ],
      "role": "supporting",
      "description": "Rustyrose is a member the dark guild, Grimoire Heart, and one of the Seven Kin of Purgatory. His magic is Arc of Embodiment, a form of Lost Magic which allows him to materialize anything from his imagination to be used at his whim.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40160.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40160
      },
      "rarity": "common"
    },
    {
      "id": "azuma",
      "name": "Azuma",
      "alt_names": [
        "アズマ"
      ],
      "role": "supporting",
      "description": "Azuma is a member of dark guild, Grimoire Heart, and one of the Seven Kin of Purgatory. His Lost Magic is Great Tree Arc, a form of magic which allows him to manipulate and produce trees, as well as to create explosions by condensing the power of the earth inside the fruits of such trees.    ~!After he defeated by Erza his body transforming into a tree. He states that's a side effect of overusing his Lost Magic. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40161.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40161
      },
      "rarity": "common"
    },
    {
      "id": "sugarboy",
      "name": "Sugarboy",
      "alt_names": [
        "シュガ－ボ－イ"
      ],
      "role": "supporting",
      "description": "Sugarboy is from Edolas and is the Royal Army Captain of the 4th Magical Division. He works for Faust in Edolas helping him in various ways such as hunting Fairy Tail, and seems to be very into statistics of things.  Sugarboy is a tall male with blue eyes and blond hair in a pompadour style. He has long sideburns extending to the ends of his face, and some stubble. Sugarboy has a very defined face and a noticeable cleft chin. He wears light red (pink in the anime), shiny armor with gold chain mail and a bronze belt, and what appear to be black briefs. He also wears a white cape with the Edolas insignia on it. When seen without a shirt, Sugarboy has a very muscular upper body.  Sugarboy can be seen as very goofy, not only in appearance, but also in personality. He can suddenly drastically change his facial expressions, as seen when fighting Gray Fullbuster. Sugarboy can notably do some strange things, without even knowing how he did it himself, such as gliding in battle. Sugarboy can be seen as over-dramatic in situations as well, such as when he saw Gray make a duplicate key. Sugarboy can be serious though around meeting with his fellow captains, and has very respectable opinions.  [Source: Fairy Tail Wiki]",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40162-JgfgEb0niW1i.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40162
      },
      "rarity": "common"
    },
    {
      "id": "shagotte",
      "name": "Shagotte",
      "alt_names": [
        "シャゴット",
        "Queen"
      ],
      "role": "supporting",
      "description": "Shagotte is the Queen of the Exceeds.   ~!She is only a one-winged Exceed and hid that fact.!~   ~!She is Charlés' mother.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40163.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40163
      },
      "rarity": "common"
    },
    {
      "id": "nichiya",
      "name": "Nichiya",
      "alt_names": [
        "二夜"
      ],
      "role": "supporting",
      "description": "Edolas version of Ichiya Wanderlei Kotobuki.  He&#039;s an Exceed and captain of the Extalia&#039;s Imperial Guard.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40164.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40164
      },
      "rarity": "common"
    },
    {
      "id": "nadi",
      "name": "Nadi",
      "alt_names": [
        "ナディ"
      ],
      "role": "supporting",
      "description": "Nadi is an Exceed from kingdom of Extalia, Minister of State under Queen Shagotte command. He is usually adding &quot;Nya&quot; (Japanese, &quot;Meow&quot;) while he&#039;s talking and intensely waving his paw.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40165.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40165
      },
      "rarity": "common"
    },
    {
      "id": "lucy-ashley",
      "name": "Lucy Ashley",
      "alt_names": [
        "ルーシィ・アシュレイ",
        "Edo-Lucy",
        "Scary Lucy"
      ],
      "role": "supporting",
      "description": "Edolas version of Lucy also called Scary Lucy. She loves to bully Natsu Dragion.   Unlike her Earth Land counterpart, Lucy Ashley has a vulgar and aggressive personality. She's also quite the Tsundere and cares for her guild a lot. Lucy seems to be the one with the crush on Edolas Natsu. She showed slightly troubled emotion when she hugged Earth Land Natsu and tends to look away when he asks her a question. When Earth Land Natsu pressured Lucy into purchasing their magical weapons, Lucy commented that she \"sort of liked it\". She also argues with Edolas Levy instead of getting along with her. Lucy Ashley also has less modesty than her Earthland counterpart, being eager to show Natsu Dragneel how her body is exactly the same as Lucy Heartfilia, only to earn a laugh and a comment about how funny it was to bath with yourself, leaving both of them in shock.  Like her Earth Land version, Lucy Ashley is skilled on using whip. She used an unnamed Magic whip. It was a powerful weapon, which she could use to defeat a monster that attacked Wendy, Natsu, Carla and Happy.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40437.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40437
      },
      "rarity": "common"
    },
    {
      "id": "roubaul",
      "name": "Roubaul",
      "alt_names": [
        "ローバウル"
      ],
      "role": "supporting",
      "description": "Guild Master of Cait Shelter.    ~!Roubaul was a member of the Nirvit, a neutral tribe from the past, and the creator of the Nirvana Magic. He also acted as the Guild Master of the nonexistent Cait Shelter Guild to take care Wendy Marvell.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40438.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40438
      },
      "rarity": "common"
    },
    {
      "id": "natsu-dragion",
      "name": "Natsu Dragion",
      "alt_names": [
        "ナツ・ドラギオン",
        "Fireball"
      ],
      "role": "supporting",
      "description": "Edolas version of Natsu. Self-proclaimed fastest man in Edolas, his personality changes dramatically when he steps out of any vehicle.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40439.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40439
      },
      "rarity": "common"
    },
    {
      "id": "lahar",
      "name": "Lahar",
      "alt_names": [
        "ラハール"
      ],
      "role": "supporting",
      "description": "Lahar is the Head of the 4th Custody Enforcement Unit under the newly reformed Magic Council, following the events of the Tower of Heaven arc.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40610.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40610
      },
      "rarity": "common"
    },
    {
      "id": "daphne",
      "name": "Daphne",
      "alt_names": [
        "ダフネ "
      ],
      "role": "supporting",
      "description": "Daphne is very quirky, and energetic. She goes long lengths to get her products sold. Daphne often jumps around the room and comes across as highly enthusiastic. Her personality changes when Natsu and Wendy mention dragons,  ~!and Daphne reveals it was a lie. When Gray shows up she speaks to him as if he is her master, and her previous energetic personality suddenly disappears. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40889.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40889
      },
      "rarity": "common"
    },
    {
      "id": "coco",
      "name": "Coco",
      "alt_names": [
        "ココ"
      ],
      "role": "supporting",
      "description": "Coco (ココKoko) is a small yet fast, barefooted girl who serves as a messenger, among other things. Her title is Assistant Chief of Staff, putting her only a rank below the wizened Byro in standing  Her face's appearance bears a distinct resemblance to a puppy, with a small black nose and some kind of headwear having large, floppy \"ears\". The greater significance this has to her actual character is unknown. She wears dark blue leggings and a yellow dress.   At first, Coco seems to be a bright, cheery girl who is dutiful to her king and her country. She eagerly follows Faust's orders and is unable to contain her energy. Later, when she learns that the king's plans would endanger her friends, Coco decides to disobey his orders, putting herself at risk. She wants nothing more than to be happy with the people she cares about.  (Source: fairytail.wikia.com)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/41401.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 41401
      },
      "rarity": "common"
    },
    {
      "id": "gray-surge",
      "name": "Gray Surge",
      "alt_names": [
        "グレイ・ソルージュ"
      ],
      "role": "supporting",
      "description": "The Edolas version of Gray. He&#039;s the opposite of the Earthland Gray in almost every way. As opposed to Earthland&#039;s Gray, the Edolas Gray is constantly putting clothes on. He has unrequited love for the Edolas Juvia, when in Earthland, Juvia is in love with Gray. The Edolas Gray often speaks with very &quot;cutesy&quot; words, and is easily frightened, whereas the Earthland Gray is usually very serious, and almost never runs away from a fight.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42094.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42094
      },
      "rarity": "common"
    },
    {
      "id": "lucky",
      "name": "Lucky",
      "alt_names": [
        "ラッキー"
      ],
      "role": "supporting",
      "description": "Lucky is is an older looking Exceed and Marl's husband. Lucky is a very loud and aggressive person. Upon meeting Happy, he began to swing his gardening tool at him. However, his wife Marl states that despite his rough exterior he shares the same beliefs as her.   ~!He is actually Happy's real father. Years ago, Queen Shagotte ordered that Lucky's child, Happy, be taken away and sent to Earth Land along with many other Exceed children in order to assassinate the Dragon Slayers, and because of that, he and his wife Marl opposed the mission as well as the queen, resulting in their exile from the kingdom.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/43547.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43547
      },
      "rarity": "common"
    },
    {
      "id": "marl",
      "name": "Marl",
      "alt_names": [
        "マール"
      ],
      "role": "supporting",
      "description": "One of the cats who helped Happy and Charles when they were being chased by the Exceed. She also encouraged the two to believe in themselves and their friends and helped them to fly again.   ~!She is actually Happy's real mother.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43578-n7ekpZlnD6pq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43578
      },
      "rarity": "common"
    },
    {
      "id": "wendy-edolas",
      "name": "Wendy (Edolas)",
      "alt_names": [
        "ウェンディ",
        "EdoWendy"
      ],
      "role": "supporting",
      "description": "Wendy (Edolas) is the counterpart of the Earthland's Wendy Marvell.    Wendy is a young woman with a very mature and confident personality unlike her Earthland counterpart, that is more shy.  They both share the same distinguishing long blue hair.  Judging by her appearance, she is most likely in her late teens.    She first appears in the Edolas Fairy Tail's guildbase.  Together with Warren, she noticed the girl that Natsu Dragneel brought with him is none other than herself.  When the Fairy Hunter approaches the guild, she explains to their visitors that due to the king's orders, Fairy Tail is now a Dark Guild.  She is the only known Edolas counterpart with a visible age difference.  Her weapon of choice is a pair of unnamed magical daggers.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/44789.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 44789
      },
      "rarity": "common"
    },
    {
      "id": "levy-edolas",
      "name": "Levy (Edolas)",
      "alt_names": [
        "レビィ"
      ],
      "role": "supporting",
      "description": "Levy is a young teen-aged girl with a slender build and stands at a height below average for her age. She sports long blue hair, with a slight purple hue, normally tied up with a red bandana around her head and wears a dark red dress that leaves her abdomen exposed and is linked by dark blue straps and yellow bands in the sleeves. She also uses a golden necklace.     ~!Levy first appears fixing the guild&#039;s Transportation System. She suddenly gets into an argument with Edolas Nab since she can&#039;t concentrate on what she is doing. After that, she starts another argument with Lucy Ashley who was being loud. However, Edolas Macao and Edolas Wakaba manage to break them up. Later, as the Fairy Hunter arrives, Levy manages to transport the guild into a safer location saving the whole guild. However, this fact doesn&#039;t seem to stop Lucy Ashley from insulting Levy.  Just as Lucy Heartfilia, Gray Fullbuster and Coco were about to be defeated by the Royal Army, Levy, with the rest of her guild, arrives and fights the Royal Army. The fight, however, did not last long as Magic was being removed by Mystogan and his plan, causing everyone to panic.Before being sent back to Earth Land, Gray cheers up the Edolas Fairy Tail Guild by telling them that they don&#039;t need Magic to be a Guild, they only need their comrades. Levy is last seen watching the Earth Land Fairy Tail&#039;s departure with a smile on her face.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/47605.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 47605
      },
      "rarity": "common"
    },
    {
      "id": "hikaru-kain",
      "name": "Hikaru Kain",
      "alt_names": [
        "華院ヒカル"
      ],
      "role": "supporting",
      "description": "Hikaru is a member one of the Dark Guilds, Grimoire Heart. He is one of the Seven Kin of Purgatory. He appears to be rather nervous, scared or simply has a speaking disorder. He stutters and then speaks what he wanted to say so fast that almost nobody could understand him. His catch phrase is &quot;Woo-wee&quot;.    (Source: Fairy Tail wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n47861-NQPumZ3oxNMy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 47861
      },
      "rarity": "common"
    },
    {
      "id": "gajeel-edolas",
      "name": "Gajeel (Edolas)",
      "alt_names": [
        "ガジル"
      ],
      "role": "supporting",
      "description": "The Edolas Gajeel is a free writer. He is well-known for his articles criticizing authorities, thus his reputation is far from being good. In fact, he is nearly hated.  Gajeel is quick-witted and excellent at gathering information. He usually wears a black suit, a white shirt and a tie. His permanent accessory is a black hat with a metal strip. He also has ear piercings.  His peculiar difference is wavy hair, while Gajeel Redfox wears his hair in spikes.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/47939.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 47939
      },
      "rarity": "common"
    },
    {
      "id": "kinana",
      "name": "Kinana",
      "alt_names": [
        "キナナ",
        "Cuberos"
      ],
      "role": "supporting",
      "description": "Unlike most other members of Fairy Tail, she joined the guild as an employee rather than as a Mage.  When she was young, she was turned into a snake by an evil wizard. She was turned back by Makarov after the master realized that she was actually a human. Kinana had no recollection of being a snake when she was first turned back, but recently her memory as a snake has slowly resurfaced, in which she hears a voice asking to hear her thoughts.   ~!The person calling out for her is actually Cobra and she used to be his snake.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/47981.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 47981
      },
      "rarity": "common"
    },
    {
      "id": "byro",
      "name": "Byro",
      "alt_names": [
        "バイロ"
      ],
      "role": "supporting",
      "description": "Byro is the Chief of Staff of the Royal Army of Edolas who serves under King Faust.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b48559-flqwxHCQM1eI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 48559
      },
      "rarity": "common"
    },
    {
      "id": "acnologia",
      "name": "Acnologia",
      "alt_names": [
        "アクノロギア",
        "The Black Dragon of the Apocalypse"
      ],
      "role": "supporting",
      "description": "Acnologia, also known as The Black Dragon of the Apocalypse, is an extremely powerful dragon that flies around the continent or world. It once faced Fairy Tail's strongest Mage, Gildartz, in battle, and was said to have instantly defeated him, tearing out several organs in the process. Acnologia's power is such that even the most evil and powerful Mage in the world, Zeref, fears him.  Acnologia seems to have a deep connection with the Black Mage Zeref, as Zeref seems to know it very well, and was able to sense its arrival quite a while before it actually arrived. It is said by Zeref that Acnologia 'Heralds the End of Eras', although what this means is still unclear.    ~! Tenrou Island arc  Acnologia comes to Tenrou Island, wreaks havoc on it, and fights the Fairy Tail members on the island.[9] In the battle, it causes so much devastation that Makarov is forced to hold him off to allow the other Fairy Tail Mages to escape in his Titan mode.As the two fight, Acnologia is eventually able to knock Makarov to the ground. Just as he is about to kill Makarov, all of Fairy Tail comes back and starts attacking the dragon. Acnologia then flies into the air, and seemingly destroys Tenrou Island, and all of the Fairy Tail members on it with his \"Dragon's Roar\". After these events, Acnologia takes back up to the skies and disappears from sight.!~   ~!Acnologia was one of the first Dragon Slayers created to fight in the Dragon Civil War. However, he and the other Dragon Slayers turned on them and slayed them as well. Acnologia killed many dragons until he, with the help of Zeref, was turned into a dragon.  It is currently unknown which type of Dragon Slayer element he formerly used.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n49003-EGHCfhVFatPw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 49003
      },
      "rarity": "common"
    },
    {
      "id": "chico-c-hammitt",
      "name": "Chico C. Hammitt",
      "alt_names": [
        "チーコ＝C＝ハーミット"
      ],
      "role": "supporting",
      "description": "Chico C. Hammitt is the daughter of the owner of Fairy Hills, Ruchio.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b49401-sMfEShLPqW2j.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 49401
      },
      "rarity": "common"
    },
    {
      "id": "mavis-vermillion",
      "name": "Mavis Vermillion",
      "alt_names": [
        "メイビス・ヴァーミリオン",
        "First",
        "Fairy Tactician"
      ],
      "role": "supporting",
      "description": "Mavis has very long, wavy, pastel yellow-blonde hair that reaches down to her feet with a small ahoge; large green eyes with no pupils; peachy skin and a slight child-like build. As a consequence of using an incomplete version of a grand Magic when she was thirteen to save Yuri Dreyar, her body was no longer able to grow or mature from that point onwards. By the time Precht encased her body in a Lacrima, though, Mavis was biologically twenty-four. Regarding her usual clothing, Mavis wears a frilly, pink layered robe with a red ribbon tied in a bow around her neck. Around the chest are three blue diamond patterns with two blue triangles above. Each series of these is outlined in a hot pink. She wears wing-like adornments around her ears and small hoop earrings. She also seems to prefer going barefoot. Mavis is The First Master and the founder of the Fairy Tail Guild. Mavis is kind and protective of Fairy Tail. She cares, guides and protects the guild whenever it's possible. She seems to be quite cheerful as she's smiling and happy most of the time. Mavis can also be quite carefree and reckless. As a child, Mavis worked for the \"Red Lizard\" Guild, where she would either clean the guild's floor, the members' clothes or even make food. She was forced to pay back her parents' debts to the guild and contribute to the guild that sustained her. Although, she was mistreated, she vowed never to cry, as her parents once told her that fairies never approached those who were cry-babies.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/50163-AUxOytSdbd1K.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 50163
      },
      "rarity": "common"
    },
    {
      "id": "juvia-edolas",
      "name": "Juvia (Edolas)",
      "alt_names": [
        "ジュビア"
      ],
      "role": "supporting",
      "description": "Juvia (Edolas) is a member of the Edolas Fairy Tail Guild and the Edolas counterpart of Juvia Lockser. In Edolas, Juvia likes, but has no super crush on Gray Surge. Instead, Gray has the super crush on her. She turns down a mission with him because he wears too much clothing. She was seen explaining some parts of Edolas and not agreeing to what Gray says. She's very skillful in hand to hand combat. She beat half of the Edolas Royal Army soldiers without Magic.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/51085.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51085
      },
      "rarity": "common"
    },
    {
      "id": "elfman-edolas",
      "name": "Elfman (Edolas)",
      "alt_names": [
        "エルフマン"
      ],
      "role": "supporting",
      "description": "Elfman (Edolas) is a member of the Edolas Fairy Tail Guild. He is the Edolas counterpart of Elfman. He is very weak and sensitive person, to the extent that when he was lectured on becoming stronger by Jet (Edolas) and Droy (Edolas), he cries over how weak he is. His sister Lisanna (Edolas) often speaks for him. He uses a giant magic hammer in the battle.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/51087.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51087
      },
      "rarity": "common"
    },
    {
      "id": "kana-edolas",
      "name": "Kana (Edolas)",
      "alt_names": [
        "カナ"
      ],
      "role": "supporting",
      "description": "Kana (Edolas) is a member of the Edolas Fairy Tail Guild. She is the Edolas counterpart of Kana Alberona. Unlike her Earth Land counterpart who wears a bikini type top, Kana is seen wearing proper and non-revealing attire. She even sits properly with her hands on her laps as opposed to her Earth Land counterpart who sits cross-legged while drinking. She is also polite and declines to drink alcohol with Edolas Macao, as she 'dislikes it'. She also hates to fight, saying that she would rather have tea parties instead. Kana (Edolas) uses a pink wand the length of a baton with a rounded top that has a golden star at its middle.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/51089.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51089
      },
      "rarity": "common"
    },
    {
      "id": "rogue-cheney",
      "name": "Rogue Cheney",
      "alt_names": [
        "ローグ・チェーニ"
      ],
      "role": "supporting",
      "description": "Rogue Cheney is the Shadow Dragon Slayer. He is also in the fromer strongest Guild in Fiore, the Sabertooth Guild. He has an exceed named Frosch, just like most of the Dragon Slayers. He is very close with Sting Eucliffe.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b51153-WAt7vK7I0rMy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51153
      },
      "rarity": "common"
    },
    {
      "id": "sting-eucliffe",
      "name": "Sting Eucliffe",
      "alt_names": [
        "スティング・ユークリフ"
      ],
      "role": "supporting",
      "description": "Sting is a White Dragon Slayer and a Mage of the currently strongest Guild in Fiore, the Sabertooth.  He was raised by the Dragon Weisslogia, who taught him White Dragon Slayer Magic. He eventually used this Magic to kill Weisslogia, in order to become a \"real\" Dragon Slayer. At some point in his life, Sting also implanted Dragon Lacrima into his body, thereby making him a third-generation Dragon Slayer.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b51171-XAJmBTPvVPv5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51171
      },
      "rarity": "common"
    },
    {
      "id": "frosch",
      "name": "Frosch",
      "alt_names": [
        "フロッシュ",
        "Fro"
      ],
      "role": "supporting",
      "description": "Rogue Cheney's exceed. Frosch easily agrees with Lector's opinion. His catchphrase is, \"I think so too!\"",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/51183.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51183
      },
      "rarity": "common"
    },
    {
      "id": "lector",
      "name": "Lector",
      "alt_names": [
        "レクター"
      ],
      "role": "supporting",
      "description": "Sting Eucliffe's exceed. Lector appears to be a highly arrogant cat. He repeatedly talks down other people whilst comparing them to Sting considering everyone beneath the Sabertooth guild in general. During the Magic Games he constantly states that Sabertooth members will easily win their matches to the point where he even berates Frosch for simply asking.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/51185.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 51185
      },
      "rarity": "common"
    },
    {
      "id": "bluenote-stinger",
      "name": "Bluenote Stinger",
      "alt_names": [
        "ブルーノート・スティンガー"
      ],
      "role": "supporting",
      "description": "The Deputy Commander of Grimoire Heart.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/54569.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 54569
      },
      "rarity": "common"
    },
    {
      "id": "rufus-lore",
      "name": "Rufus Lore",
      "alt_names": [
        "ルーファス・ロア",
        "The Singing Bard of The Red Moon"
      ],
      "role": "supporting",
      "description": "Rufus Lore is one of the mages from the Sabertooth guild that entered the contest for the best mage guild. He entered the first round of the contest. Refus has long, straight blond hair, clothing resembling the 19th century, and wears a red mask on his face.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b56211-I6sZbD5x2g3E.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56211
      },
      "rarity": "common"
    },
    {
      "id": "rob",
      "name": "Rob",
      "alt_names": [
        "ロブ"
      ],
      "role": "supporting",
      "description": "Rob was a Fairy Tail Mage who was kidnapped and enslaved in the Tower of Heaven. He was also a close friend of Makarov and Erza Scarlet. He died protecting Erza during the slave rebellion that occurred to save Jellal Fernandes.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b56775-cOtI6tkfpgT8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56775
      },
      "rarity": "common"
    },
    {
      "id": "flare-corona",
      "name": "Flare Corona",
      "alt_names": [
        "フレア・コロナ"
      ],
      "role": "supporting",
      "description": "**Race:** Human\n**Affiliation:** Raven Tail \n**Guild Mark Location:** Right Breast \n**Occupation:** Mage\n**Team:** Team Raven Tail  \n**Base of Operations:** Raven Tail Guild \n**Magic:** Hair Magic  \n**Manga Debut:** Chapter 263  \n\nFlare Corona is a mage of the Raven Tail Guild. Flare is always shown with an absent, peculiar expression on her face, making it look like she's not interested in what happens around her, and acts in a teasing, disturbing way, referring to Lucy Heartfilia as \"blondie\" and teasingly repeating such nickname several times. Her sadistic nature is later displayed in the fight between the two female Mages. Flare is extremely fond of her hair, whose color she praisingly refers to as \"sunset red\", becoming overly upset if someone damages it while she's employing her Hair Magic, something which prompts her to reveal other traits, her sadism, and unfairness.\n\n(Source: Fairy Tail Wikia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b56777-gYGj7bpfCWH5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56777
      },
      "rarity": "common"
    },
    {
      "id": "asuka-connell",
      "name": "Asuka Connell",
      "alt_names": [
        "アスカ・コネル"
      ],
      "role": "supporting",
      "description": "Asuka Connell is the daughter of Fairy Tail Mages, Alzack and Bisca Connell.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/60015.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 60015
      },
      "rarity": "common"
    },
    {
      "id": "orga-nanagear",
      "name": "Orga Nanagear",
      "alt_names": [
        "オルガ・ナナギア"
      ],
      "role": "supporting",
      "description": "__Race:__ Human    __Affiliation:__ Sabertooth  __Occupation:__ Mage  __Team:__ Team Sabertooth  __Base of Operations:__ Sabertooth Guild  __Magic:__ Black Lightning Magic  __Manga Debut:__ Chapter 268  Orga Nanagear (オルガ・ナナギア Oruga Nanagia) is a Mage of the current strongest Guild in Fiore, Sabertooth.  Orga seems to be one of the quietest members of his team, rarely ever talking or changing his usual, neutral expression, not even on the battlefield, when confronted with an opponent. In such cases, his demeanor appears to remain the same, with him striking the foe down with no seeming transport or emotion.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b60017-nf8hU4E2p3sZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 60017
      },
      "rarity": "common"
    },
    {
      "id": "kurohebi",
      "name": "Kurohebi",
      "alt_names": [
        "クロヘビ",
        "Black Snake"
      ],
      "role": "supporting",
      "description": "Kurohebi is a Mage of the Raven Tail Guild and the representative team in the Grand Magic Games. He has stated that the name \"Kurohebi\" isn't his given name. Kurohebi employs Mimicry Magic, which allows him to mimic another Mage's Magic and use it as if it was his own.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/60019.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 60019
      },
      "rarity": "common"
    },
    {
      "id": "aceto-balsamico",
      "name": "Aceto Balsamico",
      "alt_names": [
        "アチェート"
      ],
      "role": "supporting",
      "description": "Aceto is an anime-only character who appears in Episode 125. She is Count Balsamico's daughter and Velveno's fiancée.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/60621.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 60621
      },
      "rarity": "common"
    },
    {
      "id": "jenny-realight",
      "name": "Jenny Realight",
      "alt_names": [
        "ジェニー・リアライト"
      ],
      "role": "supporting",
      "description": "Jenny Realight is a Mage of Blue Pegasus, and also the current \"Miss Fiore\".  Jenny seems to be a popular and elegant young lady, as she won Miss Fiore. She is pale-skinned, and has a top model physical, being thin, and having large busts. Her hair is long, tied and decorated with flower. As a model, she's usually seen with makeup, having eyeliner around the eyes, blush in the cheeks and detached lipstick. Her jewelry consists of dangle earrings, a tiled necklace and bracelets. She wears a sparkly strapless dress, highlighting her bust. Her guild mark is on her left shoulder.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/61229.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 61229
      },
      "rarity": "common"
    },
    {
      "id": "kagura-mikazuchi",
      "name": "Kagura Mikazuchi",
      "alt_names": [
        "カグラ・ミカヅチ"
      ],
      "role": "supporting",
      "description": "Kagura Mikazuchi is a Mage from the Mermaid Heel Guild and a member of its team competing in the Grand Magic Games.  Kagura is a slim, large-busted woman, with long, straight dark hair that falls to the middle of her back. It is cut in the traditional Japanese \"princess style.\"  Kagura dons an elaborate blazer with a large collar, which is open to reveal a collared shirt and tie underneath. The cuffs of this jacket are tucked into a pair of gloves. On her legs, Kagura wears a pair of black tights, which are tucked into a pair of thigh-high boots and sit under a short frilled skirt. On her head, Kagura ties a ribbon, with the ends of the bow pointing straight up, giving them the appearance of animal ears.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b61697-lgeq3rWy3tqw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 61697
      },
      "rarity": "common"
    },
    {
      "id": "michelle-lobster",
      "name": "Michelle Lobster",
      "alt_names": [
        "ミッシェル・ロブスター",
        "Imitatia"
      ],
      "role": "supporting",
      "description": "First appeared in episode 128. She introduced herself as Lucy's relative, calling her \"nee-san\". She informs Lucy that she was instructed by her father to send the case as a memento from him to Lucy. Jude also requested for \"Michelle\" to search for Lucy during that 7-year gap.   ~!In truth, she is Imitatia, a member of the new Oración Seis. Her true form is a doll that Lucy once had a long time ago. Her sole desire was to be with Lucy forever.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/62053.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62053
      },
      "rarity": "common"
    },
    {
      "id": "yukino-aguria",
      "name": "Yukino Aguria",
      "alt_names": [
        "ユキノ・アグリア"
      ],
      "role": "supporting",
      "description": "Yukino is a Celestial Spirit Mage and a member of the currently strongest guild in Fiore, Sabertooth. She is part of Sabertooth's team in the Grand Magic Games and battled against Kagura from Mermaid Heel.  Yukino possesses three Celestial Keys, two gold keys - Pisces and Libra, and the thirteenth zodiac key of Ophiuchus. She is able to summon more than one Celestial Spirit at the same time.   ~!After wagering her life on the battle and losing against Kagura, she was kicked out of Sabertooth as a punishment for her failure, she was later seen outside Fairy Tail's lodging.!~ (Source: Fairy Tail Wikia)\nShe is also the younger sister to Angel/Sorano. (Source: Fairy Tail Wikia and Fairy tail Manga Ch 303 pg 7.)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62439-ZMBCV4cdmI27.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62439
      },
      "rarity": "common"
    },
    {
      "id": "mary-hughes",
      "name": "Mary Hughes",
      "alt_names": [
        "マリーヒューズ"
      ],
      "role": "supporting",
      "description": "Mary Hughes (マリ ヒューズ, Mari Hyūzu) is the Earth Land counterpart of Hughes, who uses Command Magic as her form of Magic.  Mary Hughes appears like her Edolas counterpart Hughes, only with a feminine façade. She has shoulder-length purple hair, save for a wide streak of white hair that runs across the left side of her face. She has yellow eyes and thin eyebrows styled into the shape of arrows.  Mary Hughes wears a dark green full-body suit, which is sleeveless. Under the top of this suit she has a white collared shirt, through which she ties a red ribbon. Around her waist sits a brown utility belt. Her hands are covered with long gloves that end just before her elbow and her feet are covered by large brown boots.  Mary Hughes has a slightly malicious and cruel personality, laughing at the Fairy Tail guild when she saw the pain they were in when they couldn't win against her. She seems to have a liking of controlling people, manipulating them with her Magic and enjoying the fact that she can make them attack their own friends.  She doesn't like people commenting on her appearance, seen when she stated to instantly dislike Natsu when he commented on the fact that she was a woman. When Kinana threw rocks at her, Mary Hughes claimed she was angry enough to commit murder, hinting that she does not like being made to look weak.  When asked by Lucy why she would allow her and Michelle to fall over a cliff, Mary Hughes nonchalantly states that if they fall, they will be injured enough that they won't be able to escape her, showing a total lack of caring for others that she considers her enemy or target.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/62615.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62615
      },
      "rarity": "common"
    },
    {
      "id": "coco-earth-land",
      "name": "Coco (Earth Land)",
      "alt_names": [
        "ココ"
      ],
      "role": "supporting",
      "description": "Coco is the Earth Land counterpart of Coco, who uses Athletic Magic as her form of Magic.  Earth Land Coco is a short girl with long brown hair that is braided and tied at the end with a blue bauble. Her cheeks are usually seen flushed and she has a puppydog-like nose and smile, giving her the appearance of a cute little animal.  She dons a pair of dark green tights, which she wears under a colourful dress. The top and sleeves of the dress are white, with a blue collar and cuffs. From her chest downwards, the dress becomes detailed and colourful, being divided into many sections, with the chest area and skirt being yellow, and the part that covers Earth Land Coco's stomach red. On her feet, Earth Land Coco wears a pair of bright red sandals.  Earth Land Coco does not have the kind, wouldn't-hurt-a-fly personality that her Edolas counterpart possess. In fact, she is much the opposite, attacking her enemies with ferocity and precision. She seems to take great pride in her abilities, and after performing a particularly difficult stunt of some description, she will openly shout the performance scores she believes her opponent has granted her, with them always being 8/10 or above.  Despite her harder personality, Earth Land Coco still seems quite naive, seen when Lucy and Michelle managed to fool and confuse her by playing a tricky word game and pretending that the other girl was Lucy. After the said game, Lucy said that she felt guilty fooling around with the girl, with Michelle commenting that she is still \"so innocent\".  In contrast to her Edolas counterpart, Earth Land Coco has stated that she hates cats.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/62689.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62689
      },
      "rarity": "common"
    },
    {
      "id": "minerva-orland",
      "name": "Minerva Orland",
      "alt_names": [
        "ミネルバ・オーランド",
        "Neo Minerva"
      ],
      "role": "supporting",
      "description": "__Race:__ Human    __Affiliation:__ Sabertooth  __Occupation:__ Mage  __Team:__ Team Sabertooth  __Base of Operations:__ Sabertooth Guild  __Relative:__ Jiemma (Father)  Minerva is a Mage of the currently strongest Guild in Fiore, Sabertooth. She speaks in highly formal language. Befitting her formal speech, she is also very mature and wishes that the people around act accordingly. Minerva speaks in an archaic, old form of Japanese.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b63899-1Kso00QWCtcQ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 63899
      },
      "rarity": "common"
    },
    {
      "id": "arania-web",
      "name": "Arania Web",
      "alt_names": [
        "アラーニャ・ウェブ"
      ],
      "role": "supporting",
      "description": "Arania Web is a Mage of the Mermaid Heel Guild and a member of its team competing in the Grand Magic Games. Arania, true to her spider theme, has been shown capable of generating spider webs from her body. These, much like their real counterparts, appear to be sticky, something which makes it possible for Arania to entangle foes with them.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n63901-k22tUKTDPwNj.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 63901
      },
      "rarity": "common"
    },
    {
      "id": "bacchus",
      "name": "Bacchus",
      "alt_names": [
        "バッカス",
        "The Drunk Falcon",
        "Bacchus of the Drunk-Chop Hanging Fist"
      ],
      "role": "supporting",
      "description": "__Race:__ Human  __Gender:__: Male  __Affiliation:__ Quatro Cerberus  __Guild Mark Location:__ Back  __Occupation:__ S-Class Mage  __Team:__ Team Quatro Cerberus  __Base of Operation:__ Quatro Cerberus Guild  __Magic:__ Palm Magic  Bacchus (バッカス Bakkasu) is an S-Class Mage of the Quatro Cerberus Guild.   __History:__ While on jobs for their respective guilds in the past, Bacchus and Fairy Tail's S-Class Mage Erza Scarlet have fought many times. However, neither ever defeated the other, and so their score has never been settled.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/63903.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 63903
      },
      "rarity": "common"
    },
    {
      "id": "chelia-blendy",
      "name": "Chelia Blendy",
      "alt_names": [
        "シェリア・ブレンディ"
      ],
      "role": "supporting",
      "description": "__Race:__ Human   \n__Affiliation:__ Lamia Scale  \n__Guild Mark Location:__ Right Calf  \n__Team:__ Team Lamia Scale  \n__Magic:__ Sky God Slayer  \n__Manga Debut:__ Chapter 267  \n\nChelia Blendy is a member of Lamia Scale, and the cousin of Sherry Blendy. Chelia is the typical \"Dojikko\", a very clumsy and cute girl that falls over a lot. She also seems determined to please the Guild Master of Lamia Scale. She doesn't seem to stand up for herself well either, as she apologizes to Lyon for falling, and gets scared when Toby yells at her. She also seems to care about Lyon as she gets angry that he is in love with Juvia.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64723-owB2deCp4qYR.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64723
      },
      "rarity": "common"
    },
    {
      "id": "dan-straight",
      "name": "Dan Straight",
      "alt_names": [
        "ダン・ストレイト"
      ],
      "role": "supporting",
      "description": "__Race:__ Human    __Affiliation:__ Zentopia Church  __Team:__ Legion Corps  __Partner:__ Samuel  __Magic Weapons:__ Ricochet, Habaraki  __Anime Debut:__ Episode 132  Dan Straight (ダン・ストレイト Dan Sutoreito) is a member of the Legion Corps of Zentopia.   __Appearance:__ Dan is a slim, young man with crimson colored hair and magenta eyes. His canines are very sharp. Dan has small, thin lines running down from the ends of his eyes and towards his cheeks. He wears a thick armor over his body which consists of a metallic breastplate that extends down to his knees, making the lower extension appear as a long skirt, shoulder pads and gauntlets on his arms. He also wears armor to cover his legs. Underneath it all, he wears a black sweater with dark pants, the latter being covered slightly with a dark green skirt, as well as brown shoes. He carries his two weapons, Ricochet and Habaraki, with him at all times.   __Personality:__ Dan is a very eager, cheerful and somewhat energetic person, often sporting a wide grin on his face. Laid-back and quite confident, Dan also seems very flirtatious around women, especially Lucy whom he claims to be in love with.   __Equipment:__  _Ricochet_: A magic shield that, like its name suggests, can repel any attack, whether it's Magic or a physical move, back at the original user.   _Habaraki_: A lance-like weapon that can change the mass size of whatever it hits. It can shrink the object to a minimal size or enlarge it by a great amount.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/65877.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65877
      },
      "rarity": "common"
    },
    {
      "id": "byro-cracy",
      "name": "Byro Cracy",
      "alt_names": [
        "バイロ・クラシー"
      ],
      "role": "supporting",
      "description": "Byro Cracy (バイロ・クラシー Bairo Kurashī) is the Earth Land counterpart of Byro and the leader of the Legion Corps of Zentopia.  Unlike his Edolas counterpart, Byro is a tall and muscular man that sports white hair in a similar style to Laxus', with most of it slicked back and having numerous spiky strands pointing backwards, and some strands over his forehead. He has gray eyes and prominent cheekbones. The only facial feature he has in common with his counterpart are the two tufts of hair on both side of his chin which point downwards, though the Earth Land counterpart seem to be thinner and black ring around his eyes. Also, he doesn't have any particular eyebrows.  Byro is a calm and collected individual who doesn't show much emotion. His form of speech is polite, ending his sentences with the more formal copula \"desu\". He is also a serious fellow, always having his sights on their main mission. He doesn't flinch even in the presence of Gildarts Clive, Fairy Tail's most powerful S-Class mage.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/66307.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 66307
      },
      "rarity": "common"
    },
    {
      "id": "sugarboy-earth-land",
      "name": "Sugarboy (Earth Land)",
      "alt_names": [
        "シュガーボーイ"
      ],
      "role": "supporting",
      "description": "Sugarboy (シュガ－ボ－イShugābōi) is the Earth Land counterpart of Sugarboy and a member of the Legion Corps of Zentopia, who uses Dog Whistle Magic as his form of magic.  Dog Whistle Magic makes Sugarboy's body lets free a large amount of green sticky mucus, which oozes from his clothes and quickly expands to form a large mass. The globules are described as having a mind of their own, and Sugarboy refers to the ooze as his \"Hound Dogs\". When touched, the phlegm surrounds and engulfs the person, trapping them and stopping them from being able to perform Magic. The gloop has also been shown to consume Magic, \"eating\" up the attacks of many Mages. Sugarboy claims that his \"Hound Dogs\" enjoy eating different types of Magic, but that they especially enjoyed Natsu's flames. The ooze has been shown to take on many shapes, such a forming a hand to pick up and throw around Sugarboy's enemies. When Sugarboy has finished his attacks, the Magic has an almost reverse retreat, being sucked back into Sugarboy's clothing. After being touched by the ooze, the victim appears to become fatigued and drained of Magic power, falling to the ground in a sleep-like manner.  Most likely gay for Gray Fullbuster. (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/69421.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 69421
      },
      "rarity": "common"
    },
    {
      "id": "samuel",
      "name": "Samuel",
      "alt_names": [
        "サミュエル",
        "Sammy"
      ],
      "role": "supporting",
      "description": "Samuel (サミュエル, Samyueru) is an Exceed and a member of the Legion Corps of Zentopia.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/71091.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71091
      },
      "rarity": "common"
    },
    {
      "id": "katja",
      "name": "Katja",
      "alt_names": [
        "カーチャ"
      ],
      "role": "supporting",
      "description": "Katja (カーチャ, Kācha) was a Celestial Spirit Mage. She is a descendant of one of Will Neville's disciples and she has been trained to utilize Celestial Spirit Magic. During her lifetime, she inherited the Organic Link to thwart the completion of the Infinity Clock.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/71287.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71287
      },
      "rarity": "common"
    },
    {
      "id": "arcadios",
      "name": "Arcadios",
      "alt_names": [
        "アルカディオス"
      ],
      "role": "supporting",
      "description": "Arcadios is a Squadron Chief in the Royal Kingdom of Fiore, though he seems to also have an allegiance towards Zeref.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/71495.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71495
      },
      "rarity": "common"
    },
    {
      "id": "guttman-kubrick",
      "name": "Guttman Kubrick",
      "alt_names": [
        "ガットマン・キューブリック"
      ],
      "role": "supporting",
      "description": "Guttman Kubrick is a member of Legion Corps and a former prisoner in the Forbidden Cell of Zentopia's main prison.  Guttman is a very cheerful and arrogant person that is inclined to underestimate the others, treating the other members of the Legion Corps, and especially Mary Hughes, like children. He trusts the Zentopia Doctrine very well and punishes those he sees disobeying it. This applies even to his comrades, like how he attacked Mary Hughes when she griped about killing a priest and destroying a church.  He used his Rapture Magic, a Magic which allows Guttman to swell the Magic in a person's body and make it explode. He can use this again and again until there is no more Magic power remaining within that person.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/71497.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71497
      },
      "rarity": "common"
    },
    {
      "id": "gato",
      "name": "Gato",
      "alt_names": [
        "ガトー"
      ],
      "role": "supporting",
      "description": "Gato is a prominent member of the Dark Guild, Naked Mummy. He has a strange tendency to repeat sentences twice, with the second following the first after some seconds, without realizing it, something about which he’s always informed by Zato.  Gato is first shown in Naked Mummy's headquarters, brutalizing one of their comrades for not having brought back any money, having been defeated by Lucy Heartfilia while robbing the LOVE &amp; LUCKY merchant guild.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/71499.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71499
      },
      "rarity": "common"
    },
    {
      "id": "zoldeo",
      "name": "Zoldeo",
      "alt_names": [
        "ゾルディオ"
      ],
      "role": "supporting",
      "description": "Zoldeo is a member of the Grimoire Heart Guild and one of the Seven Kin of Purgatory through possession of Capricorn's body.  Zoldeo gained the Capricorn's key after Layla Heartfilia retired. He was expected to hand it over to Lucy when she was ready to use Magic, but he became twisted and corrupted, and swallowed up by the darkness. At one point, he broke a taboo of the Celestial Spirits by using his Human Subordination Magic and somehow ended up possessing Capricorn's body. It's because of this that Capricorn was able to stay in the human world for 17 years. At some point in time, he was found by Master Hades and joined Grimoire Heart, becoming one of the Seven Kin of Purgatory.   ~!He died after being forcefully removed from his possession of Loke's body.!~ (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/71501.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71501
      },
      "rarity": "common"
    },
    {
      "id": "obra",
      "name": "Obra",
      "alt_names": [
        "オーブラ"
      ],
      "role": "supporting",
      "description": "Obra is a Mage of the Raven Tail Guild and a member of Team Raven Tail. He's associated with a small, brown, demon-like creature by unknown reasons.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71583-rPdMOkTn0SzU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71583
      },
      "rarity": "common"
    },
    {
      "id": "rocker",
      "name": "Rocker",
      "alt_names": [
        "ロッカー"
      ],
      "role": "supporting",
      "description": "Rocker (ロッカー Rokkā) is a Mage of the Quatro Cerberus guild, as well as a member of its team taking part in X791's Grand Magic Games.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72033-bJvwiqf2hKIo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72033
      },
      "rarity": "common"
    },
    {
      "id": "war-cry",
      "name": "War Cry",
      "alt_names": [
        "ウォークライ"
      ],
      "role": "supporting",
      "description": "War Cry (ウォークライ Wōkurai) is a Mage of the Quatro Cerberus Guild and a member of Team Quatro Cerberus, a team participating in the Grand Magic Games. As his very name suggests with a pun, utilizes Tear Magic, focused around the use of his tears. He was shown able to start crying profusely in mere seconds, something which supposedly results in him becoming capable of casting spells.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72035-IInwujlEe1O6.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72035
      },
      "rarity": "common"
    },
    {
      "id": "beth-vanderwood",
      "name": "Beth Vanderwood",
      "alt_names": [
        "ベス・バンダーウッド"
      ],
      "role": "supporting",
      "description": "Beth Vanderwood (ベス・バンダーウッド Besu Bandāuddo) is a Mage of the Mermaid Heel Guild. Beth's Magic seems to be related to the use of vegetables. Unlike Droy's form of Plant Magic however, which is Holder-type, Beth's form is Caster-type.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72037-4FlbEDIus89B.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72037
      },
      "rarity": "common"
    },
    {
      "id": "risley-law",
      "name": "Risley Law",
      "alt_names": [
        "リズリー・ロー"
      ],
      "role": "supporting",
      "description": "Risley Law is a Mage of the Mermaid Heel guild as well as a member of its representative team in the Grand Magic Games. Risley employs Gravity Change as her type of Magic. This Magic allows her to manipulate the gravity affecting a person, using it to changing her weight and allowing her to defy gravity and walk on walls. However, this Magic wears off after a period of time and Risley reverts to her original form.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72039-hxHDUfcxmCPW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72039
      },
      "rarity": "common"
    },
    {
      "id": "jiemma-orland",
      "name": "Jiemma Orland",
      "alt_names": [
        "ジエンマ・オーランド",
        "Gemma"
      ],
      "role": "supporting",
      "description": "Jiemma (ジエンマ) is the Guild Master of the currently \"strongest\" Guild in Fiore, Sabertooth. Jiemma is very strict in his beliefs. He firmly believes that Sabertooth is the strongest guild in Fiore and wishes it to remain that way.   ~!When Yukino Aguria lost a match in the Grand Magic Games, he forced her to strip down in public, remove her guild mark, and leave the guild. He also does not seem to care much for his subordinates that fail to meet his expectations as he constantly called Yukino \"trash\" after she lost her match.  ~!Even Sting and Rogue, despite their fame, power, and numerous victories prior, were \"trash\" in Jiemma's eyes and were ordered to erase their Guild Marks after their single-handed defeat by Natsu.!~!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/72041.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72041
      },
      "rarity": "common"
    },
    {
      "id": "nalpudding",
      "name": "Nalpudding",
      "alt_names": [
        "ナルプディング"
      ],
      "role": "supporting",
      "description": "Nalpudding (ナルプディング Narupudingu) is a Mage of the newly legalized Guild, Raven Tail.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72043-5ZfnppO2GQ2X.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72043
      },
      "rarity": "common"
    },
    {
      "id": "novali",
      "name": "Novali",
      "alt_names": [
        "ノバーリ"
      ],
      "role": "supporting",
      "description": "Novali (ノバーリ Nobāri) is a Mage of the Quatro Cerberus guild, as well as a member of its team taking part in X791's Grand Magic Games. On the third day of the Grand Magic Games, he is chosen to represent Quatro Cerberus for the Day's event. It consists on defeating monsters of different levels to earn points and progress.   ~!However, the event is finished by Erza Scarlet alone, which amazes the entire audience. When the Magic Power Finder is announced, Nobarly later strikes the MPF after Millianna, gaining 124 score, and becomes disappointed.!~ (Source: Fairy Tail Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72045-73QBYf823tUp.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72045
      },
      "rarity": "common"
    },
    {
      "id": "ooba-babasaama",
      "name": "Ooba Babasaama",
      "alt_names": [
        "オーバ・ババサーマ"
      ],
      "role": "supporting",
      "description": "Ooba Babasaama is the Guild Master of Lamia Scale. Ooba has a loud and rash personality, furiously berating herself and her guild for not winning the Grand Magic Games as well as ordering them to work harder. She does, however, seem to have the guild's best interests in heart, as she wants to establish Lamia Scale as the strongest guild in Fiore, as do her guild's Mages. She has a habit of continually spinning her arms in a circular fashion.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/72047.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72047
      },
      "rarity": "common"
    },
    {
      "id": "alexei",
      "name": "Alexei",
      "alt_names": [
        "アレクセイ"
      ],
      "role": "supporting",
      "description": "Alexei (アレクセイ Arekusei) is a Mage of the newly legalized Guild, Raven Tail and the representative team in the Grand Magic Games.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72527-vOfdklcj14c7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72527
      },
      "rarity": "common"
    },
    {
      "id": "guran-doma",
      "name": "Guran Doma",
      "alt_names": [
        "グラン・ドマ"
      ],
      "role": "supporting",
      "description": "Guran Doma is the new Chairman of the Magic Council. To protect the order of the Magic society and regain the people's trust of the Magic Council, he has stated that they will keep a closer eye on the problem.  While not that much is known about Guran Doma, he is evidently a stern and serious man, who does not tolerate breaking of the law. He seems to have a seemingly by the book mentality of justice and dislikes any ignoring of the laws, such as his disdain for Fairy Tail's antics. In regards to the Oración Seis incident, he personally stated that if Fairy Tail does this kind of thing again, they will be forced to disband. Lahar, Head of the 4th Custody Enforcement Unit, stated Doma is not one to hesitate in dealing judgement to evil, even if it means using Etherion to do so.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/72531.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72531
      },
      "rarity": "common"
    },
    {
      "id": "org",
      "name": "Org",
      "alt_names": [
        "オーグ"
      ],
      "role": "supporting",
      "description": "Org is a Sage of the Magic Council, having been the 2nd Seat of the previous Council. He used to despise Fairy Tail for its idiocy, but now seems to see them in a softer light due to their great achievements such as bringing down Oración Seis.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/72533.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72533
      },
      "rarity": "common"
    },
    {
      "id": "michello",
      "name": "Michello",
      "alt_names": [
        "ミケロ"
      ],
      "role": "supporting",
      "description": "Michello was a member of Magic Council, where he had occupied the third seat. Not much is known about him or his past. He hates Fairy Tail for its idiocy.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/72535.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72535
      },
      "rarity": "common"
    },
    {
      "id": "belno",
      "name": "Belno",
      "alt_names": [
        "ベルノ"
      ],
      "role": "supporting",
      "description": "Belno was a member of the Magic Council. After the misuse of the Etherion, she was forced to leave the Magic Council. Like other council members, she seems largely opposed to the actions of Fairy Tail. She seems to have a more relaxed personality compared to Org.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/72541.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72541
      },
      "rarity": "common"
    },
    {
      "id": "leiji",
      "name": "Leiji",
      "alt_names": [
        "レイジ"
      ],
      "role": "supporting",
      "description": "Leiji was a member of the Magic Council. He was forced to leave the council after the misuse of the Etherion. Like other council members, he seems to dislike Fairy Tail for its idiocy. He also seems to have a strong opinion about any matter as well, and believes some sacrifices are necessary if they are for the greater good.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/72543.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72543
      },
      "rarity": "common"
    },
    {
      "id": "bobo",
      "name": "Bobo",
      "alt_names": [
        "ボボ"
      ],
      "role": "supporting",
      "description": "He is first seen when he Natsu and Lucy ask him for a ride to Galuna Island; he initially refuses but changes his mind when he discovers they are Mages. While out at sea he explains to Natsu, Lucy, Gray, and Happy about the curse of Galuna Island, and when they arrive at the area outside of the island, he suddenly \"disappears\".   ~!He is actually the son of Moka and a resident of Galuna Island. Years ago, Bobo left the island when his father and the other villagers began to forget that they were Demons because of Moon Drip effect.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/72633.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72633
      },
      "rarity": "common"
    },
    {
      "id": "moka",
      "name": "Moka",
      "alt_names": [
        "モカ"
      ],
      "role": "supporting",
      "description": "Moka is the Headman of Galuna Island.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/72635.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72635
      },
      "rarity": "common"
    },
    {
      "id": "lulu",
      "name": "Lulu",
      "alt_names": [
        "ルル"
      ],
      "role": "supporting",
      "description": "Lulu is a resident of Galuna Island.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/72637.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72637
      },
      "rarity": "common"
    },
    {
      "id": "jason",
      "name": "Jason",
      "alt_names": [
        "ジェイソン"
      ],
      "role": "supporting",
      "description": "Jason is a reporter from Sorcerer Magazine. Jason is a very eccentric individual. He is star struck by nearly every famous Mage he sees. He likes the Mages to the extent of praising all their foolish actions. He frequently shouts \"COOOOL!\" every time he believes something cool happens, although usually it isn't as cool as he thinks.  (Source: Fairy Tail Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/72639.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72639
      },
      "rarity": "common"
    },
    {
      "id": "mato",
      "name": "Mato",
      "alt_names": [
        "マトー"
      ],
      "role": "supporting",
      "description": "Mato is the official referee and mascot for the Grand Magic Games' events. He's often seen smiling and dancing, but has a bit of a dark personality, as he smiles when he announces that they won't take any responsibility for deaths in the labyrinth. He has the tendency to end his phrases with \"Pum\".  (Source: Fairy Tail Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/73809.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 73809
      },
      "rarity": "common"
    },
    {
      "id": "lapointe",
      "name": "Lapointe",
      "alt_names": [
        "ラポワント",
        "Rapowant"
      ],
      "role": "supporting",
      "description": "Lapointe (ラポワント Rapowanto) served as a Cardinal of the Zentopia Church.  Lapointe has the same personalities as Brain, of saying pilgrims as maggots and he was very cold and strict. He does not tolerate opposition in any way and requires total loyalty. When a Zentopia priest who refused to reveal the identity of Will Neville's disciples as he threw him in prison and tortured him. He does not recognize any authority besides his own, and even challenges the Magic Council when he haughtily dismisses Lahar's inquiries, stating that the escape of Oración Seis lay solely at the feet of the Council, and that it was outrageous for Lahar to insinuate that Zentopia had something to do with it.   ~!Lapointe was a doll used by Reborn Oración Seis to accomplish their plans, possessing a strand of hair from Brain.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/73833.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 73833
      },
      "rarity": "common"
    },
    {
      "id": "chapati-lola",
      "name": "Chapati Lola",
      "alt_names": [
        "チャパティ・ローラ"
      ],
      "role": "supporting",
      "description": "Chapati Lola is the emcee for the Grand Magic Games.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/74065.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74065
      },
      "rarity": "common"
    },
    {
      "id": "yeagar",
      "name": "Yeagar",
      "alt_names": [
        "イエーガー"
      ],
      "role": "supporting",
      "description": "Yeagar (イエーガー Iēgā) is a Mage of the Quatro Cerberus Guild.  Yaeger seems to employ plants in battle. Yeagar has proven himself capable of summoning forth large carnivorous plant-like objects from the ground, shattering it in the process. Such seeming flytraps, which consist of four massive \"petals\", with a row of rounded teeth on their inner sides and massive spikes on their outer ones, are roughly the size of a human, and damage enemies by suddenly closing themselves on them, being shown sending them flying away with brute force.  (Source: Fairy Tail Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b74067-CwisAB3Ortzf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74067
      },
      "rarity": "common"
    },
    {
      "id": "semmes",
      "name": "Semmes",
      "alt_names": [
        "セムス"
      ],
      "role": "supporting",
      "description": "Semmes is a Mage of the Quatro Cerberus guild, as well as a member of its team taking part in X791's Grand Magic Games.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b74069-SKFpBG0QwQnZ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74069
      },
      "rarity": "common"
    },
    {
      "id": "yomazu",
      "name": "Yomazu",
      "alt_names": [
        "ヨマズ"
      ],
      "role": "supporting",
      "description": "Yomazu (ヨマズ, Yomazu) is one of the most powerful lesser-rank members of the Dark Guild, Grimoire Heart, serving under one of the Seven Kin of Purgatory, Caprico. He's partnered with Kawazu.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/74481.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74481
      },
      "rarity": "common"
    },
    {
      "id": "kawazu",
      "name": "Kawazu",
      "alt_names": [
        "カワズ"
      ],
      "role": "supporting",
      "description": "Kawazu (カワズ, Kawazu) is a low ranking, yet deceptively strong, member of the Dark Guild Grimoire Heart, being under the command of one of its elite Seven Kin of Purgatory, Caprico. He works alongside his partner Yomazu.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/74483.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74483
      },
      "rarity": "common"
    },
    {
      "id": "toma-e-fiore",
      "name": "Toma E. Fiore",
      "alt_names": [
        "トーマ・E・フィオーレ"
      ],
      "role": "supporting",
      "description": "Toma E. Fiore is the King who rules over the Kingdom of Fiore. Toma is a short man who wears striped overalls, held up by a belt at the waist, under a cape.Not much is known about Toma's personality, but he seems to like being entertained by watching good fights. He can also be quite childish at times as seen when he complained to Arcadios about him not having Erza battle Bacchus.   ~!After the Grand Magic Games are over, Toma has all the Mages gather at Crocus Central Square and tells them about the ten thousand Dragons' attack. He explains that while there is a plan to annihilate the attackers, it's possible that some of them will survive and thus all the Mages should cooperate to defeat them. When the Mages reply that they will defend their country, Toma is seen crying out of joy and continues giving thanks to everyone, before muttering \"Kapoh\", silencing the crowd.!~ (Source: Fairy Tail Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b76602-qKjy3eVwDyOX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 76602
      },
      "rarity": "common"
    },
    {
      "id": "velveno",
      "name": "Velveno",
      "alt_names": [
        "ベルベノ"
      ],
      "role": "supporting",
      "description": "Velveno (ベルベノ Berubeno) is an escaped convict with a 2,000,000 Jewels bounty on his head, which has been increased to 4,000,000 Jewels by the year X791.  Velveno is mentioned briefly after Fairy Tail member Gray Fullbuster accepts a job request with a 2,000,000 Jewels reward for Team Natsu to capture him. However, they cancel the job after Lucy Heartfilia goes to rescue her father Jude from Naked Mummy.   ~!When he was young, Velveno served for the Balsamico family and fell in love with Count Balsamico's daughter Aceto, with whom he had a friendly relationship with. Due to this, Count Balsamico drove him out of the mansion. Velveno tried to visit Aceto from time to time, but the Count refused to let him, pointing out the difference in their social positions. Velveno tried to ignore his feelings for Aceto as a result, eventually causing him to turn to crime, which subsequently led to his arrest. While in jail, Velveno began to regret not telling Aceto how he felt, leading him to escape and become a fugitive with a 2,000,000 Jewels bounty on his head. He sought to reunite with Aceto, who now only made public appearances at her family's magical ball held at Balsamico Palace once every seven years for the sole purpose of finding a suitor for her.!~ (Source: Fairy Tail Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/77167.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 77167
      },
      "rarity": "common"
    },
    {
      "id": "darton",
      "name": "Darton",
      "alt_names": [
        "ダートン",
        "Datong",
        "Daton"
      ],
      "role": "supporting",
      "description": "Datong (ダートン Dāton) is the Minister of Defense of the Kingdom of Fiore. Due to his high position, he knows about the Eclipse plan and has greatly opposed it.  (Source: Fairy Tail Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/77175.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 77175
      },
      "rarity": "common"
    },
    {
      "id": "rabian",
      "name": "Rabian",
      "alt_names": [
        "ラビアン"
      ],
      "role": "supporting",
      "description": "Rabian is the chairman of the Scheherazade Theater who performs plays. He once hired Team Natsu to stage a play in Onibus Town for him.  Rabian has been shown to write outrageous plays with ridiculous plot twists like in \"Frederick and Yanderica\" where confusion after confusion ensued. This garnered him bad reviews for his plays and eventually the actors that performed for him left him. He seems, at first, quite emotional when he imparted his miserable story to Team Natsu. Later, he is shown to have a tendency to take things to excess, as seen when he made Team Natsu perform the same play three times a day for a week while withholding their pay. It is also ironic how Rabian often says \"Thank you very much!\" after almost every sentence but treats his cast quite ungratefully, even commenting that Team Natsu, the cast who earned him tons of audience for a week, is composed of amateurs.   ~!During the Grand Magic Games of X791, Rabian is seen guest judging during the fourth day's events, saying that it's very fun to be there.!~ (Source: Fairy Tail Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/86335.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86335
      },
      "rarity": "common"
    },
    {
      "id": "zalty",
      "name": "Zalty",
      "alt_names": [
        "ザルティ"
      ],
      "role": "supporting",
      "description": "Lyon's minion who helps Reitei Lyon to revive Deliora (a demon trapped in ice by Ul) and uses \"Lost Magic\" to manipulate time's effects on inanimate objects.   ~!After Deliora is discovered to be long dead, Zalty is revealed to be Ultear, the daughter of Ul.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b87173-jGq06Oat8Gad.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87173
      },
      "rarity": "common"
    },
    {
      "id": "jura-neekis",
      "name": "Jura Neekis",
      "alt_names": [
        "ジュラ・ネェキス",
        "Iron Rock Jura",
        "The Ace of Lamia Scale"
      ],
      "role": "supporting",
      "description": "Race: Human (X784), 34 (X791)\nBirthday: Year X757\n~!Affiliation: Magic Council - Ten Wizard Saints\nPrevious Affiliation: Lamia scale\nOccupation:Mage, Wizard Saint!~\nMagic: Earth Magic\nWeapons: Staff\nDown-to-earth and with great humility, Jura generally refers to others with the highly honorific suffix \"-dono\", even when addressing subordinates, enemies, animals (Even despite not knowing Happy's name, he once called him Cat-dono), and those weaker than he is.",
      "metadata": {
        "gender": "male",
        "age": "27",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130582-mvOFnTMmLAjS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130582
      },
      "rarity": "common"
    },
    {
      "id": "spetto",
      "name": "Spetto",
      "alt_names": [
        "スペット"
      ],
      "role": "supporting",
      "description": "A former servant in the Heartfilia Konzern. Despite previously working for her, she loves Lucy Heartfilia as family.\n~!Sometime after Layla had retired from being a Celestial Spirit Mage, Spetto was given Cancer's key. After Lucy learned Celestial Spirit Magic, Spetto gifted the key unto her.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135577-Um7Nx9p1SiMg.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135577
      },
      "rarity": "common"
    },
    {
      "id": "krov",
      "name": "Krov",
      "alt_names": [
        "クロフ"
      ],
      "role": "supporting",
      "description": "A former Mage of the Fairy Tail Guild. After the re-establishment of Fairy tail in X792, he no longer returned as a member of the Guild.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b189152-7Gb9Fe1mU8Uc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 189152
      },
      "rarity": "common"
    },
    {
      "id": "wan-chanzi",
      "name": "Wan Chanzi",
      "alt_names": [
        "ワン・チャンジー"
      ],
      "role": "supporting",
      "description": "Wan is a former member of the Fairy Tail guild. Being a quiet person, he rarely speaks. In one instance, he did not speak for more than one hour's time in one whole year. After the re-establishment of Fairy Tail in X792, he no longer returned as a member of the guild.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b189153-pBZ1tYlFWw0J.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 189153
      },
      "rarity": "common"
    },
    {
      "id": "ribbon",
      "name": "Ribbon",
      "alt_names": [
        "リボン"
      ],
      "role": "supporting",
      "description": "Ribbon is one of the Heartfilia Konzern's former servants.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b189154-Pb90eroT2wPY.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 189154
      },
      "rarity": "common"
    },
    {
      "id": "niggy",
      "name": "Niggy",
      "alt_names": [
        "二ギー"
      ],
      "role": "supporting",
      "description": "Niggy is a former Mage of the Fairy Tail guild. After the re-establishment of Fairy Tail in X792, he no longer returned as a member of the guild.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b189155-Ejy49P8WvZKu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 189155
      },
      "rarity": "common"
    },
    {
      "id": "byard",
      "name": "Byard",
      "alt_names": [
        "ビアード"
      ],
      "role": "supporting",
      "description": "Byard was a member of the dark guild Eisenwald before its disbandment.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b189157-0YnzhqQD6vN0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 189157
      },
      "rarity": "common"
    },
    {
      "id": "snarl",
      "name": "Snarl",
      "alt_names": [
        "スナール"
      ],
      "role": "supporting",
      "description": "Snarl is a former member of the now dissolved dark guild, Eisenwald.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b189158-NBVESk3m65u6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 189158
      },
      "rarity": "common"
    },
    {
      "id": "joey-fullborn",
      "name": "Joey Fullborn",
      "alt_names": [
        "ジョイ・フルボーン"
      ],
      "role": "supporting",
      "description": "Joey is a former Mage of the Fairy Tail guild. He joined around the same time as Chico C Hammitt and Wan Chanzi, and therefore he and Wan are often partners and rivals. After the re-establishment of Fairy Tail in X792, he no longer returned as a member of the guild.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b189159-HAc6U3Bu5yfu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 189159
      },
      "rarity": "common"
    },
    {
      "id": "aed",
      "name": "Aed",
      "alt_names": [
        "エイド"
      ],
      "role": "supporting",
      "description": "A chef who formerly served the Heartfilia Konzern.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b189160-T81kUDQl4iCQ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 189160
      },
      "rarity": "common"
    },
    {
      "id": "wonderful-gocche",
      "name": "Wonderful Gocche",
      "alt_names": [
        "ワンダフル・ゴッチ",
        "Jiggle Butt Gang"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b206276-rYPZOmBSptXY.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 206276
      },
      "rarity": "common"
    },
    {
      "id": "karen-berg",
      "name": "Karen Berg",
      "alt_names": [
        "カレン・ボーグ",
        "Jiggle Butt Gang"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "age": "29",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b206277-NBRGg4gG0jSv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 206277
      },
      "rarity": "common"
    },
    {
      "id": "marco-belunjay",
      "name": "Marco Belunjay",
      "alt_names": [
        "マルコ・ベルンジュ",
        "Jiggle Butt Gang"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b206278-GQ1scMCSCmjM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 206278
      },
      "rarity": "common"
    },
    {
      "id": "balsamico-hakushaku",
      "name": "Balsamico Hakushaku",
      "alt_names": [
        "バルサミコ伯爵"
      ],
      "role": "supporting",
      "description": "Father of Aceto and the owner of Balsamico Castle.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b206280-fgfccCjyrp1f.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 206280
      },
      "rarity": "common"
    },
    {
      "id": "eisenwald-chicken",
      "name": "Eisenwald Chicken",
      "alt_names": [
        "アイゼンヴァルトチキン"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b218730-VThWen1o5Dy1.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 218730
      },
      "rarity": "common"
    },
    {
      "id": "older-vanish-brother",
      "name": "Older Vanish Brother",
      "alt_names": [
        "古いバニッシュブラザー"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b218731-tH2Ja1nEk5mO.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 218731
      },
      "rarity": "common"
    },
    {
      "id": "fortune-teller",
      "name": "Fortune Teller",
      "alt_names": [
        "占い師"
      ],
      "role": "supporting",
      "description": "The Fortune Teller is a member of the Dark Guild, Eisenwald.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b218732-vlF3yDXtftbp.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 218732
      },
      "rarity": "common"
    },
    {
      "id": "eisenwald-twins",
      "name": "Eisenwald Twins",
      "alt_names": [
        "アイゼンヴァルトツインズ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b218733-KLdIPs1nDL7w.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 218733
      },
      "rarity": "common"
    },
    {
      "id": "younger-vanish-brother",
      "name": "Younger Vanish Brother",
      "alt_names": [
        "ヴァニッシュブラザー"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b218734-2fEFVD9WAKfj.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 218734
      },
      "rarity": "common"
    },
    {
      "id": "tenshu",
      "name": "Tenshu",
      "alt_names": [
        "店主",
        "Shop Owner"
      ],
      "role": "supporting",
      "description": "The Shop Owner is the shop owner of Magic shop in Hargeon Town.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b231357-6f8yjrdMfwwz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 231357
      },
      "rarity": "common"
    },
    {
      "id": "kaby-no-tsuma",
      "name": "Kaby no Tsuma",
      "alt_names": [
        "カビーの妻",
        "Kaby's Wife"
      ],
      "role": "supporting",
      "description": "Kaby's Wife is the wife of Kaby Melon.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b231358-OH3TlivSqAkd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 231358
      },
      "rarity": "common"
    },
    {
      "id": "klodoa",
      "name": "Klodoa",
      "alt_names": [
        "クロドア"
      ],
      "role": "supporting",
      "description": "Klodoa is a Magic Staff able to talk and levitate. Formerly used by Brain, it was referred to as the seventh member of the Oración Seis.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b284270-i85wCe32eOOm.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 284270
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-23T01:42:02.848Z"
}