{
  "work_id": "rezero-starting-life-in-another-world-season-2",
  "count": 34,
  "characters": [
    {
      "id": "emilia",
      "name": "Emilia",
      "alt_names": [
        "エミリア",
        "Satella",
        "Lia",
        "Emilia-tan",
        "Witch of Glaciation",
        "Hyouketsu no Majo (氷結の魔女)",
        "Witch of Frost",
        "Han Ma (半魔)",
        "Half-Devil",
        "Mili",
        "Emily"
      ],
      "role": "protagonist",
      "description": "**Height:** 164 cm (5'5\")\n\nShe is a silver-haired half-elf girl who is one of the candidates to become the next ruler in the royal election. Subaru first meets her when her insignia is stolen by Felt as she needs to possess it to be eligible to participate in the election. She introduces herself as Satella when she and Subaru met during the first timeline before introducing herself by her real name when she got her insignia back.\n\nEmilia is good natured and likes to take care of others, though she herself refuses to admit it, instead thinking of it as her own selfishness. She is indifferent to her own appearance, leaving Puck to take care of her clothes and hair. Because her appearance is similar to the Witch of Envy, she has received unfair discrimination from others. She sometimes acts like a child and is unacquainted with the world as she used to live in the woods with other Elves, though despite this she still works hard to become a ruler.",
      "metadata": {
        "gender": "female",
        "age": "14-19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88572-IzTwXEHSobRs.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88572
      },
      "rarity": "legendary"
    },
    {
      "id": "subaru-natsuki",
      "name": "Subaru Natsuki",
      "alt_names": [
        "ナツキ・スバル",
        "Barusu",
        "Lolimancer",
        "Young Su",
        "Baru",
        "Subaruun",
        "Natsumi Schwartz",
        "Bals",
        "Le Chevalier de la Demi-Elfe",
        "The Half Elf's Knight",
        "Natsuki Schwartz",
        "Spirit Knight",
        "Purge King",
        "Captain",
        "Boss",
        "Suu",
        "Basu"
      ],
      "role": "protagonist",
      "description": "__Height:__ 173 cm (5'8\")\n\nOn the way home from the convenience store, he suddenly finds himself transported into another world. He has the ability that he calls \"Return by Death\" to go back in time when he dies. Despite being a hikikomori and gamer in his real world, Subaru does a bit of workout and seems to know basic hand-to-hand combat, making him not completely weak.\n\nWhile Subaru tends to not read the situation, he is loyal to those he holds dear, willing to help them, even if that means taking the thorny path. He has his resolve confirmed through the many situations and circumstances he faces in the fantasy world, originally having been one to always take the \"easy\" route. As a hikikomori, he is hopeful of the possibilities that being sucked into a new realm brings, but later realizes the realities of the predicament he is in. Ultimately, he resolves himself to be faithful and protective of the ones that he cares most about.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88573-F8yMTK9GhnTA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88573
      },
      "rarity": "legendary"
    },
    {
      "id": "otto-suwen",
      "name": "Otto Suwen",
      "alt_names": [
        "オットー・スーウェン"
      ],
      "role": "protagonist",
      "description": "Otto Suwen is a merchant appearing in  Re:Zero. His remarkable misfortune always takes him to dangerous situations, from which he escapes thanks to his wit.\nOtto has gray hair that is mentioned to be as long as a gal game protagonist. He is said to be somewhat handsome if he has a serious expression. However, he is usually either retorting, shouting, or panicking, ruining his looks. He has a medium build, but has trained himself since he used to work as a merchant.",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124110-Gfr3IYI6FwqE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124110
      },
      "rarity": "legendary"
    },
    {
      "id": "echidna",
      "name": "Echidna",
      "alt_names": [
        "エキドナ",
        "Witch of Greed"
      ],
      "role": "protagonist",
      "description": "Echidna is one of the Witches of Sin, being the Witch of Greed. She has a strong thirst for knowledge along with a curiosity for the unknown, which defines her behavior. Echidna is described as black hearted, being unable to empathize with others and their feelings due to a lack of understanding. She will do anything to gain knowledge, be it deceit or employed sophistry.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129330-ZUtYw4n7N0uH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129330
      },
      "rarity": "legendary"
    },
    {
      "id": "garfiel-tinsel",
      "name": "Garfiel Tinsel",
      "alt_names": [
        "ガーフィール・ティンゼル",
        "Gar",
        "Garf",
        "Gorgeous Tiger",
        "The Strongest of Shields"
      ],
      "role": "protagonist",
      "description": "Garfiel Tinsel is the former guardian of the Sanctuary and a member of the Emilia Camp. Introduced during Arc 4, he became one of the main supporting characters of the season. He's a half-beast human and Frederica Baumann's half-brother. He can transform himself in a giant golden tiger that can deal powerful attacks but with a cost of losing his reason, so he uses this ability when he's pushed to the limit\n~!Garfiel and Frederica lived together until she left when he was around 4 years old and he hadn't seen her since until their reunion 10 years later during the Sanctuary incident. After seeing his mother's \"death\" during the trial at a young age, he began to fear the outside world, causing him to try and protect the Sanctuary.!~",
      "metadata": {
        "gender": "male",
        "age": "13-15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b133847-8I2Pjoz232vS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133847
      },
      "rarity": "legendary"
    },
    {
      "id": "rem",
      "name": "Rem",
      "alt_names": [
        "レム",
        "Rem-rin"
      ],
      "role": "supporting",
      "description": "__Height:__ 154 cm (5'1\")\n\nRem is one of the twin maids working for Roswaal L Mathers. She has medium length sky blue hair that covers her right eye, large light blue eyes, and young features. She also has hair clips towards left side of her hair, flower-shaped ribbon on the same side of her hair, and a maid hairband. She looks nearly identical to her sister apart from her hair, eyes, and ribbon coloring. She usually wears a maid uniform, and since her chest is slightly larger than her sister's, she secretly changes the measurements to hide it. Rem tends to speak in a superficially polite manner and sometimes acts without thinking. She holds both respect to the point of worship and guilt toward her sister for an incident in the past. Because of her respect and guilt toward her sister, she used to think of herself as inferior.",
      "metadata": {
        "gender": "female",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88575-Ayu8UPDA8NS6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88575
      },
      "rarity": "rare"
    },
    {
      "id": "ram",
      "name": "Ram",
      "alt_names": [
        "ラム",
        "Ram-chi",
        "Ramu"
      ],
      "role": "supporting",
      "description": "__Height:__ 154 cm (5’1”)\n\nRam is one of the twin maids working for Roswaal L Mathers. She has medium length light pink hair that covers her left eye, large darkish pink eyes, and young features. She also has hair clips towards right side of her hair, flower-shaped ribbon on the same side of her hair, and a maid hairband. She looks nearly identical to her sister Rem apart from her hair, eyes, and ribbon coloring. She usually wears a maid uniform. She has a smaller chest compared to her sister, and she has slanted eyes. Ram is seemingly self-centered and does things at her own pace, however in actuality she maintains a distance from people to ascertain them. She believes that Roswaal is the greatest and no one else is as precious except for her sister Rem. She is slightly more outgoing in comparison to the generally taciturn Rem, who generally allows Ram to take the lead in their sisterly bond.\n~! As the prodigal elder twin Ram was born with extraordinary talent for mana manipulation and a powerful body to match that made her the pride of the Oni village. Her aptitude didn't just lie there, everything from cooking to physical activities she was superior to Rem and was showered in adoration even by her own sister. However she never let any of it get to her head and never forgot her little sister no matter how much attention was paid to her. During the night of the attack by the Witch Cult when all the Oni fell she alone kept fighting to avenge them and protect her sister. But the cult outnumbered her and she made a last ditch effort to shield a petrified Rem from getting cut down. In mere moments, Ram lost her horn when it was sliced off from her head as a result of that. Had it not been for a passing mage at the time whom they came to know as Roswaal L Mathers they would not have survived the massacre.\nThe next several years since then Roswaal would gain the twins eternal gratitude and fervent loyalty. Especially in the case of Ram who came to harbor romantic feelings for him who also served as her lifeline due to regular mana infusions. During the early days of her life in Roswaal's mansion Ram would also come to know the partial truth of the cult's raid that night as well as the identity of the cult member responsible for cutting off her horn, Faust with assistance from Roswaal and achieved her vengeance. Ram is the only person who knows about Roswaal's gospel and had formed a contract with him that stipulated that his life would be hers if the future ever deviated from it's predictions as penance for knowing about the attack and letting it happen for his own ends. !~",
      "metadata": {
        "gender": "female",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88576-NWkotUiJ3mK3.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88576
      },
      "rarity": "rare"
    },
    {
      "id": "wilhelm-van-astrea",
      "name": "Wilhelm van Astrea",
      "alt_names": [
        "ヴィルヘルム・ヴァン・アストレア",
        "Sword Demon (剣鬼 Kenki)"
      ],
      "role": "supporting",
      "description": "__Height__: 178 cm (5'10\")\n\nWilhelm van Astrea né Trias, is a member of the Crusch Camp and was Theresia van Astrea's husband.\n\nWilhelm is a refined man with a highly gentle and humble demeanor. However unearth that even temperament belied a fierce warrior who often is the first to help when something happens. However this wasn't always the case as in youth, Wilhelm was very opposite of who he was in his later years. Brash, afoot, short tempered, lonely and often cold with others. He was a troubled individual who devoted himself wholly to the sword and cared for little else. Even so, he knew how to analyze a situation, always finding a way out. Nonetheless, Theresia greatly influenced his personality, becoming increasingly sociable and protective, achieving more results during the Demi-human War. It was through her most of all that he would become the person he is today.",
      "metadata": {
        "gender": "male",
        "age": "62 (Arc 5+), 61 (Arc 3-4), 15-20 (Ex 2)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90179-dBqDPUn2i7dM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90179
      },
      "rarity": "rare"
    },
    {
      "id": "elsa-granhiert",
      "name": "Elsa Granhiert",
      "alt_names": [
        "エルザ・グランヒルテ",
        "The Bowel Hunter"
      ],
      "role": "supporting",
      "description": "An assassin-for-hire from the Northernmost nation, the Holy Kingdom of Gusteko, known as \"The Bowel Hunter\". Elsa wishes to make a trade for an insignia, as her client's wishes.  \n\n~!Elsa Granhiert was an assassin working together with [Meili](https://anilist.co/character/175577) for an individual they refer to as \"Mother\" until her death.!~",
      "metadata": {
        "gender": "female",
        "age": "23",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90180-YXbXfcSlalav.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90180
      },
      "rarity": "rare"
    },
    {
      "id": "beatrice",
      "name": "Beatrice",
      "alt_names": [
        "ベアトリス",
        "Beako",
        "Betty",
        "Campaign Slayer"
      ],
      "role": "supporting",
      "description": "__Height:__ 140 cm (4'7\")\n__Age:__ ~!400+ (Actual)!~\n\nThe caretaker of the library in Roswall's mansion. \n\nShe has a distinct way of speaking, adding \"I suppose\" (かしら, kashira) and \"in fact\" (のよ, no yo) at the end of some of her sentences.\n\n~!Around 400 years ago, Beatrice was created by Echidna. She helped her with her experiments, such as the Sanctuary Barrier, though she wasn't told everything as she didn't know that Ryuzu Meyer would be sealed in a crystal. Sometime later, Echidna ordered her to stand guard over the library while she waited for \"that person,\" an order which she diligently followed.!~\n\n~!After numerous and painful attempts to convince her to leave the library Subaru succeeded, and Beatrice became his contract spirit.!~\n\n(Source: Re:Zero Wikia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90181-wRPm0OEaucmw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90181
      },
      "rarity": "rare"
    },
    {
      "id": "roswaal-mathers",
      "name": "Roswaal Mathers",
      "alt_names": [
        "ロズワール・Ｌ・メイザース",
        "Ros-chi"
      ],
      "role": "supporting",
      "description": "~!__Mental age:__ 400+!~\nThe lord of the Roswaal Mansion and a descendant of the original Roswaal.\n\nHe comes across as an eccentric due to his flamboyant appearance and odd speaking style, the latter which he shares with his grandmother. However, he harbors a more calculating and reserved side with a sharp political mind and gaze that reads others quite well.\n\n~!It is later revealed that he is in fact the original Roswaal, Roswaal A. Mathers, who has been possessing his descendants' bodies to meet his teacher Echidna again at any cost, even if that means sacrificing himself or those close to him.!~",
      "metadata": {
        "gender": "male",
        "age": "29-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90182-Ho0NS06tc6NL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90182
      },
      "rarity": "rare"
    },
    {
      "id": "felix-argyle",
      "name": "Felix Argyle",
      "alt_names": [
        "フェリックス・アーガイル",
        "Argail",
        "Ferris (フェリス)",
        "Ferri-chan"
      ],
      "role": "supporting",
      "description": "Felix Argyle commonly known as Ferris, is Crusch Karsten's knight. He is a beast human (demi-human).",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90184-o1ZFF6osCZX7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90184
      },
      "rarity": "rare"
    },
    {
      "id": "crusch-karsten",
      "name": "Crusch Karsten",
      "alt_names": [
        "クルシュ・カルステン",
        "Goddess of War (戦争の女神; Sensou no Megami)",
        "Valkyrie"
      ],
      "role": "supporting",
      "description": "Crusch Karsten is the Matriarch of House Karsten and a candidate to become the 42nd King of Lugnica.\n\nWhile normally calm and serious, Crusch is honest, sincere, right, being a type of person who is destined to stand above others, though she has talent and has worked hard to reach where she is now. She is already the head of her family, finishing her work better than her father. She prefers to act herself and has the pride of a warrior. Crusch is also gentle, often believing the false knowledge jokingly told to her by Ferris, and sometimes displays an airheaded side. Like her mother Helena Karsten, she is shown to be ruthless and reckless.",
      "metadata": {
        "gender": "female",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90185-FR9JHyNe5038.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90185
      },
      "rarity": "rare"
    },
    {
      "id": "puck",
      "name": "Puck",
      "alt_names": [
        "パック"
      ],
      "role": "supporting",
      "description": "__Height:__ 7 cm\n\nPuck is an Artificial Spirit that Emilia was formerly contracted with. He is the current Great Spirit of Fire.\n\n~! He is currently known as the Beast of The End. !~\n\n~! Around 400 years ago, Puck was created by Echidna, though he had apparently left her by the time she moved into the Sanctuary. Seven years before the start of the election, Puck unfroze Emilia and began to act as her friend and mentor, and later on started to live at Roswaal's mansion where he was reunited with Beatrice. !~\n\nPuck can be described as cute or adorable, thus his skin being pink around his cheeks. His fur is mostly grey with silver in certain spots (i.e. tip of the tail). His eyebrows are pretty small and rhombus-shaped. He also has a gold earring on his left ear. Sometimes, he carries a purple bag.\n\nPuck is generally a nice spirit. He is very happy and stays at Emilia's side to protect her, affectionately calling her \"Lia\". He occasionally goofs around and gets along especially well with Beatrice. \n\n~!However, Puck's demeanor greatly changes in loops where Emilia dies, showing a complete disregard for anyone except her, and was even willing to destroy the world because of the condition in their contract.!~",
      "metadata": {
        "age": "420-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90187-xJXlD84KXl3t.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90187
      },
      "rarity": "rare"
    },
    {
      "id": "satella",
      "name": "Satella",
      "alt_names": [
        "サテラ",
        "Witch of Envy"
      ],
      "role": "supporting",
      "description": "Satella is one of the Witches of Sin, being the Witch of Envy. ~! Contrary to popular belief, Satella and the Witch of Envy are separate personalities. Both of them love Subaru, though the Witch of Envy is aggressive about it.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/127242-UVgHhBEnLAJn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127242
      },
      "rarity": "rare"
    },
    {
      "id": "minerva",
      "name": "Minerva",
      "alt_names": [
        "ミネルヴァ",
        "Witch of Wrath"
      ],
      "role": "supporting",
      "description": "Minerva is one of the Witches of Sin, being the Witch of Wrath. Minerva dislikes conflict and wishes for all to be well. She also only cares about what's directly in front of her, not worrying about things she cannot see. Minerva has some history with the elves as she cares deeply for Emilia, along with the other elves.\n\n~!Minerva's main ability is \"Authority of Wrath\". Unlike other authorities this ability is only a support skill. Minerva is able to heal others by attacking any part of their body with her own. The authority also gives her increased speed and strength. The drawback is that every time the authority is used it causes a calamity to happen in another part of the world. The calamity can range from many things such as an earthquake.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137521-Dsa1iCHNG4ib.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137521
      },
      "rarity": "rare"
    },
    {
      "id": "carmilla",
      "name": "Carmilla",
      "alt_names": [
        "カーミラ",
        "Witch of Lust",
        "Faceless Goddess"
      ],
      "role": "supporting",
      "description": "Carmilla is one of the Witches of Sin, being the Witch of Lust. She has no self confidence, being timid, and tends to have downcast eyes. Despite this, others find her similar to a scared animal, making them attracted to her.\n\n~!Carmilla's main ability is \"Authority of Lust\". With this Ability, Carmilla is able to captivate people, making them absorbed in her atmosphere to the point they wouldn't be able to know if someone were to hurt them. She can also make Individuals believe they are seeing and hearing what they want to see and hear, an example is when Subaru saw Rem and heard her when facing Carmilla.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137523-yiY6On9eQ0mc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137523
      },
      "rarity": "rare"
    },
    {
      "id": "typhon",
      "name": "Typhon",
      "alt_names": [
        "テュフォン",
        "Witch of Pride"
      ],
      "role": "supporting",
      "description": "Typhon is one of the Witches of Sin, being the Witch of Pride. She is said to judge people with the innocence and ruthlessness of a young girl. \n\n~!Typhon's main ability is \"Authority of Pride\". With this authority, Typhon is able to tear apart an individuals body if she decides they are guilty of something. The authority is extremely subjective. If the individual feels guilty, Typhon can punish the individual, even if the act may not be something they should be punished for. The ability has one draw back of not being able to work if the individual has little to no thinking capacity.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137524-6YRTpAShlNMJ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137524
      },
      "rarity": "rare"
    },
    {
      "id": "sekhmet",
      "name": "Sekhmet",
      "alt_names": [
        "セクメト",
        "Witch of Sloth"
      ],
      "role": "supporting",
      "description": "Sekhmet is one of the Witches of Sin, being the Witch of Sloth. As her position suggests, she can be summed up to being extremely lazy, enough that she finds breathing to be a pain.\n\n~! Sekhmet's main ability is \"Authority of Sloth\". With this Ability, Sekhmet is able to use a more advanced and improved version of the unseen hand used by Petelgeuse. Unlike Petelgeuse her unseen hand is able to hit individuals and objects with an invisible force without her moving and he can use this power in any direction she chooses. She is cited from Echidna to be the strongest of the witches of sin besides Satella !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137526-Pa3YPDbheK0Z.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137526
      },
      "rarity": "rare"
    },
    {
      "id": "daphne",
      "name": "Daphne",
      "alt_names": [
        "ダフネ",
        "Witch of Gluttony"
      ],
      "role": "supporting",
      "description": "Daphne is one of the Witches of Sin, being the Witch of Gluttony. All she wants is to be full, it's her reason for living. Daphne enjoys giving people nicknames, such as Subarun for Subaru.\n\n~! Daphne's main ability is \"Authority of Gluttony\". With this authority, Daphne is able to cause a individual to have and feel extreme levels of hunger by just touching them or looking at them. When Subaru encountered Daphne it only look one look from her left eye for him to start eating his arm and ignores everything that was going on around him. Echidna states that a look from Daphne's left eye isn't all impressive and the true terror of Daphne comes when she uses her right eye or eats her target. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137527-CwgIs8wHrLfE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137527
      },
      "rarity": "rare"
    },
    {
      "id": "petra-leyte",
      "name": "Petra Leyte",
      "alt_names": [
        "ペトラ・レイテ"
      ],
      "role": "supporting",
      "description": "Petra is a bright and kind girl from Irlam Village. She likes Subaru very much after he saved her from the Wolgarm incident.\n\n~!She became a maid at the Roswaal Mansion after Subaru came back from the witchcult incident. !~",
      "metadata": {
        "gender": "female",
        "age": "12-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b141858-wO0Uj6o4OpUI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 141858
      },
      "rarity": "rare"
    },
    {
      "id": "frederica-baumann",
      "name": "Frederica Baumann",
      "alt_names": [
        "フレデリカ・バウマン",
        "Frederica Tinsel "
      ],
      "role": "supporting",
      "description": "Frederica Baumann is a maid working for Roswaal L. Mathers and a member of the Emilia Camp. She quit her job as a maid a few months before Subaru's appearance, but returned after Ram couldn't manage the mansion ~! after Rem had her name and memories eaten. !~\n\n~! She is the half-sister of [Garfiel Tinsel](https://anilist.co/character/133847/). !~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143378-1pXqjZho4dhz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143378
      },
      "rarity": "rare"
    },
    {
      "id": "ryuuzu-meyer",
      "name": "Ryuuzu Meyer",
      "alt_names": [
        "リューズ・メイエル",
        "Pico",
        "Alma",
        "Bilma",
        "Shima",
        "Delma",
        "Eyes of the Sanctuary"
      ],
      "role": "supporting",
      "description": "Ryuuzu was a half-elf who lived in the Sanctuary during the era of the witches, 400 years ago. She was used by [Echidna](https://anilist.co/character/129330/Echidna) in order to activate the Sanctuary's barrier. During Echidna's immortality experiments, she created copies of Ryuzu and tasked them with protecting the Sanctuary.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b174072-v8hZDRvLIlPA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 174072
      },
      "rarity": "rare"
    },
    {
      "id": "lye-batenkaitos",
      "name": "Lye Batenkaitos",
      "alt_names": [
        "ライ・バテンカイトス"
      ],
      "role": "supporting",
      "description": "Lye Batenkaitos is a Sin Archbishop of the Witch Cult, representing the gourmet aspect of gluttony. Lye is a short individual with long light brown hair, green eyes and teeth shaped like sharp fangs. He wears blue and purple clothes and a witch cult rope, but they are both very dirty and bloodstained. He also has attached daggers to his hands he received from the cult.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b174097-4QaG0jvIft6S.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 174097
      },
      "rarity": "rare"
    },
    {
      "id": "regulus-corneas",
      "name": "Regulus Corneas",
      "alt_names": [
        "レグルス・コルニアス",
        "Sin Archbishop of Greed"
      ],
      "role": "supporting",
      "description": "Regulus is a young man of a medium height. He has gold eyes, white hair and a middle to skinny build. Regulus Is a part of the Sin Archbishops of the Witch Cult and represents greed.  Regulus is known for being very talkative and calls himself unselfish, while in fact he is very prideful and likes to act above others and reference himself as above others.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b174098-8xjd9vK1KmkP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 174098
      },
      "rarity": "rare"
    },
    {
      "id": "meili-portroute",
      "name": "Meili Portroute",
      "alt_names": [
        "メィリィ・ポートルート"
      ],
      "role": "supporting",
      "description": "One of the children that lives in the village within [Roswaal](https://anilist.co/character/90182)'s region. She's timid, though is friendly, such as when she introduces a small dog to [Subaru](https://anilist.co/character/88573). \n~!Meili Portroute is a Demon Beast User.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b175577-lUNPAV3Gujl3.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 175577
      },
      "rarity": "rare"
    },
    {
      "id": "patrasche",
      "name": "Patrasche",
      "alt_names": [
        "パトラッシュ"
      ],
      "role": "supporting",
      "description": "Subaru's Earth Dragon that he officially received from Crusch Karsten for his efforts in the Hakugei battle. Despite being of a species known for being feisty, Patrasche is extremely loyal to Subaru, as she is willing to put her life on the line for him.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b181313-eT4mFPCZj1OZ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 181313
      },
      "rarity": "rare"
    },
    {
      "id": "naoko-natsuki",
      "name": "Naoko Natsuki",
      "alt_names": [
        "菜月菜穂子"
      ],
      "role": "supporting",
      "description": "Subaru's mother.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b182087-yKqHVDQHUdbk.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 182087
      },
      "rarity": "rare"
    },
    {
      "id": "kenichi-natsuki",
      "name": "Kenichi Natsuki",
      "alt_names": [
        "菜月賢一"
      ],
      "role": "supporting",
      "description": "Subaru's father. Subaru idolized his father and wanted to be like him. However, after this proved to be impossible, he went through a downward spiral that ultimately resulted in him becoming a shut-in. \n\nKenichi is hard-working, diligent, and loved by all, which led to a huge amount of expectations being put on Subaru by his surroundings as he is \"Kenichi's Son\", which furthermore increased the burden on him. He was shown to be a very supportive dad which, although always trying to get his son to go out of the house or go back to school, never forgets to put his son's emotional state before it all through physical bonding and father-to-son talks.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b182088-Eq34LOGzm6tL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 182088
      },
      "rarity": "rare"
    },
    {
      "id": "felt",
      "name": "Felt",
      "alt_names": [
        "フェルト",
        "Feruto"
      ],
      "role": "minor",
      "description": "**Height:** 150 cm (4'11\")\n\nA thief that lives in the slums. Felt stole Emilia's insignia, hoping for quick, easy cash. Though Felt can usually handle her own, she does consider Rom to be like family.\n\n~!After being chosen by the insignia, she is forced to participate in the Royal Selection and is currently a candidate to become the 42nd King of Lugunica.!~",
      "metadata": {
        "gender": "female",
        "age": "14-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88574-Hau8t0GlMvhp.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88574
      },
      "rarity": "uncommon"
    },
    {
      "id": "reinhard-van-astrea",
      "name": "Reinhard van Astrea",
      "alt_names": [
        "ラインハルト・ヴァン・アストレア",
        "Kensei (剣聖)",
        "Sword Saint",
        "Knight Implacable"
      ],
      "role": "minor",
      "description": "__Height__: 184 cm (6'0\")\n\nReinhard van Astrea is the current Sword Saint and a member of the Royal Guard, currently acting as [Felt](https://anilist.co/character/88574/Felt)'s knight. \n\nAs the Sword Saint and the Knight of the Royal Guard, Reinhard embodies chivalry and elegance, treating everyone with exceptional respect. He is fair, brave, and always acts in the name of justice, whether on duty or simply strolling through the Royal Capital.\n\nAs a knight, Reinhard only uses his sword when necessary, since, in addition to being a rule, his iron-clad rule is to not inflict pain to others if not absolutely necessary, be it a normal thug or a member of the Witch Cult.",
      "metadata": {
        "gender": "male",
        "age": "19-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88577-oKKnibqGgSSD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88577
      },
      "rarity": "uncommon"
    },
    {
      "id": "anastasia-hoshin",
      "name": "Anastasia Hoshin",
      "alt_names": [
        "アナスタシア・ホーシン",
        "Black Fox",
        "Greedy Princess",
        "Iron Plate Magistrate"
      ],
      "role": "minor",
      "description": "Anastasia Hoshin is the head of the Hoshin Trading Company and a candidate to become the 42nd King of Lugnica. Her knight is Julius Juukulius.\n\nDespite her surname being \"Hoshin\", she's not directly related to Hoshin of the Wilderness. She chose the name because she was inspired by his legacy.",
      "metadata": {
        "gender": "female",
        "age": "22-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90177-K1XztcZqHl3c.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90177
      },
      "rarity": "uncommon"
    },
    {
      "id": "julius-euclius",
      "name": "Julius Euclius",
      "alt_names": [
        "ユリウス・ユークリウス",
        "Julius Juukulius",
        "最優の騎士 (Saiyuu no Kishi)",
        "Valuable Knight",
        "ユーリ (Juli)"
      ],
      "role": "minor",
      "description": "__Height__: 179 cm (5'10\")\n\nJulius Euclius is Anastasia Hoshin's knight and a member of the Royal Guard. Julius lived with his family at the Euclius House. After his father, Klein Euclius died, he started to live with his uncle Alviero and he started to take care of Julius and became his adoptive father.\n\nAs a member of Lugnica's nobility, Julius acts in a proper fashion, always having an air of nobility and conviction. He is also considerate and doesn't forget to show care toward others. He also shows a strict side, giving out accurate assessments of others whether they're good or bad, which is a result of his upbringing as an elite, and in actuality, he believes that he and others can do better than they currently are.\n\nJulius doesn't like those who forget their place, leading him to have bad relations with Subaru for a while. While both have apologized to each other after the battle with the Hakugei, Subaru told him he still hated him. Julius said he didn't intend to be friends. They both became very intimate very quickly during the planning and attacking the Witch Cult. In the end, Julius directly considered Subaru as his friend.",
      "metadata": {
        "gender": "male",
        "age": "21",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90183-LWx59kSa5Vjl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90183
      },
      "rarity": "uncommon"
    },
    {
      "id": "rigel-natsuki",
      "name": "Rigel Natsuki",
      "alt_names": [
        "ナツキ・リゲル"
      ],
      "role": "minor",
      "description": "Natsuki Rigel  is the non canon son of Natsuki Subaru and Rem.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205863-tQ5LTcgmG8ZC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205863
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-23T05:01:57.817Z"
}