{
  "work_id": "ouran-high-school-host-club",
  "count": 15,
  "characters": [
    {
      "id": "haruhi-fujioka",
      "name": "Haruhi Fujioka",
      "alt_names": [
        "藤岡ハルヒ",
        "Haru-chan",
        "Honor Student",
        "Little Piglet",
        "Host Club Dog",
        "Lumpy",
        "Poor Kitten"
      ],
      "role": "protagonist",
      "description": "__Height:__ 155cm (5'1\") \n\nHaruhi Fujioka, the main heroine of the story, is an intelligent freshman attending the prestigious and expensive Ouran High School. She cut her hair short because of a little boy's gum that got stuck in it,  but this action caused the Host club to mistake her for a guy. However, unlike the other students, she is from a commoner family and got into Ouran through a scholarship. On her first day at school, she accidentally breaks a vase worth 8 million yen belonging to the Host Club. As a result, she is forced to work as a host to pay off her debt, and does so by disguising herself as a boy. Soon enough, she naturally takes to acting as a host to other girls, and even finds it enjoyable. However, she does not like to take time away from studying and often finds the antics of the other hosts to be annoying. Haruhi lives with her okama (cross dressing) father. As a result of her mother passing away when she was young, Haruhi has become very independent and never lets anyone worry about her. Although seemingly unflappable, she has a fear of thunderstorms.   \n\n~!Haruhi was very popular back in middle school, and was confessed to at least once a month. However, like Tamaki, she is very dense when it comes to love, and has broken many hearts unintentionally. Later in the manga, she realizes her love for Tamaki, and begins to blush whenever he is around.  Eventually she leaves Japan to study abroad and, of course, the whole club joins her (even Honey and Mori!). In the last chapter of the manga there's a picture of Tamaki and her getting married.!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b18-SAz5kAo2Fhm1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18
      },
      "rarity": "legendary"
    },
    {
      "id": "tamaki-suou",
      "name": "Tamaki Suou",
      "alt_names": [
        "須王環",
        "Tamaki Suoh",
        "Tama-chan",
        "Daddy",
        "The Host Club King",
        "Lonesome Prince",
        "Lord",
        "Boss",
        "Milord"
      ],
      "role": "protagonist",
      "description": "__Height:__ 183 cm (6’0\")\n\nTamaki Suoh is the half-French half-Japanese founder and president of the Ouran High School Host Club. Tamaki is flamboyant, emotional, and narcissistic; however, he is extremely dedicated to his duties as a host. He is the “prince” host type, who can charm any girl with sweet talk, though he is always truthful in his compliments. To him, all girls are pretty, and the happiness of his guest is his greatest enjoyment. \n\nTamaki acts as the main comic relief in the series, exemplified in his extremely dense and naïve approach to his own feelings, and extreme emotional reactions to Haruhi’s comments about his stupidity. He has a family complex, as he asks Haruhi to call him “Daddy” and refers to Kyoya as “Mommy”. He is shown to be partial to classical piano music and plays extremely well; one of his favorite pieces being Mozart’s Sonata for Two Pianos in D Major.   \n\n~!Tamaki's full name is Rene Tamaki Richard Grantaine. His father, the superintendent of Ouran Academy, fell in love with Tamaki’s French mother and divorced his first wife to marry her. For that reason, Tamaki’s paternal grandmother harbors a strong hatred towards Tamaki. Nevertheless, he is constantly trying to get her to accept him as part of the Suoh family. Because of his family situation, Tamaki sees the Host Club as one big family and tries to maintain that illusion, to the extent of telling himself that his love for Haruhi is fatherly even when it is clearly not.  Later in the manga, Tamaki has been close to Haruhi even though he says it's almost like a father, but he says to Kanoya (who has been said to seem like Haruhi) while in a game that he says the reason why he hasn't been cheerful is because of his stricken love for Haruhi.!~",
      "metadata": {
        "gender": "male",
        "age": "17-19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b19-7Ot7WSWZ7LKF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 19
      },
      "rarity": "legendary"
    },
    {
      "id": "mitsukuni-haninozuka",
      "name": "Mitsukuni Haninozuka",
      "alt_names": [
        "埴之塚光邦",
        "Honey"
      ],
      "role": "protagonist",
      "description": "__Height:__ 145 cm (4'9\")\n__Grade:__ Third Year, Class A \n\nMitsukuni Haninozuka (a.k.a. Honey-senpai) is a cake-loving, childish senior with an elementary school appearance. He attracts customers with his “shotacon” cuteness – however, he is also extremely talented at fighting. He can send people flying with one kick, and has been told by the Japanese Defense Minister to never show his full power for fear of other countries thinking Japan had a weapon of mass destruction. He learned his skills from his father, the owner of a famous dojo. Because of him, Honey tried to act like a “real man” for some time, but after Tamaki convinced him that liking cute things was not bad, Honey dropped his façade and joined the host club along with Mori, his cousin and the person he is often seen around with. Honey carries a stuffed bunny named “Bun-bun” (in Japanese, it is called “Usa-chan”, an abbreviation of usagi, meaning rabbit) that his beloved grandmother made for him. Like Kyouya, Honey is very ill-tempered when he wakes up, and gets very violent towards those that disturb his sleep.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b20-VNIsuFhxyiJu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 20
      },
      "rarity": "legendary"
    },
    {
      "id": "takashi-morinozuka",
      "name": "Takashi Morinozuka",
      "alt_names": [
        "銛之塚崇",
        "Mori"
      ],
      "role": "protagonist",
      "description": "__Height:__ 192 cm (6'4\") \n__Grade:__ Third Year, Class A \n\nTakashi Morinozuka is a tall, stoic, but kind upperclassman who is Honey-senpai’s constant companion. The Morinozuka family had protected and served the Haninozuka family for many generations but marriage joined the families two generations ago, breaking the master-servant tradition. Despite that, Mori still faithfully protects Honey and attends to his wishes. His protectiveness extends to his classmates and fellow host club members, gaining him a certain level of respect. He does not talk very much and is considered the “wild” (“strong and silent” in the dub) type. However, when he is tired, he becomes uncharacteristically talkative and flirtatious. Mori’s hobbies include kendo and karate. He's the only member of the Host Club to call Honey-senpai by his first name.",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21-anlrcOlyRHgO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21
      },
      "rarity": "legendary"
    },
    {
      "id": "hikaru-hitachiin",
      "name": "Hikaru Hitachiin",
      "alt_names": [
        "常陸院光",
        "Hika-chan"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm (5'9\")\n\nHikaru Hitachiin is a devious and childish first-year student who greatly enjoys toying with his fellow Host Club members Haruhi and Tamaki (whom he often calls, “My Lord”). He and his younger identical twin, Kaoru, are “little devil” type hosts who put on an act of “forbidden brotherly love” (with Hikaru as the seme) to draw in their clients. Unlike Tamaki, the Hitachiin brothers are wholly calculating in their customer relations; however, this is because of their deep dependency on each other, and a reluctance to let anyone into their world. They share a deep emotional bond, which was forged through a lonely childhood and the painful fact that no one could ever tell them apart without looking at the parting of their hair (Hikaru’s hair parts to the right; Kaoru’s parts to the left). Since Haruhi is the first person that can truthfully tell them apart, they greatly treasure her friendship. Haruhi has stated that Hikaru and Kaoru have their differences, despite being identical twins. Of the two, Hikaru is a little more in control of their twincest acts but is also more childish and immature than Kaoru though he is the older twin.\n\n~!Tamaki was the one who coerced the brothers into joining the Host Club in their last year of middle school. Since they told him they would join if he could guess which one was Hikaru, Tamaki repeatedly followed them around, tossing out random guesses as to who was Hikaru and who was Kaoru. They finally crumbled and decided to join, which was their first step towards a greater exposure to a world outside of their own. Later in the manga, both Hikaru and Kaoru fall in love with Haruhi; although she has already rejected him once, Hikaru is determined to not lose to Tamaki. Eventually, however, Hikaru accepts that Haruhi loves Tamaki, and instead encourages her to confess to him, saying he is over her and wants her and Tamaki to get together (although he always looks pained as he says this).!~",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22-Xikbs9JJ9Qop.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22
      },
      "rarity": "legendary"
    },
    {
      "id": "kyouya-ootori",
      "name": "Kyouya Ootori",
      "alt_names": [
        "鳳鏡夜",
        "Kyo-chan",
        "Mommy",
        "Shadow Prince",
        "Low Blood Pressure Demon Lord"
      ],
      "role": "protagonist",
      "description": "__Height:__ 180 cm (5’11”)  \n\nKyouya Ootori, a second year student at Ouran Gakuen, is the sly and calculating vice-president of the Host Club founded by his best friend and polar opposite, Tamaki Suoh. Despite Tamaki being president, Kyoya truly runs the club and plays the role of a puppet-master behind the scenes, earning him the nickname “Shadow King”. He takes care of the Host Club’s expenses and will even sell items belonging to the host club members (such as Haruhi’s pencil) for profit. In his words, “use whatever is at hand, be it friend or foe.” Almost everything he does is for his own benefit, but he can occasionally display a selfless side. He is the third son of his very wealthy and influential family; thus, if he wants to take over his family's business, he must work extremely hard to meet his strict father’s high expectations. Also, Kyoya's bad temper when waking up in the morning has earned him the name “Low-Blood Pressure Evil Lord.\"",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23-8TQAV1BRyqxa.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23
      },
      "rarity": "legendary"
    },
    {
      "id": "kaoru-hitachiin",
      "name": "Kaoru Hitachiin",
      "alt_names": [
        "常陸院馨",
        "Kao-chan"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm (5'9\") \n\nKaoru Hitachiin is a devious and childish first-year student who greatly enjoys toying with his fellow Host Club members, Haruhi and Tamaki (whom he often calls “My Lord”). He and his older identical twin, Hikaru, are “little devil” type hosts who put on an act of “forbidden brotherly love” (with Kaoru as the uke) to draw in their clients. Unlike Tamaki, the Hitachiin brothers are wholly calculating in their customer relations; however, this is because of their deep dependency of each other and a reluctance to let anyone into their world. Hikaru and Kaoru share a deep emotional bond, which was forged through a lonely childhood and through the fact that no one could tell them apart without looking at the parting of their hair (Hikaru’s hair parts to the right; Kaoru’s parts to the left). Since Haruhi is the first person that can truthfully tell them apart, they greatly treasure her friendship. Haruhi has stated that Hikaru and Kaoru have their differences, despite being identical twins. Of the two, Kaoru is nicer, more mature, and considerate of others.",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24-QssbnrJO2Cfz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24
      },
      "rarity": "legendary"
    },
    {
      "id": "renge-houshakuji",
      "name": "Renge Houshakuji",
      "alt_names": [
        "宝積寺れんげ"
      ],
      "role": "supporting",
      "description": "The Host Club's (self-proclaimed) manageress who tends to be very loud and outspoken. She grew up in France before she came to attend Ouran right after she see Kyoya int a picture her dad gave her from a meeting. Renge first came across the Host Club by maintaining the belief she was Kyoya's fianc&eacute;e despite never having met him in person. This is due to her love of visual novel-type video games to a point that she sometimes confuses them with real life. Her fascination with Kyoya originated from her obsession with one such dating game. Still, her experience with dating sims causes her to be more aware of character development and a thickening plot. Tamaki initially allowed Renge to become the host club's manager in hopes that she would be a female friend to Haruhi and inspire her to act and dress more feminine.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b25-EFSvaBRwzbNF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 25
      },
      "rarity": "rare"
    },
    {
      "id": "umehito-nekozawa",
      "name": "Umehito Nekozawa",
      "alt_names": [
        "猫澤梅人"
      ],
      "role": "supporting",
      "description": "A hooded figure holding a cat puppet named Beelzenef, Umehito Nekozawa  hates bright light to the point that he calls anyone who drags him into the light as &#039;murderers&#039;. The Black Magic Club&rsquo;s president, he tries to get people to join his club though is not too successful. However, anyone who joins gets a free &quot;Beelzenef&quot; doll. Nekozawa has one as a puppet, but it is also available as a wooden doll. Nekozawa claims that if you write the name of the person you hate on the back of the doll, the person will be showered with misfortunes. Tamaki, especially, is superstitious about Nekozawa&#039;s curses due to having experienced them first-hand, or so he believes.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/1133.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1133
      },
      "rarity": "rare"
    },
    {
      "id": "shirou-takaouji",
      "name": "Shirou Takaouji",
      "alt_names": [
        "鷹凰子嗣郎",
        "Shiro Takaoji"
      ],
      "role": "supporting",
      "description": "~!Renge categorized him as the naughty type. He resembles Tamaki as a child. Shirou declares that he&rsquo;s serious about becoming a host - there&rsquo;s no time left and he needs to learn how to make women happy. But what he really wants is to make Kamishiro Hina happy before she moves away.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1134-pDAU7BbY9QC1.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1134
      },
      "rarity": "rare"
    },
    {
      "id": "tooru-suzushima",
      "name": "Tooru Suzushima",
      "alt_names": [
        "珠洲島亨"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1135-1v0X6z7UALzP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1135
      },
      "rarity": "rare"
    },
    {
      "id": "ryouji-fujioka",
      "name": "Ryouji Fujioka",
      "alt_names": [
        "藤岡涼二",
        "Ranka"
      ],
      "role": "supporting",
      "description": "Haruhi&#039;s father works at an okama (cross dressing) bar. He says that he was originally bisexual, but turned to cross-dressing after his wife&#039;s death because he could never love another woman. In contrast to Haruhi&#039;s practicality and lack of interest in material things, he is rather bad with money, and buys girly clothing for Haruhi in the hopes of getting her to dress more cutely. Haruhi&#039;s stubborn self-reliance causes her father to worry about her a lot; he would like to be more involved in her life and do more things for her, but she rarely lets him. However, the two of them do have a clearly loving relationship. While her father would like to be able to take care of Haruhi, it seems that often Haruhi ends up taking care of him instead.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1136-tRJgxS6AjZsy.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1136
      },
      "rarity": "rare"
    },
    {
      "id": "yoshio-ootori",
      "name": "Yoshio Ootori",
      "alt_names": [
        "鳳敬雄"
      ],
      "role": "supporting",
      "description": "Patriarch of the Ootori family, Yoshio is portrayed as a cold, calculating father. Kyoya tries hard to please him in order to become heir of the family, despite the fact that his father is apparently a cold and uncompromising man, who shows no understanding for his children and has planned out the lives of his sons as his own successors already.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1137-blQqHNjj8riN.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1137
      },
      "rarity": "rare"
    },
    {
      "id": "fuyumi-ootori",
      "name": "Fuyumi Ootori",
      "alt_names": [
        "鳳芙裕美"
      ],
      "role": "supporting",
      "description": "Kyoya&#039;s older sister. She clearly cares for her younger brother and tries to help him in life; apparently she is somewhat lacking in the areas of housework and organization, but she appears to be a kind-hearted person",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1138-CqY8DhESlaQz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1138
      },
      "rarity": "rare"
    },
    {
      "id": "kirimi-nekozawa",
      "name": "Kirimi Nekozawa",
      "alt_names": [
        "猫澤霧美"
      ],
      "role": "supporting",
      "description": "An absolutely adorable little sister of Nekozawa, she is afraid of the dark and as a result the two siblings were not able to be around one another.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/1139.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1139
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T07:04:59.830Z"
}