{
  "work_id": "blood-blockade-battlefront",
  "count": 15,
  "characters": [
    {
      "id": "leonardo-watch",
      "name": "Leonardo Watch",
      "alt_names": [
        "レオナルド・ウォッチ",
        "Leo"
      ],
      "role": "protagonist",
      "description": "A kind and humble young photographer who came to Hellsalem's Lot to help his ailing sister. A mysterious entity gave him the \"All-seeing Eyes of God,\" granting him a variety of ocular powers, at the cost of his sister's sight.",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89025-mUe7SN8rIaWP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89025
      },
      "rarity": "epic"
    },
    {
      "id": "klaus-von-reinherz",
      "name": "Klaus von Reinherz",
      "alt_names": [
        "クラウス・V・ラインヘルツ"
      ],
      "role": "protagonist",
      "description": "The leader of Libra and young head of the noble Reinherz family. A large, very powerful man with a distinctive underbite, he is actually very well composed and gentlemanly and honest to a fault, with an unshakable will. Master of the Brain Grid Blood Battle Style, which he can use to create large cross-shaped weaponry and seal away vampires. \n\n~!The sealing power he owns is to seal away vampires only under a certain condition: knowing the vampire's real name.!~\n\nKlaus is also very intelligent, being able to play the game \"Prosfair,\" the complexity of which is known to drive humans mad (Klaus himself begins to bleed internally after playing the game for 99 hours without a break) and is a game usually reserved only for one distinct species in Hellsalem's Lot that has studied it for a thousand years.",
      "metadata": {
        "gender": "male",
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89106-nhuUmojcyv9w.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89106
      },
      "rarity": "epic"
    },
    {
      "id": "zapp-renfro",
      "name": "Zapp Renfro",
      "alt_names": [
        "ザップ・レンフロ"
      ],
      "role": "protagonist",
      "description": "Described as a hotheaded, hyper-sexual juvenile punk, he is easily annoyed, quick to lose his temper, and his juvenile actions often get him and others into trouble.\n\nDespite this, he is supposedly good at looking after new members, and so was assigned as Leo's partner/bodyguard. He is also something of a ladies man, possessing several lovers in town.\n\nFor reasons unknown, he continuously tries to fight Klaus, only to be routinely smacked down.",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/89130-W0uwE4ZDzcUq.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89130
      },
      "rarity": "epic"
    },
    {
      "id": "mary-macbeth",
      "name": "Mary Macbeth",
      "alt_names": [
        "メアリー・マクベス",
        "White"
      ],
      "role": "supporting",
      "description": "A mysterious girl who approached Leonardo Watch after he recovered from his injury. She is the younger sister of [Black](https://anilist.co/character/89131).\nShe doesn't appear in the manga, and thus is an anime-only character.\n\n(Source: Kekkai Sensen Wiki)",
      "metadata": {
        "gender": "female",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/89024-uJT3MHnj3t1v.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89024
      },
      "rarity": "rare"
    },
    {
      "id": "william-macbeth",
      "name": "William Macbeth",
      "alt_names": [
        "ウィリアム・マクベス",
        "Black",
        "Will"
      ],
      "role": "supporting",
      "description": "A fairly talkative person with a sweet and caring nature, he is also a rather awkward individual. Upon meeting [Leonardo](https://anilist.co/character/89025/) for the first time, he readily introduces himself and acts in a relaxed and friendly manner.\n\nDuring Leo and Black’s lunch together, it is established that the two have a lot in common, especially when it comes to having low self-esteem. Black is shown to feel rather insecure about himself and his abilities, showing no hesitation in talking down on himself when recounting memories of being bullied in his younger years. Along with this, Black is also shown to be awkward and clumsy when he spills his drink all over himself in front of Leo, and is shown to panic in the embarrassing situation in an exaggerated manner.\n\nHe is White's older brother. Black is incredibly protective of his younger twin sister [White](https://anilist.co/character/89024), as seen in multiple occasions throughout the series, especially when he is seen desperately trying to keep the King of Despair from involving her in his plans. As children, he and White were raised lovingly by their parents, however Black began to develop feelings of being lesser than his family due to the fact he saw himself as emotionally weak. He came to this conclusion when he and White were making mud balls together when they were very little, and when White made better a mud ball than him he used his psychic powers to burst the ball out of frustration. He expected White to start crying, but instead she just went straight to making another mud ball, and Black ended up being the one crying. Due to this, Black felt as though he was much weaker than his sister, and showed great self-restraint in distancing himself from his powers as much as possible in order to try to better himself as a person, even going as far as letting bullies beat him up without fighting back.\n\n(Source: Kekkai Sensen Wiki)",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/89131-5DsXxlYdHbbd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89131
      },
      "rarity": "rare"
    },
    {
      "id": "kk",
      "name": "K.K.",
      "alt_names": [
        "K.K."
      ],
      "role": "supporting",
      "description": "K.K. is a lively and confident Libra member who sports an eye. Typically cheerful, she cares deeply for her comrades & sons, whom she treasures above all else.\n\nShe seems to have a slight complex about her age and figure, and openly dislikes being around Steven, whom she refers to as 'Scarface'. She shares a much closer relationship to Klaus, whom she describes as a perfect gentleman and the leader of her organization.",
      "metadata": {
        "gender": "female",
        "age": "36",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89132-huPm18LuMVj1.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89132
      },
      "rarity": "rare"
    },
    {
      "id": "femt",
      "name": "Femt",
      "alt_names": [
        "堕落王フェムト",
        "King of Depravity"
      ],
      "role": "supporting",
      "description": "Sadistic and clearly insane, Femt lives for excitement & can't stand anything 'normal'. In a city full of people willing to start their own millenium reich, even Zapp acknowledges that Femt is the worst.\n\n(Source: Kekkai Sensen Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/89133-G5aGGGhlxmhQ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89133
      },
      "rarity": "rare"
    },
    {
      "id": "aligura",
      "name": "Aligura",
      "alt_names": [
        "アリギュラ",
        "Queen of Monomania"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/89134-FD72x7MHHpZa.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89134
      },
      "rarity": "rare"
    },
    {
      "id": "blitz-t-abrams",
      "name": "Blitz T. Abrams",
      "alt_names": [
        "Lucky"
      ],
      "role": "supporting",
      "description": "Outwardly jovial for the most part, he seems entirely unaware why people go out of their way to avoid him, and can come off as insensitive, such as when he chastised Leo for damaging an eye, telling him to 'sacrifice an arm' next time.\n\n(Kekkai Sensen Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/89135-duIho6PzYkFF.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89135
      },
      "rarity": "rare"
    },
    {
      "id": "chain-sumeragi",
      "name": "Chain Sumeragi",
      "alt_names": [
        "チェイン・皇"
      ],
      "role": "supporting",
      "description": "While diligent in the field, she can sometimes come off as cruel or indifferent towards others, such as when she seemingly ignored Leo when he was being mugged, only to win his earning back later.\n\nDespite this, she can also be quite sadistic, often causing physical harm to others, usually Zapp, with whom she doesn't get along. However, she does show some protectiveness towards her friends, as shown when she refused to give her friend Angelica's phone number to Zapp who kept pestering her.\n\nChain is a competitive drinker. She can down dozens of shots of alcohol in one sitting.",
      "metadata": {
        "gender": "female",
        "age": "21",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89136-MhZk5Jz6nizx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89136
      },
      "rarity": "rare"
    },
    {
      "id": "steven-a-starphase",
      "name": "Steven A. Starphase",
      "alt_names": [
        "スティーブン・Ａ・スターフェイズ",
        "Steven Alan Starphase"
      ],
      "role": "supporting",
      "description": "__Occupation:__ Fang Hunter\n\nSteven Alan Starphase is Libra's second-in-command. A shady man with many connections, and a genius of deception and intuition. Seemingly laid back, he gives off an air of a suave businessman, always with a quip or sardonic comment to make about the situation. When crossed, however, he shows a ruthless side, and is not above using his connections to make 'problems' disappear. Steven is the middle child in his family and he has at least two sisters, one older and one younger.",
      "metadata": {
        "gender": "male",
        "age": "32",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89137-1PaZUcDzeKpq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89137
      },
      "rarity": "rare"
    },
    {
      "id": "zed-obrien",
      "name": "Zed O'Brien",
      "alt_names": [
        "ツェッド・オブライエン"
      ],
      "role": "supporting",
      "description": "A stern merman with similar powers to Zapp, as they were both taught by the same master. Joins Libra after being abandoned in Hellsalem's Lot. A stark contrast to Zapp, Zed is a decidedly serious individual who has little patience for nonsense, particularly those of his fellow disciple.\n\nAs a merman, he has yellow eyes, blue skin with black markings adorning his head & wrist-blades that extend backwards like fins. He wears a black, sleeveless muscle-shirt, finger-less gloves & green cargo pants with metal sneakers. There is also a water breathing apparatus around his neck with a very sleek design, making them look like headphones.\n\nHe is also usually quiet and easy to get along with, going with the flow of events and tries to be agreeable. He is very well read, often seen reading books in his spare time due to the fact that in the past his creator, an unknown count, talked with him a lot about poetry and music, art and science, philosophy, astronomy etc. In addition, he feels a strong sense of loneliness as he is the only one of his kind, since he is a heteromorph who is half fish half human and is therefore not human but also not a creature from Hellsalem’s lot and as a result is rejected by both species.",
      "metadata": {
        "gender": "male",
        "age": "13 (leap year), 52 years old",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124707-jx7VCtRBv5k2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124707
      },
      "rarity": "rare"
    },
    {
      "id": "dog-hummer",
      "name": "Dog Hummer",
      "alt_names": [
        "ドグ ハマー"
      ],
      "role": "supporting",
      "description": "A handsome man who had his blood replaced with the liquefied body of the serial killer and \"bad boy\" Deldro Brody.",
      "metadata": {
        "gender": "male",
        "age": "23",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124708-AJmQZRCufGzL.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124708
      },
      "rarity": "rare"
    },
    {
      "id": "gilbert-f-altstein",
      "name": "Gilbert F. Altstein",
      "alt_names": [
        "ギルベルト F アルトシュタイン"
      ],
      "role": "supporting",
      "description": "Klaus' butler and a member of Libra that handles most of their intelligence network.",
      "metadata": {
        "gender": "male",
        "age": "78",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124709-TNxVdD7opUuX.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124709
      },
      "rarity": "rare"
    },
    {
      "id": "deldro-brody",
      "name": "Deldro Brody",
      "alt_names": [
        "デルドロ ブローディ",
        "Bad Boy"
      ],
      "role": "supporting",
      "description": "Brody can materialize as a gigantic living armour that surrounds Hummer, granting him immense physical strength.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124710-oBzeHjtMrAxl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124710
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T22:57:36.915Z"
}