{
  "work_id": "a-silent-voice",
  "count": 18,
  "characters": [
    {
      "id": "shouko-nishimiya",
      "name": "Shouko Nishimiya",
      "alt_names": [
        "西宮硝子",
        "Shoko",
        "Shou",
        "Sho",
        "Sho-chan"
      ],
      "role": "protagonist",
      "description": "A young, deaf transfer student with an amazingly positive outlook on life. Despite being a victim of continuous bullying, she always keeps a smile on her face.",
      "metadata": {
        "gender": "female",
        "age": "12-20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b80243-RzxE51iUU5eq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 80243
      },
      "rarity": "epic"
    },
    {
      "id": "shouya-ishida",
      "name": "Shouya Ishida",
      "alt_names": [
        "石田将也",
        "Shou",
        "Yashou",
        "Sho-Chan",
        "Cho-ya"
      ],
      "role": "protagonist",
      "description": "__Height:__ 183 cm\n\nThe main character and narrator. Ishida bullied Nishimiya Shouko in elementary school and when she transferred away, he was ostracized and bullied by his former friends. He started to ignore those around him (imagining them with a large X across their face) and was driven to the point of suicide. He changed his mind after he apologized to Nishimiya and began to spend time with her. He learned sign language specifically so he could apologize to her and is shown to be very talented in it. He feels like he hasn't been punished enough for bullying Nishimiya and often wishes he could kill his younger self. He seems resigned to the fact that he will never be able to have friends again.",
      "metadata": {
        "gender": "male",
        "age": "12-20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b80491-NK6pxb6oH61P.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 80491
      },
      "rarity": "epic"
    },
    {
      "id": "yuzuru-nishimiya",
      "name": "Yuzuru Nishimiya",
      "alt_names": [
        "西宮結絃"
      ],
      "role": "supporting",
      "description": "Shouko's younger sister who is currently a middle school student. She cut her hair short so their mother would not cut Shouko's and has kept it that way ever since; due to this, she is often mistaken for a boy, with Ishida even thinking that she is Shouko's boyfriend at first.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89335-3fy5a7Qa9h9J.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89335
      },
      "rarity": "rare"
    },
    {
      "id": "naoka-ueno",
      "name": "Naoka Ueno",
      "alt_names": [
        "植野直花"
      ],
      "role": "supporting",
      "description": "A girl from Ishida and Nishimiya's elementary school and the girl that Ishida was closest to at school. Ishida remembers her bossing him about and also being his main helper in bullying Nishimiya. After having separated from him since middle school graduation, Ueno runs into Ishida years later, herself now working in a cat café. \n\n~!It is revealed that Ueno is in love with Ishida and originally picked on Nishimiya to impress him, however when she learned that Nishimiya was cleaning the offensive words off Ishida's desk before he could see them she convinced herself that Nishimiya also loved Ishida and was using her disability to get his attention, leading her to grow jealous and resentful toward Nishimiya. However, unlike Ishida, Ueno never learns her lesson and continues to hate and bully Nishimiya once she reconnects with her through Kawai and Sahara (whom she remained friends with). Ueno watched Ishida suffer through middle school—still being bullied for what he did to Nishimiya—and feels bad herself for being unable to do anything. She claims that their sadness, from her having to cut off contact with Ishida to him hating everyone, including her, have all been because of Nishimiya. In truth, however, Ueno is irritated because Nishimiya never defends herself whenever she is bullied, thinking of her as a weak person because of this. Despite being within the group of friends, Ishida still imagines Ueno with an X over her face, showing his disgust with her, until after his release from the hospital, after which Ueno is dragged by Sahara to become her assistant as a model.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124026-KcQmX7heg7im.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124026
      },
      "rarity": "rare"
    },
    {
      "id": "miyako-ishida",
      "name": "Miyako Ishida",
      "alt_names": [
        "石田美也子"
      ],
      "role": "supporting",
      "description": "A kind and loving single mother of Shouya and his older sister who owns a hair salon. She cares for her granddaughter Maria as well as Ishida and often lets Yuzuru stay around the house. She became disappointed upon learning that Ishida bullied Nishimiya and had to pay 1.7 million yen for all the hearing aids Ishida broke.\n\n~!When Ishida pays her back with the intention of killing himself afterwards, she reveals that she had been aware of his plans and threatens to burn the money if he tries to kill himself again—leaving her with nothing. Unfortunately, she accidentally burns the money anyway.\n\nAfter Ishida ends up in a coma, she becomes awkward around Nishimiya, despite trying to remain polite.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124030-YoZ0Drg5cHXX.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124030
      },
      "rarity": "rare"
    },
    {
      "id": "maria-ishida",
      "name": "Maria Ishida",
      "alt_names": [
        "石田マリア"
      ],
      "role": "supporting",
      "description": "Ishida's young niece who lives with Ishida and his family. Maria is half-Japanese from her mother's side and half-Brazilian from her father's side.\n\n~!She gains a constant wonder about the difference between things that are dead and alive after Ishida's fall and fearing he might be dead, Yuzuru takes it upon herself to teach her the difference—being an expert on the matter.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124031-ErVGKjxFH56V.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124031
      },
      "rarity": "rare"
    },
    {
      "id": "miki-kawai",
      "name": "Miki Kawai",
      "alt_names": [
        "川井みき",
        "Kawaiichi"
      ],
      "role": "supporting",
      "description": "Nicknamed \"Kawaiichi,\" Kawai was the school representative at Ishida's elementary school. She is popular and normally takes charge of situations and is shown to be kind to everyone; however, all her actions seem to have her academic reputation in mind. Kawai is also a narcissist who believes that everyone should love her, as well as wants to be the victim in every problem she faces.\n\n~!Though she never actually insulted Nishimiya, Kawai did nothing to intervene and even laughed alongside her friends, making her also responsible for Nishimiya's transfer. Kawai's accusation of Ishida being a bully is a catalyst to his isolation among his classmates. Kawai becomes Ishida's classmate again in high school and takes part in Nagatsuka's film shooting, bringing Mashiba, whom she has a crush on, in tow. It is revealed that Kawai has always been scared of Ishida and accuses him of not wanting to face the truth, again a catalyst to his falling out with his film crew. Later, when she tells the class that they will make paper cranes as a wish of recovery for Ishida, who is hospitalized after saving Nishimiya, her classmates are disgusted and secretly bully her. Having to experience the feeling of getting bullied for the first time, Kawai resolves to become more empathetic with others. At the end of the series, Kawai presents Ishida with the paper cranes made by their classmates and follows Mashiba to study to become a teacher.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124033-UThOFdQGZjq7.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124033
      },
      "rarity": "rare"
    },
    {
      "id": "satoshi-mashiba",
      "name": "Satoshi Mashiba",
      "alt_names": [
        "真柴智"
      ],
      "role": "supporting",
      "description": "A boy who becomes interested in and joins Ishida's group of friends upon learning they are making a movie. He is eager to be the leading actor and is considered handsome and talented enough to do so. Mashiba was lonely as a child and the other children took him for granted and bullied him, now he is completely intolerant of bullies in any form, and while generally calm and level-headed, he reacts violently to any random act of bullying he sees.\n\n~!He is oblivious to Kawai's crush on him until Ishida points it out. It is later revealed that Mashiba befriends Ishida because of his social awkwardness and never being able to fit in at school despite trying to; by hanging out with Ishida—believing him to be even stranger than he is—he would appear normal. However, this only makes him feel that he should be the least important in the group. Thus, when Ishida asks Mashiba to hit him after the former reveals his bullying records, he calmly does so. Mashiba is the first to reconcile with Ishida upon his release from the hospital and later studies to become a teacher after graduation.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124034-94AX4zhTaQZB.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124034
      },
      "rarity": "rare"
    },
    {
      "id": "tomohiro-nagatsuka",
      "name": "Tomohiro Nagatsuka",
      "alt_names": [
        "永束友宏"
      ],
      "role": "supporting",
      "description": "A short, fat, and lonely boy who is a habitual liar. When someone tries to steal Nagatsuka's bike, Ishida offers his to be taken instead. Nagatsuka sees this act of kindness as an unbreakable act of friendship and swiftly becomes Ishida's self-proclaimed best friend and starts to idolize Ishida. He is shown to be quite obsessive and protective of Ishida and often dislikes him befriending other people. However, Nagatsuka is also supportive of Ishida and often offers advice. He has plans to become a millionaire, so is willing to hand out money to friends and is keen to become a film director—entering himself and Ishida into a film competition. It is shown both Ueno and Kawai find Nagatsuka repulsive, while Ishida is uncomfortable that Nagatsuka is so willing to take his side when he knows so little about him. Though his film proves to be a failure, this only made Nagatsuka resolved to take up film studies as his college subject.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124035-Il86uF1hboRA.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124035
      },
      "rarity": "rare"
    },
    {
      "id": "ito-nishimiya",
      "name": "Ito Nishimiya",
      "alt_names": [
        "西宮いと"
      ],
      "role": "supporting",
      "description": "Shouko and Yuzuru's maternal grandmother. A caring, wise woman, she cared for Nishimiya and Yuzuru when their father left and their mother was at work. She bought Yuzuru her first camera and tries to convince Yuzuru that her mother means well for both her and her sister.\n\n~!Ito dies of old age and leaves a letter that Yuzuru asks Ishida to read at the funeral. The letter tries one last time to convince Yuzuru to forgive her mother, but she grows angry and does not hear the end of it.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124036-smBYAumpnds2.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124036
      },
      "rarity": "rare"
    },
    {
      "id": "yaeko-nishimiya",
      "name": "Yaeko Nishimiya",
      "alt_names": [
        "西宮八重子"
      ],
      "role": "supporting",
      "description": "A cold woman, who after catching a virus from her husband during pregnancy, left Shouko deaf. Yaeko's husband's family quickly filed for a divorce. When her husband left, she was pregnant with Yuzuru and her mother helped her raise both her daughters. \n~!Eventually, she left her mother to care for the children permanently while she works—causing problems in her relationship with Yuzuru—not helped by the fact Yuzuru frequently skips school to take photos of dead animals. She made Shouko stay at the elementary school where she was bullied for so long in the hopes it would toughen her up and prepare her for how people would treat her. She planned to cut Shouko's hair like a boy to make her look tougher, but Yuzuru cut her own hair instead in protest. She hates Shouya and feels he can never atone for the happy school years he stole from her daughter. Upon seeing him again years after he left school, she slaps him; however, after her mother's death, she begins to warm up to Ishida and thanks him for being Yuzuru's friend.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124037-3KFDLRIT66Bn.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124037
      },
      "rarity": "rare"
    },
    {
      "id": "miyoko-sahara",
      "name": "Miyoko Sahara",
      "alt_names": [
        "佐原みよこ"
      ],
      "role": "supporting",
      "description": "A kind girl from Ishida and Nishimiya's elementary school. She was the only person willing to make an effort to learn sign language and befriend Nishimiya.\n\n~!Sadly, this singled her out for bullying too, and started to take all her classes in the nurse's office. Ishida finds Sahara several years later so she can reconnect with Nishimiya, and she becomes her friend again. She was always and is still bullied by Ueno for her unorthodox sense of fashion, however, the two remain close even after they separated and Sahara boldly claims they are now best friends. Sahara has grown very tall during the time-skip and due to her high heel boots appears even taller. After Ishida, Sahara spends the most time with the Nishimiya family; however, their relationship is briefly strained when Ishida decides to cut off all ties with his friends by insulting them, claiming that Sahara is always the first to run away from a problem. Sahara later texts Ishida asking how he could prove that he has grown up; this motivates him to risk his life-saving Nishimiya during her attempted suicide. Fed up with Ueno always blaming Nishimiya for everything, she chooses to take Nishimiya's side and defends her from being attacked by Ueno during Ishida's hospitalization. After graduating from high school, Sahara goes to Tokyo to become a runway model, bringing an unwilling Ueno with her.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124038-tmsS0TUxwx87.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124038
      },
      "rarity": "rare"
    },
    {
      "id": "kazuki-shimada",
      "name": "Kazuki Shimada",
      "alt_names": [
        "島田一旗"
      ],
      "role": "supporting",
      "description": "Ishida's best friend in elementary school. He helped him bully Nishimiya.\n\n~!When Nishimiya moved away, Shimada placed all the blame on Ishida and soon became the ringleader of the people bullying Ishida: frequently stealing his shoes, beating him up, and writing threats and cruel things on his desk in chalk every morning. Ueno wants Ishida and Shimada to be friends again and gets Ishida to the amusement park where Shimada is now working, but Ishida storms away, deciding he does not care about Shimada and does not want to be his friend again. It is revealed that when Ishida falls while saving Nishimiya, Shimada sees him and saves him from the river; however, Ishida never learns this because he is unconscious at that time and Shimada asks Nishimiya, who witnesses the event, not to tell him about it.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124039-gbt1fKyZRdBp.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124039
      },
      "rarity": "rare"
    },
    {
      "id": "takeuchi",
      "name": "Takeuchi",
      "alt_names": [
        "竹内"
      ],
      "role": "supporting",
      "description": "Takeuchi-sensei was the homeroom teacher of Shouya, Shouko, Naoka, Shimada, Hirose, Miki, and Miyoko during their 6th-grade year.\n\n~!While he was disappointed in Ishida for bullying Nishimiya, he still laughed at the jokes made about her, and once Nishimiya left, he prompted the class to turn Ishida into a scapegoat for all their bullying. He refused to believe Ishida when he claimed he was being bullied too. Years later, Ishida runs into Takeuchi again when looking for locations for the film. Takeuchi says that Ishida has grown into a fine young man and all the bad things in his past have changed Ishida for the better. Mashiba dislikes how Takeuchi talks about Nishimiya and throws his drink into Takeuchi's face, costing them the chance to film at the school, though with Ishida's later hospitalization and Mashiba's apology to him, Takeuchi allows them to shoot anyway.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135851-7gmFc8ZB594q.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135851
      },
      "rarity": "rare"
    },
    {
      "id": "pedro",
      "name": "Pedro",
      "alt_names": [
        "ペドロ"
      ],
      "role": "supporting",
      "description": "Maria's Brazilian father.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135852-mW3w0bGh7DFI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135852
      },
      "rarity": "rare"
    },
    {
      "id": "keisuke-hirose",
      "name": "Keisuke Hirose",
      "alt_names": [
        "広瀬啓祐"
      ],
      "role": "supporting",
      "description": "Keisuke was Shouya Ishida's friend in elementary school. Although he did bully Shouko Nishimiya, he wasn't a huge participant and usually seemed uncomfortable picking on her. However, he was more than happy bullying Shouya later on.\n\n~!Keisuke stayed close with Kazuki after graduation and along with him brings Shouya from the river after he falls down after saving Shouko.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135854-UpPOO4l7YdUG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135854
      },
      "rarity": "rare"
    },
    {
      "id": "ishida-no-ane",
      "name": "Ishida no Ane",
      "alt_names": [
        "将也の姉"
      ],
      "role": "supporting",
      "description": "Ishida's older sister. She is significantly older than him as she already graduated from college when he was still in elementary school. Curiously, she is the only character with lines whose face is never seen. According to Shouya, his sister had dated numerous men, one of whom has a younger brother who was bullied by Shouya. Later, she dated a Brazilian man named Pedro; this time, her relationship stuck, and she had a daughter, Maria, with him.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135856-56gnTN6auHEy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135856
      },
      "rarity": "rare"
    },
    {
      "id": "genki",
      "name": "Genki",
      "alt_names": [
        "げんき"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b186210-8VGxaQ0wc5FW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 186210
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T01:16:12.416Z"
}