{
  "work_id": "tokyo-ghoulre-2",
  "count": 15,
  "characters": [
    {
      "id": "ken-kaneki",
      "name": "Ken Kaneki",
      "alt_names": [
        "金木研",
        "Eyepatch",
        "Kane-yan",
        "Kanekichi"
      ],
      "role": "protagonist",
      "description": "__Height:__ 169 cm (5'6\")\n\nKen Kaneki was originally a human and a normal college student until he encountered a female ghoul named [Rize](https://anilist.co/character/88413/Rize-Kamishiro) who was posing as a human at the time. Rize, using Kaneki's crush on her as leverage, managed to lure him into an alley and tried to eat him but ended up dying when construction beams fell on top of her. Kaneki, already in a half-dead state from Rize's attempts at killing him, ends up in a hospital and has some of Rize's organs transplanted into his body. This results in him absorbing some of Rize's powers and characteristics, such as a ghoul eye, powers of regeneration, and the inability to stomach human food.\n\nTerrified and lost, Kaneki's life takes a dramatic turn from then on as he tries to find a place for himself in the world, realizing he now belongs to neither the human nor ghoul world and refusing to eat humans to sustain himself. Meeting some of the ​other ghouls, as well as humans, makes him realize that things aren't just black and white and that there are more to ghouls and humans than originally thought.",
      "metadata": {
        "gender": "male",
        "age": "18-29",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b87275-mb13EWZBdbh3.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87275
      },
      "rarity": "epic"
    },
    {
      "id": "nimura-furuta",
      "name": "Nimura Furuta",
      "alt_names": [
        "旧多二福"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm\n~!__RC Type:__ Rinkaku!~\n\n~!Kichimura Washuu is the primary antagonist of the Tokyo Ghoul series and the former Bureau Director of the CCG. He is involved in numerous organizations and is responsible for several major events of the series.!~\n\n~!He was originally the illegitimate son of former CCG Chairman Tsuneyoshi Washuu and an agent of V raised in the Sunlit Garden.\n\nTo further his own agenda, he has used various identities to infiltrate organizations or build personal alliances. As a member of the Clowns, he was responsible for the Steel Beam Incident. He also joined the Ghoul Restaurant as __PG__, and has been a partner in Akihiro Kanou's ghoulification experiments. Like [Ken Kaneki](https://anilist.co/character/87275/Ken-Kaneki), he is an artificial one-eyed ghoul who possesses [Rize Kamishiro](https://anilist.co/character/88413/Rize-Kamishiro)'s kagune.!~",
      "metadata": {
        "gender": "male",
        "age": "20-25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126031-3tBpl6tvYwaZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126031
      },
      "rarity": "epic"
    },
    {
      "id": "touka-kirishima",
      "name": "Touka Kirishima",
      "alt_names": [
        "霧嶋董香",
        "Rabbit"
      ],
      "role": "supporting",
      "description": "__Height:__ 156 cm (5'1\")\n\nTouka is a ghoul successfully posing as a human and working as a waitress at a cafe which serves as a gathering place for other ghouls, as well as a food resource.\n\nShe saves Kaneki's life at one point and acts as a reluctant guide to him and his adaptation to the ghoul society. She doesn't like Kaneki much and has no qualms about expressing her dislike for him. She is very serious, tough and hard-working, trying to keep their district as safe for ghouls and humans as possible. Her powers and strength are also quite great and she makes for a formidable opponent.",
      "metadata": {
        "gender": "female",
        "age": "17-28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b87277-oUaqrI1iBzu6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87277
      },
      "rarity": "uncommon"
    },
    {
      "id": "hinami-fueguchi",
      "name": "Hinami Fueguchi",
      "alt_names": [
        "笛口雛実",
        "Yotsume"
      ],
      "role": "supporting",
      "description": "__Height:__ 148 cm - 152 cm (4'10\" - 4'11\")\n\nHinami is a child ghoul whose parents were killed by ghoul investigators. Before, she and her mother seek help from the owner of the Antique Cafe to acquire food. Hinami is initially quite shy, but when she opens up, she is cheerful and earnest. Ken helps her learn kanji, as she cannot attend school, and is very eager to learn. Currently, she is living together with Touka Kirishima.",
      "metadata": {
        "gender": "female",
        "age": "13-24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88293-4J36uyflNWvb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88293
      },
      "rarity": "uncommon"
    },
    {
      "id": "koutarou-amon",
      "name": "Koutarou Amon",
      "alt_names": [
        "亜門鋼太朗"
      ],
      "role": "supporting",
      "description": "__Height:__ 191 cm (6'3\")\n\nA first class police investigator who investigates Ghouls, also known as a Dove. He comes to the 20th ward with his mentor, Mado Kureo, to investigate Ghoul incidents in the area. He has a strong sense of justice, fervently believing it is the right and moral thing to do to exterminate the Ghouls. He hunts the Ghouls in order to prevent more human children from becoming orphaned like himself, and he often works after hours to achieve his goals.\n\nHe wields a \"Quinque\" (a weapon made from the \"Kagune\" of a Ghoul) that has the appearance of a pole-arm with a large cylindrical bludgeon at the end.",
      "metadata": {
        "gender": "male",
        "age": "26\r",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88407-YwE6D75Xskxl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88407
      },
      "rarity": "uncommon"
    },
    {
      "id": "nishiki-nishio",
      "name": "Nishiki Nishio",
      "alt_names": [
        "西尾錦",
        "Serpent"
      ],
      "role": "supporting",
      "description": "__Height:__ 177 cm (5'9\")\n\nNishiki Nishio is a ghoul whose original feeding ground was taken from Rize. He is a sophomore in the Pharmaceutical Department of Kamii University and Kimi Nishino's boyfriend.",
      "metadata": {
        "gender": "male",
        "age": "19-25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88409-rOaEex2Ml2ah.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88409
      },
      "rarity": "uncommon"
    },
    {
      "id": "ayato-kirishima",
      "name": "Ayato Kirishima",
      "alt_names": [
        "霧嶋絢都",
        "Black Rabbit"
      ],
      "role": "supporting",
      "description": "__Height:__ 159 cm (5'2\")\n\nAyato Kirishima is [Touka Kirishima](https://anilist.co/character/87277/Touka-Kirishima)'s younger brother. He grew up with his sister in the 20th ward but at some point of time, he disappeared. Currently, he is an executive of Aogiri Tree. An arrogant youth with a similar harsh attitude that resembles his sister. Other than physical looks, he shares many similarities with Touka such as his cold, hotblooded attitude and a habit for kicking people. However, he's more harsh compared to her and surprisingly nicer than his Aogiri superiors.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88411-dI6vqLy4pvHK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88411
      },
      "rarity": "uncommon"
    },
    {
      "id": "juuzou-suzuya",
      "name": "Juuzou Suzuya",
      "alt_names": [
        "鈴屋什造",
        "Rei"
      ],
      "role": "supporting",
      "description": "__Height:__ 160 cm (5'3\")\n\nA Rank 3 Ghoul Investigator. In the past, he went by the name Rei Suzuya. He is the partner of Yukinori Shinohara. He is a young man with androgynous appearance. He has many stitches used as both first-aid and fashion. His hair is tied with a stitching string in a roman numeral 13 pattern, with large pupils that leaves an eerie and frightening impression.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88412-sIOJUnIkyFRe.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88412
      },
      "rarity": "uncommon"
    },
    {
      "id": "rize-kamishiro",
      "name": "Rize Kamishiro",
      "alt_names": [
        "神代利世",
        "Binge Eater"
      ],
      "role": "supporting",
      "description": "__Height:__ 164 cm\n\nRize Kamishiro is a ghoul that was hanging out at Anteiku. She set her eyes on Ken Kaneki, but moments before eating him, she died in an accident and her organs were transplanted in Ken Kaneki, making him half-ghoul.",
      "metadata": {
        "gender": "female",
        "age": "18-22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88413-FmAvV0hGSljG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88413
      },
      "rarity": "uncommon"
    },
    {
      "id": "uta",
      "name": "Uta",
      "alt_names": [
        "ウタ",
        "No Face"
      ],
      "role": "supporting",
      "description": "__Height:__ 177 cm\n\nA ghoul that has his own art studio where he makes masks for other ghouls. He has a lot of piercings and tattoos on his body, making him look pretty intimidating, even as a normal-looking human. He's the one who also made a mask for Kaneki.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88414-r2Xd7jJeMrvR.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88414
      },
      "rarity": "uncommon"
    },
    {
      "id": "itori",
      "name": "Itori",
      "alt_names": [
        "イトリ"
      ],
      "role": "supporting",
      "description": "Itori is an old friend of Yomo and Uta. She can be found in Helter Skelter bar, where she makes her share in the information web of the underworld. Itori is over friendly and talkative. She likes having fun and even doing pranks. Her bad point might be her using people like toys to get the information she wants.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/88415.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88415
      },
      "rarity": "uncommon"
    },
    {
      "id": "tatara",
      "name": "Tatara",
      "alt_names": [
        "タタラ"
      ],
      "role": "supporting",
      "description": "A direct subordinate of the One-Eyed King and one of Aogiri Tree's leaders. He was a former member of the Chinese ghoul organization Chi She Lian. \n\nAs one of the Aogiri Tree leaders and a trusted subordinate working under the One-Eyed King, Tatara comes off as a rather loyal individual. He is portrayed as composed and stoic mostly. He often monitors the activities of the Aogiri executives, but kills in cold-blood when embarking on a mission. He is also proud of his immense stamina when fighting and the accuracy of his calculations as well. Tatara seems to have a taste for precision; as shown when he turns down Kaneki considering he's an artificial one-eyed ghoul. He appears to hold a grudge against Houji, to the extent that even the Quinque associated with him, is enough to make him enraged and lose his near unflappable composure.\n\nAs the second-in-command of Aogiri, it can be inferred that he is quite powerful.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88418-OyaEfoP3tf1e.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88418
      },
      "rarity": "uncommon"
    },
    {
      "id": "nico",
      "name": "Nico",
      "alt_names": [
        "ニコ"
      ],
      "role": "supporting",
      "description": "__Species:__ Ghoul\n__Height:__ 175 cm\n__Affiliations:__ Clown Mask Ghoul Gang\n\nA gay ghoul (okama) in love. He was once acting together with Yamori and participating in Aogiri Tree.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/88419.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88419
      },
      "rarity": "uncommon"
    },
    {
      "id": "hideyoshi-nagachika",
      "name": "Hideyoshi Nagachika",
      "alt_names": [
        "永近英良",
        "Hide"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n\nHideyoshi is a normal human and the best friend of Ken Kaneki. Hide is incredibly observant and can figure things out about people in a almost sherlock-like manner. He also becomes interested in things and works hard on them until he finds something else to interest him.",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88421-F8yaeVfHjwYn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88421
      },
      "rarity": "uncommon"
    },
    {
      "id": "shuu-tsukiyama",
      "name": "Shuu Tsukiyama",
      "alt_names": [
        "月山習",
        "Gourmet"
      ],
      "role": "supporting",
      "description": "__Height:__ 180 cm\n\nShuu Tsukiyama was the infamous Gourmet ghoul of the 20th ward. He was a fourth-year student studying Social Welfare at the Department of Human Sciences at Seinan Gakuin University. He comes from the extremely wealthy and influential Tsukiyama family which his father, Mirumo Tsukiyama was the head of. Tsukiyama himself became the head of his family after the Tsukiyama Family Extermination Operation. He was also a member of the Ghoul Restaurant, known as MM until he betrayed them.\n\nHe joined Kaneki's group with the hidden intention of eating Ken Kaneki, obsessed with his scent and taste but eventually came to genuinely care for Kaneki. Two years later, his severe depression and anorexia after Kaneki's apparent demise left him emaciated and required constant care from his family servants. After finding out Kaneki was alive and meeting him, he recovers, being able to walk and eat on his own as well as take measures to help Kaneki regain his memories.",
      "metadata": {
        "gender": "male",
        "age": "26",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88424-mFPgcZlCuODC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88424
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-24T21:08:41.054Z"
}