{
  "work_id": "watashitachi-no-shiawase-na-jikan",
  "count": 4,
  "characters": [
    {
      "id": "yuu",
      "name": "Yuu",
      "alt_names": [
        "優",
        "Augustine",
        "No.3987"
      ],
      "role": "protagonist",
      "description": "An orphan who killed three people - mother, kid and a man. He is in prison (death row) waiting for his death to the point that he attempted suicide numerous times.     ~!His abusive father caused Yuu&#039;s three-year younger brother to go blind. Their mother could not handle the abuse so she abandoned her children, and so Yuu and his brother were sent to an orphanage. Since the brother would get teased a lot, they ran away and lived on the streets together. For his brother&#039;s sake Yuu shoplifted and even worked as a prostitute. But his younger brother jumped in front of traffic and was killed because he felt Yuu would have an easier life by himself. Years later, Yuu killed three people. Until he met Juri his life was all in the darkness and despair. In the end, he confesses that he fell in love with her and wanted to live and listen to her play the piano, but he could hear it just once before he was executed.!~     ~! The truth was that he only meant to kill one person. Using the first thing in sight- an umbrella, causing two accidental deaths-  a mother and a child. In the process of taking the umbrella, he accidentally knocked the mother and child over the cement and a train coming by hit them.!~     ~! In the manga, Yuu asks to have a christian name bestowed on him. The name is Augustine.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/28263.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28263
      },
      "rarity": "epic"
    },
    {
      "id": "juri-mutou",
      "name": "Juri Mutou",
      "alt_names": [
        "武藤樹里",
        "Sylvia"
      ],
      "role": "protagonist",
      "description": "The daughter of a very famous pianist who had to stop playing after giving birth to her. She believed she had no hope in the future due to a dark past - until she met Yuu.   ~!When she was 16 years old, her piano teacher raped her. She told about it her mother, but she didn't believe her. Taking her daughter for granted and hating her for losing her dream - piano - caused Juri's hatred for her. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/28264.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28264
      },
      "rarity": "epic"
    },
    {
      "id": "monica",
      "name": "Monica",
      "alt_names": [
        "モニカ"
      ],
      "role": "supporting",
      "description": "She is Juri&#039;s aunt. She lost her child in a motorcycle accident. She couldn&#039;t bear the grudge anymore after the killer committed suicide in prison and joined the clergy. She meets convicts on death row and tries to take care of them.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/31162.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31162
      },
      "rarity": "uncommon"
    },
    {
      "id": "jirou-inoue",
      "name": "Jirou Inoue",
      "alt_names": [],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/35096.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 35096
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-26T10:25:21.108Z"
}