{
  "work_id": "blame",
  "count": 13,
  "characters": [
    {
      "id": "killy",
      "name": "Killy",
      "alt_names": [
        "キリー",
        "Kyrii"
      ],
      "role": "protagonist",
      "description": "Killy is the main character who is on the unenviable task to find a human with the Net Terminal Gene within the Megastructure to access the Netsphere. He is equipped with a Gravitational Beam Emitter (GBE), a petite but awesome weapon capable of creating holes miles long in the Megastructure. He is soon joined by Cibo in his quest.  Looking to be in his early to mid-20's (Once saying that his \"growth period is over.\"), he is a glum looking person, never smiling (except madly when shooting on occasion) and has a slight slouch in his normal standing position, he isn't afraid to fight, and readily shoots the GBE. He also often shows superhuman strength and endurance, being thrown through solid walls and floors before standing right back up with no apparent injuries.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3762-hh1LPjA5Tswg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3762
      },
      "rarity": "epic"
    },
    {
      "id": "cibo",
      "name": "Cibo",
      "alt_names": [
        "シボ"
      ],
      "role": "protagonist",
      "description": "Cibo is a main character in the manga BLAME! by Tsutomu Nihei. She is the head scientist of the Electronic Corporation in the Capitol and joins Killy on his quest for the Net Terminal Gene.    Killy 's first encounter with Cibo is in the lower levels of the Corporation in The Capitol, where she has been imprisoned for attempting to access the Net Sphere with an artificially created version of Net Terminal Genes. Her failed attempt to access the Net Sphere led to the appearance of the Safeguard, which destroyed the entire lab facility that Cibo was conducting the experiment in. The death and destruction resulting from Cibo's failed experiment led the governing body of the Corporation to convict and imprison her.    Cibo's first form is the decaying upper torso of a woman kept alive by machinery inserted into her body. She convinces Killy to take her with him by stating that he needs her hacking skills to access the files he is looking for. Afterwards, she acquires a human form and destroys The Corporation's President with Killy's help.    After the President's destruction, Cibo leaves the Corporation to travel with Killy because he is also exploring the City and is equipped with a GBE, the only weapon that can breach the Megastructure.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3763-HGLzLifxgoRH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3763
      },
      "rarity": "epic"
    },
    {
      "id": "sanakan",
      "name": "Sanakan",
      "alt_names": [
        "サナカン"
      ],
      "role": "supporting",
      "description": "A high level agent of the Safeguard who first appears as a short, young girl with black hair. She appears to have a particular interest in wiping out the human tribe of Electro-Fishers, and seems to know Killy from the past.  Sanakan has 3 forms. First is a child form who later is stolen by Cibo and used until 10 years is over. The second one is Safeguard form. This form is her battle form, and this one can be revived many times. She uses a GBE like Killy, but it has a bigger shape, though not necessarily more or less powerful. Her third form, similar to the original form, is a humanoid like Killy. According to the manga, the Safeguard form of Sanakan does not possess a Sanakan soul, only a remote body controlled by the main Safeguard system, which is why, when Cibo hacks into the Safeguard system, all exterminators and the Sanakan Safeguard stop moving for a while. The real Sanakan, now protecting Cibo who brings Net Terminal Genes, is again killed by the silicon creatures. After dying (she is possibly in the net sphere), her leader warns her that if she goes back to base reality with Safeguard form (one possessing a Sanakan soul), and she is killed again, they can't revive her again. Sanakan finally has the same goal as Killy. She even helps Killy to destroy Safeguard, who tries to eat Cibo's core.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n10882-Qw3Gt9UEf6Sk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10882
      },
      "rarity": "uncommon"
    },
    {
      "id": "dhomochevsky",
      "name": "Dhomochevsky",
      "alt_names": [
        "ドモチェフスキー"
      ],
      "role": "supporting",
      "description": "A special Safeguard who with his companion Iko protects all the people on his level from Silicon Creatures regardless of Net Terminal Genes.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b15438-gj4zgalY0tz7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15438
      },
      "rarity": "uncommon"
    },
    {
      "id": "pcell",
      "name": "Pcell",
      "alt_names": [
        "プセル"
      ],
      "role": "supporting",
      "description": "A Silicon Creature. She is one of Davine lu linvega&#039;s lieutenants (along with Schiff and Blon). Despite that most Silicon Creatures have some deformed features and a generally unbalanced appearance, PCell looks almost entirely human. Nevertheless she has very high combat capabilities and undoubtedly is one of the strongest opponents Killy and Cibo have to face.     Also, whether it was a history of previous unfriendly encounters or something more profound, but there seems to be something between her and Dhomochevsky.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/18979.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18979
      },
      "rarity": "uncommon"
    },
    {
      "id": "davine-lu-linvega",
      "name": "Davine lu Linvega",
      "alt_names": [],
      "role": "supporting",
      "description": "Leader of a contingent of cyborgs who Killy encounters late in the series. The level on which he&#039;s present allows provisional access to the Net Sphere to any person having normal human DNA. Davinel wants to access the Net Sphere and tries to obtain the DNA sample in Cibo&#039;s possession (which is Seu&#039;s). Afterward he is able to infiltrate the netsphere in Seu&#039;s form. However, he fatally underestimates the GA&#039;s agent who cleverly slows the connection speed, giving enough time for him to be unaware during the attack on him. However, he manages to steal the level nine safeguard data just before Dhomochevsky kills him. Linvega&#039;s gender has been up to debate; Iko first refers to him/her as male. However, the side comic BLAME! Academy depicts Linvega as a girl.    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b33903-Styd8OSdCqqi.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33903
      },
      "rarity": "uncommon"
    },
    {
      "id": "mensab",
      "name": "Mensab",
      "alt_names": [],
      "role": "supporting",
      "description": "Mensab is the AI Controller for Cave 8 inside Toha Heavy Industries. She is expelled from the collective AI, although the reason is not exactly clear. She normally acts and appears quite calm, but her appearance also mirrors her mood. Also, as Cibo departs from Toha Heavy Industries, she bestows her with a small capsule containing Seu&#039;s genetic information which, surprisingly enough, can partially access the netsphere.    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33904.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33904
      },
      "rarity": "uncommon"
    },
    {
      "id": "seu",
      "name": "Seu",
      "alt_names": [],
      "role": "supporting",
      "description": "A Planter, who serves as Mensab&#039;s protector. He is a powerful swordsman and loyal bodyguard. Whenever he is severely injured, Mensab takes him to be restored by equipment which can heal any damage and also synthesize any substance (however, he loses memory each time he is healed in this way). As only Mensab&#039;s people survived the silicon creature invasion, and they were likely killed in the destruction of Toha Heavy Industries, Seu could have possibly been the last Planter alive. He eventually withdraws with Mensab and the recorded personalities of the remaining Planters into a time-space rift, ensuring their safety. However, the nature of this escape guarantees their entrapment in the rift, as technology has stalled throughout The City and Toha is destroyed.    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b33905-FwSXjuHjWAh5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33905
      },
      "rarity": "uncommon"
    },
    {
      "id": "ivy",
      "name": "Ivy",
      "alt_names": [],
      "role": "supporting",
      "description": "Ivy is the leader of the contingent of Cyborgs attacking Toha Heavy Industries. He carries a massive weapon, which is essentially four swords, with two of them spring-loaded to swing out from the middle to bludgeon enemies. He is eventually defeated in a sword fight with Seu.    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b33906-ej4tddlqkKNz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33906
      },
      "rarity": "uncommon"
    },
    {
      "id": "maeve",
      "name": "Maeve",
      "alt_names": [],
      "role": "supporting",
      "description": "Maeve is Ivy&#039;s sidekick. The lower half of her body is sliced off by Seu in a fight. Later on, Ivy and some of his contingent discover the &#039;advanced&#039; cyborg fused to a wall. They cut it out, wrench the cyborg&#039;s original head out and implant Maeve into the body. Later, as Maeve is about to execute Mensab/Mensierve, Seu attempts to kill her by throwing his sword and lodging it in her forehead. She seems almost indifferent to this, but before proceeding, she is killed by Killy who fires a Gravitational Beam through her heart. This happens just before the teleportation of Toha Heavy Industries.    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33907.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33907
      },
      "rarity": "uncommon"
    },
    {
      "id": "iko",
      "name": "Iko",
      "alt_names": [],
      "role": "supporting",
      "description": "Iko appears as the thin, white wisp of a facial image. However, in the manga, it is suggested in a flashback of Dhomochevsky&#039;s that he had a corporeal shape once, but how he lost it was never explained. Most likely, he was unable to gain a new body as the Silicon Life on his level captured the Substance Conversion Tower on which he and Dhomochevsky depended. He acts as a guardian for Dhomochevsky, predicts the behavior of his opponents, and healing him if possible. He transfers all his power to Dhomochevsky in a last ditch effort to stop Davinel as well as Cibo&#039;s transformation into a Level 9 Safeguard.    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33908.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33908
      },
      "rarity": "uncommon"
    },
    {
      "id": "blon",
      "name": "Blon",
      "alt_names": [],
      "role": "supporting",
      "description": "One of Davine Lu Linvega&#039;s henchmen. Blon is capable of creating worm-like creatures, possibly the same way the Safeguard use to &#039;download&#039; common safeguards to any location. He can also release leech-like creatures, about a foot and a half long, which attach to a target&#039;s spine and render the target unconscious. Another of Blon&#039;s abilities is that he can use what is possibly alchemy to create radically different forms apart from his humanoid form. The first is a massive, metallic centipede-like creature which ravages Killy with multiple blades before Blon reveals his true form. As he finishes transforming into his humanoid form, Killy fires the Gravitational Beam Emitter at &quot;Level 4&quot; disintegrating all but Blon&#039;s head and the remains of his arms and legs. Several people believe that he dies here, but he actually appears later. His first defeat allows Pcell to detect the 70-kilometer long holes left by Killy&#039;s GBE. When Dhomochevsky, Cibo and Iko set out to find Killy and Davinel, Pcell appears to confront them at a large orbital transport hatch and minutes later, Blon appears in his third form at her command. The third form resembles a large, metallic, spider-praying mantis hybrid with Blon&#039;s face and his large chain-gun (Vulcan Cannon/Gatling Gun) on its left arm (where it is in Blon&#039;s humanoid form). When Blon attacks, he slightly wounds Dhomochevsky and is able to steal a capsule from Cibo containing Seu&#039;s genetic information. Blon is finally killed when Dhomochevsky, Cibo and Iko enter the hatch&#039;s portal and close the hatch itself while Blon is still in the hatch locking area. This crushes and destroys his entire body. The capsule lands less that a foot outside the hatch radius and is picked up by Pcell.    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b33909-4SsTOicyQm11.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33909
      },
      "rarity": "uncommon"
    },
    {
      "id": "schiff",
      "name": "Schiff",
      "alt_names": [],
      "role": "supporting",
      "description": "Schiff is another of Davine Lu Linvega&#039;s lieutenants. He seems to be a more humanoid version of the &#039;armored cyborgs&#039;, as he is clad in full armor. He wields two rectangular black blades on his arms in a style similar to Wolverine from The X-men. Schiff is the first cyborg to attack Killy after Killy loses his GBE (and is forced to use more conventional safeguard weaponry). After a short hand-to-hand fight, Killy gains the upper hand and lands several punches which essentially mangle Schiff&#039;s armored face. While Schiff is clawing at his broken face, Killy administers the coup de gr&acirc;ce.    (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b33910-Ky5FSoj4lZCf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33910
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-24T13:20:29.165Z"
}