{
  "work_id": "is-it-wrong-to-try-to-pick-up-girls-in-a-dungeon-iii",
  "count": 15,
  "characters": [
    {
      "id": "hestia",
      "name": "Hestia",
      "alt_names": [
        "ヘスティア",
        "Vesta",
        "Loli Kyonyuu (ロリ巨乳)",
        "Loli Big-Boobs"
      ],
      "role": "protagonist",
      "description": "__Race:__ God\n__Height:__ 140 cm (4'7\")\n__Affiliation:__ Hestia Familia\n\nHestia is an energetic, kind goddess who sees potential in Bell. She is a hard worker, and works jobs to support the two while Bell goes off to the dungeon. Hestia tends to be shown as very petty and gets jealous easily when girls, namely Aiz, show interest in Bell, because she is deeply in love with him, or they are the reason for his strength growth. Despite seeming mature and dependable toward Bell, Hestia is in truth, a lazy goddess, as she couldn't get a job or put effort into work. After descending to the Lower World, Hestia was taken care of by her friend Hephaestus. Soon after, she was asked to live on her own after she kept freeloading off of Hephaestus' familia and was given a room at an abandoned church. Hestia tried to create her own familia, but wasn't able to recruit anyone. After failing to recruit for the 50th time, she noticed Bell and decided to secretly follow him. Hestia found out that Bell had been trying to enter a familia, but was rejected multiple times and seemed to be in the same boat. Hestia then took the chance to recruit him, which Bell happily agreed upon; becoming the first member of her familia. She took Bell to a bookstore, the location she already decided beforehand, and granted her Falna to her first dependent.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b87654-UmmuLPwSK2Hd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87654
      },
      "rarity": "epic"
    },
    {
      "id": "bell-cranel",
      "name": "Bell Cranel",
      "alt_names": [
        "ベル・クラネル",
        "Little Rookie",
        "Rabbit Foot",
        "Record Holder",
        "Ox Slayer"
      ],
      "role": "protagonist",
      "description": "__Race:__ Human\n__Height:__ 165 cm (5'5\")\n\nBell Cranel is the captain of the Hestia Familia. Bell was raised by his grandfather in a rural farming village deep within the mountains near the labyrinth city Orario. He had heard and read many stories about heroes from his grandfather, forming his dream of aspiring to be a mighty one himself. After his grandfather's death, he took it upon himself to leave the village, traveling to the land of Orario to fulfill his dreams. Upon his arrival in the city, Bell attempted to enter numerous Familia, but was rejected by each one. Hestia, a Goddess, unable to find members willing to join her Familia, asked him if he'd like to become the first member of her Familia. Bell gladly accepted, and so started his new life, finally with a Goddess' blessing.\n\nBell is a kind, straightforward, brave, yet shy boy who desires to be a hero like the ones he grew up reading about. He cares deeply for the people around him, especially his Goddess, Hestia, and his Familia. He considers them like family due to the death of his grandfather. Bell's goals didn't start out pure, as he wanted to be an adventurer in hopes of picking up girls, even thinking of starting a harem. However, after his experience with Ais and Bete, Bell seems to have forgone that dream and fell in love with Ais Wallenstein. He became determined to grow stronger so that he could be someone that could stand beside her. Ais saved Bell in an incident with a minotaur and that event made Bell fall in love with her and have fear of Minotaurs.",
      "metadata": {
        "gender": "male",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88860-catfcwlvUYst.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88860
      },
      "rarity": "epic"
    },
    {
      "id": "liliruca-arde",
      "name": "Liliruca Arde",
      "alt_names": [
        "リリルカ・アーデ",
        "Lili"
      ],
      "role": "protagonist",
      "description": "__Race:__ Pallum\n__Height:__ 110 cm (3'7\")\n\nLiliruca Arde is a member of the Hestia Familia. Originally a member of the Soma Familia, she converted to the Hestia Familia after securing her freedom after the War Game. Lili was born to Hobbit parents belonging to the Soma Familia, making her a member of the Familia from birth. However, her parents didn't look after her and ordered her to earn money for them instead. A while later, her parents were killed in the dungeon, leaving her to fend for herself. The Soma Familia didn't take care of her and bullied her, making her lonely and isolated. To earn money, she tried to be an adventurer, but didn't have the talent, eventually switching to being a supporter. As a supporter, she was constantly looked down on by those she partied with, fueling the hatred of adventurers inside of her. After a while, Lili decided to run away from the Soma Familia and become a normal citizen. However, the Soma Familia found her and inflicted misery on the old couple who took care of her, destroying their store and stealing money. She began to hate Soma himself, wondering why he created a Familia if he wasn't going to take care of it. From that time on, Lili began using her hatred of adventurers as an excuse to trick and steal from them. \n\nShe also treated Bell the same way, however, his actions repeatedly caused her to question her own attitude. After she is saved by Bell, she becomes much closer to him and develops romantic feelings for him. Lili often uses her experience to gather information or do jobs that Bell and the other members of the Hestia Familia would be unable to do properly. She is also frequently amazed at how Bell seems to constantly get himself involved in trouble, yet she still cooperates with him in whatever he does.\n\nLili is regarded as the \"brains\" of the Familia, being that she is the most capable when it comes to developing battle plans and strategies. She advised Bell and Welf to travel to the eighteenth floor when they were trapped in the dungeon, and she was crucial in forming the Hestia Familia's plan of attack for the War Game. Lili also possesses a strong insight, forged through her time as a thief, as she was able to pick up Finn Deimne's speech patterns, mannerisms, and character after only one meeting with him.",
      "metadata": {
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88897-2xey5UG7Qr2S.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88897
      },
      "rarity": "epic"
    },
    {
      "id": "welf-crozzo",
      "name": "Welf Crozzo",
      "alt_names": [
        "ヴェルフ・クロッゾ",
        "Ignis"
      ],
      "role": "protagonist",
      "description": "__Race:__ Human\n__Height:__ 175 cm (5'9\")\n\nWelf Crozzo is a member of the Hestia Familia and Bell's personal blacksmith, later becoming one for the entire Hestia Familia after converting from the Hephaestus Familia. Welf was originally born in Rakia, a nation type Familia ruled by Ares. As a member of the Crozzo Family, he lived as a noble due to the successes his predecessors had in creating magic swords. However, his life changed the day his Skill Crozzo Blood appeared, which enabled him to create magic swords again. Despite his family's joy at the prospect of being able to create more magic swords, Welf despised his skill, causing him to escape Rakia with the help of his former Goddess Phobos. \n\nWelf Crozzo is a straightforward and honest person. He is generally casual to everyone that he associates with. He doesn't like to be associated with his family name, preferring to not be a part of the conversation when his name is brought up and even refuses people that come to him seeking magic swords.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b138250-VOIbyr2PNsZS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 138250
      },
      "rarity": "epic"
    },
    {
      "id": "haruhime-sanjouno",
      "name": "Haruhime Sanjouno",
      "alt_names": [
        "サンジョウノ・春姫"
      ],
      "role": "protagonist",
      "description": "__Race:__ Renard\n__Height:__ 156 cm (5'1\")\n\nSanjouno Haruhime is a member of the Hestia Familia and a former member of the Ishtar Familia. Haruhime grew up as a dignified young lady of a noble family in the Far East. Living in solitude, her home was like a cage and she had no friends. At some point, children of the Takemikazuchi Familia, with the approval of their God, started taking her outside at night to play with them. Sometime later, someone framed her for eating an offering, which angered her father so much that he disowned her and a Pallum guest offered to take her away. As they were traveling, they were attacked by monsters and the Pallum ran away, leaving Haruhime behind. She survived, but was later captured by bandits and sold to a brothel in Orario. While heading there, she caught the eye of Ishtar, who bought her. Haruhime became a member of the Ishtar Familia, where she was forced to work as a prostitute, until the Familia disbanded.\n\nHaruhime is a gentle, timid, well-mannered, and extremely kind girl. She is respectful of everyone she meets and is eager to help when given the chance. Having grown up mostly isolated and later kept hidden by the Ishtar Familia, Haruhime has experienced quite a sheltered life. And as such, even minor things will excite her. Haruhime developed a love of reading at a young age, as it was her way of escaping her loneliness. She has a fondness for fairy tales, particularly ones where the hero saves a damsel in distress. When she was made to work as a prostitute, she wished that a hero would come and save her like in those stories. As time went on, however, she convinced herself that she wouldn't be saved since she believed that her profession made her unworthy of rescue. However, Haruhime's view on this changed after Bell saved her regardless of her beliefs. Though she has never had to fend for herself, Haruhime displays an unusual sense of bravery when those she cares for are threatened. When Wiene was in danger, Haruhime leaped off a building in pursuit of her and stood up to Bete in order to give Bell enough time to escort Wiene to safety.\n\nWhile working as a prostitute, Haruhime would foam at the mouth and collapse whenever she saw a naked man. Due to this, she is still a virgin, but is unaware of the fact.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142551-WyUJ6UW2H5UH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142551
      },
      "rarity": "epic"
    },
    {
      "id": "mikoto-yamato",
      "name": "Mikoto Yamato",
      "alt_names": [
        "ヤマト・命",
        "Absolute✝Shadow"
      ],
      "role": "protagonist",
      "description": "__Race:__ Human\n__Height:__ 157 cm (5'2\")\n__Affiliation:__ Hestia Familia • Takemikazuchi Familia (temporary leave)\n__Level:__ 2\n__Skills:__ Yatanokurogarasu • Yatanoshirogarasu\n__Magic:__ Futsunomitama\n__Weapon:__ Kotetsu • Chizan • Shunsan • Shakuya\n\nYamato Mikoto is a member of the Hestia Familia and the Takemikazuchi Familia, having converted to aid the former during the War Game. Mikoto originally hails from the Far East. Her parents died several years after her birth. Tsukuyomi and Takemikazuchi took the young girl into their orphanage, where she lived for years, eventually joining the Takemikazuchi Familia. Mikoto and the other members of the Takemikazuchi Familia used to sneak Sanjouno Haruhime out of her mansion at night to play with her. They were eventually caught, damaging relations between Haruhime's father and the shrine. They pursued their nightly fun regardless. Two years before the story, Mikoto and the other Takemikazuchi Familia members moved to Orario to earn money to help support the shrine.\n\nMikoto has a serious and honorable personality, unwilling to use cowardly tactics even in an emergency, as shown through her disapproval of Pass Parading the monsters that were chasing them onto the Hestia Familia. She also has a softer side as she cares for the well-being of her friends and is fiercely loyal to them.",
      "metadata": {
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b142923-3DX8e5beuivx.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 142923
      },
      "rarity": "epic"
    },
    {
      "id": "wiene",
      "name": "Wiene",
      "alt_names": [
        "ウィーネ"
      ],
      "role": "protagonist",
      "description": "__Race:__ Xenos \n__Height:__ 150 cm (4'11\")\n__Affiliation:__ Xenos • Hestia Familia • Ouranos\n__Level:__ 2+ (estimate)\n\nWiene is a mysterious female Vouivre born in the middle floors of the Dungeon. It is later revealed that she is one of the Xenos. \n\nWiene has the ability to speak even though she is a monster due to her being a Xenos. She is kind, helping a young boy even though people regarded monsters as evil. Wiene grew attached to the Hestia Familia, particularly Bell and Haruhime. Wiene doesn't like to wear clothes, as she refused to wear them and she even tried to get rid of the cape she was wearing due to the hot temperatures she was not used to before being convinced to keep it on. Originally, Wiene had more of a cowardly nature, influenced by all of the evil intent people had toward monsters, including the citizen's rejection of her even though she saved a boy. However, after she was reborn, she becomes much more courageous, reminding herself that Bell saved her even though people would scorn him for it.",
      "metadata": {
        "gender": "female",
        "age": "0",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b146907-h9FMMvnMsv4C.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 146907
      },
      "rarity": "epic"
    },
    {
      "id": "ais-wallenstein",
      "name": "Ais Wallenstein",
      "alt_names": [
        "アイズ・ヴァレンシュタイン",
        "Sword Princess",
        "War Princess"
      ],
      "role": "supporting",
      "description": "__Height:__ 162 cm (5'4\")\n\nAis Wallenstein, also known as the Sword Princess, is a First-Class Adventurer and a key member of the Loki Familia. Among the small fraction of First-Class Adventurers, she is considered one of the strongest.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b87655-7QjpIyyZuqyp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87655
      },
      "rarity": "uncommon"
    },
    {
      "id": "ryuu-lion",
      "name": "Ryuu  Lion",
      "alt_names": [
        "リュー・リオン",
        "Ryu Lion",
        "Lyu"
      ],
      "role": "supporting",
      "description": "__Race:__ Elf\n__Height:__ 165 cm (5'5\")\n\nRyuu Lion is a waitress at the Hostess of Fertility.\n\nRyuu was a member of a family that cared for the sacred tree in their home forest of Ryumilua. As time passed, she began to think that beautiful Elves were the ugliest of all people, due to seeing her fellow Elves' behavior toward those of other races. No matter how much she tried to forget it, once she began thinking about it, the thought firmly planted itself in her mind. Eventually, the thought became enough to make her decide to leave the forest.\n\nRyuu is calm and stoic but also cares deeply for her friends. When a person related to her or her friends are in danger or in need of help, she is always ready to step in and help no matter the cost. Like many Elves, Ryuu is selective with who may touch her. However, she has been advised by Alise to not let go of a man that was able to grab her hands, and began to follow Bell with her eyes. Unlike most Elves, she doesn't bear the same hatred towards the Crozzo family or their magic swords for their role in the destruction of the forests the Elves lived in, stating that the event took place many years ago and that her village wasn't directly affected. \n\n~!After arriving in Orario, Ryuu became an adventurer known as Gale, belonging to the Astraea Familia. She was caught in a trap set by Evilus and all of her fellow Familia members were murdered. Overcome with vengeance, she persuaded Astraea to leave Orario as she didn't want her to see her revenge. After that, she single-handedly destroyed the Rudra Familia as a part of her rampage and those associated with Evilus through various trickery, traps, and assassinations, causing her to be branded as a fugitive as a result of the ensuing chaos. Her revenge finally fulfilled, she collapsed in an alley where she nearly succumbed to her injuries. Fortunately, she was discovered by Syr and nursed back to health by Mia Grand. Ever since then, she has joined the Hostess of Fertility.!~",
      "metadata": {
        "gender": "female",
        "age": "21",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88890-lJFKK5czkH9E.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88890
      },
      "rarity": "uncommon"
    },
    {
      "id": "eina-tulle",
      "name": "Eina Tulle",
      "alt_names": [
        "エイナ・チュール"
      ],
      "role": "supporting",
      "description": "__Race__: Half Elf\n__Height:__ 164 cm (5'5\")\n__Affiliation:__ Guild\n\nEina Tulle is a receptionist at the Guild and Bell Cranel's advisor. Eina joined the Guild five years earlier at the age of 14 after she graduated from the school. Originally excited to work at the Guild, she quickly learned that it wasn't as fun as she thought it would be, eventually changing her personality into what it is now. She met Bell four years later and became his dungeon adviser. \n\nEina shows a serious, calm demeanor, appearing as a very wise and sisterly figure towards Bell, even so far as getting worried whenever he went out to dangerous levels in the dungeon. She gets embarrassed when the subject of romance or love is mentioned, especially coming from Bell. Eina is passionate about her job as she doesn't want any adventurers under her care to die in the dungeon. She has a particular stance when it comes to advising adventurers; in addition to the usual Dungeon-prowling advice and regular meetings, she would also summon her adventurers to private lessons, where she crams as much Dungeon knowledge into their heads as possible. It was to the point where she gained a scary reputation among many adventurers, as she would often demand her pupils to perfectly draw out maps and monsters strategies from memory, with the threat of extra work if there were any mistakes. No one had lasted all the way to the end of her course, most ran away halfway through, and the only one known so far to be able to endure her lessons is Bell.\n\nDue to her beauty, Eina is popular with her coworkers and adventurers and is often flirted on, and some keep on trying even if they're rejected like Dormul and Luvis. However, she is interested in men that are unreliable like Bell instead of reliable men.",
      "metadata": {
        "gender": "female",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/88896-zhwTEI30T5XB.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88896
      },
      "rarity": "uncommon"
    },
    {
      "id": "syr-flova",
      "name": "Syr Flova",
      "alt_names": [
        "シル・フローヴァ",
        "Syr Flover"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 162 cm (5'4\")\n__Affiliation:__ Hostess of Fertility • Maria's Orphanage Alliance\n__Skill:__ Pupa Domina\n\nA shop employee who works at the bar Mistress of Abundance. A kind person who gives Bell food when he is hungry.\n\n~!Syr is actually a demi-god!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/88898-smaZBxgyx2wM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88898
      },
      "rarity": "uncommon"
    },
    {
      "id": "tiona-hiryute",
      "name": "Tiona Hiryute",
      "alt_names": [
        "ティオナ・ヒリュテ",
        "Amazon",
        "Crusher"
      ],
      "role": "supporting",
      "description": "__Race:__ Amazoness\n__Height:__ 165 cm (5'5\")\n__Affiliation:__ Loki Familia\n__Level:__ 6\n__Skills:__ Berserk • Intense Heat\n__Weapon: __Urga • Blade Rolan\n\nTiona Hiryute is a first class adventurer and an executive member of the Loki Familia. She is the younger twin of the Hiryute Sisters. Tione and Tiona were born in Telskyura and were forced to join the Kali Familia from the moment they were born. Both sisters didn't know who their parents were, but knew that they were sisters. She reached Level 2 on the same day Tione did after killing an Amazoness she knew in a fight to the death. Soon after, both sisters became students to Argana and Bache. Around a year after reaching Level 2, Tiona found her first hero story. The day before her seventh birthday, Tiona asked Kali to let her and Tione leave the country, which Kali granted a couple days later, much to the sisters' surprise. The sisters traveled across the land, temporarily joining different Familia for a year, during which both sisters reached Level 3. They arrived at Orario years later when they were 12 years old. After agreeing to join the Familia of the adventurer that defeated them, they proceeded to defeat everyone that challenged them, only to lose to Finn and Gareth when they were challenged by the Loki Familia. Following a dungeon expedition they went on shortly after joining, both sisters reached Level 4.\n\nTiona is an overly energetic Amazoness woman who likes teasing people, but is a caring friend. She isn't the type to use her brain, which she admits herself, and has a complex about her chest size compared to other women. She is also fond of hero stories and is almost equally as knowledgeable about the topic as Bell is. She also seems to be more caring than her sister, as seen when she let Wiene live.",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/121633-XNWkrmvyvevi.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 121633
      },
      "rarity": "uncommon"
    },
    {
      "id": "mord-latro",
      "name": "Mord Latro",
      "alt_names": [
        "モルド・ラトロー",
        "Ruffian Dog"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Height:__ 178 cm (5'10\")\n__Affiliation:__ Ogma Familia\n__Level:__ 2\n__Weapon:__ Double-Edged Sword\n\nMord Latro is a Level 2 adventurer who was initially an enemy to Bell Cranel. Mord Latro is a loud and tough adventurer. He is also shown to be ill-tempered, holding a grudge against Bell for his rapid growth and fame. He is also shown to have a lustful nature, claiming that Bell should share Ryuu, Syr, and Lili while at the Hostess of Fertility because \"they were friends\". Despite Mord's dislike for Bell at first due to his growth and fame, he comes to respect Bell after his battle with him on the 18th floor, as well as witnessing Bell finish off the Floor Boss Black Goliath. Through various encounters, such as the El Dorado Resort incident, he also becomes much friendlier to him, even coming to his defense when an adventurer insulted him for helping monsters. He even bet 100,000 valis on the Hestia Familia during the War Game, showing his confidence in their abilities.",
      "metadata": {
        "age": "35",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/122200-F51vOIWgcAQh.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122200
      },
      "rarity": "uncommon"
    },
    {
      "id": "bete-loga",
      "name": "Bete Loga",
      "alt_names": [
        "ベート・ローガ",
        "Vanargand",
        "Fenris"
      ],
      "role": "supporting",
      "description": "__Race:__ Werewolf\n__Height:__ 183 cm (6'0\")\n__Affiliation:__ Loki Familia\n__Level:__ 6\n__Skills:__ Úlfheðinn • Fenris Wolf • Solmani\n__Magic:__ Hati\n__Weapon:__ Flosvirt • Dual Rolan\n\nBete Loga is a first class adventurer and an executive member of the Loki Familia. He was the former captain of the Vidar Familia until they left the city. Bete was born to the leader of a clan of Werewolves and had a sister named Luna along with a childhood friend named Rene, who he later got in a relationship with. However, his whole clan was killed by a monster when he was 12, and he traveled to Orario where he eventually became the captain of the Vidar Familia. When he was 16, he temporarily left the city as a Level 3 to kill the monster that killed his clan, succeeding in doing so after a day of fighting. Unfortunately, he discovered upon his return that his Familia had failed their recent dungeon expedition, resulting in the deaths of the vice-captain, who he used to be in a relationship with, along with several others while others that survived gained wounds fatal for an adventurer. The Vidar Familia subsequently left the city, though he stayed behind, and later joined the Loki Familia after an incident with Finn and Gareth at a pub.\n\nBete has a rough personality and a slight superiority complex. He completely hates the weak, especially those that don't do anything about their weakness, and is not afraid to express his opinions about it. He can be an idiot who can't read the atmosphere. Furthermore, he is a bad drunk and has a tendency to spout things when intoxicated. He has, in several instances, displayed feats of heroism and still worries for the wellbeing of his weaker subordinates. He is also described as a tsundere, hiding a more forebearing exterior. He admires and has a crush on Ais.",
      "metadata": {
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b122632-kzchULOi6BfA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122632
      },
      "rarity": "uncommon"
    },
    {
      "id": "tione-hiryute",
      "name": "Tione Hiryute",
      "alt_names": [
        "ティオネ・ヒリュテ",
        "Jormungand"
      ],
      "role": "supporting",
      "description": "__Race:__ Amazoness\n__Height:__ 165 cm (5'5\")\n__Affiliation:__ Loki Familia\n__Level:__ 6\n__Skills:__ Berserk • Backdraft\n__Magic:__ List Iorum\n__Weapon:__ Zolas • Filuka • Halberd Rolan\n\nTione Hiryute is a first class adventurer and an executive member of the Loki Familia. She is the older twin of the Hiryute Sisters. Tione and Tiona were born in Telskyura and were forced to join the Kali Familia from the moment they were born. Both sisters didn't know who their parents were, but knew that they were sisters. She reached Level 2 on her fifth birthday after she unknowingly killed Seldas, a person that she had viewed as a mother and an older sister, in a daily fight to the death, resulting in her resentment of Telskyura. Soon after, both sisters became students to Argana and Bache. The day before Tione's seventh birthday, Tiona asked Kali to let them leave the country, which she granted a couple of days later, much to their surprise. The sisters traveled across the land, temporarily joining different Familia for a year, during which both sisters reached Level 3. They arrived at Orario years later when they were 12 years old. After agreeing to join the Familia of the adventurer that defeated them, they proceeded to defeat everyone that challenged them, only to lose to Finn and Gareth when they were challenged by the Loki Familia. Upon her defeat, Tione fell in love with Finn, and desperately tried to make herself into a woman he would like. Following a dungeon expedition they went on shortly after joining, both sisters reached Level 4.\n\nTione is in love with Finn Deimne and gets angry when other women try to flirt with him. She used to use dirty language, but cleaned it up after meeting Finn. However, her language returns to normal whenever she gets angry.",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/127209-IQuMFrofF1Nm.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127209
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-25T13:08:23.533Z"
}