{
  "work_id": "dragon-ball-super",
  "count": 15,
  "characters": [
    {
      "id": "gokuu-son",
      "name": "Gokuu Son",
      "alt_names": [
        "孫悟空",
        "Goku Son"
      ],
      "role": "protagonist",
      "description": "__Race:__ ~!Saiyan!~\n__Height:__ 175 cm (5'9\")\n__Birth Year:__ 737 Age  \n__Hobby:__ Fighting a Strong Opponent\n\nSon Gokuu is a boy we meet in a forest far from any civilization. He lives in this forest alone as his grandpa passed away, he only has this special orb-like object called a Dragon Ball to remember him by, which he will sometimes talk to as if it is his Grandpa Gohan. As the series continues, Gokuu meets Bulma, a brilliant teenage girl, and they go on a journey to collect these 7 magical dragon balls which actually have wish granting powers once all of them are collected. During this journey they meet and befriend Yamcha, Oolong, and Pu'ar, whose characters mirror those found in Wu Cheng'en's _Journey to the West_. Gokuu also encounters one his closest friends, Kuririn, and others during his time training. Participating in several World Martials Arts Tournaments, ~!Gokuu also battles foes-turned-allies such as Tien Shinhan and Chiaotzu, as well as the offspring of Demon King Piccolo named Piccolo Junior.!~\n\n~!\n_Dragon Ball Z_ takes place 5 years after the defeat of King Piccolo and Gokuu's last world tournament. We come to find out that Son Gokuu was originally named Kakarot, and is born a member of a race of extraterrestrials called the Saiyans. Shortly following his birth, Gokuu was sent from his home, planet Vegeta, to prepare Earth for sale on the intergalactic market by destroying all its life but due to that injury to his head that caused him severe amnesia, Gokuu forgot his purpose, and instead started focusing on becoming stronger for a little more than the pleasure of it. He now has a son named Son Gohan (named after Grandpa Gohan) who is some what of a cry baby but has hidden potential. Throughout the series, Gokuu faces terribly strong opponents like other powerful Saiyans, Intergalactic Rulers, Androids, and Extraterrestrial Beings that give him fights like no other. Along with new enemies, Gokuu also gains new friends that help him in these situations.  \n\nIn  _Dragon Ball GT_, which was not based on Toriyama's manga, Gokuu is turned into a child by a wish on the dragon balls by Pilaf. The series revolves around him traveling around space to find the Black Star Dragon Balls with the help of his granddaughter, Pan, and Trunks. The series ends with Gokuu leaving for good with Shenron and returning one hundred years later to witness the match between Gokuu Jr. and Vegeta Jr.  \n\nIn  _Dragon Ball Online_ (which takes place 216 years after Dragon Ball Z, and unlike Dragon Ball GT, Toriyama had a lot of creative control over the story), a new villain by the name of Miira appears with the goal to obtain Gokuu's DNA.  In  _Cross Epoch_, the  _Dragon Ball_ and  _One Piece_ crossover one-shot, Gokuu is seen accompanying Luffy to attend a party hosted by Shenron from whom key characters from both series had received an invitation.!~\n\n(Source: Dragon Ball Super Exciting Character Guide)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/246-wsRRr6z1kii8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 246
      },
      "rarity": "epic"
    },
    {
      "id": "vegeta",
      "name": "Vegeta",
      "alt_names": [
        "ベジータ",
        "Prince of All Saiyans",
        "Vegeta IV",
        "Prince Vegeta",
        "Saiyan Prince"
      ],
      "role": "protagonist",
      "description": "__Race:__ Saiyan  \n__Date of Birth:__ Age 732  \n__Height:__ 164 cm (5' 5\")\n__Hobby:__ Training  \n__Favorite Food:__ All types of food  \n__Favorite Vehicle:__ Space pod  \n__Known Family:__ King Vegeta III (father), Tarble (brother), ~!Bulma (wife)!~ ~!Trunks (son)!~ ~!Bra [Bulla] (daughter)!~ \n\nVegeta is a character from the manga series Dragon Ball by Akira Toriyama.  \n\nAside from Goku, Gohan and Piccolo, he is easily one of the most prominent characters in the series, receiving more character development after being introduced than a number of other characters.  Vegeta is haughty, arrogant, and filled with hatred and bitterness as a result of the destruction of his home planet and his race's abusive treatment at the hands of Freeza. His royal status seems to have caused him to develop an inflated sense of superiority and he holds himself above most people he encounters.  In  _Cross Epoch_ (the  _Dragon Ball_ and  _One Piece_ crossover one-shot) Vegeta is the captain of an air ship and is seen wearing an eye patch and a cape with a clasp featuring the Kanji character for \"vegetable.\" Trunks, Usopp, and Nico Robin are members of his crew.  \n\n(Source: Dragon Ball Super Exciting Guide, Character Edition)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b913-NIFkKazWM8VO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 913
      },
      "rarity": "epic"
    },
    {
      "id": "puar",
      "name": "Pu'ar",
      "alt_names": [
        "プーアル",
        "Puar",
        "Pu'erh",
        "Squeaker"
      ],
      "role": "supporting",
      "description": "Pu'ar is a soft-spoken shapechanging blue creature and the constant companion of Yamcha. The name is revealed to be a pun on Pu-erh tea. Pu'ar is neither a cat or a mouse, albeit the series creator Akira Toriyama stated that he had drawn the character to look a little bit like a cat. Traveling alongside Yamcha, the two worked as a team robbing anyone traveling through the desert area in which they lived. Pu'ar has an innate ability of levitation or flight, and is nearly always seen simply 'standing' in thin air at about human head height.  Pu'ar has the unique ability to shapeshift into any form, even inanimate objects, and can hold that form for as long as desired; his strength is not increased by the change, however, and as such he is unable to turn into something that can be used up like fuel or food. Pu'ar graduated from the same shapeshifting academy as Oolong, although unlike Oolong, Pu'ar had completed all of the academy training and does not have Oolong's difficulties with maintaining a transformed state. Pu'ar shows up quite a bit in the beginning, but becomes less of a presence as the series continues. As the driving theme of the series is mostly about fighting, Pu'ar can do little more than react to the horrors of the latest supervillains in the story.  There is some debate regarding the character's gender. Despite being portrayed by several female voice actors, the character has been referred to with both male and female pronouns during the anime. Though the issue of gender is never directly addressed, Toriyama has referred to Pu'ar as \"he\" while answering a fan question in the \"Ask Me Anything\" section in the back of the manga. Some fans believe that since shape-shifters can assume many different forms, gender is a moot point.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b677-PTNZaPeuV1Dx.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 677
      },
      "rarity": "common"
    },
    {
      "id": "bulma",
      "name": "Bulma",
      "alt_names": [
        "ブルマ",
        "Buruma",
        "Bloomers",
        "Lena",
        "Blooma"
      ],
      "role": "supporting",
      "description": "__Birth Year:__ 733 Age\n__Height:__ 165 cm (5'5\")\n__Race:__ Earthling \n\nBulma is originally a secondary main character, but her role is quickly downplayed as the series continues, even though she does remain an important support character for most of the series. Bulma is a direct parody of the character Xuanzang from the Chinese novel Journey to the West. Even though Bulma's character parodies a monk, her Japanese name \"Buruma\" is the brand of a popular gym short worn by girls in Japan. Her re-adapted name Bulma is a direct take on the word \"bloomers\", which was a popular brand of women's underwear in the early 20th century.  Bulma is the second character to be introduced in the Dragon Ball series. In the early part of the story, she is the inventor of the Dragon Radar and is searching for the legendary Dragon Balls. Bulma was hoping to use the Dragon Balls to wish for the perfect boyfriend. While searching for a nearby Dragon Ball, she runs into Son Goku. It is at this time that she finds out Goku inherited one of the balls (the four-star ball) she is searching for from his Grandpa Gohan. Because of Goku's love for the ball and his belief that his Grandpa's spirit lives in the ball, Goku is not willing to give it up. Bulma then asks him to loan it for her in exchange of taking him in her travels. At that point, they team up to find the remainder of the balls and the adventure begins. In the later action-oriented episodes of the series, there is little room for a genius but Bulma continues to play a role as a secondary character, helping Goku and his friends with her gadgets, and having a rather rocky relationship with Yamcha.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b678-2YCe13F0tFos.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 678
      },
      "rarity": "common"
    },
    {
      "id": "piccolo",
      "name": "Piccolo",
      "alt_names": [
        "ピッコロ",
        "Ma Junior",
        "Big Green",
        "King Piccolo",
        "Demon Junior",
        "Mr. Piccolo",
        "Piccolo Jr.",
        "Cor Petit Jr.",
        "Szatan Serduszko",
        "Store Grønn",
        "Satan Petit-Cœur"
      ],
      "role": "supporting",
      "description": "__Race:__ ~!Namekian!~\n__Height:__ 223 cm (7'4\") \n__Birth Year:__ 753 Age  \n\nPiccolo is a fictional character from the Dragon Ball series. He is introduced in the late stages of Dragon Ball as the main antagonist of the final saga and is a ruthless enemy of the protagonist Son Goku. He carries a very cold, menacing demeanour and is not afraid to show his evil nature, he is characterized wearing his weighted clothing, cape and turban. \n\n~!He is considered both the son and reincarnation of Demon King Piccolo and was spawned to save himself from certain death at the hands of Son Goku. Like his father, he appears as a tall green humanoid creature with pointy ears. After his narrow defeat against Goku, Piccolo is soon forced to form an at first uneasy alliance with Goku and his friends against newer, more dangerous threats. Out of necessity he also takes it upon himself to train Goku's child Son Gohan, forming a powerful bond which ultimately redeems him when he sacrifices himself to save the child's life. After his resurrection he fully joins Goku and the others in their struggles against ever more powerful villains.!~ \n\n(Source: Dragon Ball Super Exciting Guide, Character Edition)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b914-KuS8AWjqBrqa.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 914
      },
      "rarity": "common"
    },
    {
      "id": "majin-boo",
      "name": "Majin Boo",
      "alt_names": [
        "魔人ブウ",
        "Majin Buu",
        "Djinn Boo"
      ],
      "role": "supporting",
      "description": "Boo is introduced in the series as an innocent looking, pudgy, pink genie-like creature. Later in the series, it is revealed that Boo's original form is a more sleek child form (\"The Boo of Pure Evil\"), however his nature and form had been altered after he'd assimilated the gentle, pudgy god (Dai Kaioshin) into his body. Boo's creator, a wizard named Bibbidi, had used Boo to wage war on the Kaioshin. Boo managed to assimilate two of the four Kaioshin, the second being the one who altered his nature to become innocent. After Bibbidi sealed Boo away, Bibbidi was killed by the fourth Kaioshin, and Boo was transported to Earth where he layed dormant for five million years until he was revived by Bibbidi's son Babbidi during the events of Dragon Ball.\n\nBoo has numerous counterparts in the series. When he first emerges from his shell, he is tall and round, and his personality is naive and innocent. Boo's anger later manifests itself in the form of another Boo (\"The Boo of Pure Wrath\").  After a battle with the Boo of Pure Wrath, Boo is absorbed and the two combined create Super Boo, who tracks down the protagonists of the series Piccolo and Gotenks. He later reverts to his purest form, the original state called \"The Boo of Pure Evil\".",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/1012.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1012
      },
      "rarity": "common"
    },
    {
      "id": "gohan-son",
      "name": "Gohan Son",
      "alt_names": [
        "孫悟飯",
        "The Great Saiyaman",
        "The Gold Fighter"
      ],
      "role": "supporting",
      "description": "__Race:__ Half-Saiyan, Half-Human  \n__Height:__ 175 cm (5'9”)\n\nGohan is a shy and studious intellectual, and as a child lacks the Saiyan fighting spirit. However, because he is forced to protect the ones he loves, he taps into his vast half-breed Saiyan potential and emotional reserves, becoming one of the most powerful Z Fighters. As an adult, he abandons his superhero duties and uses his mind, as a premier scholar of the Dragon World. Gohan was extremely powerful, surpassing powerhouses like Goku and Vegeta at times. \n\n(Source: Dragon Ball Super Exciting Guide, Character Edition)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2093-kdFZhqcNSsqW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2093
      },
      "rarity": "common"
    },
    {
      "id": "chi-chi",
      "name": "Chi-Chi",
      "alt_names": [
        "チチ"
      ],
      "role": "supporting",
      "description": "__Race:__ Earthling\n __Height:__ 5' 2\"\n__Birth year:__ 737 Age\n__Hobbies:__ Working in the Farm, Gohan's Education\n__Favorite Food:__ Chimaki\n__Favorite Vehicle:__ Tractor\n\nChi-Chi (チチ, Chichi) is the wife of Son Goku, and the mother of Son Gohan and Son Goten. She is often depicted as a sometimes nagging, overprotective but fundamentally well-meaning woman, who sincerely looks for her children and husband's well-being even when their views clash. She and Goku meet as children, and Goku promises to marry her thinking marriage is food. Several years later, she finds him at the 23rd Tenkaichi Budoukai, and despite confessing that he misunderstood what she had meant, he fulfills his promise and asks her to marry him. As she gets older, she disapproves of Goku's lifestyle, enough to ban Gohan from following in his foot steps, but due to the threats like Vegeta and Freeza, she is forced to let him train under Piccolo and Goku. She relaxes this with Goten by training him herself while Gohan is away for school. She has a wild temper and can react in violent anger over the slightest annoyance which means all of the Z Warriors fear her and try to avoid making her mad.  (Source: Dragon Ball Super Exciting Guide, Character Edition)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/2102.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2102
      },
      "rarity": "common"
    },
    {
      "id": "briefs-hakase",
      "name": "Briefs Hakase",
      "alt_names": [
        "ブリーフ博士",
        "Dr. Brief",
        "Dr. Briefs"
      ],
      "role": "supporting",
      "description": "The father of Bulma, Dr. Briefs is an elderly, brilliant and eccentric scientist. He is one of the smartest men in the world. Dr. Briefs is the founder of Capsule Corporation and the man responsible for the invention of the Hoi-Poi Capsules, which can shrink inanimate objects down to pocket sized capsule of namesake. He is easy-going and friendly. Dr. Briefs rarely leaves his home, even if he knows he'll die (in the Buu Saga, he and his wife refuse to leave their pets even after Capsule Corp. has been specifically targeted for destruction; they know they can always be wished back) and he can often be found tinkering on a number of complicated gadgets while surrounded by his beloved pets. His favorite pet is a small black cat, named \"Tama\" in the original anime and \"Scratch\" in the FUNimation dub.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/2103.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2103
      },
      "rarity": "common"
    },
    {
      "id": "marron",
      "name": "Marron",
      "alt_names": [
        "マーロン",
        "Maron"
      ],
      "role": "supporting",
      "description": "Marron is the daughter of Kuririn and #18. She was born before the Majin Buu Saga in Dragon Ball Z. As a little girl, she resembles her father. She has his eyes and nose, or lack there of. However, she does indeed have a nose, though small, and as she grows older, Marron begins to look more like her mother. Unlike the rest of the other Z Fighters&#039; children, Marron is the only one who was never trained by her mother or father which means that she either has never shown any special abilities or martial arts skills of her own, or simply doesn&#039;t have any wish to give up on her normal life.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/2106.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2106
      },
      "rarity": "common"
    },
    {
      "id": "oolong",
      "name": "Oolong",
      "alt_names": [
        "ウーロン",
        "Oolon"
      ],
      "role": "supporting",
      "description": "Oolong is a shapeshifting humanoid pig, standing about three feet tall with pale pink skin, who tends to dress in trousers, button-down shirts, and suspenders. He was expelled from shapeshifting training for stealing the teacher's underwear and lacks the ability to change his form for more than five minutes at a time without a break. With his shapeshifting, Oolong can look like anything at all. Oolong's initial appearance was as a villain who terrorized a village and kidnapped their young women. Son Goku defeated Oolong and the girls were returned to their village. Bulma decided that he might be useful on her Dragonball quest and persuaded him to join their expedition. Eventually he becomes good friends with Goku and the others, and helps them to find more Dragonballs. He plays a large role in the beginning of Dragon Ball, but by the end of Dragon Ball Z, he just shows up from time to time. His poor shapeshifting skills (and innate cowardice) made him a very weak character that didn't have much to do once the tone was shifted to more serious action. In the anime and several movies, he appears quite often as comic relief. He is loosely based on the character Zhu Bajie from the classic Chinese novel Journey to the West.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/2108.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2108
      },
      "rarity": "common"
    },
    {
      "id": "videl",
      "name": "Videl",
      "alt_names": [
        "ビーデル",
        "Great Saiyaman 2 (グレートサイヤマン2号)",
        "Great Saiyawoman",
        "Great Saiyagirl"
      ],
      "role": "supporting",
      "description": "__Race:__ Earthling\n__Height:__ 4'11\"\n__Birth Year:__ 757 Age\n__Hobby:__ Serving as the Ally of Justice\n__Favorite Food:__ Okonomiyaki, Caesar Salad\n__Favorite Vehicle:__ Air Bike\n\nVidel is the daughter of Mr. Satan. Mr. Satan is very protective of her, especially in respect to boys. She grew up learning martial arts hoping to be as great as her dad, when in fact, unknown to herself she was already better than him. She is a tough, tomboyish character, raised with fame all around her. In her spare time, Videl fights crime in Satan City. She becomes suspicious of Gohan after meeting him at Orange Star High School, and she even follows him for a brief time to learn more about him. Videl eventually discovers Gohan's secret identity as the Great Saiyaman. She forces Gohan to teach her how to fly, and makes him enter the 25th Tenka'ichi Budokai under the threat that she'll reveal his identity to the world. ~!After the Buu saga, the two get together, and have a child named Pan.!~\n\n(Source: Dragon Ball Super Exciting Guide, Character Edition.)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2111-9XqkV0tpjRPB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2111
      },
      "rarity": "common"
    },
    {
      "id": "jinzouningen-17-gou",
      "name": "Jinzouningen 17-gou",
      "alt_names": [
        "人造人間17号",
        "17",
        "No. 17 (Juunana-gou)",
        "Lapis",
        "Android 17"
      ],
      "role": "supporting",
      "description": "Artificial Human #17, Android 17 in the English adaptations, is a fictional character who first appears in the Dragon Ball manga created by Akira Toriyama, as well as Dragon Ball Z and Dragon Ball GT.    Originally a human, he is constructed into a cyborg by Dr. Gero like his twin sister. 17 is a mass murderer in Future Trunks&#039; timeline.    Number 17 is not an android created by Dr. Gero. He and his twin sister #18, were once human. How could they be twins if they weren&#039;t once human? Toriyama said Gero found them as a couple of hooligans. They existed before Dr. Gero, therefore, they are not robots. An android is a robot and a cyborg is a human with robot parts in them. Considering what he can do, #17 is probably about half human.    Now as to the motivation behind #17 killing Dr. Gero, that&#039;s subjective. While they didn&#039;t necessarily like being turned into cyborgs, once it was done, it couldn&#039;t be undone. It was Dr. Gero&#039;s strangle hold on their freedom, as represented by the &quot;controller&quot; device, that inspired #17 to kill him. Threat + Rebel = dead Gero. They were both rebels. You should never try to put a leash on a rebel.    Later, #17 and #18 drive around in a van with Android 16, looking for Goku. When they finally get to the Kame House, Piccolo tells them Goku is not there. He refuses to tell them where he went to, and thus Piccolo challes #17 to a battle. As they fight, Piccolo&#039;s ki leads Cell (an evil insect freak spawned by Dr. Gero&#039;s computer who needs to absorb #17 and #18 to reach its perfect form) to the battlefield. He offers #17 to surrender so he can become a part of *greatness*. #17 refuses, and is defeated during the battle.     ~!Number 17 is killed when Cell explodes, but is wished back to life along with the other people on Earth who had been killed by Cell. #17 has his explosive device removed by Kuririn with the second wish. The last time we see #17 in DBZ is when he is in the woods donating energy for Goku&#039;s Genki-Dama. Considering the fact that he is alive during the Kid Buu saga serves as a testament to his good soul: the wish that revived him was one that Vegeta made asking for only the good people on Earth to be revived when it was restored (Kid Buu had previously obliterated the planet in a single attack).!~    *Wikipedia",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2147-AQ0iJ9QEmwPf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2147
      },
      "rarity": "common"
    },
    {
      "id": "kuririn",
      "name": "Kuririn",
      "alt_names": [
        "クリリン",
        "Kurin-chan",
        "Krillin",
        "Kulilin",
        "Clearin"
      ],
      "role": "supporting",
      "description": "A short, hairless (for most of the series) warrior monk, loyal Kuririn provides comic relief during tense moments. Like Chiaotzu, Kuririn doesn't have a nose. He is a good-natured, outgoing and competitive martial artist.  Once a fierce rival of Son Goku, he quickly became his best friend while training under Muten Roshi. He also is close to Goku's son, Gohan. He eventually marries Android 18 and settles down, having a daughter named Marron.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2159-qtEuMYyOUkwY.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2159
      },
      "rarity": "common"
    },
    {
      "id": "goten-son",
      "name": "Goten Son",
      "alt_names": [
        "孫悟天"
      ],
      "role": "supporting",
      "description": "__Race:__ Half Saiyan, Half-Human  \n__Height:__ 123 cm (4')  \n__Birth Year:__ 767\n__Hobbies:__ Playing War, Catching Bugs  \n__Favorite Food:__ Pocky, Strawberry Daifuku  \n__Favorite Vehicle:__ Bicycle  \nGoten is a fictional character in the manga and anime series Dragon Ball Z, as well as appearing in Dragon Ball GT. He is the second son of Son Goku and Chi Chi. Goten is a Human-Saiyan hybrid, just like his older brother, Son Gohan.  Son Goten's natural physique almost perfectly replicates his father Goku's, even though his appearance such as hairstyle and clothes change from time to time. Goten is generally seen wearing an outfit that mimics his father's, with only slight differences. As in the case of the last few episodes of Dragon Ball Z, his hair has grown long, no longer looking like his father's, he also wears a blue and white shirt with his name printed on it. In Dragon Ball GT, he wears a white shirt with purple jeans, and his hair is much shorter. His skin color stays lightly tanned for all of his appearances in Dragon Ball Z/GT. Goten, unlike his brother, was never shown to have a tail. This is never explained.  In  _Dragon Ball Online_ (which takes place 216 years after Dragon Ball Z, and unlike Dragon Ball GT, Toriyama had a lot of creative control over the story), it is stated that in 800 Age, Goten, along with Present Day Trunks had created the Kikoukenjutsu Sword School   (Source: Wikipedia, Dragon Ball Super Exciting Guide, Character Edition)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/2551.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2551
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-26T04:00:09.585Z"
}