{
  "work_id": "snow-white-with-the-red-hair",
  "count": 14,
  "characters": [
    {
      "id": "shirayuki",
      "name": "Shirayuki",
      "alt_names": [
        "白雪"
      ],
      "role": "protagonist",
      "description": "__Height:__ 162 cm (5'4\")\n\nShirayuki is a bright and resourceful girl, determined, able to speak her mind, and knowledgeable in both botany and medicine. Whenever there is a problem or conflict, she often takes matters into her own hands. She later learns to rely on others, especially Zen.\n\nDue to her rare hair color, Shirayuki gets a proposal to be a concubine of the foolish but famous prince Raji. As she cannot decline it, she escapes to the neighboring country. While traveling, she meets a boy named Zen, who accidentally gets injured, and she boldly cures his wounds. They become friends, and she finds out than Zen is actually a prince of that country, and he saves her from being taken by Raji. They later go to his palace, where she applies for the job of \"Palace Pharmacist,\" to be able to go freely to the castle where Zen is.\n\n~!Although she is put off initially by Zen's arrogance she comes to realize that, that isn't his true character. The more time she spends with Zen, the more she wants to be by his side even though she knows someone of her social status is not fit to be with royalty. After helping Kiharu, Zen goes to Shirayuki and thanks her by initiating a kiss. This causes confusion and conflict within her which causes her to avoid eye contact with Zen. Unable to handle her present feelings for Zen, she panics and runs into the forest to which Zen gives chase. After calming down Shirayuki realizes how much she loves Zen as well as why she loves him. She confesses asking if it is alright to keep feeling that way. Zen responds that he wants to be with her with a mutual promise to be together.!~",
      "metadata": {
        "gender": "female",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b18323-yDl2JX1vF19h.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18323
      },
      "rarity": "epic"
    },
    {
      "id": "zen-wistaria",
      "name": "Zen Wistaria",
      "alt_names": [
        "ゼン・ウィスタリア",
        "Zen Wistalia"
      ],
      "role": "protagonist",
      "description": "__Height:__ 176 cm (5'9\")\n\nThe 2nd prince of the Kingdom of Clarines. He is in love with Shirayuki and has told his brother, Izana that he wishes to make her his wife.\n\nZen is an excellent swordsman and has a penchant for exiting out windows instead of doors and jumping down from high places.\n\nAs a young child, Zen has built up an immunity against various poisons by exposing himself to poisons in specific controlled doses causing convulsions, fever, and difficulty walking to name a few. These results were carefully documented by his doctors.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b18324-WauBT7sWq4hA.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18324
      },
      "rarity": "epic"
    },
    {
      "id": "kiki-seiran",
      "name": "Kiki Seiran",
      "alt_names": [
        "木々・セイラン"
      ],
      "role": "supporting",
      "description": "She is one of Zen's close Aides. Her partner is Mitsuhide whom she likes to tease.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b18325-CIHPHLsDdwpT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18325
      },
      "rarity": "rare"
    },
    {
      "id": "mitsuhide-rouen",
      "name": "Mitsuhide Rouen",
      "alt_names": [
        "ミツヒデ・ルーエン"
      ],
      "role": "supporting",
      "description": "One of Zen's close Aides. He was first introduced to Zen when he was 17 by Zen's brother, the first prince, Izana. Mitsuhide is one with an outgoing and honest personality. He shares a close relationship with Zen and can often be seen having a friendly banter with each other. He was once described as 'protective' by Kiki, another close aide, towards Zen.",
      "metadata": {
        "gender": "male",
        "age": "23",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b18326-CGse1KjRMXWT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18326
      },
      "rarity": "rare"
    },
    {
      "id": "obi",
      "name": "Obi",
      "alt_names": [
        "オビ"
      ],
      "role": "supporting",
      "description": "Working for Zen, Obi, is a strange (but lighthearted mostly) and unusual character in the story. His first appearance is when he tries to frighten Shirayuki by shooting an arrow to a wall next to her. He tends to hide his face under a mask, which makes many people think of him as a bad guy. He later starts showing to have feelings for Shirayuki, for she is the only person that understands him. Out of all the characters in AnS, he is the only character with unknown motives for following Zen so far which makes him a rather mysterious character.\n\n~!Later, it is revealed he has feelings for Shirayuki.!~",
      "metadata": {
        "gender": "male",
        "age": "21",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b25273-MveN8WxA1iSj.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 25273
      },
      "rarity": "rare"
    },
    {
      "id": "ryuu",
      "name": "Ryuu",
      "alt_names": [],
      "role": "supporting",
      "description": "Shirayuki&#039;s mentor pharmacist and a genius with medicine. He works very diligently but when his concentration is broken he goes to sleep (usually under his desk although he can sleep almost anywhere)",
      "metadata": {
        "gender": "male",
        "age": "12",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b25483-RN9gSjYPBAlp.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 25483
      },
      "rarity": "rare"
    },
    {
      "id": "izana-wistaria",
      "name": "Izana Wistaria",
      "alt_names": [
        "イザナ・ウィスタリア・クラリネス"
      ],
      "role": "supporting",
      "description": "He is the crown Prince and also Zen&#039;s older brother. He also doesn&#039;t like the idea of Shirayuki being close to Zen, but knows that Zen is deeply in love with her.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b26484-8n6G6e6zBW8R.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 26484
      },
      "rarity": "rare"
    },
    {
      "id": "kihal-toghrul",
      "name": "Kihal Toghrul",
      "alt_names": [
        "キハル・トグリル",
        "Kiharu Toghril"
      ],
      "role": "supporting",
      "description": "Kihal is a young girl hailing from a small island. Her village is known for it&#039;s beautiful messenger birds with oceanic blue and green feathers. Kihal has her own bird, Popo, that she controls with her flute, called a Walnut Stone. She despises nobles for the acts they have done on her island. They hunted the birds ignorantly and cared nothing for the islanders. Kihal enters the story by going to Clarines to complain about this problem, but only to be tested in the process.\n\n(Source: MyAnimeList, edited)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28424-C3nwJx8Pl4Wz.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28424
      },
      "rarity": "rare"
    },
    {
      "id": "garack-gazeld",
      "name": "Garack Gazeld",
      "alt_names": [
        "ガラク・ガゼルド"
      ],
      "role": "supporting",
      "description": "She's the Chief Pharmacist of Clarines and the one gives Shirayuki the test to become a royal pharmacist.  Source: Wikipedia",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b64659-gUW1NqRnlgBs.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64659
      },
      "rarity": "rare"
    },
    {
      "id": "haruka-koushaku",
      "name": "Haruka Koushaku",
      "alt_names": [
        "ハルカ侯爵"
      ],
      "role": "supporting",
      "description": "A man who is only concerned about appearances and his social status. He opposes Shirayuki's relationship with Prince Zen regarding her as a \"commoner\" unfit to be with Zen.  He is afraid that if Shirayuki is allowed to be near Zen, the people of Clarines will not respect Zen's authority.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/68139.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 68139
      },
      "rarity": "rare"
    },
    {
      "id": "mihaya",
      "name": "Mihaya",
      "alt_names": [
        "巳早 "
      ],
      "role": "supporting",
      "description": "Appears in chapter 2. He kidnaps Shirayuki on the mountain in order to make money by showing off her rare red hair. He explains he was once a noble who became penniless and as a result lost his rank and status. Desperate, he is willing to make money using any means necessary.  Later in the story he requests an audience with Prince Zen who demands him thrown out, still holding a grudge against him for kidnapping Shirayuki. Zen is wary and distrustful of him and suspects him having an ulterior motive. Mihaya provides information of a \"pretty boy\" who is looking for Shirayuki and may be planning on kidnapping her. He helps in the searching for the \"pretty boy\" when Shirayuki goes to Tanburn.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/70831-fZTGKyPorwBk.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 70831
      },
      "rarity": "rare"
    },
    {
      "id": "raji-shenazard",
      "name": "Raji Shenazard",
      "alt_names": [
        "ラジ・シェナザード"
      ],
      "role": "supporting",
      "description": "Raji is the prince of Shirayuki's mother country, Tanburn. Regarded by his people and known even by the neighboring country of Clarines as an idiotic and selfish prince, Raji does as he pleases. Raji orders Shirayuki to become his concubine simply because she has rare red hair. In response to this absolute order, Shirayuki cuts her long hair, leaves it behind, and escapes to the neighboring country. After Zen is poisoned by an apple (sent by Raji) intended for Shirayuki, Raji forces Shirayuki to come to his castle to be his concubine in exchange for the antidote. Shirayuki almost complies before a recovered Zen bursts in revealing himself to be the second prince of Clarines. He orders Raji at sword-point to leave Shirayuki alone or else strain the relation between Clarines and Tanburn. Raji of course, obeys.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b75480-ixmXhWC5AKDL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 75480
      },
      "rarity": "rare"
    },
    {
      "id": "atri",
      "name": "Atri",
      "alt_names": [
        "アトリエ"
      ],
      "role": "supporting",
      "description": "Atri is one of the remaining members of the Lido family and became a rebel. Prince Izana punished the family because they considered victims and pawns of their lords but the truth is they filled up their pockets by trampling on the good.\n\nHe only appeared in the Episode 8 of the first season of the anime.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b136968-FAhEW7Py48fD.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 136968
      },
      "rarity": "rare"
    },
    {
      "id": "shuka",
      "name": "Shuka",
      "alt_names": [
        "シュカ"
      ],
      "role": "supporting",
      "description": "Shuka is an Apprentice Soldier stationed at Fort Laxdo.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b228983-alZfJUhqqe07.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 228983
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-26T02:03:21.783Z"
}