{
  "work_id": "durarara",
  "count": 15,
  "characters": [
    {
      "id": "mikado-ryugamine",
      "name": "Mikado Ryugamine",
      "alt_names": [
        "竜ヶ峰帝人",
        "Tanaka Taro (田中太郎)"
      ],
      "role": "protagonist",
      "description": "__Height:__ 165 cm  \n\nThe primary male protagonist of the series, Mikado Ryugamine is a high school boy who moved to Ikebukuro with the encouragement of his best friend Masaomi in order to search for unusual beings and adventure. Mikado tries hard to change his image but so far he has not had any luck. Mikado has had moments where he speaks his mind, which is a reason why Masaomi admires him.",
      "metadata": {
        "gender": "male",
        "age": "16-19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24592-TS71Pz7B0bNy.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24592
      },
      "rarity": "legendary"
    },
    {
      "id": "masaomi-kida",
      "name": "Masaomi Kida",
      "alt_names": [
        "紀田正臣",
        "Bakyura"
      ],
      "role": "protagonist",
      "description": "__Height__: 170 cm  \n\nKida is Mikado Ryuugamine's childhood friend and resident of Ikebukuro. Kida is an easy-going guy and appears foolhardy at times. He is 15 years old and is in class 1-B.   Mikado says that Kida used to be very energetic in elementary school and describes him as being quite charismatic. Kida seems to know many of the residents of Ikebukuro and he functions as a guide to Mikado.  He enjoys flirting with older girls and women although his passes usually aren't taken very well. \n\n~!He was the leader of the gang: Yellow Scarves. During his reign, he is referred as \"Shogun\" (i.e. \"General\") although he doesn't seem like to be referred to as that title. He is very strong fighter as demonstrated during the coup of the Yellow Scarves; he took down several opponents with crowbar before collapsing due to a wound on his head.  He left Ikebukuro with Saki at the end of the third novel, but joined the chat-room using alias \"Bakyura\" to keep in touch with Mikado. He is now working with Saki for Izaya. He returns during the eighth novel and Mikado tells Kida to stay away from him and not to get involved with the current affairs.!~  \n\n(Source: Durarara!! DVD)",
      "metadata": {
        "gender": "male",
        "age": "15-20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24593-vACD1zDsDSkT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24593
      },
      "rarity": "legendary"
    },
    {
      "id": "anri-sonohara",
      "name": "Anri Sonohara",
      "alt_names": [
        "園原杏里"
      ],
      "role": "protagonist",
      "description": "__Height__: 152 cm   \n\nA bespectacled girl who attends the same school as Mikado and Masaomi. She is rather quiet and timid, but seems very close towards Kida and Mikado. She is very busty and cute, which makes her somehow popular, even though she feels uneasy about it. Mikado seems to have a crush on her.  Chat name and origins:  ~!Her online chat screenname is \"Saika\".  She is currently in possession of the demon sword Saika, which gives her control over whoever it cuts and people wielding its 'daughter' swords. !~  Her past:  ~!When she was younger, her father was extremely abusive towards her. Her mother, who was at the time possessed by Saika, killed him and then herself. !~  (Source: Anri's profile from the 3rd DVD)",
      "metadata": {
        "gender": "female",
        "age": "15-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24594-SQbcpxLBiTm5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24594
      },
      "rarity": "legendary"
    },
    {
      "id": "shizuo-heiwajima",
      "name": "Shizuo Heiwajima",
      "alt_names": [
        "平和島静雄",
        "Shizu-chan"
      ],
      "role": "protagonist",
      "description": "A man who is always seen to wear sunglasses and a bartender's suit. Although quiet and nondescript while not angered, he has a very short fuse and fights with incredible strength. Despite his simple and unrefined fighting skills, he is often considered the strongest fighter in the series. In the novels his power is described as the naturally unlimited form of human strength and likened to \"adrenaline power\" that can give people superhuman strength in times of emergency. In addition, Shizuo is capable of often superhuman parkour moves, a skill he obtained naturally from years of hunting down Izaya Orihara.  Shizuo works as a bodyguard for a debt collector in Ikebukuro and carries intense animosity towards Izaya. He has a younger brother, Kasuka, who is a top idol under the showbiz name of Hanejima Yuuhei. He is also a long-time acquaintance of Celty. His first and last name translates literally into \"serene man\" and \"peaceful island\" respectively. Shizuo likes receiving gifts from his little brother, [Kasuka Heiwajima](https://anilist.co/character/30441/Kasuka-Heiwajima)",
      "metadata": {
        "gender": "male",
        "age": "24-27",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n24595-pfv6CeBrPl7q.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24595
      },
      "rarity": "legendary"
    },
    {
      "id": "izaya-orihara",
      "name": "Izaya Orihara",
      "alt_names": [
        "折原臨也",
        "Kanra",
        "Nakura",
        "Chrome",
        "Iza-nii"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm\n\nA young man who sells information for his own enjoyment. He claims to love the entire human race except for Shizuo Heiwajima, and exhibits said love by putting humans in often miserable conditions and observing their reactions.  \n\nHe attended Raira Academy with Shizuo, Shinra and Kadota. According to Shinra, Izaya and Shizuo hated each other with a passion almost from the point they met. In the novels Izaya framed Shizuo for crimes on several occasions. In the anime he puts Shizuo in constant problems, such as gangs attacking him daily up to framing him of crimes.  \n\nHe is a master of parkour, and also quite skilled with his flickblade (the blade he uses must be slightly opened before the mechanics of it springs opens the blade - a switchblade will open on its own after the user presses a switch) as he is implied to be the only one capable of leaving numerous cuts in Shizuo's bartender suit after a fight in the novels. In the anime, he shaves a gang member's head bald without him noticing it. He is also fluent in Russian, which is exhibited in the final episode and episode 13 when he speaks with Simon.  \n\nIzaya has two younger sisters, Mairu and Kururi, who are twins and troublemakers. He claims to have grown up in a normal family whose only abnormal trait was their naming habits. He does not like his sisters and find them to be unlovable, saying that if even he can not like them, he expects no one else to ever be able to either.  \n\nHis name comes from a combination of the biblical Isaiah and Japanese for \"the one who looks over the crowd.\"  \n\nIn the novels, Shinra is the only person that Izaya doesn't consider as one of his \"humans.\" Rather, Izaya considers Shinra as his only friend (which is rather rare). Though it was hinted that he also cares for Saki, despite his manipulation towards her. It was stated that he was like her guardian. He seemed to be genuinely sad when Simon informed him that she left Ikebukuro with Kida.\n\n~!In volume 9 of the novels, Izaya treats Shinra as his only friend, letting himself be seen as guilty and put on protective custody for \"stabbing\" Shinra, which was supposed to be Nakura's fault. It is stated that Izaya greatly envies Shinra because Shinra's standards were far departed from any other human's, even including Izaya's. He had always thought of himself as being in a position to observe humans and therefore standing on a higher pedestal than those around him. But unlike Izaya, Shinra was living in a different world in the real sense of the word.!~   \n\n~!He is a part of the anonymous online gang the Dollars. He is usually seen pretending to be female online and talks in a feminine manner in the chatroom. His screenname is \"Kanra.\"!~",
      "metadata": {
        "gender": "male",
        "age": "23-27",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24596-IKSguezbPH9D.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24596
      },
      "rarity": "legendary"
    },
    {
      "id": "shinra-kishitani",
      "name": "Shinra Kishitani",
      "alt_names": [
        "岸谷新羅"
      ],
      "role": "protagonist",
      "description": "__Height:__ 178 cm    \n\nA young underground doctor who lives with Celty and is also her lover.  He mostly remains indoors and wears his white doctor's coat even when he is not at work.  He went to the same primary school as Shizuo and Izaya and finds them interesting, enjoying their fights ... up to a point. His father was also a doctor, and as a child,​ Shinra participated in surgery alongside him, the most notable being an autopsy on Celty when they first met.  As a doctor he is rather interested in what he considers to be interesting phenomena, such as the unlimited strength Shizuo shows in times of anger, and Celty's healing, headlessness and bodily functions.   Shinra seems to have the \"capacity\" to tell what Celty is feeling, much to her surprise since she doesn't have a head to show her emotions.",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24597-bwi62765fT0I.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24597
      },
      "rarity": "legendary"
    },
    {
      "id": "celty-sturluson",
      "name": "Celty Sturluson",
      "alt_names": [
        "セルティ・ストゥルルソン",
        "The Headless Rider",
        "The Black Rider"
      ],
      "role": "protagonist",
      "description": "Celty is a Dullahan from Ireland who came to Japan looking for her stolen head. Her motorcycle is actually a horse in disguise. She has no heart and perceives surroundings via unknown sensors that are not located on the head. The physical strength she possesses is above human, though not quite on par with Shizuo Heiwajima. She is also capable of manipulating a shadow-like, durable substance to form objects ranging from gloves to chariots at her will.  Celty lives with Shinra Kishitani and works as an underground porter. She wears a helmet when she goes out and communicates via a PDA. She enjoys online chatting, television and DVDs. She is one of the minority who knows the creator of the Dollars. She seems to have feelings for Shinra, but she herself if unsure if it is really love. She tends to get mad when Shinra says she does not need her head. She is afraid of movie scenes such as being chased by extraterrestrials or traffic officers.   ~!Her online chat screenname is \"Setton\".!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28331-At0Nz4p6qZHx.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28331
      },
      "rarity": "legendary"
    },
    {
      "id": "kyohei-kadota",
      "name": "Kyohei Kadota",
      "alt_names": [
        "門田京平",
        "Dotachin",
        "Monta"
      ],
      "role": "supporting",
      "description": "__Height:__ 183 cm\n\nOriginally part of his own gang, Kyohei is now a member of the gang Dollars. He has a nickname &quot;Dotachin&quot; which is used by several characters in the series (mostly Izaya and Erika).    One day he got a message to join the gang Dollars. He first thought is was a joke but on the next day he saw his login name (MONTA) on the list of the members of Dollars.    Monta originated from his last name (門田), because 門 is also read as Mon and 田 (Ta) stays the same. He and other members never saw the leader of Dollars, but he has a suggestion who the leader is because there is only one person who could organize such a strange organization. His suspicion is on Izaya Orihara. Izaya was also the person who gave him the nickname &quot;Dotachin&quot;. He likes to read, ink and wash paintings, company, hot springs and watch baseball games.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b26832-lSNvYFaxHH78.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 26832
      },
      "rarity": "rare"
    },
    {
      "id": "erika-karisawa",
      "name": "Erika Karisawa",
      "alt_names": [
        "狩沢絵理華"
      ],
      "role": "supporting",
      "description": "__Height:__ 160cm \n\nErika is a very passionate otaku and manga reader. She and Walker are usually together. She is equally enthusiastic about manga or novel-inspired torture. It is noted she is a \"fujoshi\" or a yaoi fan.   Like Izaya, she calls Kadota \"Dotachin\".   \n\n~!She is a member of the anonymous online gang Dollars. She was also a member of Kadota's gang.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27885-o86wkQabM9wH.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27885
      },
      "rarity": "rare"
    },
    {
      "id": "seiji-yagiri",
      "name": "Seiji Yagiri",
      "alt_names": [
        "矢霧誠二"
      ],
      "role": "supporting",
      "description": "A classmate of Mikado's. He quits school claiming he has something more important to do with his life. He is very obsessed to his 'true love' who has scar on her head; revealing his psychopathic behaviours. He seems to rely on his sister's money for that.    ~!It is revealed that he is in love with Celty's head.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27886-rAb0VHVjs9xg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27886
      },
      "rarity": "rare"
    },
    {
      "id": "namie-yagiri",
      "name": "Namie Yagiri",
      "alt_names": [
        "矢霧波江"
      ],
      "role": "supporting",
      "description": "The Chief of Yagiri Pharmaceuticals and sister of Seiji Yagiri. She harbors feelings for her brother. She is behind the recent human hunting in Ikebukuro which involves kidnapping people whose disappearance would not be noticed for unknown experiments. She seems to rely on Shinra for some tasks, including keeping their secret. She doesn't like the fact that Seiji is in love with Celty's head. She wants to get rid of what she calls \"that thing.\" After Yagiri Pharmaceuticals ends up merging with another company, she makes a deal with Izaya and becomes his secretary.",
      "metadata": {
        "gender": "female",
        "age": "25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27888-o63ZN7EwoeCk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27888
      },
      "rarity": "rare"
    },
    {
      "id": "semyon-brezhnev",
      "name": "Semyon Brezhnev",
      "alt_names": [
        "サーミャ・ブレジネフ",
        "Simon",
        "サイモン・ブレジネフ",
        "Simon Brezhnev"
      ],
      "role": "supporting",
      "description": "A tall Black Russian who came to the city to help out his Russian friend who runs a sushi shop. His real name is Semyon but everyone just calls him by the name, &quot;Simon&quot;.     Even though he is a friendly person, it has been shown that he is a force to be reckoned with as he is able to stop a fight with a man his size with just a single arm and also able to fight on par with Shizuo, who is one of the most feared men in Ikebukuro. He is another member of Dollars.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27889-MiEsi3Wf7sxE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27889
      },
      "rarity": "rare"
    },
    {
      "id": "walker-yumasaki",
      "name": "Walker Yumasaki",
      "alt_names": [
        "遊馬崎ウォーカー",
        "Yumacchi"
      ],
      "role": "supporting",
      "description": "__Height:__ 174cm \n__Weight:__ 55kg \n__Birthday:__ Jan. 23rd\n__Hobbies:__ Everything fictional (including games, movies, etc.), anime songs, ice carving \n__Things he likes:__ Make-believe, vision, fantasizing, wishful thinking, daydreaming \n__Things he dislikes:__ Censorship of expression \n__Foods he likes:__ Manga meat* \n__Foods he dislikes:__ “I can’t afford to be picky about food if I’m going to end up in the 2D world one day! So I’ll eat anything, even insects!” \n__Favorite saying:__ “I’m glad you asked! I’ll start from the titles beginning with an ‘A’…(and he went on to cite over 100 sayings from anime and manga as well as those by mangaka and anime producers, which we will omit here.)” \n\nLike his female friend and companion, Erika, Walker is a very passionate otaku and manga reader. He and Erika are nearly always together. He also likes to perform torture by letting the victim choose a light novel or manga, and carrying out the contents.  He seems to be carefree. He also keeps a wide dumb smile most of the time. But this smile can hide more than people can see at first glance. Like Erika he is a very mysterious person.   ~!He is a member of the anonymous online gang Dollars. He was also a member of Kadota's gang and an​ ex-member of the Blue Squares.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27890-52uU3vYHYzF0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27890
      },
      "rarity": "rare"
    },
    {
      "id": "tom-tanaka",
      "name": "Tom Tanaka",
      "alt_names": [
        "田中トム"
      ],
      "role": "supporting",
      "description": "Tom Tanaka is an old friend and senpai of Shizuo Heiwajima. He works as a debt collector, and later becomes Shizuo's employer. Tom is usually seen walking around in a suit, but his clothing and his hair don't make him look too formal. This is probably due to his job as a debt collector, which needs him to look sharp and business-like but not too polite and friendly, as he often confronts people. It is likely that he works as an underground debt collector, and not for something like a bank. The light novels state that he works for an online dating website. He generally has a sort of reserved, laid back personality, and as harsh as you might expect an underground debt collector to be. He is usually calm, and is able to calm Shizuo down and make him stop without angering him and incurring his wrath.  \n\n(Source: Durarara wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29207-TDzjtfmjfRA6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29207
      },
      "rarity": "rare"
    },
    {
      "id": "kinnosuke-kuzuhara",
      "name": "Kinnosuke Kuzuhara",
      "alt_names": [
        "葛原金之助"
      ],
      "role": "supporting",
      "description": "A motorcycle cop with the police department. In the anime, he is known to chase after criminals viciously and has caused accidents and injuries among bystanders during his chases.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29209-bpYYUszDyKgF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29209
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T17:25:35.853Z"
}