{
  "work_id": "rezero-starting-life-in-another-world-season-3",
  "count": 65,
  "characters": [
    {
      "id": "emilia",
      "name": "Emilia",
      "alt_names": [
        "エミリア",
        "Satella",
        "Lia",
        "Emilia-tan",
        "Witch of Glaciation",
        "Hyouketsu no Majo (氷結の魔女)",
        "Witch of Frost",
        "Han Ma (半魔)",
        "Half-Devil",
        "Mili",
        "Emily"
      ],
      "role": "protagonist",
      "description": "**Height:** 164 cm (5'5\")\n\nShe is a silver-haired half-elf girl who is one of the candidates to become the next ruler in the royal election. Subaru first meets her when her insignia is stolen by Felt as she needs to possess it to be eligible to participate in the election. She introduces herself as Satella when she and Subaru met during the first timeline before introducing herself by her real name when she got her insignia back.\n\nEmilia is good natured and likes to take care of others, though she herself refuses to admit it, instead thinking of it as her own selfishness. She is indifferent to her own appearance, leaving Puck to take care of her clothes and hair. Because her appearance is similar to the Witch of Envy, she has received unfair discrimination from others. She sometimes acts like a child and is unacquainted with the world as she used to live in the woods with other Elves, though despite this she still works hard to become a ruler.",
      "metadata": {
        "gender": "female",
        "age": "14-19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88572-IzTwXEHSobRs.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88572
      },
      "rarity": "epic"
    },
    {
      "id": "subaru-natsuki",
      "name": "Subaru Natsuki",
      "alt_names": [
        "ナツキ・スバル",
        "Barusu",
        "Lolimancer",
        "Young Su",
        "Baru",
        "Subaruun",
        "Natsumi Schwartz",
        "Bals",
        "Le Chevalier de la Demi-Elfe",
        "The Half Elf's Knight",
        "Natsuki Schwartz",
        "Spirit Knight",
        "Purge King",
        "Captain",
        "Boss",
        "Suu",
        "Basu"
      ],
      "role": "protagonist",
      "description": "__Height:__ 173 cm (5'8\")\n\nOn the way home from the convenience store, he suddenly finds himself transported into another world. He has the ability that he calls \"Return by Death\" to go back in time when he dies. Despite being a hikikomori and gamer in his real world, Subaru does a bit of workout and seems to know basic hand-to-hand combat, making him not completely weak.\n\nWhile Subaru tends to not read the situation, he is loyal to those he holds dear, willing to help them, even if that means taking the thorny path. He has his resolve confirmed through the many situations and circumstances he faces in the fantasy world, originally having been one to always take the \"easy\" route. As a hikikomori, he is hopeful of the possibilities that being sucked into a new realm brings, but later realizes the realities of the predicament he is in. Ultimately, he resolves himself to be faithful and protective of the ones that he cares most about.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88573-F8yMTK9GhnTA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88573
      },
      "rarity": "epic"
    },
    {
      "id": "reinhard-van-astrea",
      "name": "Reinhard van Astrea",
      "alt_names": [
        "ラインハルト・ヴァン・アストレア",
        "Kensei (剣聖)",
        "Sword Saint",
        "Knight Implacable"
      ],
      "role": "protagonist",
      "description": "__Height__: 184 cm (6'0\")\n\nReinhard van Astrea is the current Sword Saint and a member of the Royal Guard, currently acting as [Felt](https://anilist.co/character/88574/Felt)'s knight. \n\nAs the Sword Saint and the Knight of the Royal Guard, Reinhard embodies chivalry and elegance, treating everyone with exceptional respect. He is fair, brave, and always acts in the name of justice, whether on duty or simply strolling through the Royal Capital.\n\nAs a knight, Reinhard only uses his sword when necessary, since, in addition to being a rule, his iron-clad rule is to not inflict pain to others if not absolutely necessary, be it a normal thug or a member of the Witch Cult.",
      "metadata": {
        "gender": "male",
        "age": "19-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88577-oKKnibqGgSSD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88577
      },
      "rarity": "epic"
    },
    {
      "id": "beatrice",
      "name": "Beatrice",
      "alt_names": [
        "ベアトリス",
        "Beako",
        "Betty",
        "Campaign Slayer"
      ],
      "role": "protagonist",
      "description": "__Height:__ 140 cm (4'7\")\n__Age:__ ~!400+ (Actual)!~\n\nThe caretaker of the library in Roswall's mansion. \n\nShe has a distinct way of speaking, adding \"I suppose\" (かしら, kashira) and \"in fact\" (のよ, no yo) at the end of some of her sentences.\n\n~!Around 400 years ago, Beatrice was created by Echidna. She helped her with her experiments, such as the Sanctuary Barrier, though she wasn't told everything as she didn't know that Ryuzu Meyer would be sealed in a crystal. Sometime later, Echidna ordered her to stand guard over the library while she waited for \"that person,\" an order which she diligently followed.!~\n\n~!After numerous and painful attempts to convince her to leave the library Subaru succeeded, and Beatrice became his contract spirit.!~\n\n(Source: Re:Zero Wikia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90181-wRPm0OEaucmw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90181
      },
      "rarity": "epic"
    },
    {
      "id": "felt",
      "name": "Felt",
      "alt_names": [
        "フェルト",
        "Feruto"
      ],
      "role": "supporting",
      "description": "**Height:** 150 cm (4'11\")\n\nA thief that lives in the slums. Felt stole Emilia's insignia, hoping for quick, easy cash. Though Felt can usually handle her own, she does consider Rom to be like family.\n\n~!After being chosen by the insignia, she is forced to participate in the Royal Selection and is currently a candidate to become the 42nd King of Lugunica.!~",
      "metadata": {
        "gender": "female",
        "age": "14-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88574-Hau8t0GlMvhp.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88574
      },
      "rarity": "uncommon"
    },
    {
      "id": "ram",
      "name": "Ram",
      "alt_names": [
        "ラム",
        "Ram-chi",
        "Ramu"
      ],
      "role": "supporting",
      "description": "__Height:__ 154 cm (5’1”)\n\nRam is one of the twin maids working for Roswaal L Mathers. She has medium length light pink hair that covers her left eye, large darkish pink eyes, and young features. She also has hair clips towards right side of her hair, flower-shaped ribbon on the same side of her hair, and a maid hairband. She looks nearly identical to her sister Rem apart from her hair, eyes, and ribbon coloring. She usually wears a maid uniform. She has a smaller chest compared to her sister, and she has slanted eyes. Ram is seemingly self-centered and does things at her own pace, however in actuality she maintains a distance from people to ascertain them. She believes that Roswaal is the greatest and no one else is as precious except for her sister Rem. She is slightly more outgoing in comparison to the generally taciturn Rem, who generally allows Ram to take the lead in their sisterly bond.\n~! As the prodigal elder twin Ram was born with extraordinary talent for mana manipulation and a powerful body to match that made her the pride of the Oni village. Her aptitude didn't just lie there, everything from cooking to physical activities she was superior to Rem and was showered in adoration even by her own sister. However she never let any of it get to her head and never forgot her little sister no matter how much attention was paid to her. During the night of the attack by the Witch Cult when all the Oni fell she alone kept fighting to avenge them and protect her sister. But the cult outnumbered her and she made a last ditch effort to shield a petrified Rem from getting cut down. In mere moments, Ram lost her horn when it was sliced off from her head as a result of that. Had it not been for a passing mage at the time whom they came to know as Roswaal L Mathers they would not have survived the massacre.\nThe next several years since then Roswaal would gain the twins eternal gratitude and fervent loyalty. Especially in the case of Ram who came to harbor romantic feelings for him who also served as her lifeline due to regular mana infusions. During the early days of her life in Roswaal's mansion Ram would also come to know the partial truth of the cult's raid that night as well as the identity of the cult member responsible for cutting off her horn, Faust with assistance from Roswaal and achieved her vengeance. Ram is the only person who knows about Roswaal's gospel and had formed a contract with him that stipulated that his life would be hers if the future ever deviated from it's predictions as penance for knowing about the attack and letting it happen for his own ends. !~",
      "metadata": {
        "gender": "female",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88576-NWkotUiJ3mK3.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88576
      },
      "rarity": "uncommon"
    },
    {
      "id": "anastasia-hoshin",
      "name": "Anastasia Hoshin",
      "alt_names": [
        "アナスタシア・ホーシン",
        "Black Fox",
        "Greedy Princess",
        "Iron Plate Magistrate"
      ],
      "role": "supporting",
      "description": "Anastasia Hoshin is the head of the Hoshin Trading Company and a candidate to become the 42nd King of Lugnica. Her knight is Julius Juukulius.\n\nDespite her surname being \"Hoshin\", she's not directly related to Hoshin of the Wilderness. She chose the name because she was inspired by his legacy.",
      "metadata": {
        "gender": "female",
        "age": "22-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90177-K1XztcZqHl3c.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90177
      },
      "rarity": "uncommon"
    },
    {
      "id": "aldebaran",
      "name": "Aldebaran",
      "alt_names": [
        "アルデバラン",
        "Al (アル)"
      ],
      "role": "supporting",
      "description": "**Height:** 173 cm (5'8\")\n\nAldebaran, commonly known as Al, is [Priscilla Barielle](https://anilist.co/character/90186/Priscilla-Barielle)'s knight, though he claims to just be a subordinate. He has a frivolous personality and acts aloof, but shows insecurity regarding his disfigured face and wears a helmet to conceal it. Due to that, he is a man of both eccentric appearance and behavior.\n\n~!Like Subaru, he is revealed to be from Japan and was summoned roughly 18 years before Subaru. Shortly after he was summoned, he lost his left arm in an unfortunate incident in the Empire of Vollachia. !~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90178-olaN8k9RJRxo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90178
      },
      "rarity": "uncommon"
    },
    {
      "id": "wilhelm-van-astrea",
      "name": "Wilhelm van Astrea",
      "alt_names": [
        "ヴィルヘルム・ヴァン・アストレア",
        "Sword Demon (剣鬼 Kenki)"
      ],
      "role": "supporting",
      "description": "__Height__: 178 cm (5'10\")\n\nWilhelm van Astrea né Trias, is a member of the Crusch Camp and was Theresia van Astrea's husband.\n\nWilhelm is a refined man with a highly gentle and humble demeanor. However unearth that even temperament belied a fierce warrior who often is the first to help when something happens. However this wasn't always the case as in youth, Wilhelm was very opposite of who he was in his later years. Brash, afoot, short tempered, lonely and often cold with others. He was a troubled individual who devoted himself wholly to the sword and cared for little else. Even so, he knew how to analyze a situation, always finding a way out. Nonetheless, Theresia greatly influenced his personality, becoming increasingly sociable and protective, achieving more results during the Demi-human War. It was through her most of all that he would become the person he is today.",
      "metadata": {
        "gender": "male",
        "age": "62 (Arc 5+), 61 (Arc 3-4), 15-20 (Ex 2)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90179-dBqDPUn2i7dM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90179
      },
      "rarity": "uncommon"
    },
    {
      "id": "elsa-granhiert",
      "name": "Elsa Granhiert",
      "alt_names": [
        "エルザ・グランヒルテ",
        "The Bowel Hunter"
      ],
      "role": "supporting",
      "description": "An assassin-for-hire from the Northernmost nation, the Holy Kingdom of Gusteko, known as \"The Bowel Hunter\". Elsa wishes to make a trade for an insignia, as her client's wishes.  \n\n~!Elsa Granhiert was an assassin working together with [Meili](https://anilist.co/character/175577) for an individual they refer to as \"Mother\" until her death.!~",
      "metadata": {
        "gender": "female",
        "age": "23",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90180-YXbXfcSlalav.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90180
      },
      "rarity": "uncommon"
    },
    {
      "id": "roswaal-mathers",
      "name": "Roswaal Mathers",
      "alt_names": [
        "ロズワール・Ｌ・メイザース",
        "Ros-chi"
      ],
      "role": "supporting",
      "description": "~!__Mental age:__ 400+!~\nThe lord of the Roswaal Mansion and a descendant of the original Roswaal.\n\nHe comes across as an eccentric due to his flamboyant appearance and odd speaking style, the latter which he shares with his grandmother. However, he harbors a more calculating and reserved side with a sharp political mind and gaze that reads others quite well.\n\n~!It is later revealed that he is in fact the original Roswaal, Roswaal A. Mathers, who has been possessing his descendants' bodies to meet his teacher Echidna again at any cost, even if that means sacrificing himself or those close to him.!~",
      "metadata": {
        "gender": "male",
        "age": "29-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90182-Ho0NS06tc6NL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90182
      },
      "rarity": "uncommon"
    },
    {
      "id": "julius-euclius",
      "name": "Julius Euclius",
      "alt_names": [
        "ユリウス・ユークリウス",
        "Julius Juukulius",
        "最優の騎士 (Saiyuu no Kishi)",
        "Valuable Knight",
        "ユーリ (Juli)"
      ],
      "role": "supporting",
      "description": "__Height__: 179 cm (5'10\")\n\nJulius Euclius is Anastasia Hoshin's knight and a member of the Royal Guard. Julius lived with his family at the Euclius House. After his father, Klein Euclius died, he started to live with his uncle Alviero and he started to take care of Julius and became his adoptive father.\n\nAs a member of Lugnica's nobility, Julius acts in a proper fashion, always having an air of nobility and conviction. He is also considerate and doesn't forget to show care toward others. He also shows a strict side, giving out accurate assessments of others whether they're good or bad, which is a result of his upbringing as an elite, and in actuality, he believes that he and others can do better than they currently are.\n\nJulius doesn't like those who forget their place, leading him to have bad relations with Subaru for a while. While both have apologized to each other after the battle with the Hakugei, Subaru told him he still hated him. Julius said he didn't intend to be friends. They both became very intimate very quickly during the planning and attacking the Witch Cult. In the end, Julius directly considered Subaru as his friend.",
      "metadata": {
        "gender": "male",
        "age": "21",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90183-LWx59kSa5Vjl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90183
      },
      "rarity": "uncommon"
    },
    {
      "id": "felix-argyle",
      "name": "Felix Argyle",
      "alt_names": [
        "フェリックス・アーガイル",
        "Argail",
        "Ferris (フェリス)",
        "Ferri-chan"
      ],
      "role": "supporting",
      "description": "Felix Argyle commonly known as Ferris, is Crusch Karsten's knight. He is a beast human (demi-human).",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90184-o1ZFF6osCZX7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90184
      },
      "rarity": "uncommon"
    },
    {
      "id": "crusch-karsten",
      "name": "Crusch Karsten",
      "alt_names": [
        "クルシュ・カルステン",
        "Goddess of War (戦争の女神; Sensou no Megami)",
        "Valkyrie"
      ],
      "role": "supporting",
      "description": "Crusch Karsten is the Matriarch of House Karsten and a candidate to become the 42nd King of Lugnica.\n\nWhile normally calm and serious, Crusch is honest, sincere, right, being a type of person who is destined to stand above others, though she has talent and has worked hard to reach where she is now. She is already the head of her family, finishing her work better than her father. She prefers to act herself and has the pride of a warrior. Crusch is also gentle, often believing the false knowledge jokingly told to her by Ferris, and sometimes displays an airheaded side. Like her mother Helena Karsten, she is shown to be ruthless and reckless.",
      "metadata": {
        "gender": "female",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90185-FR9JHyNe5038.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90185
      },
      "rarity": "uncommon"
    },
    {
      "id": "priscilla-barielle",
      "name": "Priscilla Barielle",
      "alt_names": [
        "プリシラ・バーリエル",
        "Sun Princess",
        "Scarlet Princess",
        "Bloody Bride"
      ],
      "role": "supporting",
      "description": "The matriarch of House Barielle and a candidate to become the 42nd King of Lugunica. Her knight is [Al](https://anilist.co/character/90178/Aldebaran).",
      "metadata": {
        "gender": "female",
        "age": "19-20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90186-gjElC1SypZ7h.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90186
      },
      "rarity": "uncommon"
    },
    {
      "id": "otto-suwen",
      "name": "Otto Suwen",
      "alt_names": [
        "オットー・スーウェン"
      ],
      "role": "supporting",
      "description": "Otto Suwen is a merchant appearing in  Re:Zero. His remarkable misfortune always takes him to dangerous situations, from which he escapes thanks to his wit.\nOtto has gray hair that is mentioned to be as long as a gal game protagonist. He is said to be somewhat handsome if he has a serious expression. However, he is usually either retorting, shouting, or panicking, ruining his looks. He has a medium build, but has trained himself since he used to work as a merchant.",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124110-Gfr3IYI6FwqE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124110
      },
      "rarity": "uncommon"
    },
    {
      "id": "rachins-hoffman",
      "name": "Rachins Hoffman",
      "alt_names": [
        "ラチンス・ホフマン",
        "Chin"
      ],
      "role": "supporting",
      "description": "One of the three thugs that attacked Subaru at the very start of Arc 1. \n\n~! He later joined the Felt Camp when [Felt](https://anilist.co/character/88574/Felt) employed him after Royal Selection began. After being employed by Felt, he started to get trained by Reinhard and has developed considerable power. !~\n\n~! He was born as a noble from the Royal Capital of Lugunica, to [Rickert Hoffman](https://anilist.co/character/226757/Rickert-Hoffman) and an unnamed woman. However, after unknown events, he left his family and began living in the slums. He scorns his father and chose to cut ties with his family. !~",
      "metadata": {
        "gender": "male",
        "age": "23",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124115-AlzT5EbLBWbt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124115
      },
      "rarity": "uncommon"
    },
    {
      "id": "garfiel-tinsel",
      "name": "Garfiel Tinsel",
      "alt_names": [
        "ガーフィール・ティンゼル",
        "Gar",
        "Garf",
        "Gorgeous Tiger",
        "The Strongest of Shields"
      ],
      "role": "supporting",
      "description": "Garfiel Tinsel is the former guardian of the Sanctuary and a member of the Emilia Camp. Introduced during Arc 4, he became one of the main supporting characters of the season. He's a half-beast human and Frederica Baumann's half-brother. He can transform himself in a giant golden tiger that can deal powerful attacks but with a cost of losing his reason, so he uses this ability when he's pushed to the limit\n~!Garfiel and Frederica lived together until she left when he was around 4 years old and he hadn't seen her since until their reunion 10 years later during the Sanctuary incident. After seeing his mother's \"death\" during the trial at a young age, he began to fear the outside world, causing him to try and protect the Sanctuary.!~",
      "metadata": {
        "gender": "male",
        "age": "13-15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b133847-8I2Pjoz232vS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133847
      },
      "rarity": "uncommon"
    },
    {
      "id": "frederica-baumann",
      "name": "Frederica Baumann",
      "alt_names": [
        "フレデリカ・バウマン",
        "Frederica Tinsel "
      ],
      "role": "supporting",
      "description": "Frederica Baumann is a maid working for Roswaal L. Mathers and a member of the Emilia Camp. She quit her job as a maid a few months before Subaru's appearance, but returned after Ram couldn't manage the mansion ~! after Rem had her name and memories eaten. !~\n\n~! She is the half-sister of [Garfiel Tinsel](https://anilist.co/character/133847/). !~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143378-1pXqjZho4dhz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143378
      },
      "rarity": "uncommon"
    },
    {
      "id": "mimi-pearlbaton",
      "name": "Mimi Pearlbaton",
      "alt_names": [
        "ミミ・パールバトン"
      ],
      "role": "supporting",
      "description": "__Height:__ 135 cm (4'5\")\n\nMimi is one of Anastasia Hoshin's followers and is one of three vice-captains of the mercenary group Fang of Steel.",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b157961-gvUztmBkzSMB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 157961
      },
      "rarity": "uncommon"
    },
    {
      "id": "lye-batenkaitos",
      "name": "Lye Batenkaitos",
      "alt_names": [
        "ライ・バテンカイトス"
      ],
      "role": "supporting",
      "description": "Lye Batenkaitos is a Sin Archbishop of the Witch Cult, representing the gourmet aspect of gluttony. Lye is a short individual with long light brown hair, green eyes and teeth shaped like sharp fangs. He wears blue and purple clothes and a witch cult rope, but they are both very dirty and bloodstained. He also has attached daggers to his hands he received from the cult.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b174097-4QaG0jvIft6S.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 174097
      },
      "rarity": "uncommon"
    },
    {
      "id": "regulus-corneas",
      "name": "Regulus Corneas",
      "alt_names": [
        "レグルス・コルニアス",
        "Sin Archbishop of Greed"
      ],
      "role": "supporting",
      "description": "Regulus is a young man of a medium height. He has gold eyes, white hair and a middle to skinny build. Regulus Is a part of the Sin Archbishops of the Witch Cult and represents greed.  Regulus is known for being very talkative and calls himself unselfish, while in fact he is very prideful and likes to act above others and reference himself as above others.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b174098-8xjd9vK1KmkP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 174098
      },
      "rarity": "uncommon"
    },
    {
      "id": "sirius-romanee-conti",
      "name": "Sirius Romanée-Conti",
      "alt_names": [
        "シリウス・ロマネコンティ"
      ],
      "role": "supporting",
      "description": "Sirius is a Sin Archbishop of the Witch Cult, representing wrath.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b175579-1J47sd32LEpW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 175579
      },
      "rarity": "uncommon"
    },
    {
      "id": "capella-emerada-lugnica",
      "name": "Capella Emerada Lugnica",
      "alt_names": [
        "カペラ・エメラダ・ルグニカ"
      ],
      "role": "supporting",
      "description": "Capella Emerada Lugnica is a Sin Archbishop of the Witch Cult, representing lust.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b175581-boju9L7bFkvi.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 175581
      },
      "rarity": "uncommon"
    },
    {
      "id": "patrasche",
      "name": "Patrasche",
      "alt_names": [
        "パトラッシュ"
      ],
      "role": "supporting",
      "description": "Subaru's Earth Dragon that he officially received from Crusch Karsten for his efforts in the Hakugei battle. Despite being of a species known for being feisty, Patrasche is extremely loyal to Subaru, as she is willing to put her life on the line for him.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b181313-eT4mFPCZj1OZ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 181313
      },
      "rarity": "uncommon"
    },
    {
      "id": "ricardo-welkin",
      "name": "Ricardo Welkin",
      "alt_names": [
        "リカード・ウェルキン"
      ],
      "role": "supporting",
      "description": "Ricardo Welkin is one of Anastasia Hoshin's followers and the captain of the mercenary group: Fang of Iron.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b181314-OB2xgtbugqwZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 181314
      },
      "rarity": "uncommon"
    },
    {
      "id": "liliana-masquerade",
      "name": "Liliana Masquerade",
      "alt_names": [
        "リリアナ・マスカレード",
        "Diva"
      ],
      "role": "supporting",
      "description": "Liliana is a songstress who is currently accompanying Kiritaka Muse in the city of Pristella.",
      "metadata": {
        "gender": "female",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b183731-1zm1phZcrLjP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 183731
      },
      "rarity": "uncommon"
    },
    {
      "id": "tivey-pearlbaton",
      "name": "Tivey Pearlbaton",
      "alt_names": [
        "ティビー・パールバトン"
      ],
      "role": "supporting",
      "description": "One of Anastasia Hoshin's followers and is one of the three vice captains of the mercenary group Fang of Iron.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b187763-R4qQ7xhZ9JTP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 187763
      },
      "rarity": "uncommon"
    },
    {
      "id": "hetaro-pearlbaton",
      "name": "Hetaro Pearlbaton",
      "alt_names": [
        "ヘータロー・パールバトン"
      ],
      "role": "supporting",
      "description": "Hetaro Pearlbaton  is one of Anastasia Hoshin's followers and is one of the three vice captains of the mercenary group Fang of Iron.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b203919-C4m7N3cBUfCw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 203919
      },
      "rarity": "uncommon"
    },
    {
      "id": "schult",
      "name": "Schult",
      "alt_names": [
        "シュルト"
      ],
      "role": "supporting",
      "description": "Schult is a member of the Priscilla Camp. Though not much is known about him, he's extremely loyal to his mistress and is one of her closest attendants.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205259-Pythrq9UT2h0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205259
      },
      "rarity": "uncommon"
    },
    {
      "id": "heinkel-astrea",
      "name": "Heinkel Astrea",
      "alt_names": [
        "ハインケル・アストレア"
      ],
      "role": "supporting",
      "description": "Heinkel Astrea is the current Patriarch of House Astrea and the Deputy Commander of the Royal Guards.\n\nOnce a gentle and kind man, after his wife fell into a coma he turned into an alcoholic, causing him to neglect his son and abuse his power as Deputy Commander. Some time prior to Arc 5, he joined the Priscilla Camp in hopes that, if their camp wins the Royal Selection, he can gain access to the Dragon's Blood and save his wife.",
      "metadata": {
        "gender": "male",
        "age": "39",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205415-YdcMfEP23BlZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205415
      },
      "rarity": "uncommon"
    },
    {
      "id": "joshua-euclius",
      "name": "Joshua Euclius",
      "alt_names": [
        "ヨシュア・ユークリウス",
        "Joshua Juukulius"
      ],
      "role": "supporting",
      "description": "__Age__: 19 (Arc 5+)\n\nJoshua is Julius Euclius' younger brother. Joshua is extremely well mannered and elegant but, unlike Julius, he can’t keep his composure and often gets flustered. Joshua was born sickly so he’s physically very weak and has a narrow point of view towards the world yet at the same time having a lot of respect for his brother.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b207929-HyE6pbQehXnX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 207929
      },
      "rarity": "uncommon"
    },
    {
      "id": "kiritaka-muse",
      "name": "Kiritaka Muse",
      "alt_names": [
        "キリタカ・ミューズ",
        "The Songstress Maniac"
      ],
      "role": "supporting",
      "description": "Kiritaka Muse is a trade representative of Priestella and the successor of the Muse Trading Company. He is the last survivor of the Priestellan Council of Ten.",
      "metadata": {
        "gender": "male",
        "age": "Late 20s",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b289735-RIoPao2T9sAQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 289735
      },
      "rarity": "uncommon"
    },
    {
      "id": "dynas",
      "name": "Dynas",
      "alt_names": [
        "ダイナス"
      ],
      "role": "supporting",
      "description": "Captain of the White Dragon's Scales.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b346671-k0V1f1796d98.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 346671
      },
      "rarity": "uncommon"
    },
    {
      "id": "reshia-tinzel",
      "name": "Reshia Tinzel",
      "alt_names": [
        "リーシア・ティンゼル",
        "Reala Thompson (リアラ・トンプソン)"
      ],
      "role": "supporting",
      "description": "Mother of [Garfiel](https://anilist.co/character/133847) and [Frederica](https://anilist.co/character/143378).",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205112-xRtGam1Yu0Cp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205112
      },
      "rarity": "uncommon"
    },
    {
      "id": "fred-thompson",
      "name": "Fred Thompson",
      "alt_names": [
        "フレド・トンプソン"
      ],
      "role": "supporting",
      "description": "Garek Thompson's son. He is half-siblings with Garfiel and Frederica.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b346672-DmfHFX01fOfc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 346672
      },
      "rarity": "uncommon"
    },
    {
      "id": "rafiel-thompson",
      "name": "Rafiel Thompson",
      "alt_names": [
        "ラフィール・トンプソン"
      ],
      "role": "supporting",
      "description": "Garek Thompson and Reala Thompson's daughter. She is half-siblings with Garfiel and Frederica.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b346673-3mgEvkg2SM4m.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 346673
      },
      "rarity": "uncommon"
    },
    {
      "id": "lusbel-kallard",
      "name": "Lusbel Kallard",
      "alt_names": [
        "ルスベル・カラード"
      ],
      "role": "supporting",
      "description": "Citizen of Priestella. He is taken hostage by Sirius.",
      "metadata": {
        "gender": "male",
        "age": "9",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b346678-kniJ4flHrrof.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 346678
      },
      "rarity": "uncommon"
    },
    {
      "id": "theresia-van-astrea",
      "name": "Theresia van Astrea",
      "alt_names": [
        "テレシア・ヴァン・アストレア",
        "Sword Saint"
      ],
      "role": "supporting",
      "description": "Theresia was the former Sword Saint/Master Swordsman, Wilhelm's wife and Reinhard's grandmother.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124116-n6qYjDhHcBHS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124116
      },
      "rarity": "uncommon"
    },
    {
      "id": "pandora",
      "name": "Pandora",
      "alt_names": [
        "パンドラ",
        "Witch of Vanity"
      ],
      "role": "supporting",
      "description": "Pandora is one of the Witches of Sin, being the Witch of Vanity. She acts dignified and graceful, but is quick to being a maniac when things don't go her way. Pandora also has some ties with the Witch Cult.\n\n~! Pandora's main ability is \"Authority of Vainglory\". With this authority, Pandora is able to rewrite phenomenon to her liking as much she desires. Examples include being able to negate death, bury people into the ground instantaneously, teleporting individuals and warp and change individuals memories. The only draw back is her authority not being able to function on the demon beasts for full control, but she can still direct them to go to areas of her choosing. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137522-vVY1DGT88Lqe.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137522
      },
      "rarity": "uncommon"
    },
    {
      "id": "roy-alphard",
      "name": "Roy Alphard",
      "alt_names": [
        "ロイ・アルファルド"
      ],
      "role": "supporting",
      "description": "Roy Alphard is a Sin Archbishop of the Witch Cult, representing the bizarre eating aspect of gluttony. \nHe has long disheveled brown hair, with green eyes that are yellow are the center and teeth shaped like sharp fangs. He wears a small piece of cloth around his body as clothing.\n\nUnlike his brother Lye, Roy doesn’t care about what he consumes nor does he place any special emphasis on who he wants to eat like his sister Louis. As “bizarre eating” of gluttony, his approach towards his meals is much more casual, emphasizing quantity over quality. In combat unlike Lye he does not give his opponents a chance and likes to exploit their weaknesses to completely destroy them. \n\n~! \nLike Lye and Louis, Roy has to similar skills shared between the gluttony’s \n\nRoy has access to “Authority of Gluttony”, unlike other types of authority there are different forms and effects that come from being affected by the authority.\n\nRoy can eat a name and memories of an individual. To achieve eating a name he touches the individual with his left hand, then licks the palm of the same hand. Roy can then take things such as experience, talent, likes and dislikes of human relationships and they can serve as food for him, allowing him to take advantage of any abilities or memories his opponents had. \n\nThose that have their names eaten have their existences erased from the world. This will end any human relationships and remove any contracts with spirits\nThose who have their memories eaten become amnesic and any types of characteristics they had previous are removed.\nThose who have their name and memories eaten become an empty shell, while they are still alive they no longer require the need to eat,excrete waste or age. \n\nWhile this ability is powerful on paper it has to major drawbacks\n\nIf Roy eats a fake name or memory he will become plagued with severe nausea.\nRoy is also unable to eat the same person twice until that individual has gained enough new memories or has established a different sense of self from their old existence.  \n\n!~\n\n~! \nRoy has access to what he calls his trump card known as “Eclipse” it has two forms “Solar Eclipse” and “Lunar Eclipse”.\n\n__Lunar Eclipse__ - This skill allows Roy to take an individual's memories and use them to harvest skills or knowledge they have learned for his own benefit. An example is when Roy used “Lunar Eclipse” to boost his physical strength and speed against Julius Juukulius and Ricardo Welkin . This skill CANNOT allow Roy  to take divine protections or spirit arts and authorities.\n\n__Solar Eclipse__ - The inverse of “Lunar Eclipse”. This skill allows Roy to take an individual's name and transform to their appearance. This skill is widely used by Louis arneb.\n!~\n\n~!\nRoy as well has a large arsenal of skills and abilities besides the three mentioned above.\n\n__Master class fighter__ - Through all the souls Roy has eaten he has gained increased strength over his existence, this is specifically shown in arc 6 as he fights multiple opponents with ease.\n\n__Palm of the Fist King__ - A powerful strike that ruptures a person's internal organs, as well as outright, destroys physical objects like swords. It can also bypass mana based defensive techniques. Lye took this move from Neji Rockheart.\n\n__Snake of the Twin Sword__ - A sword technique that launches several types of slashes at high speed.\n\nRoy wields two claws from his hands that he uses with his speed and lightness. He also wields daggers that were hidden inside of his clothes. \n!~\n\n~!\nBecause Lye, Roy and Louis possess the Witch Factors of Gluttony they are able to direct demon beasts to attack certain areas. \n!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b175578-LVgtk9D4XfZs.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 175578
      },
      "rarity": "uncommon"
    },
    {
      "id": "louis-arneb",
      "name": "Louis Arneb",
      "alt_names": [
        "ルイ・アルネブ",
        "Rui Arneb"
      ],
      "role": "supporting",
      "description": "Louis Arneb is a Sin Archbishop of the Witch Cult, representing the satiation aspect of gluttony. Louis has large blue eyes and extremely long blond hair as well she has sharp fang like teeth. Her skin appears white as pottery and she wears rags to cover herself. Unlike Roy and Lye, Louis doesn't care much about what she eats, putting more emphasis on who she eats with. Louis believes life is unfair and her ideology is trying to find a life that will satisfy her. Louis does not think fondly of her brothers despite them bringing her food and to some degree caring for her. ~!Like Roy and Lye, Louis has to similar skills shared between the gluttony’s. Louis has access to “Authority of Gluttony”, unlike other types of authority there are different forms and effects that come from being affected by the authority. Louis can eat a name and memories of an individual. To achieve eating a name he touches the individual with his left hand, then licks the palm of the same hand. Louis can then take things such as experience, talent, likes and dislikes of human relationships and they can serve as food for him, allowing him to take advantage of any abilities or memories his opponents had. Those that have their names eaten have their existences erased from the world. This will end any human relationships and remove any contracts with spirits\nThose who have their memories eaten become amnesic and any types of characteristics they had previous are removed. Those who have their name and memories eaten become an empty shell, while they are still alive they no longer require the need to eat,excrete waste or age. While this ability is powerful on paper it has to major drawbacks If Louis eats a fake name or memory he will become plagued with severe nausea. Louis is also unable to eat the same person twice until that individual has gained enough new memories or has established a different sense of self from their old existence.!~\n~!Louis has access to what she calls his trump card known as “Eclipse” it has two forms “Solar Eclipse” and “Lunar Eclipse”.\n\n__Lunar Eclipse__ - This skill allows Louis  to take an individual's memories and use them to harvest skills or knowledge they have learned for his own benefit. An example of its use is when Lye used “Lunar Eclipse” to boost his physical strength and learn techniques such as “The Palm of the Fist King” and the Leaper technique or when  Roy used “Lunar Eclipse” to boost his physical strength and speed against Julius Juukulius and Ricardo Welkin.  This skill CANNOT allow Louis to take divine protections or spirit arts and authorities.\n\n__Solar Eclipse__ - The inverse of “Lunar Eclipse”. This skill allows Louis  to take an individual's name and transform to their appearance.  Unlike Lye and Roy with their dislike of having Solar Eclipse, Louis tends to primarily use Solar Eclipse as she doesn't share the same fear as her two brothers of feeling like they are damaged when using the skill. !~~!Louis as well has a large arsenal of skills and abilities besides the three mentioned above.\n\n__Leaper technique__ -This technique allows Louis to move with extreme speed and in turn become undetectable by the naked eye, allowing her to leap behind his opponents or avoid extremely precise and quick attacks. She's also capable of utilizing it vertically, making it appear as if she's flying. Lye took his move from  Dorkell\n\n__Ability of the Carnivorous Beast__ - This ability allows Louis to strengthen her body which gives her two advantages: she can withstand powerful attacks and strengthen her limbs to deliver devastating blows. An example is when she was able take a hit from Emilia's ice spear and came out unscathed and deliver a retaliating punch that is said to be as devastating as getting hit by a car. This ability was taken from Beli Heinelga.!~\n\n~!Because Lye, Roy and Louis possess the Witch Factors of Gluttony they are able to direct demon beasts to attack certain areas. !~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b175582-hDwS4CVocZa5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 175582
      },
      "rarity": "uncommon"
    },
    {
      "id": "kan",
      "name": "Kan",
      "alt_names": [
        "カン",
        "Camberley (カンバリー)"
      ],
      "role": "supporting",
      "description": "__Height:__ 130 cm (4'3\")\n\nCamberley, commonly known as Kan, is one of the three thugs that attacked Subaru.\n\n~! He later joined the [Felt](https://anilist.co/character/88574/Felt) Camp when Felt employed him after Royal Selection began. After being employed by Felt, he began getting trained by Reinhard and has developed considerable power. !~",
      "metadata": {
        "gender": "male",
        "age": "23-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205261-v1HJzOXXVEJf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205261
      },
      "rarity": "uncommon"
    },
    {
      "id": "gaston",
      "name": "Gaston",
      "alt_names": [
        "ガストン",
        "Ton"
      ],
      "role": "supporting",
      "description": "Gaston, commonly known as Ton, is one of the three thugs that attacked Subaru.\n\n~! He later joined the [Felt](https://anilist.co/character/88574/Felt) Camp when Felt employed him after Royal Selection began. After being employed by Felt, he started to get trained by Reinhard and has developed considerable power. !~",
      "metadata": {
        "age": "26",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205262-4QkNpvgw0svU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205262
      },
      "rarity": "uncommon"
    },
    {
      "id": "kurgan",
      "name": "Kurgan",
      "alt_names": [
        "クルガン",
        "Yatsuude (八つ腕)",
        "Eight Arms"
      ],
      "role": "supporting",
      "description": "Kurgan was a hero of the Vollachia Empire, regarded as its strongest warrior at one point in time. He fought against [Wilhelm van Astrea](https://anilist.co/character/90179/Wilhelm-van-Astrea) in the years following the Demi-Human War during [Stride](https://anilist.co/character/175580/Stride-Vollachia)'s attack on the Kingdom.\n\n~!It is mentioned that he was killed by [Regulus](https://anilist.co/character/174098/Regulus-Corneas), however, he is used by the Witch Cult as a corpse soldier during their attack at the Watergate City of Priestella.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b207928-R70qMbMjlVQo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 207928
      },
      "rarity": "uncommon"
    },
    {
      "id": "tina",
      "name": "Tina",
      "alt_names": [
        "ティーナ"
      ],
      "role": "supporting",
      "description": "Citizen of Priestella.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b348125-uzv2HujAQm4K.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348125
      },
      "rarity": "uncommon"
    },
    {
      "id": "garek-thompson",
      "name": "Garek Thompson",
      "alt_names": [
        "ギャレク・トンプソン"
      ],
      "role": "supporting",
      "description": "Priestella's Metropolitan Director and the husband of Reala Thompson.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b348129-vRaMKwJ4VlJA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348129
      },
      "rarity": "uncommon"
    },
    {
      "id": "sylphy",
      "name": "Sylphy",
      "alt_names": [
        "シルフィ",
        "Hyaku Hachi Juu Shi-ban (百八十四番)",
        "Number 184"
      ],
      "role": "supporting",
      "description": "184th wife of Regulus Corneas.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b348995-nHlOes7863nH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348995
      },
      "rarity": "uncommon"
    },
    {
      "id": "liliana-no-haha",
      "name": "Liliana no Haha",
      "alt_names": [
        "リリアナの母",
        "Liliana's Mother"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b355832-ls3p2HRslAKw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 355832
      },
      "rarity": "uncommon"
    },
    {
      "id": "liliana-no-chichi",
      "name": "Liliana no Chichi",
      "alt_names": [
        "リリアナの父",
        "Liliana's Father"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b355833-jkgFrTp8JVkJ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 355833
      },
      "rarity": "uncommon"
    },
    {
      "id": "rem",
      "name": "Rem",
      "alt_names": [
        "レム",
        "Rem-rin"
      ],
      "role": "minor",
      "description": "__Height:__ 154 cm (5'1\")\n\nRem is one of the twin maids working for Roswaal L Mathers. She has medium length sky blue hair that covers her right eye, large light blue eyes, and young features. She also has hair clips towards left side of her hair, flower-shaped ribbon on the same side of her hair, and a maid hairband. She looks nearly identical to her sister apart from her hair, eyes, and ribbon coloring. She usually wears a maid uniform, and since her chest is slightly larger than her sister's, she secretly changes the measurements to hide it. Rem tends to speak in a superficially polite manner and sometimes acts without thinking. She holds both respect to the point of worship and guilt toward her sister for an incident in the past. Because of her respect and guilt toward her sister, she used to think of herself as inferior.",
      "metadata": {
        "gender": "female",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88575-Ayu8UPDA8NS6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88575
      },
      "rarity": "common"
    },
    {
      "id": "puck",
      "name": "Puck",
      "alt_names": [
        "パック"
      ],
      "role": "minor",
      "description": "__Height:__ 7 cm\n\nPuck is an Artificial Spirit that Emilia was formerly contracted with. He is the current Great Spirit of Fire.\n\n~! He is currently known as the Beast of The End. !~\n\n~! Around 400 years ago, Puck was created by Echidna, though he had apparently left her by the time she moved into the Sanctuary. Seven years before the start of the election, Puck unfroze Emilia and began to act as her friend and mentor, and later on started to live at Roswaal's mansion where he was reunited with Beatrice. !~\n\nPuck can be described as cute or adorable, thus his skin being pink around his cheeks. His fur is mostly grey with silver in certain spots (i.e. tip of the tail). His eyebrows are pretty small and rhombus-shaped. He also has a gold earring on his left ear. Sometimes, he carries a purple bag.\n\nPuck is generally a nice spirit. He is very happy and stays at Emilia's side to protect her, affectionately calling her \"Lia\". He occasionally goofs around and gets along especially well with Beatrice. \n\n~!However, Puck's demeanor greatly changes in loops where Emilia dies, showing a complete disregard for anyone except her, and was even willing to destroy the world because of the condition in their contract.!~",
      "metadata": {
        "age": "420-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b90187-xJXlD84KXl3t.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 90187
      },
      "rarity": "common"
    },
    {
      "id": "satella",
      "name": "Satella",
      "alt_names": [
        "サテラ",
        "Witch of Envy"
      ],
      "role": "minor",
      "description": "Satella is one of the Witches of Sin, being the Witch of Envy. ~! Contrary to popular belief, Satella and the Witch of Envy are separate personalities. Both of them love Subaru, though the Witch of Envy is aggressive about it.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/127242-UVgHhBEnLAJn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127242
      },
      "rarity": "common"
    },
    {
      "id": "echidna",
      "name": "Echidna",
      "alt_names": [
        "エキドナ",
        "Witch of Greed"
      ],
      "role": "minor",
      "description": "Echidna is one of the Witches of Sin, being the Witch of Greed. She has a strong thirst for knowledge along with a curiosity for the unknown, which defines her behavior. Echidna is described as black hearted, being unable to empathize with others and their feelings due to a lack of understanding. She will do anything to gain knowledge, be it deceit or employed sophistry.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129330-ZUtYw4n7N0uH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129330
      },
      "rarity": "common"
    },
    {
      "id": "typhon",
      "name": "Typhon",
      "alt_names": [
        "テュフォン",
        "Witch of Pride"
      ],
      "role": "minor",
      "description": "Typhon is one of the Witches of Sin, being the Witch of Pride. She is said to judge people with the innocence and ruthlessness of a young girl. \n\n~!Typhon's main ability is \"Authority of Pride\". With this authority, Typhon is able to tear apart an individuals body if she decides they are guilty of something. The authority is extremely subjective. If the individual feels guilty, Typhon can punish the individual, even if the act may not be something they should be punished for. The ability has one draw back of not being able to work if the individual has little to no thinking capacity.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137524-6YRTpAShlNMJ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137524
      },
      "rarity": "common"
    },
    {
      "id": "louanna-astrea",
      "name": "Louanna Astrea",
      "alt_names": [
        "ルアンナ・アストレア"
      ],
      "role": "minor",
      "description": "Louanna Astrea is Heinkel Astrea's wife and Reinhard van Astrea's mother.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205343-yceVSGGA9I10.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205343
      },
      "rarity": "common"
    },
    {
      "id": "gunshuu-a",
      "name": "Gunshuu A",
      "alt_names": [
        "群衆",
        "Crowd"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348121
      },
      "rarity": "common"
    },
    {
      "id": "gunshuu-d",
      "name": "Gunshuu D",
      "alt_names": [
        "群衆",
        "Crowd"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348122
      },
      "rarity": "common"
    },
    {
      "id": "gunshuu-b",
      "name": "Gunshuu B",
      "alt_names": [
        "群衆",
        "Crowd"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348123
      },
      "rarity": "common"
    },
    {
      "id": "gunshuu-c",
      "name": "Gunshuu C",
      "alt_names": [
        "群衆",
        "Crowd"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348124
      },
      "rarity": "common"
    },
    {
      "id": "anchisukiru",
      "name": "Anchisukiru",
      "alt_names": [
        "警備員",
        "Security Guard"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b348130-697GUhLBDkKW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348130
      },
      "rarity": "common"
    },
    {
      "id": "regulus-no-tsuma",
      "name": "Regulus no Tsuma",
      "alt_names": [
        "レグルスの妻",
        "Regulus's Wife"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348996
      },
      "rarity": "common"
    },
    {
      "id": "hinansho-no-hitobito-b",
      "name": "Hinansho no Hitobito B",
      "alt_names": [
        "避難所の人々"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348997
      },
      "rarity": "common"
    },
    {
      "id": "hiansho-no-hitobito-a",
      "name": "Hiansho no Hitobito A",
      "alt_names": [
        "避難所の人々"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348998
      },
      "rarity": "common"
    },
    {
      "id": "hinansho-no-hitobito-c",
      "name": "Hinansho no Hitobito C",
      "alt_names": [
        "避難所の人々"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 348999
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-23T05:05:10.918Z"
}