{
  "work_id": "puella-magi-madoka-magica",
  "count": 16,
  "characters": [
    {
      "id": "madoka-kaname",
      "name": "Madoka Kaname",
      "alt_names": [
        "鹿目まどか"
      ],
      "role": "protagonist",
      "description": "__Height:__ 152 cm (5'0\")\n\nA 14-year-old girl whose life changes when she encounters the Puella Magi Homura and the familiar Kyuubey, who offers to transform her into a Puella Magi herself. She sees herself as a person without special qualities or talents, and after seeing Mami fighting against witches, wants to be a wonderful and cool Puella Magi like her. She is a rather selfless girl who wishes to be a magical girl simply so that she can help others. She allegedly has a large amount of magical potential within her. \n\nMadoka's heavily pink character design evokes a sense of child-like innocence and femininity. Her age and naive attitude is further implied with her pigtail haircut. Her immaturity is exemplified with props several times, such as when she brought an impractical sketchbook to a witch hunt, which is something you'd expect a child to do.",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b37832-lzVj5IkUciLd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 37832
      },
      "rarity": "legendary"
    },
    {
      "id": "homura-akemi",
      "name": "Homura Akemi",
      "alt_names": [
        "暁美ほむら"
      ],
      "role": "protagonist",
      "description": "__Height:__ 155 cm\n\nHomura is a magical girl who first appears in an apocalyptic nightmare of Madoka's. She transfers into her school the day after the dream. She is a beautiful, mysterious individual that performs exceptionally well in academics and athletics. This makes her instantly popular even though she is cold to others. She seems to know Madoka well and wishes to prevent her from becoming a magical girl. She attacks Kyuubey in the first episode, only to be stopped by Mami.   ~!Homura's cold personality developed from repeating the same timeline again and again. She was originally a shy, weak transfer student who spent a long time in hospital due to heart disease. She was befriended and eventually saved from a witch by Madoka, who revealed that she was a magical girl. When Madoka was killed in her battle with WalpurgisNacht, Homura contracted with Kyuubey to become a person that could protect her. She became a magical girl with the ability to manipulate time, allowing her to return to her first meeting with Madoka in order to change her fate. She tries, again and again,​ to prevent Madoka from being killed or becoming a magical girl and, inevitably, a witch, but is never able to save her. She always returns to the beginning of the month upon failure.  Her magical weapon is a shield filled with sand that allows her to freeze time. However, this power becomes useless if she is physically restrained as she cannot turn her shield to activate it. She can also use this shield to block projectiles and store the various weapons she carries. Since her shield and magic have no offensive capability, she instead attacks using stolen firearms and homemade explosives while time is stopped. Once the sand on her shield runs out, Homura must reset the timeline.!~\n\nHomura's prominently black design is sinister and mysterious, fitting with how the series is slow at revealing her motives. Her ambiguity is further amplified by her dull, purple eyes. Whereas the rest of the cast had vibrant, same-color eyes, Homura's show internal conflict (purple is a mix of red and blue) and trauma. She has a cold design and personality, with her monotone voice and dark color palette. Her eyes are similar to Mami's, which hints towards Homura putting up a facade when she's actually quite fragile, hinting towards a past event that turned Homura into who she is.",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b38005-T3NR8p2f021x.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38005
      },
      "rarity": "legendary"
    },
    {
      "id": "mami-tomoe",
      "name": "Mami Tomoe",
      "alt_names": [
        "巴マミ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 156-159 cm \n\nMami Tomoe is a veteran magical girl and a third-year student at Madoka's school. She lives alone in a penthouse after her parents were killed in a car crash, which Mami survived after contracting with Kyuubey. Mami is particularly focused on saving, guiding, and protecting those around her, which is a traditionally selfless perspective on the role of magical girl. She is much like a maternal figure to Madoka and Sayaka, being the eldest among them. Her name could be considered a play on the word 'mommy', further supported in the third film, where she has a companion named \"Bebe\". Though Mami's outward disposition is cheery and confident, Mami feels deeply alone as she has no friends to confide in as she fights.\n\n ~!Madoka offers to become her partner and save her from her loneliness, but Mami is killed immediately after during battle with a witch; as per Madoka's wish, at the close of the final timeline, this witch never existed, and Mami is therefore seen, alive, with Kyoko and Homura at the end of the series. According to Kyuubey, she never knew the darker truths concerning Soul Gems and origins of witches. In a previous timeline, learning of these truths drove Mami insane and she attempted to murder the remaining magical girls to prevent them from becoming witches, and in the Oriko Magica timeline, she contemplates letting herself be killed and/or committing suicide so she doesn't become a witch herself.!~",
      "metadata": {
        "gender": "female",
        "age": "14-15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b38194-gnlnx4XN4HYP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38194
      },
      "rarity": "legendary"
    },
    {
      "id": "sayaka-miki",
      "name": "Sayaka Miki",
      "alt_names": [
        "美樹さやか"
      ],
      "role": "protagonist",
      "description": "__Height:__ 158-160 cm\n__Weapon:__ Cutlass\n\nMadoka's classmate who, after helping Madoka rescue Kyuubey, ends up getting an offer to become a Puella Magi herself. She cares deeply for her friends, and wants to help an ill boy named Kyousuke Kamijou, whom she has a crush on. Before becoming a Puella Magi, Sayaka wields a baseball bat that Mami can enhance with magic to defend herself with while on witch hunts.\n\n~!In order to cure Kyosuke's hand, which was damaged in an accident which robbed him of his ability to play the violin, she becomes a Puella Magi. Sayaka's weapon of choice is a sword. She also has regenerative powers stronger than anyone else due to the nature of her wish. Sayaka hates people who think only of themselves whilst hurting others and is easily provoked into a fight. After learning how Puella Magi are created, Sayaka starts to descend into despair, as she believes she's now no better than a zombie and thus cannot openly admit her love for Kyousuke. Her state of mind only worsens as one of her two best friends, Hitomi, confesses that she has feelings for Kyousuke too and makes advances on him. At the same time, she also refuses to purify her Soul Gem with Grief Seeds and neglects it to become tainted. At the end of episode 8, her Soul Gem was finally exhausted, and Sayaka turns into the witch Oktavia von Seckendorff. She dies in a battle with Sakura Kyouko, who sacrifices herself in order to not let Sayaka die alone. In episode 10, it's revealed that during Akemi Homura's third time loop, Sayaka also suffered the same fate of turning into a witch, and was killed by Homura with an explosive.!~\n\nSayaka's design is prominently blue, which makes her appear heroic and 'just', further reinforced by her wearing a white cape, symbolic for goodness and purity. Aside from her color scheme conveying her being a hero who fights for justice, it also foreshadows ~!her eventual melancholic downfall.!~ Sayaka also noticeably differs from the rest of the cast with her short hair. Again amplified with traditionally male aspects of her design, Sayaka is a tomboy. She would, for instance, bring a baseball bat on the girls' first hunt, whereas the traditionally feminine Madoka brought a notebook. \n\nSayaka has tareme eyes, symbolizing fragility and sadness. Although this might look like it contradicts Sayaka's personality, it foreshadows ~!her losing her belief of fighting selflessly in the name of justice and starts falling into despair.!~",
      "metadata": {
        "gender": "female",
        "age": "13",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b38395-d24OayatTB5h.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38395
      },
      "rarity": "legendary"
    },
    {
      "id": "kyuubey",
      "name": "Kyuubey",
      "alt_names": [
        "キュゥべぇ",
        "QB"
      ],
      "role": "protagonist",
      "description": "He is a familiar who can grant any wish to a certain girl, on the condition that she becomes a Puella Magi and fights against witches. \n~!When someone makes a contract with him, he extracts their soul and places it inside a Soul Gem, replacing their body with a shell that's more resilient to fighting witches.  He has made contracts with Mami, Kyoko, Homura, and Sayaka, and shows particular interest in making Madoka a Puella Magi. It is unknown if there are other familiars besides him. He can only be seen or heard by Puella Magi and those who have potential to become a Puella Magi. He also disposes of used Grief Seeds for the Puella Magi, because, if they are used too extensively, the witch could become reborn from the Grief Seed. He also constantly tries to find chances to persuade girls who have potential to become Puella Magi to form a contract with him, despite the fact that he knows the dangers that Puella Magi face. Much to his dismay, he cannot force a girl to become a Puella Magi.  He doesn't fully understand human values and questions any perceived differences between himself and humans. For example, when Madoka claims that he is cruel for forming contracts with girls and turning them into Puella Magi, he compares his actions to the act of humans slaughtering livestock, saying that, unlike humans, who show a lack of interest and sympathy for other creatures' values when it comes to their own survival, he at least recognizes humans as being sentient beings and tries to negotiate with them. Therefore, Kyuubey is neither evil nor good, just a survivor like everyone else. !~\n\n__Major Spoiler:__  ~!Kyuubey is an \"Incubator\" and from an advanced alien species whose civilization is located far away from Earth. A long time ago, his species took alarm to the gradual heat death of the universe, and, in their search for a solution to it, encountered a species on Earth, humans, who exhibited emotions, something Kyuubey's species does not have. They then subsequently discovered a type of energy called emotional energy that could be used efficiently counter entropy, and also realized that teenage human females, who are very emotionally unstable during their mental and physical development throughout puberty, harbor the most emotional energy of all humans.  Therefore, it is Kyuubey's duty to form contracts with teenage girls and to collect the emotional energy that is created when the girl becomes a Puella Magi. However, it is also his duty to collect the massive amount of emotional energy that is created when a Puella Magi transforms into a witch, and to consume Grief Seeds, which also contain large amounts of emotional energy.  It seems that negative emotions such as hatred and despair yield more emotional energy than positive emotions, since Kyuubey comments that the amount of emotional energy created when a girl becomes a Puella Magi is nothing compared to the explosion of emotional energy created when a Puella Magi transforms into a witch. Thus, it could be said that Kyuubey's main purpose is to \"incubate\" girls' souls in Soul Gems until they become filled with so much negative emotion that they transform into Grief Seeds and \"hatch\" into witches, and to then \"harvest\" the emotional energy created from the transformation.  Also, whenever Kyuubey is killed, he is instantly reincarnated (for lack of a better word) into a new body with the same appearance and disposes of his previous body by eating it. He seems to have an endless supply of spare bodies, so, it might not be possible to kill him in a conventional fashion.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b38566-XzE2iqAodRQK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38566
      },
      "rarity": "legendary"
    },
    {
      "id": "kyouko-sakura",
      "name": "Kyouko Sakura",
      "alt_names": [
        "佐倉杏子"
      ],
      "role": "protagonist",
      "description": "__Height:__ 156-158 cm\n__Weapon:__ Spear\n\nKyouko is a veteran magical girl who comes to the city later in the story. Amusingly, she is always seen eating something, even while she is battling. \n \nHaving grown up in a poor family, she often has to steal food and hates people who waste it, a logic she also applies to Grief Seeds, as she only goes after fully grown witches. Kyouko has been a Puella Magi much longer than the others, and thus is more skillful; she wields a spear which can extend itself, split into multiple sections, and produce a ball at the end of a chain, which can constrict and hit others at the same time. She also has the ability to put up barriers to protect others or keep them from interfering. She initially clashes with Sayaka, but after learning the truth about Soul Gems, she sympathizes with her and tries to help her.\n\n~!She came from a poor church family and used her wish so that people would listen to her father's preaching; when her father learned of this, however, he went mad and killed everyone in his family aside from Kyouko. As such, Kyouko decided only to use her magic for herself from this point on, since using it for others will only cause despair.!~",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40006-zOwYYimuiO3m.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40006
      },
      "rarity": "legendary"
    },
    {
      "id": "hitomi-shizuki",
      "name": "Hitomi Shizuki",
      "alt_names": [
        "志筑仁美"
      ],
      "role": "supporting",
      "description": "Madoka and Sayaka's classmate and friend, who is quite popular with the boys. She attends after-school classes in Piano, Japanese dance and Tea ceremony, feeling obliged to make time for them even when she might reasonably be expected to focus on her studies.    ~!She has feelings for Kyousuke, just like Sayaka.!~  (Source: Puella Magi Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b39584-YxtWll1k1zRe.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 39584
      },
      "rarity": "epic"
    },
    {
      "id": "junko-kaname",
      "name": "Junko Kaname",
      "alt_names": [
        "鹿目詢子"
      ],
      "role": "supporting",
      "description": "Junko is Madoka's mother. She's a successful business woman. She often goes out drinking with friends and co-workers, and comes home from a long day of work drunk. She's also friends with Madoka's homeroom teacher.  She and Madoka are close, and she cares for her daughter very much, but ultimately lets her go when she tells her there's something she has to do on Walpurgis Nacht.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n39742-v9wdkOMMW7oT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 39742
      },
      "rarity": "epic"
    },
    {
      "id": "tomohisa-kaname",
      "name": "Tomohisa Kaname",
      "alt_names": [
        "鹿目知久"
      ],
      "role": "supporting",
      "description": "Height: 175-180 cm  \n\nMadoka's father. A stay-at-home dad. He does housekeeping, cooking, laundry and cleaning.   \n\n(Source: Puella Magi Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b39784-fVO9u5JgwaIK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 39784
      },
      "rarity": "epic"
    },
    {
      "id": "kazuko-saotome",
      "name": "Kazuko Saotome",
      "alt_names": [
        "早乙女和子"
      ],
      "role": "supporting",
      "description": "Height: 155-157 cm  \n\nKazuko is Madoka's class teacher. Her relationships with guys don't last very long, and so she's extremely frustrated in these regards. Many of her classes involve her complaining about men. She also seems to be a friend of Junko Kaname, Madoka's mother.   \n\n(Source: Official Production Notes & Puella Magi Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b39785-LR0WC4uHFSl4.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 39785
      },
      "rarity": "epic"
    },
    {
      "id": "kyousuke-kamijou",
      "name": "Kyousuke Kamijou",
      "alt_names": [
        "上条恭介"
      ],
      "role": "supporting",
      "description": "__Height:__ 170-175 cm   \n\nA terminally ill boy whom Sayaka constantly visits. He used to play violin when he was younger and enjoys listening to classical musical CDs that Sayaka brings him.   \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "14-15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b39835-poPdlPsql0Cy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 39835
      },
      "rarity": "epic"
    },
    {
      "id": "tatsuya-kaname",
      "name": "Tatsuya Kaname",
      "alt_names": [
        "鹿目タツヤ"
      ],
      "role": "supporting",
      "description": "Madoka's little brother. He's 3 years old and goes to kindergarten.  \n\n(Source: Puella Magi Wikia)",
      "metadata": {
        "gender": "male",
        "age": "3",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b41851-dKtgQbvKOMS7.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 41851
      },
      "rarity": "epic"
    },
    {
      "id": "walpurgis-night",
      "name": "Walpurgis Night",
      "alt_names": [
        "ワルプルギスの夜",
        "Walpurgisnacht"
      ],
      "role": "supporting",
      "description": "The witch of stage settings; her nature is helplessness. She symbolizes the fool who continuously spins in circles. The witch's mysteries have been handed down through the course of history; her appellation is \"Walpurgis Night.\" She will continue to rotate aimlessly throughout the world until she completely changes the whole of this age into a drama. When the doll's usual upside-down position reaches the top part of the witch, she completely roils the civilization on the ground in a flash through her gale-like flight.  Her true name is unknown.  \n\n(Source: Puella Magi Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42361.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42361
      },
      "rarity": "epic"
    },
    {
      "id": "nakazawa",
      "name": "Nakazawa",
      "alt_names": [
        "中沢"
      ],
      "role": "supporting",
      "description": "Nakazawa is rare among Madoka's classmates in that his family name is known. However, his given name is unknown. He answered Ms. Saotome's question about whether he prefers hard-boiled or soft-boiled eggs.  Source : Puella-Magi Wiki",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/87295.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87295
      },
      "rarity": "epic"
    },
    {
      "id": "host-b",
      "name": "Host B",
      "alt_names": [
        "ホストＢ"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 286729
      },
      "rarity": "rare"
    },
    {
      "id": "shou",
      "name": "Shou",
      "alt_names": [
        "ホストＡ"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 286730
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T04:52:07.511Z"
}