{
  "work_id": "tales-of-demons-and-gods",
  "count": 15,
  "characters": [
    {
      "id": "li-nie",
      "name": "Li Nie",
      "alt_names": [
        "聂离"
      ],
      "role": "protagonist",
      "description": "__Race:__ Human\n__Soul Realm:__ Red\n\nAfter dying at the hands of the Sage Emperor, Nie Li wakes up back in his thirteen year old body. Given a second chance to save his loved ones, he is determined to stop Sacred Family from betraying Glory City, and causing the attack that not only destroyed his home but killed all his friends and family.\n\nNie Li is a member of the Heavenly Marks Family, a declining and weak aristocratic family. His initial talent is considered by others to be poor and is lacking in culture and social position. However, he retains all the knowledge he gathered while roaming the Divine Continent in his past life. Using that, he plans to cultivate himself to far greater heights in this life and defeat the enemies he makes along the way. He has a very calm and determined personality. Though his appearance is that of a thirteen year old, he truly has the mind of someone far older and more experienced. (Due to the rebirth).\n\n__Abilities and Equipment:__\n~!\n- __Secret Soul Techniques:__ Divine Stream\n\n- __Temporal Demon Spirit Book:__ An attack which pierces his enemies with a beam of light\n\n- __Shadow Devil Form:__ A state where Nie Li becomes completely invisible and undetectable but can not affect the world around him, as he increases his level of cultivation to the higher stages, he can perform this ability for longer lengths of time with a higher concealment ability so he can hide from stronger foes as the story progresses. He has 2 other abilities from his shadow devil form, being Arm sickle and fist mutation. Fist mutation allows Nie Li to use the power of law in his fist for different attack types.\n\n- __Fanged Panda Form:__ Thunder Strike which is the basic attack with a large force behind it. Gravity Field which controls the gravity in a 5 metre radius around himself and Yin Yang Blast which is a long range attack that shoots two energy balls which explode with a radius of damage of 10 meters, the longer he charges this attack, the more power he can get out of it, the maximum power he can get out of the attack is 10x the original power.\n\nIn addition to these abilities, he also has the Demon Blood Sacrifice which strengthened Nie Li's cultivation and physique with that of a Primordial Bloodline Demon Beast as to withstand the cultivation techniques he uses.\n!~",
      "metadata": {
        "gender": "male",
        "age": "13 (Start), 15 (Currently)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124685-BgKG6Z1BeA9l.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124685
      },
      "rarity": "epic"
    },
    {
      "id": "ninger-xiao",
      "name": "Ninger Xiao",
      "alt_names": [
        "肖凝儿"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Soul Realm:__ Green\n\nOne of the students in the fighter apprentice class with Nie Li. She is a member of the noble Winged Dragon family. One of the main motivations behind her strong determination in training is her wish to escape from an arranged marriage between her and the Sacred Family's Shen Fei, who she despise and hate.\n\nShe is described as having shoulder length black hair and a slim figure The Manhua varies from this by showing her with long brownish orange hair. She is a cold and anti-social beauty. Her personality is that of a serious student, unyielding woman with a strong determination. She is very grateful to Nie Li for giving her the ability to oppose her arranged marriage with her newfound powers and for curing her of the Arctic disease before the worst happened. She was the first woman to start loving Nie Li in his rebirth life.\n\n__Abilities and Equipment:__\n~!\n- __Heavenly Lightning Sparrow:__ She can throw lightning bolts at will and blind her enemies at her command.\n\n- __Divine Scarlet Thunderbird:__ Her spirit form she can use to kill her enemies, like Nie Li's fanged panda and shadow devil.\n\n-__Lightning Gale Sword:__ After the death of her spirit and became replaced by one of the dragon bloodline, she had her Heavenly Lightning Sparrow demon spirit refined into a sword that she can brandish to kill her foes.\n\nShe is in possession of a page from the Temporal Demon Spirit Book which was sealed inside a tattoo on her by her grandfather.\n\n!~",
      "metadata": {
        "gender": "female",
        "age": "13 (start), 15 (Currently)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124686-CRiviTYdlzjI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124686
      },
      "rarity": "uncommon"
    },
    {
      "id": "ziyun-ye",
      "name": "Ziyun Ye",
      "alt_names": [
        "叶紫芸"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Soul Realm:__ Cyan \n\nOne of the students in the fighter apprentice class with Nie Li, very few know her background. She is a member of the strongest family in Glory City, Snow Wind Family. Her grandfather is the legend rank demon spiritualist Ye Mo, and her father, Ye Zong, is the current City Lord. Her mother died when she was young, and because her father and grandfather have always been busy, she doesn't see them a lot.\n~!\n In her previous life Nie Li protected her and they were able to grow close as they struggled to survive. Despite his much weaker cultivation they became lovers for a short time until she died protecting the survivors from a demon beast attack which affects Nie Li mentally.\n!~\n__Abilities and Equipment:__ \n~!\n- __Snow Queen Form:__ Ice Wall which is defensive skill that forms a barrier out of ice. She can also call forth a blizzard around herself in a wide area attack to freeze her enemies. Finally she has Ice Sword where she can form a sword out of ice for fighting at a close distance yet this gets rarely used throughout the story.\n\n- __Bone Tooth Anklet:__ Found in the underground palace, made from a legend rank Snow Wind Giant Beast, enhances the demon spirit force within her.\n\n- __Divine Guardian Rocks:__ These were given to her by Nie Li and they can be used to form a protective array which is impenetrable around her along with Forbidden Technique Inscription scrolls which have the purpose of unleashing high level inscriptions on the enemies she cant take out using her own power.\n!~",
      "metadata": {
        "gender": "female",
        "age": "13 (start), 15 (Currently)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127077-b6tSSRz7mGUO.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127077
      },
      "rarity": "uncommon"
    },
    {
      "id": "ming-shen",
      "name": "Ming Shen",
      "alt_names": [
        "沈冥"
      ],
      "role": "supporting",
      "description": "Shen Ming is the main affairs elder of Sacred Family. However, his influence is greater then normal as while the Patriarch, Shen Hong, is in isolation training, he is making all the important decisions for the family.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b177458-242F0W4o6bCW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 177458
      },
      "rarity": "uncommon"
    },
    {
      "id": "yao-zhu",
      "name": "Yao Zhu",
      "alt_names": [
        "妖主",
        "Demon Lord"
      ],
      "role": "supporting",
      "description": "(After rebirth)\n__Race:__ Human\n__Hair Color:__ Brown/Grey\n__Eye Color:__ Red\n__Cultivation Technique:__ Law Of Hell/God Tongue\n\nThe title taken by the founder and leader of the Dark Guild. He has been reborn into younger bodies multiple times using the Spiritual Constellation Technique, allowing him to live for hundreds of years. In this incarnation, he has a body with the Supreme Physique.\n\n~!When he was a young starving child he was taken in by an old man that worked for the Red Jade Family. When the boy was seventeen the old man was ruthlessly whipped to death by the family for failing an assigned task. The boy disappeared for decades. When he returned he was wearing a demon mask and called himself the Demon Lord. He then single-handedly massacred the entire Red Jade Family, including several high level black gold Demon Spiritualists. He then left Glory City and founded the Dark Guild.!~\n\n__Abilities and Equipment:__\n~!\n- __Supreme Physique:__ An extremely tough body that is able to support higher levels of cultivation.\n\n- __Eight-Armed Darkhell Fiend:__ An extremely overbearing punch attack the appears to be made up of countless souls from the people he massacred.\n\n- __Ancestral Master Daozang Secret Technique:__ Allows him to control/command the people of the Daozang family lineage\n\n- __Armor: Draconic__ Ruins Realm Grade 3 Artifact\n!~",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b177459-s7x5lPuPUiAH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 177459
      },
      "rarity": "uncommon"
    },
    {
      "id": "yan-ye",
      "name": "Yan Ye",
      "alt_names": [
        "叶延",
        "Xiao Fei Fei (小飞飞)"
      ],
      "role": "supporting",
      "description": "One of the five legend rank demon spiritualists that founded Glory City about a thousand years ago. The Snow Wind Family is a branch of his Thunder Family, making him also the founder of the Snow Wind Family. His spirit was sealed within the Heavenly Sacred Border in order to guard over Glory City and protect it.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b177460-Rbh380jVasHf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 177460
      },
      "rarity": "uncommon"
    },
    {
      "id": "zong-ye",
      "name": "Zong Ye",
      "alt_names": [
        "叶宗"
      ],
      "role": "supporting",
      "description": "A member of the major Snow Wind Family and Ye Ziyun's father. He holds the position of City Lord of Glory City.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b177461-nNwKEtawvnUr.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 177461
      },
      "rarity": "uncommon"
    },
    {
      "id": "jian-duan",
      "name": "Jian Duan",
      "alt_names": [
        "段剑"
      ],
      "role": "supporting",
      "description": "A male youth with dragon wings, who was the product of a Silver Winged woman falling in love with Duan Yun, a member of the Black Dragon Family. Both of his parents were killed and he was tortured by the Silver Winged Family.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b177462-mCDy4Qfia2q9.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 177462
      },
      "rarity": "uncommon"
    },
    {
      "id": "yan-gu",
      "name": "Yan Gu ",
      "alt_names": [
        "古炎"
      ],
      "role": "supporting",
      "description": "One of the six elders that sit on the council at the Alchemy Association and also the current president.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b177463-FEiIJXz7H6iw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 177463
      },
      "rarity": "uncommon"
    },
    {
      "id": "xin-yang",
      "name": "Xin Yang ",
      "alt_names": [
        "杨欣"
      ],
      "role": "supporting",
      "description": "The director of the Alchemy Association. She is described as a beautiful and talented alchemist. She was orphaned at a young age and used her own skill and hard work to rise to the position of director. Because of her beautiful looks she is often not taken seriously. Because of this she often feels very isolated and lonely.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b177464-n79WcmQ3OgGl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 177464
      },
      "rarity": "uncommon"
    },
    {
      "id": "yue-shen",
      "name": "Yue Shen",
      "alt_names": [
        "沈越"
      ],
      "role": "supporting",
      "description": "A member of the Sacred family, he was a fellow student in the Fighter apprentice class with Nie Li. His aunt Shen Xiu was the teacher for the class in order to watch over him and Ye Ziyun. His family has always been trying to pair him up with Ye Ziyun and though he has tried to get close to her, she has shown him no particular interest.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b177465-fdUaLf3wNRaJ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 177465
      },
      "rarity": "uncommon"
    },
    {
      "id": "ze-du",
      "name": "Ze Du",
      "alt_names": [
        "杜泽"
      ],
      "role": "supporting",
      "description": "__Soul Realm:__ Yellow\n\nA fellow student at Holy Orchid Institute in the fighter apprentice class with Nie Li. He comes from the very poor commoner Du family, but his nature is very hard working and his talent is not bad.",
      "metadata": {
        "gender": "male",
        "age": "13-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b279490-h9vTZaDPfzDN.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 279490
      },
      "rarity": "uncommon"
    },
    {
      "id": "piao-lu",
      "name": "Piao Lu",
      "alt_names": [
        "陆飘"
      ],
      "role": "supporting",
      "description": "__Soul Realm:__ Red\n\nLu Piao is one of Nie Li's best friends along with Du Ze. He is a member of the noble Lu family of Glory City and is a student at Holy Orchid Institute.",
      "metadata": {
        "gender": "male",
        "age": "13-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b279491-IrwrDWkWCoLB.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 279491
      },
      "rarity": "uncommon"
    },
    {
      "id": "fei-shen",
      "name": "Fei Shen",
      "alt_names": [
        "沈飞"
      ],
      "role": "supporting",
      "description": "Shen Yue's older brother. He is known to be a playboy. He is a student at Holy Orchid Institute in the Genius Demon Spiritualist class.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b279767-179UZJpDtl2v.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 279767
      },
      "rarity": "uncommon"
    },
    {
      "id": "hong-shen",
      "name": "Hong Shen",
      "alt_names": [
        "沈鸿"
      ],
      "role": "supporting",
      "description": "He is the Patriarch of the Sacred Family. He is Shen Yue and Shen Fei's father and Shen Xiu's brother.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b279768-81lppANLikmv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 279768
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-26T08:01:31.881Z"
}