{
  "work_id": "black-lagoon",
  "count": 15,
  "characters": [
    {
      "id": "revy",
      "name": "Revy",
      "alt_names": [
        "レヴィ",
        "Rebecca Lee (レベッカ・リー)",
        "Two Hands",
        "Becky"
      ],
      "role": "protagonist",
      "description": "Revy, sometimes referred by her full name Rebecca Lee, is the female protagonist of the series. She does most of the fighting for the Lagoon Company. Very little is revealed about her past, although portions can be pieced together through the series. Revy is a Chinese-American born and raised in Chinatown, Manhattan, near Mott Street, spending most of her youth as a thief and murderer. Flashbacks throughout the series reveal that Revy may have honed her skills with firearms by shooting at cans, and that her first murder may have involved shooting her father while using a pillow. It is unknown whether the pillow was used to suppress the noise or to help avoid looking at her first victim.\nShe shot him as a result of being fed up with the abuse.\n~!In the 3rd season, it is revealed that she was also raped in a jail cell!~ Revy is very competitive, easily bored, and extremely ill-tempered. Unlike Rock, she is undiplomatic, believing in the use of brute force and coercion to get her way. In contrast to this, she's revealed to be highly ticklish.  Revy is a merciless and sadistic killer, without a conscience, who will kill anyone at the slightest provocation, even unarmed civilians (as seen in episode 6). Dutch once made reference to University of Texas shooter Charles Whitman in describing Revy after she slaughtered the crew of the Neo-Nazis' boat after a previous conversation with Rock brought up some unpleasant memories, resulting in an internal fit of rage - she even threatened Rock with death if he ever questions or tampers with her way of life. Of all the characters in the series, Revy uses the most foul language. She takes maniacal glee in killing anyone and everyone. She is also a heavy smoker and drinker.  She has a changing but volatile attitude towards Rock; though she respects him later in the series, she is mostly hostile towards him. She shot Rock at point blank range, but he moved her gun at the last second, during a confrontation in episode 7, and in episode 1 emptied most of a magazine in his direction while arguing with Dutch about their hostage. However, she does have a tendency to save Rock from critical situations, and later on she admits to considering Rock as family to Balalaika. It is possible that she has an attraction to Rock, based on her reactions to Eda's teasing, which appear to be jealousy.  According to CIA agents on Basilan Island, towards the end of episode 12, Revy is still notorious in the NYPD, particularly at the 27th Precinct. Since the 27th Precinct does not exist in real-life New York City, this throwaway reference may - or may not - indicate an odd connection to Dick Wolf's Law and Order franchise. This is further suggested in a later episode, when Revy specifically mentions the series.  Revy is one of the deadliest fighters in the series, whose skill with firearms and ability to dodge bullets is almost superhuman and unparallelel. There are only a few other characters, such as Roberta and Ginji, that can hold their ground against her in combat. Her weapons of choice are a pair of modified Beretta 92FS's; which are made out of stainless steel and had their barrels extended from 4.9\" to 5.9\" each (the 5.9\" is the combat MOD barrel) and also adapted for silencers. They are engraved with \"9mm Sword Cutlass\" on both sides, as well as the Jolly Roger of the infamous pirate Calico Jack (which is also inlaid into the ivory grips), and a manufacture inscription in Thai. Due to her ambidextrous marksmanship skills, she is nicknamed \"Two Hands\" by the denizens of Roanapur. However, Revy has been seen using a variety of other firearms.  Constantly living on the edge of life, Revy has developed a rather bleak, almost nihilistic outlook on life, relying only on her own power, skills, and money. She does not believe in God or emotions. However, she seems to respect and trust her companions.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b458-tlKqPcuR287U.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 458
      },
      "rarity": "legendary"
    },
    {
      "id": "rokuro-okajima",
      "name": "Rokuro Okajima",
      "alt_names": [
        "岡島緑郎",
        "Rock",
        "Japonski"
      ],
      "role": "protagonist",
      "description": "Rock, formerly known as Rokuro Okajima, is the protagonist of the series. He was a Japanese salaryman for Asahi Industries in Tokyo until he was taken hostage by the crew of the Black Lagoon. He joined the Lagoon Company after his department chief, Kageyama, abandoned him in an attempt to cover up the smuggling operation in which Rock had been an unwitting participant. Rock is a humble and mild-mannered person despite being on the business end of guns from friend and foe alike, and often seems surprised at the barbarity of the Southeast Asian crime world. He still wears his tie, short-sleeved dress shirt, and dress pants because although now a pirate, he still retains his business persona. He prefers to use words over weapons when interacting with others. Rock, after joining the Lagoon company, has wondered if he is experiencing Stockholm syndrome.  \n\nWithin the Lagoon Company, Rock is usually responsible for account management, diplomacy, negotiation, interpretation, and the occasional errand. Having once worked in the resource investigation department of Asahi Industries, Rock is also skilled in geology. He is also a skilled linguist, being effectively bilingual in Japanese (his native language) and English as well as being familiar with other languages, including Spanish, Romanian and Russian. He also has a surprisingly high tolerance for alcohol, owing to the heavy-drinking lifestyle of a ladder-climbing salaryman. Rock's earnest personality has earned him the interest of several figures in Roanapur, including Balalaika, Mr. Chang, Rowan \"Jackpot\" Pigeon, Yolanda, Eda (who develops a crush on him), and young Garcia Lovelace, whom he trusts to the greatest degree. In many ways, Rock is the heart of the Lagoon Company, serving as a balance for his more jaded teammates and as a bright spot in the world of darkness that is Roanapur. Dutch has stated that he believes Lagoon Company is complete with Rock not holding a gun, saying his bullets are the kind to ricochet back at them. \n\nRock is one of the \"luckiest\" characters in the series as he managed to survive every single thing he experienced from being taken hostage to being shot at. Thus far, he has survived the wrath of Revy, Balalaika, Roberta, and Sawyer. He is personally appointed by Mr. Chang to help Garcia Lovelace, much to Lagoon Company's disapproval. Rock eventually begins to enjoy his life as a pirate and becomes even more comfortable with corruption. Later, in a conversation with Fabiola, he demonstrates a darker, sadistically ruthless side of his personality clearly influenced by Revy and the Roanapur environment. Benny even points out that there are things about him that scare almost everyone in Roanapur.  While Rock has a family in Tokyo, he does not seem to have much connection to them due to their somewhat apathetic attitude towards him. It was later revealed that he did not pass his college entrance exams on his first try, leading his family to lower their expectations of him. It is known that he has a father, a mother, and an older brother who was academically capable and thus attained a job in the Japanese government. He was born in the 49th year of the Showa period, according to the manga version, which corresponds to 1975-1976.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b459-QsGmozEvK0jM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 459
      },
      "rarity": "legendary"
    },
    {
      "id": "dutch",
      "name": "Dutch",
      "alt_names": [
        "ダッチ",
        "Dicky"
      ],
      "role": "protagonist",
      "description": "The leader of Lagoon Company and captain of the ex-American Navy PT boat Black Lagoon. He is a former American soldier who fought in the Vietnam War. He tends to stay away from the fighting associated with Lagoon Company&#039;s activities. Instead, he gives orders and negotiates contracts with clients - usually Balalaika of Hotel Moscow. Dutch is a calm, easygoing character, and quite friendly. He is a Christian, denomination unknown. His body is heavily muscled, and he is always seen wearing a pair of sunglasses. He appears to be in his 30s, but is likely in his 50s, based on his military service in Vietnam.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b457-BdoXIN7tNvoz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 457
      },
      "rarity": "legendary"
    },
    {
      "id": "benny",
      "name": "Benny",
      "alt_names": [
        "ベニー",
        "Benny-Boy"
      ],
      "role": "protagonist",
      "description": "Benny is a college dropout from a Florida university where he studied until getting into trouble with the FBI and the mafia. He works as the Lagoon Company&#039;s mechanic, computer specialist, and researcher. He is of Jewish descent as he puts it himself and is often called &quot;Benny-Boy&quot; by Dutch.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/460.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 460
      },
      "rarity": "legendary"
    },
    {
      "id": "balalaika",
      "name": "Balalaika",
      "alt_names": [
        "バラライカ",
        "Sofiya Pavlovena",
        "Fry Face",
        "Kapitan",
        "Vladilena"
      ],
      "role": "supporting",
      "description": "Balalaika is the boss of Hotel Moscow. It is revealed in the novel that her real name is Sofiya Pavlovena, though this name is never used in her presence. She is sometimes referred as Vladilena reduction from Vladimir Ilich Lenin. She was brought up by her grandfather, the military head of the USSR. \n\nBefore joining the mafia, Balalaika was a captain in the Soviet Army and a Vozdushno-Desantnye Vojska paratrooper who served in the Soviet war in Afghanistan. A fine marksman and sniper, she was nicknamed \"balalaika\", one of Soviet Army's slang terms for the Dragunov sniper rifle. Due to Balalaika's leadership during the hellish fighting in Afghanistan, her men look up to her as their superior and will do just about anything upon her orders. As a combat officer, she is a skilled strategist and well-rounded fighter, capable of taking care of herself despite the fact that all of her troopers, including Boris, often worry about her. Although she has shown herself to be rather cynical on occasion, she is also a pragmatic and professional businesswoman. She frequently employs Dutch and the Lagoon Company, apparently because they share a mutual respect.  \n\nBalalaika can be easily identified by the burn marks which scar most of the right side of her face, neck, and chest which she suffered in Afghanistan, earning her the nickname \"Fry-Face\" by those who dislike her. She has long blonde hair, and usually wears a military greatcoat, thrown over a low-cut business suit. She smokes cigars, in contrast with the other characters who smoke cigarettes. \n\nBased on her service in Afghanistan and the missed opportunity to participate in the 1984 Summer Olympics in Los Angeles, she is between 31–35 years old. She is one of the few people to earn Revy's respect. In turn, Balalaika also seems to hold Rock in high regard, sometimes relying on his knowledge and business skills. \n\nIn critical operations, Balalaika calls upon a personal cadre of ex-Soviet airborne troops and Spetsnaz commandos who are Afghanistan veterans. Known as the Desantniki, they act as Hotel Moscow's special ops team. When conducting foreign operations from Thai soil, she uses the Russian cargo ship Maria Zeleska as a legal cover from the police and various law enforcement agencies. In spite of the fact that Balalaika is on the Interpol list, she uses her real name in Japan, being covered by diplomatic immunity.  Benny revealed to Rock that Balalaika's men have enough training to start and win World War III if they wanted to. They were all Afghan Veterans with insane amount of training and skill. With Balalaika as the brains for their operation, her men became unstoppable killing machines.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b461-1hBKMLSpTY0e.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 461
      },
      "rarity": "rare"
    },
    {
      "id": "eda",
      "name": "Eda",
      "alt_names": [
        "エダ",
        "Damn nun of the Violence Church"
      ],
      "role": "supporting",
      "description": "Eda is a nun in a convent in Roanapur with ties to the underground (since the convent is mainly a smuggling operation). She is friends with Revy but that doesn't keep them from pointing their guns at each other in business matters as they share the same hotheaded personality. She has blonde hair and wears her pink sunglasses even with her nun outfit.   ~!It is later revealed that Eda is actually CIA and undercover in Roanapur.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b462-v7jdOHUT6hPI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 462
      },
      "rarity": "rare"
    },
    {
      "id": "roberta-cisneros",
      "name": "Roberta Cisneros",
      "alt_names": [
        "ロベルタ・チスネロス"
      ],
      "role": "supporting",
      "description": "Roberta is a maid who worked for four years at the Lovelace household in Venezuela. Although her domestic skills, such as cleaning and cooking, were poor, she has developed a close friendship with the young scion of the Lovelace family, Garcia. ~!Roberta was once known as Rosarita Cisneros, a former FARC guerrilla trained as an assassin in Cuba and an internationally wanted criminal. She earned the moniker \"Bloodhound of Florencia\" for her relentless drive to achieve her objectives.  In combat, Roberta is a truly fearsome opponent, having trained in a wide variety of martial, stealth, and weapon skills. Among the weapons she has used before were a sniper rifle, a combat knife, a shotgun disguised as an umbrella, a machine gun which was disguised as a briefcase, a grenade launcher, spiked brass knuckles, a trench spike, and pistols. Her strength, speed, endurance, and instincts were honed to almost supernatural levels. There was even a scene in anime where she chased a car barefoot and used a knife to attach herself to it, that bore a striking resemblance to a similar scene from a movie Terminator 2 - the fact which Rock also indirectly points out and gets reprimanded by Dutch not to joke around.  It is ironic that while Roberta is one of the most powerful warrior-women in the story of Black Lagoon, she is also humane, possessing warmth, kindness, remorse, and family love for her master and his son.  She admitted that she did murder children, woman or anyone in name of revolution during her FARC years. Disillusioned by the fact that she is merely a tool for drug cartels in cahoots with FARC in the end, she opted out and joined the Lovelace clan as a maid. Despite being asked by Garcia not to pick up gunfighting anymore, later events of manga story make her go into battle again, seeking revenge.!~  She is also heavily modeled on El Mariachi, popularized by Antonio Banderas down to suitcase machine gun signature and her Latin America background.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/2762-j8CEA7sYiDP6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2762
      },
      "rarity": "rare"
    },
    {
      "id": "bai-ji-shin-chang",
      "name": "Bai Ji-Shin Chang",
      "alt_names": [
        "張維新",
        "Mr. Chang",
        "Babe",
        "The Walking Dude",
        "Wai-San Chang",
        "チャン・ウァイサン"
      ],
      "role": "supporting",
      "description": "Wai-San Chang (also known as Mr. Chang) is the boss of a branch of the Triads based in Thailand. Like Revy, he is adept with wielding a pistol in each hand (Beretta 76 and AMT Hardballer) in a fashion similar to that of gun fu. Chang is far more proficient in it than Revy (in episode 11 she actually confesses that she is \"not on his level yet,\" an unprecedented admission of anything less than perfection on her own part; it remains unclear, however, whether or not she is referring to gunplay in general or Chang's own particular style), and it is implied that it is he who taught her this style of combat. It may be this prowess in combat that makes Chang the only male to whom Revy respectfully refers to as \"Sir\".  Mr. Chang is based on characters commonly played by Chow Yun Fat in films by John Woo, such as John Lee in Replacement Killers and especially Mark Gor in A Better Tomorrow, as both Chang and Gor are members of the Hong Kong Triad, wield dual pistols and don similar attire.  Unlike most criminal bosses in the town, he advocates cooperation and joint ventures.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/3450.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3450
      },
      "rarity": "rare"
    },
    {
      "id": "shenhua",
      "name": "Shenhua",
      "alt_names": [
        "シェンホア",
        "Chinglish"
      ],
      "role": "supporting",
      "description": "Shenhua is a Taiwanese assassin in the employ of Mr. Chang. She prefers to use various edged weapons in close combat, in particular a pair of kukri knives linked together with a length of leather rope at the handles. She is also skilled in the use of throwing knives. Shenhua is a professional rival of Revy, whom she has worked with and against at times. Her personal religion is Taoism. One of her most notable traits is her broken speech pattern, which is always moving between Chinese and English. This can be compared to Shampoo from Ranma 1/2.    It is unknown if Shenhua has any unarmed hand-to-hand skills, although it seems likely. In the anime she fights only with blades, and never engages anyone in true hand-to-hand combat.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b9007-vADI4jKONEh7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9007
      },
      "rarity": "rare"
    },
    {
      "id": "garcia-lovelace",
      "name": "Garcia Lovelace",
      "alt_names": [
        "ガルシア・フェルナンド・ラブレス",
        "Garcia Lábrez"
      ],
      "role": "supporting",
      "description": "Garcia Fernando Lovelace is the only son of Diego Jose San Fernando Lovelace, aged about 12 to 13 at his first appearance. He was heir to the Lovelace family line, and as such, is its current head, the twelfth in succession after his father was assassinated.  He was kidnapped for a short while by a Colombian cartel and was transported by the Lagoon Company as \"goods\". He and Roberta left Roanapur shortly afterwards, with some help from Hotel Moscow. He has apparently returned to Roanapur searching for Roberta with a new maid named Fabiola, waiting in a local hotel called the \"Sunken Palace Hotel\" and seemed to have matured greatly in terms of emotional strength, as commented by Rock, since his last appearance.  He treats both Roberta and Fabiola as if they were his extended family and in return, both care for him equally.  He requests help from Lagoon Company with additional help from Chang, Shenhua, Sawyer, and Lotton. However, the only person he truly trust among Roanapur is Rock.  (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/14238.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14238
      },
      "rarity": "rare"
    },
    {
      "id": "luak",
      "name": "Luak",
      "alt_names": [
        "ルアク"
      ],
      "role": "supporting",
      "description": "Luak was a pirate captain who was based in Roanapur and often raided the coast and rivers of nearby Thailand. Although he was good, he had the bad habit of attracting unwanted company (Chin once commented that a warship had once pursued him).    His latest contract was with the minor crimeboss Chin. It seemed that Dutch had slighted the Chinese boss by favoring Balalaika rather than him, and hired Luak to kill him and the Lagoon Company in an ambush (Chin had given a trusted source of Dutch's bogus information on a job to send the Lagoon Company).    But from the start, the mission was doomed. When his six boats tried to flank the Black Lagoon and riddle it with gunfire, Dutch managed to &quot;hit the brakes&quot; by reversing the Black Lagoon's engines, causing one of Luak's boats to be destroyed in a friendly-fire crossfire. Then Revy took over as she single-handedly boarded four of the remaining crafts, killing the crews and blowing the boats up with a grenade launcher. Seeing his chances diminishing, Luak decided to flee the scene &ndash; only to be killed when Revy blew-up his boat. Chin was later killed by Balalaika and &quot;Hotel Moscow&quot;.    (Source: Absolute Anime)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b15755-BXnnzoehKu5L.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15755
      },
      "rarity": "rare"
    },
    {
      "id": "bao",
      "name": "Bao",
      "alt_names": [
        "バオ"
      ],
      "role": "supporting",
      "description": "Originally an ARVN officer (army of South Vietnam), Bao is now the owner and bartender of the Yellow Flag Bar (the name is a reference to the old flag of South Vietnam, which was yellow with three narrow yellow stripes running through it), the favorite watering hole for the Lagoon Company. Bao had founded the bar after he fled the country following the fall of Saigon (now known as Ho Chi Mihn City), just like other ARVN soldiers.  Rock, upon his first visit to the Yellow Flag Bar when he was a hostage of the Lagoon Company, referred to it as the archetypal 'Bar at the end of the world'. The clientele are often the worst of Roanapur's residents – pirates, smugglers, prostitutes and people that had lost all hope for the island. Weapons are usually displayed openly on the bar's tables, possibly an unwritten rule.  \n\nAlthough Bao has retrofitted his bar with a bulletproof-steel plate in front of it (the Yellow Flag Bar is often the scene of many gun battles), it doesn't save the rest of the bar from being shot-up in a gun battle when it happens. And whenever Revy or the Lagoon Company is involved, he demands payment from the Lagoon Company for fixing the bar afterward (which Revy or Dutch never does usually).  (source: Absolute Anime)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b15758-Od8NVPoYyjpZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15758
      },
      "rarity": "rare"
    },
    {
      "id": "chin",
      "name": "Chin",
      "alt_names": [
        "陳"
      ],
      "role": "supporting",
      "description": "Chin is a Chinese crime boss who made several serious attempts to replace Balalaika as one of the major powers of Roanapur. Balalaika found out about his plans and personally murdered him, which consisted of tying him to a chair and then blowing up his apartment using plastic explosives and gasoline.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b18956-e1TktSLPwiJQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18956
      },
      "rarity": "rare"
    },
    {
      "id": "leigharch",
      "name": "Leigharch",
      "alt_names": [
        "レガーチ"
      ],
      "role": "supporting",
      "description": "Leigharch is an Irish driver who worked with Shenhua at one time. A compulsive smoker of marijuana (in the manga he actually snorts cocaine), he has a distressingly frequent tendency to hallucinate at inopportune times, such as in the middle of a car chase. Most of his hallucinations are actually references to Western pop culture, such as Playmates, Star Trek characters like Jean-Luc Picard and Klingons, or sixties rock music such as Jimi Hendrix. Leigharch is said by Shenhua to have suffered a massive overdose (he &quot;couldn&#039;t get back from Mars&quot;), inducing psychological damage severe enough to commit him to full-time medical attention.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/20264.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 20264
      },
      "rarity": "rare"
    },
    {
      "id": "yolanda",
      "name": "Yolanda",
      "alt_names": [
        "シスター・ヨランダ",
        "Sister Yolanda"
      ],
      "role": "supporting",
      "description": "Sister Yolanda is the leader of the Church of Violence, often called &quot;the Rip-off Church&quot; by much of Roanapur. Located on the mainland of Thailand, the facility operates as an active Roman Catholic church &ndash; although it is heavily active in arms and drug smuggling, and often undercuts operations by the other Roanapur mob syndicates, including Balalaika&#039;s &quot;Hotel Moscow&quot;, but has remained unattacked by them because of their religious status.  Although kind and soft-spoken, Sister Yolanda runs the Church of Violence with an iron fist, and is the one person that can barely keep a hot-head like Eda under check. She is also appreciative of the talents of Rock, when he let on about his observations about the drug smuggling operations of the church and kindly made mention how it would affect the relationship of it with the Lagoon Company. Just in case things go wrong, she has a golden Desert Eagle automatic pistol hidden in her desk, just in case.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22186-inZE84OgoeVd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22186
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T11:30:20.143Z"
}