{
  "work_id": "kurokos-basketball",
  "count": 15,
  "characters": [
    {
      "id": "tetsuya-kuroko",
      "name": "Tetsuya Kuroko",
      "alt_names": [
        "黒子テツヤ",
        "The Phantom Sixth Member",
        "Tetsu",
        "Kurokocchi",
        "Kuro-chin"
      ],
      "role": "protagonist",
      "description": "__Height:__ 168 cm (5'6\")\n__School:__ Seirin High \n__Number:__ #11  \n__Speciality:__ Simple sleight of hand tricks  \n__Motto:__ (Every encounter is a) once-in-a-lifetime encounter  \n\nThe phantom sixth member of the \"Generation of Miracles.\" He has a very weak presence and often seemingly appears out of nowhere as a result. \n\nAt the first glance all of his abilities seem to be below average, but despite being bad at dribbling and shooting he can be a dangerous opponent. He specializes in circulating passes without being seen. Because of his largely complementary skill set, Kuroko considers himself a \"shadow\" whose goal is to help his \"light\" achieve greatness.   \n\n~!After being defeated by Aomine, Kuroko trains himself to evolve his play style. He overcomes his previous limitations, and has developed the ability to move past players unseen while dribbling the ball, creating his own 'vanishing' drive. After his misdirection effect runs out, Kuroko can force the opponent to just focus on him, allowing his teammates to go by unnoticed. Thanks to Aomine's coaching later on, Kuroko also develops some shooting skill, making his own shooting style called \"Phantom Shot\" where the ball disappears.!~",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b18769-7ms6XKt8jCzU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18769
      },
      "rarity": "legendary"
    },
    {
      "id": "taiga-kagami",
      "name": "Taiga Kagami",
      "alt_names": [
        "火神大我",
        "Bakagami",
        "Kagamicchi"
      ],
      "role": "protagonist",
      "description": "__Height:__ 190 cm (6'2'')\n__School:__ Seirin High\n__Number:__ #10\n__Position:__ Power Forward\n__Talent:__ Jumping power\n\nKagami was in America until second year of middle school and has recently come back to Japan in his first year of high school. He is determined to surpass \"The Generation of Miracles\" and become the number one. Along with Kuroko, they're the only two freshmen allowed to play in matches. (Even though it looks like they always disagree over things, he and Kuroko – nicknamed Seirin's Freshmen Duo – are actually on good terms.)\n\nAt the start of the story, Kagami is shown to have a huge potential – good build, height, skill in basketball – but his strongest weapon is his inhuman jump. With those jumps (that gradually get higher and higher every time), he manages to block his opponent's attacks.\n\nHe's really bad at studying and always get low grades, even in English. He lives alone, has an enormous appetite and is unexpectedly good at cooking. In the past, he was attacked by a dog, and that made him afraid of dogs.",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b18770-iLAk9O3GGUvN.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18770
      },
      "rarity": "legendary"
    },
    {
      "id": "riko-aida",
      "name": "Riko Aida",
      "alt_names": [
        "相田リコ"
      ],
      "role": "supporting",
      "description": "**Height:** 156 cm (5'1\")  \n**School:** Seirin High\n**Job:** Coach  \n**Talent:** Ability Scan \n\nShe is the coach of the basketball team. She has the ability to be able to tell the potential of each basketball player just by looking at their bodies. Her ability works best when the players are shirtless. She got this ability by following her father to work. She's so horrible at cooking that her teammates can't endure eating it (moreover, she has the habit of mixing vitamins with her cooking). She's good at studying and is ranked #2 in the whole school. Riko can be really scary when she's mad, and she's often teased as being 'flat-chested' compared to Touou's Momoi.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21331-OmWP2h7Y9yKq.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21331
      },
      "rarity": "rare"
    },
    {
      "id": "ryouta-kise",
      "name": "Ryouta Kise",
      "alt_names": [
        "黄瀬涼太",
        "Ki-chan"
      ],
      "role": "supporting",
      "description": "**Height:** 189 cm (6'2\")\n**School:** Teiko, Kaijou High\n**Number:** #8 (Teiko), #7 (Kaijou)\n**Position:** Small Forward\n**Talent:** Copy\n\nNow a freshman at Kaijou High, Kise was the rookie of the \"Generation of Miracles\". Since he only started playing basketball in his second year of middle school, Kise was his team's least experienced member, and notes himself the weakest of the five. Kise's unique skill is his ability to mimic the moves and plays of other players. The only moves he cannot copy are the special skills of truly exceptional players, like the other members of the \"Generation of Miracles\". Beyond being a strong player in his own right, Kise respects Kuroko's abilities and wishes to play with him once again. He seems to have a slight obsession with Kuroko, believing that they were the two who got along most in middle school (though Kuroko said they didn't) and often blurting out random facts about him (mentioning that Kuroko was an Aquarius, even though Kasamatsu was talking about Midorima).   Also, he's a model in his free time, so girls are always mobbing him.   ~!Later on in the manga series, it's revealed that Kise had developed the strength to mimic the other Generation of Miracles' member's play (shown as Midorima's absolute accuracy, Aomine's flexibility, and also Murasakibara's monstrous strength), which resulted from his hard work these past days. And also because the technique costs lots of energy even from the original user, Kise can only use them for 5 minutes during a match.!~",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21332-aPRs1Xq7ZHoV.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21332
      },
      "rarity": "rare"
    },
    {
      "id": "shun-izuki",
      "name": "Shun Izuki",
      "alt_names": [
        "伊月俊"
      ],
      "role": "supporting",
      "description": "**Height:** 174 cm (5'8\") \n**School:** Seirin High \n**Number:** #5 \n**Position:** Point Guard \n**Talent:** Eagle's Eye \n\nA Seirin sophomore who is known for being calm and composed. He also tends to make lame puns. His special ability is his Eagle Eye, which allows him to 'see' his selected area on the court without actually looking.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22251-suyrYFjsIVPk.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22251
      },
      "rarity": "rare"
    },
    {
      "id": "rinnosuke-mitobe",
      "name": "Rinnosuke Mitobe",
      "alt_names": [
        "水戸部凛之助"
      ],
      "role": "supporting",
      "description": "A hard working player who has never spoken in front of his team members. For some reason, Koganei can understand what's on his mind and then speaks for him. Mitobe is the eldest son in a really big family, with a lot of brothers and sisters.  Mitobe is just as determined to win as the other players at Seirin, but unlike the others, he doesn't show his feelings that often. Most people know him as a quiet, hard worker. According to Riko, no one has ever heard Mitobe talk.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22252-zUc554bESbKn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22252
      },
      "rarity": "rare"
    },
    {
      "id": "shintarou-midorima",
      "name": "Shintarou Midorima",
      "alt_names": [
        "緑間真太郎",
        "Midorimacchi",
        "Mido-chin",
        "Shin-chan",
        "Midorin"
      ],
      "role": "supporting",
      "description": "__Height:__ 195 cm (6'5\")\n__School:__ Shuutoku High School \n__Position:__ Shooting Guard  \n__Special Ability:__ Shooting from anywhere on the court (Far-Distance Shooter)  \n\nMidorima often acts reserved, mean, and brusque with others, coming off as arrogant—although Takao claims Midorima is just \"tsundere.\" He has a hard time acting kind to his opponents and generally hates \"fooling around\" (although Takao often pursues him into it). He can be seen, at all times, with a lucky item due to his strong belief and passion for horoscope. He is left-handed, and always bandages his dominant hand outside of matches (claiming that his hand must be in perfect condition so nothing will influence his shot).  Formerly a member of the basketball team of Teikou Middle School, Midorima is a member of the Generation of Miracles (Kiseki no Sedai); during his time with Teikou, his jersey number was seven, switching to six as he joined Shuutoku's. He also served as a vice-captain under Akashi.  His strength is his absolute accuracy, which is shown in his shots that always go in. He can shoot accurately no matter how far he is from the ring. He likes red bean soup and Oha-Asa",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22253-PwE3Kv3nSA44.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22253
      },
      "rarity": "rare"
    },
    {
      "id": "junpei-hyuuga",
      "name": "Junpei Hyuuga",
      "alt_names": [
        "日向順平"
      ],
      "role": "supporting",
      "description": "**Height:** 178 cm (5'10\") \n**School:** Seirin \n**Number:** #4  \n**Position:** Shooting Guard   \n**Talent:** Clutch Player, Shooting  \n\nSophomore and Seirin basketball club's captain. His specialty is 3 pointers, and can shoot accurately even if under extreme pressure. He's the team's clutch during tough situations.  Hyuuga really likes to collect ancient Japanese warrior figurines (ex: Masamune, Yukimura, etc) and treasures them a lot. He got the skill to shoot accurately thanks to his special training, in which when he missed a shot during practice, he had to break one of his figurines. Hyuuga normally has a pleasant personality, but gets arrogant when irritated.   ~!When Hyuuga was in middle school, he was also on the basketball team together with Izuki. Unfortunately, the team was very weak. Despite Hyuuga's shooting ability, they never won once. Hyuuga was discouraged and decided to quit basketball when going to high school and also dyed his hair blond. But he was touched by Teppei's seriousness on forming a basketball club, and he finally joins the team. Then due to Teppei's suggestion and everyone's approval, he became the team's captain.!~",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22254-d5wfloxjDwIJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22254
      },
      "rarity": "rare"
    },
    {
      "id": "shinji-koganei",
      "name": "Shinji Koganei",
      "alt_names": [
        "小金井慎二",
        "Koga"
      ],
      "role": "supporting",
      "description": "**Height:** 170 cm (5'7\")\n**Team:** Seirin\n**Number:** #6\n**Position:** Small Forward\n\nA Seirin sophomore. Considered a jack of all trades, master of none, Koganei is a fairly skilled all-rounder. This is driven home when his coach denotes his special skill as \"being able to shoot from any point on the court, with a so-so accuracy rate\"; a decidedly normal ability. He is, however, quite intelligent, ranking in the top 20% of his class, though he does not excel in any particular subject. Mysteriously, he can read Mitobe's mind even though Mitobe never says anything.",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22255-WM183YizKive.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22255
      },
      "rarity": "rare"
    },
    {
      "id": "daiki-aomine",
      "name": "Daiki Aomine",
      "alt_names": [
        "青峰大輝",
        "Mine-chin",
        "Aominecchi",
        "Dai-chan",
        "Ahomine"
      ],
      "role": "supporting",
      "description": "__Height:__ 192 cm (6'3'')\n__Number:__ #6 (Teikou), #5 (Touou) \n__Position:__ Power Forward \n__Talent:__ Skill and Agility, Unusual Speed, Zone Play \n\nAomine was the ace of Teikou's team, embracing an aggressive and liquid style, made even more powerful by Kuroko's misdirection. In fact, Aomine was once Kuroko's \"Light\", before Kagami. Incredibly fast and versatile, Aomine's strength lies in his unpredictability, as well as an uncanny ability to shoot from virtually any position.  \n\nIn his second year in middle school, Aomine inspired Kise to play basketball and he became his training partner. Kise was still a complete rookie, apart from his copying ability, and Aomine was obviously stronger than him, but Aomine kept training with Kise, just because he loves basketball. He taught Kise a lot and became his mentor/idol. During that time, Aomine also became the ace of the team.  \n\nThough he loves basketball, he has  grown sardonic and unenthusiastic toward the sport, skipping practice and even arriving late for important matches. This is due to his frustration in not being able to find an opponent capable of matching his skill, and thus making him conclude that the only one that can defeat him is he himself.  \n\nHe and Momoi are childhood friends. Even though he doesn't show it, he's actually really fond of her, and they have a sibling-like relationship.",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36820-bW2c6TbIqgKO.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36820
      },
      "rarity": "rare"
    },
    {
      "id": "satsuki-momoi",
      "name": "Satsuki Momoi",
      "alt_names": [
        "桃井さつき",
        "Sa-chin "
      ],
      "role": "supporting",
      "description": "__Height:__ 161 cm \n__School:__ Touo Academy \n__Job:__ Manager \n__Talent:__ Analyst\n\nThe ex-manager of the basketball team at Teikou, and now serving as Touou's manager. She's in fact Aomine's childhood friend and enters Touou together with him because she can't leave him alone. She is actually in love with Kuroko and considers herself to be Kuroko's girlfriend. Her reasoning for loving Kuroko is that he once gave her a coupon for an extra ice cream, although he only did this because he was already full. As noted by Riko her data collection abilities are elite and she resembles a spy while observing the game. She doesn't only have the past data, but she can also predict the opponent's growth, and thus making her a great strategist. Apparently she's also bad at cooking.   ~!Seen in another Kuroko no Basuke Extra, it turns out that while her relationship with Kuroko is not yet official, they have gone out on a date before.!~",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36821-8vtlTiKYRNVz.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36821
      },
      "rarity": "rare"
    },
    {
      "id": "atsushi-murasakibara",
      "name": "Atsushi Murasakibara",
      "alt_names": [
        "紫原敦",
        "Mu-kun",
        "Murasakibaracchi",
        "The Wall"
      ],
      "role": "supporting",
      "description": "__Height:__ 208 cm \n__School:__ Yousen High \n__Position:__ Center \n__Number:__ #9\n\nFormerly playing center for Teikou Middle School's basketball team, he does the same now for Yousen High School. Beyond possessing shoulder-length, purple hair, Murasakibara is immediately recognizable for his great height, at least ten centimeters taller than any other currently revealed member of the Generation of Miracles. Murasakibara likes snacks, a lot. He is sometimes seen carrying tons of snacks wherever he goes. The everyday Murasakibara is childish and often teases people, but once he's on the court, his personality changes. Because of his natural height and great talent, he doesn't care very much for basketball, and he said that he's annoyed seeing average people going so far on playing basketball. He is said to be one of the greatest centers among high school players in Japan.\n\n~!Murasakibara's greatest strength is that he has a monstrous, destructive power that never allows anything get past him. Combined with his other current teammates' strength, they don't allow opponent's team to score even one point. Even though Murasakibara usually plays only in defense, if he gets serious, he also plays in the ​offense, which results in the offensive power getting more extreme.!~",
      "metadata": {
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36976-fVmQY9GqvHHa.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36976
      },
      "rarity": "rare"
    },
    {
      "id": "seijuurou-akashi",
      "name": "Seijuurou Akashi",
      "alt_names": [
        "赤司征十郎",
        "Seijuro Akashi",
        "Akashicchi",
        "Aka-chin",
        "Sei-chan"
      ],
      "role": "supporting",
      "description": "**Height:** 173 cm\n**School:** Rakuzan \n**High Position:** Point Guard \n\nThe final member of the Generation of Miracles, he stood at their head as captain, leading their team to uncontested victory during the three years he played for Teikou Middle School. He is uninterested in winning, simply because victory in his eyes is an absolute given, requisite to his own life as much as breathing. But he has grown tired of victory in the absence of a chance of defeat;    ~!Thus when it became clear that Aomine would not be able to participate in the final rounds of the inter-high school championship, he also withheld himself from playing and demanded Murasakibara do the same, wanting to make the games at least a little interesting. He upholds an extreme 'winner-take-all' philosophy, believing that victors are granted absolution in all things, while losers are denied everything. He claims never to have lost at anything, and as such he believes himself right in all things; he grows violent towards those who thus defy him, attempting to stab Kagami with a pair of scissors when the latter refused to leave even when told to do so. Respected and feared by the Generation of Miracles, they assemble as he demands, and can't help but heed his words.!~",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b42038-3xNprwetDcl1.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42038
      },
      "rarity": "rare"
    },
    {
      "id": "yukio-kasamatsu",
      "name": "Yukio Kasamatsu",
      "alt_names": [
        "笠松幸男"
      ],
      "role": "supporting",
      "description": "**Height:** 178 cm \n**School:** Kaijou High \n**Number:** #4  \n**Position:** Point Guard  \n**Motto:** \"Steady progress; rapid advance\"\n\nThe captain of Kaijou's basketball team, Kasamatsu is a nationally credited point guard. Possessed of a short temper and often exceedingly serious demeanor, he can become quickly enraged over the antics of his teammates, Kise in particular, and often vents his feelings with sudden fits of violence. As he takes his responsibility as team captain very seriously, he is extremely devoted to his team and does his best to trust in their abilities and lead them to glory. He likes to play guitar.    ~!Though crushed that he was unable to take his teammates to the Inter-High School Championship, he repressed his own furious sorrow in front of them in order to spur them forward to prepare for the Winter Cup, later anguishing alone rather than burden his team.!~",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b42804-BDkgumv9Dccp.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42804
      },
      "rarity": "rare"
    },
    {
      "id": "yoshitaka-moriyama",
      "name": "Yoshitaka Moriyama",
      "alt_names": [
        "森山由孝"
      ],
      "role": "supporting",
      "description": "__Height:__ 181 cm\n__School:__ Kaijou High\n__Number:__ #5\n__Position:__ Shooting Guard  \n__Talent:__ Unorthodox Shooting  \n\nThe flirtatious, third-year Shooting Guard of the Kaijou team, Moriyama is a reliable player with a unique shooting form. He is quick to notice pretty women and often claims to fight for them on the court.",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b42805-2Wod7wrbZ6Bb.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42805
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T22:55:11.850Z"
}