{
  "work_id": "jojos-bizarre-adventure-part-6-stone-ocean",
  "count": 35,
  "characters": [
    {
      "id": "joutarou-kuujou",
      "name": "Joutarou Kuujou",
      "alt_names": [
        "空条承太郎",
        "JoJo",
        "Qtaro",
        "Professor Kuujou",
        "Jotaro Kujo"
      ],
      "role": "protagonist",
      "description": "**Height:** 195 cm (6'5\")\n__Occupation:__ Student, Marine Explorer, Oceanographer\n__Nationality:__ Japanese \n\nJoutarou is Holly Kujo's son and Joseph Joestar's grandson. In Part 3, he has a recognizable attire of a blue trenchcoat-length school uniform jacket with yellow chains on the collar. He also wears a trademark hat which, while torn in the back, often seems to blend with his hair. When Joutarou first appears, he turned himself in to the police because he believes his Stand is an evil spirit possessing him. After he is released from jail, and learns what his Stand is, Joutarou gets used to Star Platinum -- a fierce, muscular, vaguely Aztec-looking spirit with \"the precision of a machine\" and the ability to destroy virtually anything with a sledgehammer barrage of fists. He has a very tough exterior, and is even rather rough and delinquent, but he also is very dedicated, intense, and loyal. He is very intelligent, but usually lets his (or Star Platinum's) fists do the talking with the enemy, even though he often has to rely on his wits to deal with stand users' attacks. He is also known for a quick and short temper. His catchphrase is \"Yare yare daze.\" It generally relates of being bored or exasperation. In Part 3, he is the main target of Dio, who realizes that Joutarou is his greatest threat.\n\nOne of the strongest stands in the JoJo universe; Star Platinum possesses super human senses, strength, stamina, accuracy and speed. It can see for great distances and at great magnifications. The Star tarot card that Star Platinum is named after symbolizes hope. Like other physically powerful stands, Star Platinum suffers from a narrow range of activity. It can only be active within a 2-3 meter radius from Joutarou. ~!It is similar to Dio's The World stand, and, it turns out, can likewise be used to stop time, but that ability is only revealed in Joutarou's epic battle with Dio Brando when Dio was about to drop a steamroller on him.!~\n\nIn the sixth story arc Stone Ocean, Joutarou becomes an oceanologist, moves to the United States, eventually marries, and his daughter, Jolyne inherits the potential to wield Stand powers.",
      "metadata": {
        "gender": "male",
        "age": "17-40",
        "dateOfBirth": "1970-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4003-gWDSEGbeOAll.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4003
      },
      "rarity": "epic"
    },
    {
      "id": "jolyne-kuujou",
      "name": "Jolyne Kuujou",
      "alt_names": [
        "空条徐倫",
        "JoJo",
        "Jolyne Cujoh",
        "Chorokichi"
      ],
      "role": "protagonist",
      "description": "__Height:__ 174.5 cm \n__Nationality:__ Japanese-American \n~!__Stand:__ Stone Free!~\n\nShe is the daughter of Joutarou Kuujou and is the only female \"JoJo\" to date.  \n\nQuick to anger and snappy with her elders, it seemed like Jolyne was a lost cause. She was irresponsible and flighty, at first only looking to satisfy a cheap thrill. Bitter at Joutarou for leaving the family for so long, she blamed him for her misguided outlook. However, she still had honorable morals and treasured her mother. She would selflessly do everything in her power to help her friends. Jolyne believed that her loved ones had a good heart and an honest nature. Unfortunately, she can believe in them to the point of being gullible as it was through Romeo's lies that she was sentenced to a prison sentence of 15 years.  When Joutarou sacrifices himself for Jolyne's freedom, she noticeably matures and her resolve to \"revive\" Joutarou turns into her first priority. She adopts more traits like her father and her wardrobe even changes to resemble Joutarou's look. She eventually gains pride for her Joestar bloodline and she becomes rather tough by the end of the series. Her strength and infallible integrity shine in her fights and her willpower soon echoed that of other Jojos.  Her distant and near-fatherless childhood bore a tinge of loneliness in her. Their relationship is challenging at first, not really fitting the typical father-daughter mold. When Jolyne was fourteen, she was wrongfully accused of pickpocketing. Panicked, she stole a car and sloppily tried to make an escape from the authorities, leading to her being arrested and taken into custody. Jolyne anticipated for Joutarou to pay the bail for her but was sorely disappointed when she overheard her mother's frantic and unsuccessful pleas with him on the phone. Her father's absences following this lead to her teenage years of delinquency (she later reflects these events as a desperate call for attention). As time passed, Jolyne came to respect her father more and idolized him somewhat, adapting his trademark \"Yare yare daze\" into a more feminine \"Yare yare dawa\". When Joutarou returns later, both father and daughter show considerable care to one another, each in their own way.  Jolyne's mother rarely appears and is hardly talked about. It's assumed that she loves Jolyne very much and dotes on her in Joutarou's absence as she is one of the few people to call Jolyne \"JoJo\". It's mentioned that she is an Italian-American, making Jolyne 1/4 Japanese, 1/4 American, 3/8 Italian, and 1/8 British.  The tattoo on her left arm is a sign of her past membership in a car-stealing gang. It's hinted that she has been arrested before while in the gang, presumably to protect the other members.  \n\nStone Free (ストーン・フリー) gives Jolyne the power to unravel herself. Ironically, whenever she moves away from the stand it unravels. At first she is only able to send a string from her fingertip and felt intense pain if it snapped. It also featured the ability to listen to faraway conversations, similar to a can tied to string. Later, she can unravel up to 70 percent of her entire body into a string and quickly reassemble herself. She can also \"cut\" her string form and make it independent from her body. Jolyne also develops the ability to stitch her wounds together. Like Joutarou, Jolyne also cries, \"Ora, Ora!\" while pummeling with her fists. Her stand, though perhaps not the strongest, is praised for being both extremely quick and flexible.  Jolyne, unlike her father, is not a naturally awakened stand user. She received her stand when she was cut by an amulet given to her by Joutarou.",
      "metadata": {
        "gender": "female",
        "age": "19",
        "dateOfBirth": "1992-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b11222-Se9QoJHDSeYY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 11222
      },
      "rarity": "epic"
    },
    {
      "id": "hermes-costello",
      "name": "Hermes Costello",
      "alt_names": [
        "エルメェス・コステロ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm\n__Prisoner \nNumber:__ FE40533\n__Stand:__ Kiss\n\nHermes is a woman voluntarily imprisoned in Green Dolphin Street Prison in order to seek revenge for her sister Gloria Costello's killer, Sports Maxx, and soon allies herself with Jolyne Cujoh in the hostile environment that the jail is. Thanks to a certain pendant, Ermes acquires her own Stand, Kiss, which has the ability of duplication stickers.",
      "metadata": {
        "gender": "female",
        "age": "21",
        "dateOfBirth": "1990-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13369-7lNj3c1ohOVz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13369
      },
      "rarity": "epic"
    },
    {
      "id": "weather-report",
      "name": "Weather Report",
      "alt_names": [
        "ウェザー・リポート",
        "Weather Forecast",
        "Værmelding",
        "Weather"
      ],
      "role": "protagonist",
      "description": "__Height:__ 192 cm \n__Nationality:__ Italian-American\n__Occupation:__ Delivery Boy (formerly) \n__Stand:__ Weather Report\n\nWeather Report is an amnesiac and fellow inmate who seeks his memory and allies himself with Jolyne Cujoh. \n\nWeather is a Stand User controlling the surrounding atmosphere through his ability, which is also named Weather Report.\n~!He later develops Heavy Weather, after recovers his memory, representing the release of his basic Stand's full power; fostering a particular, bizarre delusion in all within its range.!~\n\n~!His real name is Domenico Pucci, Weather was originally born to the wealthy Pucci family, the younger of fraternal twins. He was stolen from the clinic nursery by a woman whose own baby had died the same day, soon after birth. He lived his live in the other family with the name of Wes Bluemarine.!~",
      "metadata": {
        "gender": "male",
        "age": "39+",
        "dateOfBirth": "1972-06-05"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17675-rrayRQnq2awa.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17675
      },
      "rarity": "epic"
    },
    {
      "id": "enrico-pucci",
      "name": "Enrico Pucci",
      "alt_names": [
        "エンリコ・プッチ",
        "Emilio Pucci",
        "Father Pucci",
        "Whitesnake",
        "The New Father"
      ],
      "role": "protagonist",
      "description": "__Height:__ 181 cm \n__Nationality:__ Italian-American \n__Occupation:__ Priest, Chaplain \n__Stand:__ ~!White Snake, C-Moon, Made in Heaven!~\n\nA loyal follower and friend of Dio, Pucci aspires to implement a plan long formulated by Dio to \"achieve heaven.\" Working as a chaplain at Green Dolphin Street Prison, he secretly frames Jolyne Cujoh and uses her as bait to lure Jotaro Kujo and his memories of Dio's Diary.\n\n~!He is the twin brother of Weather Report !~\n\nWhitesnake is Pucci's Stand, with which he may steal up to two discs from individuals, one disc contains the Stand of the target while the other disc contains the target's memories.\n\n~!Pucci develops C-Moon with the instructions in Dio's Diary and with Dio's Bone, which manipulates gravity.!~\n\n~!Pucci develops Made in Heaven, which steadily increases the speed of time. This Stand is the final metamorphosis in a chain following Whitesnake and C-Moon; one of the very last elements of the plan referenced in Dio's Diary. It was considered by Dio to be the ultimate Stand and the key to achieving \"heaven\".!~",
      "metadata": {
        "gender": "male",
        "age": "39+",
        "dateOfBirth": "1972-06-05"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17676-kPsqj8g9d2Bi.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17676
      },
      "rarity": "epic"
    },
    {
      "id": "narciso-annasui",
      "name": "Narciso Annasui",
      "alt_names": [
        "ナルシソ・アナスイ",
        "Narciso Anasui",
        "Narciso Anastasia"
      ],
      "role": "protagonist",
      "description": "__Height:__ 178 cm (Manga), 183 cm (Anime)\n__Occupation:__ Student (formerly)\n~!__Stand:__ Diver Down!~\n\nObsessed with disassembling objects, Annasui grew up a bit awkward during his childhood days. He painstakingly dissected a pocket watch, his neighbor's car, and whatever else that struck his fancy. One day while returning from work, he found his girlfriend cheating on him with another man. In response, he methodically tore both of them apart. He was sent to prison and a faced twelve year sentence for first degree murder.  Although he was briefly seen next to Weather Report by Hermes, Annasui doesn't get involved with Jolyne until F.F. comes to Emporio for help. Seemingly entranced by the tales he has heard of her, Annasui agrees to become Jolyne's bodyguard out of his burning love for her. Upon finding her, Annasui keeps true to his word and protects Jolyne - to the point of self-sacrificing at times.",
      "metadata": {
        "gender": "male",
        "age": "25",
        "dateOfBirth": "1986-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24327-NQg6L5c2gaOK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24327
      },
      "rarity": "epic"
    },
    {
      "id": "emporio-alnino",
      "name": "Emporio Alnino",
      "alt_names": [
        "エンポリオ・アルニーニョ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 140 cm\n__Nationality:__ American\n\nEmporio is a young Stand User, born and living secretly in Green Dolphin Street Prison. He sympathizes with Jolyne and becomes one of her primary allies. Emporio's Stand, Burning Down the House, is a room comprising a secret, alternate space within Green Dolphin Street Prison, to which only he may grant entry. The room contains a number of useful, imperishable objects.\n\n~!Emporio temporarily borrows the Stand \"Weather Report\" at the end of Stone Ocean.!~",
      "metadata": {
        "gender": "male",
        "age": "11-12",
        "dateOfBirth": "2000-02-17"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28956-dDkXqrq9DZXp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28956
      },
      "rarity": "epic"
    },
    {
      "id": "foo-fighters",
      "name": "Foo Fighters",
      "alt_names": [
        "フー・ファイターズ",
        "F.F.",
        "Atroe"
      ],
      "role": "protagonist",
      "description": "__Height:__ 165 cm\n__Prisoner Number:__ FE39423\n__Manga Debut:__ Chapter 26\n__Anime Debut:__ Episode 7\n\nF.F. is a fusion of Stand and Stand User; a colony of plankton that is organized, maintained by, and essentially equivalent to the Stand, Foo Fighters. At first serving Enrico Pucci, they soon ally themself with Jolyne Cujoh out of gratitude.",
      "metadata": {
        "gender": "non-binary",
        "age": "22",
        "dateOfBirth": "1989-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b32507-IRB4mLw5kdo6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 32507
      },
      "rarity": "epic"
    },
    {
      "id": "dio-brando",
      "name": "Dio Brando",
      "alt_names": [
        "ディオ・ブランドー"
      ],
      "role": "supporting",
      "description": "__Height:__ 195 cm (6'5\")\n__Race:__ Human (formerly), Vampire (onwards)\n__Nationality:__ British\n\nDio is an immortal vampire and the arch rival of the Joestar clan.\n \n__Series 1: Phantom Blood__ \n~!Dio is the son of Dario Brando, an alcoholic and abusive father. Back when Dio was just a boy, he was brought into the household of George Joestar after the mysterious death of his father, so as to repay the debt he owed Dio's father for saving his life. But soon Dio's personality caused trouble for George's young son, Jonathan Joestar. Even more of a sociopath than his father, Dio was resolute to shatter Jonathan's spirit and take his place as the favored son, even going so far as to arrange for Jonathan's dog Danny to be burned to death. Initially, Dio is able earn the trust of the patriarch of the Joestar family through deceit (and at Jonathan's expense). However, his plans of taking over the Joestar household were discovered by Jonathan when he discovered that not only had Dio poisoned his biological father to death, he was doing the same to his adoptive father, all to take the Joestar estate for his own.  Determined not to be stopped, and understanding the potential to enjoy power over all things instead of just the Joestar estate, Dio wears and activates the Stone Mask, becoming a nearly unstoppable vampire. His gains supernatural abilities such as being able to walk on walls, and regenerating his body faster than fire can consume it. He is able to create two fluid jets from his eyes powerful enough to slice stone and kill living things. He is also able to vaporize his body fluid rapidly enough to freeze anything he touches. However, this is at the expense of having his body be sustained by sheer willpower alone, rather than vital energy. A sufficiently powerful vital force--specifically, sunlight or the Hamon force--will negate the sustaining force's presence and disintegrate the long-unliving body. Like all Jojo vampires, Dio sucks blood through tentacles in his fingers and has been seen at least once drinking blood from an unnamed girl.  At the end of Series 1, Dio's body was destroyed, but his severed head managed to kill Jonathan Joestar and together they sank to the bottom of the Atlantic Ocean.!~ \n\n__Series 3: Stardust Crusaders__ \n~!100 years later, at the bottom of the sea, Dio's severed head reattached itself to Jonathan Joestar's lifeless body (giving Dio the same star birthmark as the members of the Joestar family). Dio's casket is recovered by fishermen, who are implied to have been killed by Dio as he awakened. He finds that he is now in the year 1985. After he returns to land he develops a Stand (a sort of ghostly bodyguard), giving him vastly powerful new abilities on top of his vampiric powers. For most of Series 3, Dio is out of scene and in the shadows, and the question of exactly what his Stand \"The World\" can do is a mystery.  In Series 3, many of Dio's offensive vampiric abilities do not appear, though he displays a new ability described as \"evil implants\"; parasites generated in his hair that attach themselves to and brainwash victims, finding early success with Kakyoin and Polnareff. Dio's Stand \"The World\", as a sort of brother power to \"Star Platinum\", possesses great speed and strength and, crucially, is able to stop time, making Dio appear to teleport or move at impossible speed. Dio's ambition is to create a perfect world for himself and his servants. In the interim, he seeks to drain for himself the blood of the Joestar lineage, which will help him to fully fuse with Jonathan Joestar's body and take better control of The World. Once he does this, his powers will gradually increase, until he is able to stop time for as long as he likes. In the beginning of the story arc Dio's World, Dio mainly battles Kakyoin and Joseph. Kakyoin succeeds in leading Dio into a vast barrier created by his Stand, trapping him. Dio uses The World to stop time, allowing him to ignore the barrier and approach Kakyoin to deliver a fatal blow. Before dying, Kakyoin deduces the The World's time-stop ability and uses his last strength to give Joseph this message. Joseph then warns this to Jotaro before he is also killed by Dio.  After a long battle between Dio and Jotaro, Jotaro finds his own ability to stop time just before Dio drops a steamroller on him, proceeding in time-stop to break Dio's leg. Jotaro's intention was for the two to end the fight with a final blow once Dio's leg had healed. Dio, determined not to lose, squirts blood from his open leg into Jotaro's eyes. Dio then attempts a final kick with The World, which Jotaro blindly counters with a punch from Star Platinum. Star Platinum's hand breaks on The World's leg, but the punch sends a fissure through The World and through Dio, shattering Dio completely above the waist. Jotaro and doctors from the Speedwagon Foundation (an oil and medicine company loyal to the Joestar family) transfer the blood from Dio's lower half to Joseph Joestar, reviving him. Later, they lay Dio Brando's remains in the Sahara Desert to evaporate with the rising sun.!~ \n\n__Series 6: Stone Ocean__ \n~!In Part 6, it is revealed to the Joestars that his reemergence was planned to create a perfect world when the moon reached a certain angle and time. He stumbled upon Enrico Pucci not long before Part 3 and \"healed\" his disfigured foot for him. After piercing Pucci with a Stand arrow, the two spent considerable time together, plotting and scheming. He questioned Pucci's loyalty to him, wondering why he didn't use Whitesnake to remove The World from him. Pucci had explained that he loved Dio as he had loved God, and thus worshipped him too much to betray him. Ensuring that he wouldn't completely fade, he left one of his bones in Pucci's care. Dio's presence continues to haunt the series, emerging in flashbacks and his disfigured sons. His bone played a vital plot element for the first half of Part 6, an odd green baby inheriting a Stand to merge with it.!~",
      "metadata": {
        "gender": "male",
        "age": "13-121",
        "dateOfBirth": "1867-04-10"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4004-w0OtWuvjhftG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4004
      },
      "rarity": "common"
    },
    {
      "id": "donatello-versace",
      "name": "Donatello Versace",
      "alt_names": [
        "ドナテロ・ヴェルサス"
      ],
      "role": "supporting",
      "description": "__Height:__ 181 cm\n__Debut:__ Chapter 111\n\nDonatello Versace is a minor antagonist in JoJo's Bizarre Adventure Part 6: Stone Ocean, and is one of Dio's four illegitimate sons. He is the user of the memory-excavating stand Under World.\n\nVersace holds a grudge against the world and society in general. He has a strong desire to become happier than anyone else. In terms of similarities to his father DIO, he has inherited his personality traits such as selfishness and ruthlessness. Over the course of his life, Donatello experienced enormous amounts of misfortune, in part due to his undeveloped stand digging up memories it shouldn't have. Eventually, after meeting Pucci alongside his half-brothers Rykiel and Ungaro, he learned to control his powers.  He is the most ambitious of the three brothers in Stone Ocean, and considers usurping Pucci, who he dislikes due to how highly he thinks of himself.\n\nHis stand Under World is able to excavate memories of events and people from the earth. Acting on the assumption that the ground has a \"memory\" of everything that happens upon it, Under World can summon any past event that has happened in Orlando, Florida, with no limitation to its date of occurrence and scope, by digging through the soil and uncovering the underground. If an individual becomes caught in an event, they will experience what occurred in the memory (i.e. those caught in an impending plane crash will experience exactly the specific crash that is brought up) and cannot change the event. Once caught, one must find a loophole or condition in the memory to escape death, such as a certain area where nobody dies or is injured. Apart from trapping people in lethal events, Under World's ability has other uses. Memories of individuals can be investigated for information. Replayed events can also indirectly attack victims without catching them in an event, such as a stray bullet.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "gender": "male",
        "age": "25",
        "dateOfBirth": "1986-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b76550-3MJU00EiCdES.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 76550
      },
      "rarity": "common"
    },
    {
      "id": "johngalli-a",
      "name": "Johngalli A",
      "alt_names": [
        "ジョンガリ・A"
      ],
      "role": "supporting",
      "description": "__Height:__ 185 cm \n__Stand:__ Manhattan Transfer\n\nJohngalli A is a man of average to above-average height and medium build. He has long, light hair, including a small braid bordering the left side of his face; and his cheeks are marked by a thin, vaguely tribal symbol. Johngalli A. has cataract, making his irises appear entirely white. He also possesses a tattoo of Earth on his back.\n\nJohngalli A. wears a plain shirt and dark trousers, which feature regular nearly full circular cuts, so that round patches dangle from the clothes. He also wears a holed tie with a square end.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "gender": "male",
        "age": "35",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130605-o5AqQ4LpZXpo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130605
      },
      "rarity": "common"
    },
    {
      "id": "miraschon",
      "name": "Miraschon",
      "alt_names": [
        "ミラション"
      ],
      "role": "supporting",
      "description": "Miraschon is an inmate in Green Dolphin Street Prison to whom Enrico Pucci gifts the Stand, Marilyn Manson, and sends to assassinate Jolyne Kuujou. She then gambles with Jolyne, Hermes Costello and Foo Fighters in order to harvest their organs and take Jotaro Kujo's Stand disc.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130606-GclY8nLq77SQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130606
      },
      "rarity": "common"
    },
    {
      "id": "sports-maxx",
      "name": "Sports Maxx",
      "alt_names": [
        "スポーツ・マックス",
        "Sports Maximum"
      ],
      "role": "supporting",
      "description": "Sports Maxx is a man of average to above-average height and medium build. He has short, sparse hair in soft spikes; and eyebrows in the shape of large, light circles, tapering into short tails. He wears a long, light coat and light pants, both patterned by a dark paisley design.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130607-Elz4TjjqQ2iI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130607
      },
      "rarity": "common"
    },
    {
      "id": "gwess",
      "name": "Gwess",
      "alt_names": [
        "グェス"
      ],
      "role": "supporting",
      "description": "__Height:__ 171 cm\n__Stand:__ Goo Goo Dolls\n\nGwess is a young woman of average build and height, with long dark hair. She dons three dots under her left eye. Gwess wears a horizontally stripped body suit, supported by another layer of clothing over her breasts, over which she wears a typical Green Dolphin Street inmate jacket. Her pants are covered with stripes over her thighs with different colored normal pant legs behind and down to her feet. She also sports a pair of boots, decorated outside the pants by long accessories that are incrementally indented. She wears a voided hat furnished with a bird feet motif, out from which her hair sticks out, as well as a thick collar around her neck.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "gender": "female",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130608-zdSdODc414QR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130608
      },
      "rarity": "common"
    },
    {
      "id": "miuccia-miuller",
      "name": "Miuccia Miuller",
      "alt_names": [
        "ミュッチャー・ミューラー",
        "Miu Miu",
        "ミューミュー "
      ],
      "role": "supporting",
      "description": "Miu Miu is described by Gwess as giving off air from having come from an upper-class socialite family. She is the corrections captain of Green Dolphin Street Prison and she clashes with Jolyne Cujoh and Emporio Alniño when she comes to stop Jolyne from breaking out of prison. She is a Stand User and uses Jail House Lock to manipulate the memories of her enemies.\n\nJail House Lock is a humanoid Stand capable of making one or several people able to only memorize three new pieces of information at once, the oldest memory being replaced by the newest memory.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130609-i14gtS4XDRkX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130609
      },
      "rarity": "common"
    },
    {
      "id": "d-an-g",
      "name": "D an G",
      "alt_names": [
        "DアンG"
      ],
      "role": "supporting",
      "description": "D an G is a man of average build and height, wearing a fleece-like multi-colored toga, wristbands, and a spiked metal helmet.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130610-RvxtRn1Ev3oB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130610
      },
      "rarity": "common"
    },
    {
      "id": "kenzou",
      "name": "Kenzou",
      "alt_names": [
        "ケンゾー"
      ],
      "role": "supporting",
      "description": "Kenzou is a small yet athletic old man, with a heavily wrinkled and clean-shaved face, but he has unusually long eyebrows over slanted eyes. He has several thin braids on the back of the head.\n\nKenzou wears a furred bodysuit open on the chest, a jeweled skullcap on which are several big pearls, and a similarly jeweled necklace.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130611-FMsasSUs9If9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130611
      },
      "rarity": "common"
    },
    {
      "id": "lang-rangler",
      "name": "Lang Rangler",
      "alt_names": [
        "ラング·ラングラー"
      ],
      "role": "supporting",
      "description": "Lang is a man of average to above-average height and medium build.\n\nVery little can be seen of his face, as he is clad in an assortment of makeshift gear designed to insulate him from the effects of his Stand. This includes a flat-topped hat covering his face to below his eyes with a serrated bottom edge, and goggles. As such, nothing of his hair or even eyes can be distinguished, leaving his actual face enigmatic.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130612-5SrjtvY7qacK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130612
      },
      "rarity": "common"
    },
    {
      "id": "ungalo",
      "name": "Ungalo",
      "alt_names": [
        "ウンガロ"
      ],
      "role": "supporting",
      "description": "Ungalo is one of Dio's children recruited by Pucci to try and kill Jolyne and her friends. Unngalo is a drug addict who tried to stab Pucci to death when he first met him.\n\nHis stand, Bohemian Rhapsody, can give life to drawn/fictional characters, like the ones in a comic or the stickman in a road sign.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130613-IMjUBC4Bz4vE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130613
      },
      "rarity": "common"
    },
    {
      "id": "rikiel",
      "name": "Rikiel",
      "alt_names": [
        "リキエル"
      ],
      "role": "supporting",
      "description": "Rikiel is a young, decently built man with a long face. He has dark hair styled into several dreadlocks. He wears a sleeveless and hooded bodysuit patterned after the hide of a stereotypical cow with an opening on his chest. He wears an assortment of arm warmers.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "gender": "male",
        "age": "22-23",
        "dateOfBirth": "1988-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130614-zUqj2hbh94A2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130614
      },
      "rarity": "common"
    },
    {
      "id": "green-baby",
      "name": "Green Baby",
      "alt_names": [
        "緑色の赤ちゃん"
      ],
      "role": "supporting",
      "description": "The Green Baby resembles a gremlin in appearance, with two lines going down either side of its cranium. It has large, pointy ears and green skin, which is patterned with leaf shapes. It has eyes that resemble seeds. It also has what appears to be a leaf-shaped mark on its forehead and the Joestar Birthmark on its back.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130615-q0FCsNzkp859.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130615
      },
      "rarity": "common"
    },
    {
      "id": "annakiss",
      "name": "Annakiss",
      "alt_names": [
        "アナキス"
      ],
      "role": "supporting",
      "description": "Presumably not as maniacal as his original self due to not being a convict, Annakiss is a typical carefree juvenile who is in a relationship with his girlfriend, Irene. He appears friendly enough to offer strangers a ride when it's raining. His physical features are similar to his original self, but his clothes have been replaced by a jacket and long brim hat with a feather on it.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130616-1MPDa1r9Mi3r.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130616
      },
      "rarity": "common"
    },
    {
      "id": "thunder-mcqueen",
      "name": "Thunder McQueen",
      "alt_names": [
        "サンダー・マックイイーン",
        "Torden McQueen"
      ],
      "role": "supporting",
      "description": "__Height:__ 181 cm \n__Stand:__ Highway to Hell\n\nThunder is a man of average to above-average height and medium build. An \"M\" shape appears across the right side of his forehead.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "gender": "male",
        "age": "27",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130617-K1nJCybOTvbp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130617
      },
      "rarity": "common"
    },
    {
      "id": "viviano-westwood",
      "name": "Viviano Westwood",
      "alt_names": [
        "ヴィヴァーノ・ウエストウッド"
      ],
      "role": "supporting",
      "description": "__Height:__ 186 cm\n__Stand:__ Planet Waves\n  \nViviano Westwood is a muscular man with a sharp square face. After his companion violently punches him, a significant part of his inner mouth, gum and teeth included, is visible. He has dark hair and an undercut. Westwood wears the uniform of the Green Dolphin Street Jail guards.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "gender": "male",
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130618-qqZE22IiGu5k.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130618
      },
      "rarity": "common"
    },
    {
      "id": "irene",
      "name": "Irene",
      "alt_names": [
        "アイリン"
      ],
      "role": "supporting",
      "description": "Irene appears effectively exactly like Jolyne; besides wearing slightly longer hair, and a softer outfit consisting of a light, turtle-necked sweater cut above the navel, patterned by several heart-shaped gaps or holes.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130619-sVhekb9naC9u.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130619
      },
      "rarity": "common"
    },
    {
      "id": "guccio",
      "name": "Guccio",
      "alt_names": [
        "グッチョ"
      ],
      "role": "supporting",
      "description": "Guccio is a scrawny man with a triangular face, wide open eyes, a small flat nose, thin eyebrows, and a perpetually open mouth showing his teeth. Guccio sports a pencil mustache and a bowl cut, with two shoulder long strands of hair on each side of the head.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130622-IdZJxVTBCYs8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130622
      },
      "rarity": "common"
    },
    {
      "id": "loccobarocco",
      "name": "Loccobarocco",
      "alt_names": [
        "ロッコバロッコ"
      ],
      "role": "supporting",
      "description": "Loccobarocco is the chief of Green Dolphin Street Prison. He uses an alligator puppet to communicate in tandem with people.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b216729-nFUPaFTDG1kg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 216729
      },
      "rarity": "common"
    },
    {
      "id": "yo-yo-ma",
      "name": "Yo-Yo Ma",
      "alt_names": [
        "ヨーヨーマッ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b286585-I9tGz48ff6tu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 286585
      },
      "rarity": "common"
    },
    {
      "id": "dragons-dream",
      "name": "Dragon's Dream",
      "alt_names": [
        "ドラゴンズ・ドリーム",
        "龍の夢"
      ],
      "role": "supporting",
      "description": "Dragon's Dream is the neutral, automatic stand of [Kenzou](https://anilist.co/character/130611). To understand Dragon's Dream, one must understand the principle of Feng Shui behind it.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b297608-hjDby7VIEIKz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 297608
      },
      "rarity": "common"
    },
    {
      "id": "gloria-costello",
      "name": "Gloria Costello",
      "alt_names": [
        "グローリア・コステロ"
      ],
      "role": "minor",
      "description": "Gloria Costello is Hermes Costello's late sister. At age twenty, Gloria inherited her father's Mexican restaurant and managed it, constantly chastising her sister Hermes for not helping her.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130620-vpo6VrPZl5b3.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130620
      },
      "rarity": "common"
    },
    {
      "id": "perla-pucci",
      "name": "Perla Pucci",
      "alt_names": [
        "ペルラ・プッチ"
      ],
      "role": "minor",
      "description": "Perla is a beautiful young girl of slim build, who has long blonde hair and two thin braids on each side of her head.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130621-FXNgslRo9rEk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130621
      },
      "rarity": "common"
    },
    {
      "id": "romeo-jisso",
      "name": "Romeo Jisso",
      "alt_names": [
        "ロメオ･ジッソ"
      ],
      "role": "minor",
      "description": "Romeo Jisso is a young athletic man who has an undercut, the hair forming three to four stripes going around the side of the head.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130623-UhDZwZQWnrq0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130623
      },
      "rarity": "common"
    },
    {
      "id": "akutoku-bengoshi",
      "name": "Akutoku Bengoshi",
      "alt_names": [
        "悪徳弁護士",
        "Corrupt Lawyer"
      ],
      "role": "minor",
      "description": "The corrupt defense attorney of Jolyne Cujoh who first meets with her in the detention center.\n\n(Source: [JoJo's Bizarre Encyclopedia](https://jojowiki.com))",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b255423-mbbZizGyQgQD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 255423
      },
      "rarity": "common"
    },
    {
      "id": "saibankan",
      "name": "Saibankan",
      "alt_names": [
        "裁判官",
        "Judge"
      ],
      "role": "minor",
      "description": "An elderly judge who is in charge of Jolyne Cujoh's trial.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b255424-6ockmKNbgphr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 255424
      },
      "rarity": "common"
    },
    {
      "id": "pi-chan",
      "name": "Pi-chan",
      "alt_names": [
        "ピーちゃん"
      ],
      "role": "minor",
      "description": "A pet parakeet nicknamed Pi-chan that Gwess hides in her pocket. The bird is revealed to actually be a prison guard who was shrunk by Goo Goo Dolls and forced to become Gwess's \"pet\".",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b264841-9ct24IRp5xfD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 264841
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-24T05:26:12.454Z"
}