{
  "id": "steinsgate-0",
  "type": "anime",
  "title": "Steins;Gate 0",
  "alt_titles": [
    "Steins;Gate 0",
    "シュタインズ・ゲート ゼロ"
  ],
  "source": "AniList",
  "source_id": 21127,
  "description": "The eccentric, self-proclaimed mad scientist Rintarou Okabe has become a shell of his former self. Depressed and traumatized after failing to rescue his friend, he has decided to forsake his mad scientist alter ego and live as an ordinary college student. Surrounded by friends who know little of his time travel experiences, Okabe spends his days trying to forget the horrors of his adventures alone.\n\nWhile working as a receptionist at a college technology forum, Okabe meets the short, spunky Maho Hiyajo, who\nlater turns out to be the interpreter at the forum's presentation, conducted by Professor Alexis Leskinen. In front of a stunned crowd, Alexis and Maho unveil Amadeus—a revolutionary AI capable of storing a person's memories and creating a perfect simulation of that person complete with their personality and quirks. Meeting with Maho and Alexis after the presentation, Okabe learns that the two were Kurisu's colleagues in university, and that they have simulated her in Amadeus. Hired by Alexis to research the simulation's behavior, Okabe is given the chance to interact with the shadow of a long-lost dear friend. Dangerously tangled in the past, Okabe must face the harsh reality and carefully maneuver around the disastrous consequences that come with disturbing the natural flow of time.",
  "metadata": {
    "format": "TV",
    "status": "FINISHED",
    "startDate": "2018-04-12",
    "endDate": "2018-09-27",
    "genres": [
      "Drama",
      "Psychological",
      "Sci-Fi",
      "Thriller"
    ],
    "averageScore": 84,
    "popularity": 201313,
    "episodes": 23
  },
  "images": [
    {
      "url": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/medium/bx21127-7ARWZkDXKiiD.jpg",
      "type": "cover",
      "source": "AniList"
    },
    {
      "url": "https://s4.anilist.co/file/anilistcdn/media/anime/banner/21127-6jTjz7ndTHOi.jpg",
      "type": "banner",
      "source": "AniList"
    }
  ],
  "external_ids": {
    "anilist": 21127
  },
  "tags": [
    "War",
    "Alternate Universe",
    "Time Manipulation",
    "Artificial Intelligence",
    "Tragedy",
    "Dystopian",
    "Dissociative Identities",
    "Post-Apocalyptic",
    "Urban",
    "Age Regression",
    "Time Skip",
    "Male Protagonist",
    "Amnesia",
    "Philosophy",
    "Denpa",
    "Kuudere",
    "Memory Manipulation",
    "Military"
  ],
  "updated_at": "2025-12-25T02:40:32.489Z",
  "created_at": "2025-12-25T02:40:32.489Z"
}