{
  "work_id": "nana",
  "count": 15,
  "characters": [
    {
      "id": "nana-komatsu",
      "name": "Nana Komatsu",
      "alt_names": [
        "小松奈々",
        "Hachi",
        "Hachiko"
      ],
      "role": "protagonist",
      "description": "__Height:__ 158 cm (5’2)\n__Occupation:__ Misc, housewife\n\nKomatsu came to Tokyo, looking to find her dream. Unlike Osaki, Komatsu came from a large and happy household, though her childish outlook prevented her from living on her own initially. She&#039;s the middle child of three sisters.  Her chance encounter with Osaki began a friendship which changes Komatsu&#039;s life forever. She is introduced to Osaki&#039;s band, Black Stones, and their members. She later even helps &quot;Blast&quot; to find their bassist, by drawing a poster to advertise the vacancy. Much to her surprise, she also discovers that the members of Blast were friends with the members of Trapnest, a popular rock band of which she&#039;s a very big fan.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": "1980-11-30"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b701-gNKbnxT6dbrf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 701
      },
      "rarity": "legendary"
    },
    {
      "id": "nana-oosaki",
      "name": "Nana Oosaki",
      "alt_names": [
        "大崎ナナ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 162 cm (5'4\")\n\nOne of the two titular characters of the series, Oosaki Nana may look like a tough punk rocker, but she has a kind heart and is a devoted friend. Abandoned by her parents and raised by her grandmother, Nana was expelled from high school after she was falsely accused of prostitution. Despite these hardships, Nana \"polishes the shards of her dreams\" and is determined to be successful as the lead vocalist of Blast. She is now engaged to her first love, Ren, although she also has lingering, ambiguous feelings for Yasu. Nana's favourite things never change. Her favorite designer is Vivienne Westwood, and her favorite band is the Sex Pistols. She smokes Seven Stars and likes coffee with milk and strawberry cake. She also has the ability to cook, but prepares all her food with too much salt which only Ren seems to enjoy.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": "1981-03-05"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b702-qqO3zbj5hp1l.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 702
      },
      "rarity": "legendary"
    },
    {
      "id": "shinichi-okazaki",
      "name": "Shinichi Okazaki",
      "alt_names": [
        "岡崎真一",
        "Shin"
      ],
      "role": "supporting",
      "description": "__Height:__ 164 cm  \n\n Shinichi Okazaki is the bass player of Blast, and youngest member of the band, being only 15 years old.  Shin was born in Sweden, he speaks British English with a Swedish accent. Due to his dysfunctional family, Shin left his home and abandoned his original family name.    ~!He moonlights as a male prostitute, with Reira being one of his clients. Among other things, he is an expert mahjong player and a confidant and early roommate to Nobu. He stops seeing Reira to protect her status and his own feelings—also possibly sparked from fear by Takumi's warning.   Ryouko Kawashigi, one of his older clients, bears a striking resemblance to Reira and he sees her again after the two musicians ended their relationship. She lives near his parents' apartment, works as a stewardess, and is the one that taught Shin \"bad things\". He and Ryouko were put under arrest for possession of marijuana which caused BLAST to withdraw from their tour. In the future it is shown he has become an actor. !~",
      "metadata": {
        "gender": "male",
        "age": "15-22",
        "dateOfBirth": "1985-11-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1424-dcHnhsX7XfrP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1424
      },
      "rarity": "rare"
    },
    {
      "id": "ren-honjou",
      "name": "Ren Honjou",
      "alt_names": [
        "本城蓮"
      ],
      "role": "supporting",
      "description": "BLAST's former bassist, and Trapnest's current guitarist. He is very popular and his music is well-received by fans. He and Nana Oosaki were once in a relationship. Ren is a big fan of the Sex Pistols; he participated in a tribute album to them, and wears a &quot;Sid Vicious&quot; padlock around his neck that he received from Nana. Nana had an image of a lotus tattooed on her upper arm in honor of him (&quot;Ren&quot; is a Japanese name for lotus). The brand of the cigarettes he originally smoked was the &#039;Seven Stars&#039;.\n\nNana first met him through Nobu, who really just admired him from afar. Ren was popular around their hometown for supposedly being found as a baby in an abandoned warehouse, which he lives in to this day. He isn&#039;t ashamed of this; he actually brags about it. Ren and Nana are proven to be very similar throughout the series, but they are not totally similar. Ren seems to be more open with his love for Nana, being able to ask for her back and her hand in marriage while those thoughts just made Nana want to yell at him. Ren also really would like a family and child, while Nana really dislikes the concept because she doesn&#039;t want to be the dependent wife who makes miso soup for her husband all day.\n\n~!Later on in the series, Ren develops a drug addiction and his life starts to spiral out of control. Shortly after begging his manager for more drugs, on his knees, quivering in pain from withdrawal, he dies from a car crash. Reporters were following him and happened to see him suddenly swerve into a building, which happened to be where he&#039;s lived in all of his life. No one is really sure if it was a suicide attempt or accidental.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1425-zZVyHt5cc742.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1425
      },
      "rarity": "rare"
    },
    {
      "id": "layla-serizawa",
      "name": "Layla Serizawa",
      "alt_names": [
        "芹澤レイラ",
        "Reira"
      ],
      "role": "supporting",
      "description": "Although her name is often transliterated as &quot;Reira&quot;, her actual name is &quot;Layla&quot;, after Eric Clapton&#039;s famous song of the same name. She is half-American, half-Japanese, and is the lead singer of Trapnest. She also penned some of their songs.    Layla&#039;s friendship with her band comes all the way back to her elementary school days, starting with Takumi Ichinose. The two met when Layla and her mother moved to Japan. Often criticized by the neighborhood because of her then-vague understanding of the Japanese language, Takumi was asked to befriend her. The two stuck together throughout their childhood, mostly teaching each other about their first language - Reira learned more about Japanese, while Takumi learned more about English.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": "1978-11-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2089-zofXDvhPOO2U.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2089
      },
      "rarity": "rare"
    },
    {
      "id": "nobuo-terashima",
      "name": "Nobuo Terashima",
      "alt_names": [
        "寺島伸夫",
        "Nobu"
      ],
      "role": "supporting",
      "description": "He is the guitarist of Blast; attended the same high school as Nana Osaki. He is friendly and optimistic, but at times, he tends to miss the focus of conversations around him. Before Nana&#039;s &quot;smoking ban&quot;, he&#039;s the only non-smoking member of Blast. But, his poor threshold for alcohol meant that he leaked many secrets while he&#039;s drunk (most notably, about Nana and Ren&#039;s relationship to Shin). Like Yasushi, Nobu comes from a rich family (his parents own an inn). Despite this, he is still very passionate about music, even sharing Osaki&#039;s dream of making it big with a band one day.   ~!He falls in love with Hachi and they start a short but happy relationship. When Takumi tells Nobu about her pregnancy, Hachi painfully leaves him for Takumi. While he eventually accepts the reasons why she left him, he still fears the possibility of the child being his and he continues to have feelings for Hachi.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2449-V3b2fG5cCww5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2449
      },
      "rarity": "rare"
    },
    {
      "id": "yasushi-takagi",
      "name": "Yasushi Takagi",
      "alt_names": [
        "高木泰士",
        "Yasu",
        "Yas-san",
        "Ya-san",
        "Baldy"
      ],
      "role": "supporting",
      "description": "He plays percussion and is the leader of Blast, usually handling the business partnerships and financial decisions needed for the band's success. His favorite cigarette brand is \"Black Stones\", from which the band got their name. He is also a lawyer in training, despite his \"scary\" appearance (clean shaven head, many earrings and dark glasses). He's the big brother figure for Nana O—and sometimes Nobu—and acted as Nana's \"guardian\" when she arrived in Tokyo. In the past, he shared several ties with Trapnest's members. Yasu and Ren grew up in the same orphanage and remained close friends when Yasu was adopted. He dated Reira while in high school and was jealous of Takumi's success and influence on her, which he later relates as the reasons for their break up. Also, he's the oldest member of Blast which Nobu sometimes teases him about (by calling him \"old man\").\n\n~!He is in a budding romance with Miu to the surprise of Ren and others—who were sure he would date Reira again.!~\n\n~! He is also in love with Nana.!~",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2450-fybfLw3SlimN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2450
      },
      "rarity": "rare"
    },
    {
      "id": "takumi-ichinose",
      "name": "Takumi Ichinose",
      "alt_names": [
        "一ノ瀬巧"
      ],
      "role": "supporting",
      "description": "**Height**: 183 cm  \n\nThe leader and bassist of Trapnest. He is handsome and has a reputation of being a playboy. Despite his raw sexual charisma, Takumi can also be a cold and controlling workaholic. His favorite brand of cigarettes is Gitanes.    ~!Coming from a family with an alcoholic and bitter father, he and his older sister learned to be independent at a young age due to their mother being bed-ridden with illness in the hospital. He looked after Layla since they were children and always harbored a brother-like care for her. He ends up dating and sleeping with Hachi, which dubiously resulted in Hachi's pregnancy. For some reason, perhaps because of his family background or because he is starting to become possessive, he refuses to leave Hachi and the unborn child despite Hachi's uncertainty whether it is his or Nobu's. In a previous chapter, Naoki said something to Yasu about Takumi not letting the woman he is infatuated with run away that easily; and Ren saying that Takumi hates getting into such mess, which hints that Takumi took responsibility not just only because of sheer sense of responsibility but he is starting to care for her. But although he loves Hachi and is \"infatuated\" with her, Takumi still keeps his playboy habits, cheating on her first with a soap-opera actress and later on with Reira, who has openly declared her desire to become his lover.  In the end, Takumi is one of the most confusing characters in this manga. Like what Hachiko once said, with Takumi, it is hard to tell whether it is love or business.!~",
      "metadata": {
        "gender": "male",
        "age": "23",
        "dateOfBirth": "1977-12-12"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b2451-W6dBNWlhwQ3Y.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 2451
      },
      "rarity": "rare"
    },
    {
      "id": "kyousuke-takakura",
      "name": "Kyousuke Takakura",
      "alt_names": [
        "高倉京助"
      ],
      "role": "supporting",
      "description": "Junko's boyfriend who currently shares an apartment with her. He's also good friends with Hachi and Shouji. His laid-back attitude to life may deem him a slacker in the eyes of many, but he's actually quite perceptive and he coddles Hachi more than Junko would like. Both him and Junko are studying to become artists (his art being Romantic and hers being Post-Modernistic).",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/4461.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4461
      },
      "rarity": "rare"
    },
    {
      "id": "naoki-fujieda",
      "name": "Naoki Fujieda",
      "alt_names": [
        "藤枝直樹"
      ],
      "role": "supporting",
      "description": "He is the drummer of Trapnest. Like Nobu in Black Stones, he's the \"clueless\", loud-mouthed member of his band. As with the rest of his bandmates, he's a friend of Yasu. He's a big fan of glam rock bands or musical artists, like David Bowie, and his look is inspired by the glam rock look. He started playing drums when Takumi asked him to be in the music club in high school, thinking that he'd be perfect in him and Reira's band with his blond hair and \"Prince\"-ly appearance. Naoki was very excited by this idea, thinking he'd get tons of girls and popularity by being in a band. He realized right away that being in a band isn't as easy as he thought. He didn't immediately join Trapnest, and played in a few small bands that never really even had any gigs before joining them.  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5341.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5341
      },
      "rarity": "rare"
    },
    {
      "id": "sachiko-kawamura",
      "name": "Sachiko Kawamura",
      "alt_names": [
        "川村幸子"
      ],
      "role": "supporting",
      "description": "**Height**: 146 cm  \n\nShe works at the same restaurant as Shoji. Early on in the manga, Hachi once dreamt of Shoji two-timing her with a buxom, Prada-loving city girl named Sachiko (she thought of the name randomly). Ominously, it later turned out to be true, though the real Sachiko is nothing like &quot;virtual&quot; Sachiko. Interestingly, Hachi also plays with the idea of naming her unborn daughter Sachiko.\n\n~!Later on, she starts dating Shoji and they become a couple.!~",
      "metadata": {
        "gender": "female",
        "age": "18",
        "dateOfBirth": "1982-05-05"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5749.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5749
      },
      "rarity": "rare"
    },
    {
      "id": "miu-shinoda",
      "name": "Miu Shinoda",
      "alt_names": [
        "篠田美雨",
        "Myuu"
      ],
      "role": "supporting",
      "description": "A placid and soft-spoken actress who shares a boarding house with Blast and Yuri. She is 27, but her acting profile states that she is 23. Her name is often mispronounced \"Myuu\" by many people. Miu wears long sleeves to hide the scars on her wrists from self-mutilation. Also, in volume 11 (the volume where she first appears), it's shown that she's a very good mahjong player (she claimed that she learned her skills by having special training for her role in a mahjong movie as a nameless rival).   ~!She is currently dating Yasu.!~  (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "age": "27",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7344-kiJV9hdzQTgx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7344
      },
      "rarity": "rare"
    },
    {
      "id": "junko-saotome",
      "name": "Junko Saotome",
      "alt_names": [
        "早乙女淳子",
        "Jun"
      ],
      "role": "supporting",
      "description": "Nana's sensible, no-nonsense best friend. Junko is much more emotionally mature than Nana and often pushes her to be more independent and responsible. She's the host of the omake (bonus) section at the end of each manga volume, reading fan mail and displaying fan art. She's often called \"Jun\" by Nana K.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/8017.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8017
      },
      "rarity": "rare"
    },
    {
      "id": "mai-tsuzuki",
      "name": "Mai Tsuzuki",
      "alt_names": [
        "都築舞",
        "Misato Uehara",
        "Misato-chan"
      ],
      "role": "supporting",
      "description": "An ardent fan of Blast since its inception, Misato loves Nana and has befriended the band. However, \"Uehara Misato\" is not her true name. Misato/Mai claims that a fortune teller told her that if she used the name \"Uehara Misato\" she could become closer to Nana, but may have actually chosen it because it's the name of Nana's half-sister. Mai later joins the staff at Gaia, Blast's record label. She came to know about Nana and Blast when she read her grandfather's diary and discovered that he and Nana's grandmother were once lovers. Recent chapters reveal that Mai may actually have a secret she prefers not to reveal since the tabloids have discovered Nana's father's surname may actually be \"Tsuzuki\", which would imply that she, like Uehara Misato, is Nana's half-sister.   (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/9996.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9996
      },
      "rarity": "rare"
    },
    {
      "id": "shouji-endou",
      "name": "Shouji Endou",
      "alt_names": [
        "遠藤章司",
        "Sho-chan"
      ],
      "role": "supporting",
      "description": "Shouji is Komatsu Nana's boyfriend. Friends at first, they build up their relationship and Shouji moves to Tokyo applying for art school with Nana joining him a year later. Their relationship is pure and kind but later on they can't seem to keep it going as they both are too busy with their lives.\n\n~!Shouji says he will lie in the same grave as Nana but that soon changes when he falls in love with a waitress at his work, Sachiko.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/13232.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13232
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-25T11:25:04.714Z"
}