{
  "work_id": "fruits-basket-the-final-season",
  "count": 15,
  "characters": [
    {
      "id": "shigure-souma",
      "name": "Shigure Souma",
      "alt_names": [
        "草摩紫呉",
        "Shigure Soma",
        "Gure",
        "Shii-Chan"
      ],
      "role": "protagonist",
      "description": "__Zodiac Animal:__ Dog\n\nShigure transforms into the dog of the Chinese Zodiac whenever he is hugged by the opposite gender or his body comes under a great deal of stress. Shigure is one of the oldest members of the Soma family.  He is laid-back and anything but solemn. He is somewhat of a pervert, and as a writer of both romance novels and academic books.  Occasionally, Shigure shows that he has another side to himself. He can be surprisingly mature, thoughtful, and gives rather sage and insightful advice to Tohru, Kyo, Yuki, and other characters, acting like an actual \"adult\".\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "26",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b206-4HokrxTIqu7L.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 206
      },
      "rarity": "legendary"
    },
    {
      "id": "tooru-honda",
      "name": "Tooru Honda",
      "alt_names": [
        "本田透",
        "Tohru Honda"
      ],
      "role": "protagonist",
      "description": "A kind hearted orphaned high school student who, at the start of the story, begins living in a tent. She is then found by [Shigure](https://anilist.co/character/206) and [Yuki](https://anilist.co/character/208), who offer to take her in in exchange for housekeeping. She loves to cook and describes herself as an excellent housekeeper. She also has an after-school job as a janitor to pay her tuition fees to avoid being a burden on her grandfather. She is depicted as polite, optimistic, extremely kind, and selfless; several other characters, including [Kyo](https://anilist.co/character/209), [Rin](https://anilist.co/character/3892) and [Hanajima](https://anilist.co/character/376), tell her she needs to look out for her own interests and not shoulder everyone else's burdens.\n\nTohru habitually speaks formally, but not always correctly, a habit she picked up from her father, [Katsuya](https://anilist.co/character/9230), after he died when she was three, as a way of replacing him in her mother's eyes. Tohru's mother, [Kyoko](https://anilist.co/character/9754), raised her alone until she died in a car accident shortly after Tohru entered high school, a few months before the start of the story. Tohru repeatedly calls Kyoko the most important person in her life and treasures her photograph. \n\n~!When she falls in love with Kyo she feels guilty of being \"unfaithful\" to her mother's memory.!~\n\n~!In the first half of the series, as Tohru learns about the zodiac curse and its effects on those she loves, she becomes distressed, and when she learns that the dangerous Akito is the \"god\" of the zodiac, she resolves to break the curse. Only later does she admit that she wants to free Kyo most of all.!~  ~!In the last chapter, she begins moving with Kyo to another city so he can continue his martial arts training, and in the final pages they are shown as a loving elderly couple with a granddaughter.!~",
      "metadata": {
        "gender": "female",
        "age": "16-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b207-RQ4EUdTD0K62.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 207
      },
      "rarity": "legendary"
    },
    {
      "id": "yuki-souma",
      "name": "Yuki Souma",
      "alt_names": [
        "草摩由希",
        "Yuki Soma",
        "Prince Yuki",
        "Yunyun"
      ],
      "role": "protagonist",
      "description": "__Height:__ 170.5 cm / 5'7\"\n__Zodiac Animal:__ Rat\n\nKnown as \"The Prince\" or \"Prince Yuki\" at school, Yuki is very pretty and refined, and has many admirers at school, but has a hard time being social. He wishes that he could be with people as friends, rather than admired and worshiped from afar. Yuki has suffered a traumatic childhood at the hands of [Akito](https://anilist.co/character/374), the head of the Soma clan, who locked up and mentally tortured him. Because of this, Yuki has a somewhat low sense of worth and is claustrophobic. With [Tohru's](https://anilist.co/character/207) help, however, Yuki is gradually able to loosen up. He is jealous of [Kyo](https://anilist.co/character/209) because he thinks Kyo can have a normal life, which Yuki always wanted.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "16-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b208-5TmAqqh82wNe.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 208
      },
      "rarity": "legendary"
    },
    {
      "id": "kyou-souma",
      "name": "Kyou Souma",
      "alt_names": [
        "草摩夾",
        "Kyo Soma",
        "Kyonkyon",
        "Kyonkichi",
        "Kyokyo",
        "Lucky Kyo",
        "Cat lovers",
        "Kyo Sohma",
        "Stupid Cat",
        "Carrots",
        "Orange Top",
        "Jari-gaki",
        "Prince Kyon"
      ],
      "role": "protagonist",
      "description": "Kyo is a stubborn, hot-headed boy. He is easily provoked and angered in any situation. As with most of the Soma clan, Kyo is cursed with becoming an animal of the Zodiac when hugged by someone of the opposite gender. His Zodiac animal is the cat which, in legend, was barred from becoming one of the official twelve animals because of the rat's trickery. Kyo hates the current rat of the family, [Yuki](https://anilist.co/character/208), as a result. The two constantly fight and Kyo loses every time.\n\nEver since he met [Tohru Honda](https://anilist.co/character/207), who admires the cat of Zodiac legend, he has expressed a soft side of himself. Kyo was always separated from the Soma clan, including his parents, which is likely the cause of his short-fused temperament and stubbornness. He constantly trains in martial arts so that he might one day defeat his rival, Yuki. His martial arts master is one of the people he respects the most.",
      "metadata": {
        "gender": "male",
        "age": "16-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209-NOAbiLvJt1QA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209
      },
      "rarity": "legendary"
    },
    {
      "id": "akito-souma",
      "name": "Akito Souma",
      "alt_names": [
        "草摩慊人",
        "Akito Soma"
      ],
      "role": "protagonist",
      "description": "~!__Gender:__ Female (Manga); Male (Anime, 2001); Female (Anime, 2019)!~\n\nAkito is the head of the Souma clan and very frail. He often runs fevers and rarely walks out of the main house other than to greet some of the Zodiac members, such as [Yuki](https://anilist.co/character/208) and [Shigure](https://anilist.co/character/206), that live in the outside world. Akito has a definite mean streak, and has physically and emotionally scarred many members of the Souma family, but Akito's rule in the Souma clan is absolute, and none dare oppose him.\n\nA possible part of Akito's curse was that he would only live to be thirty. At a certain point in the Zodiac's life, Akito wishes to force them to live within the Souma compound with him for the rest of their lives in a never-ending \"banquet\". He even describes himself as the \"Master of their (the Zodiac) Souls\".\n\nHe has a deep hatred of [Kyou Souma](https://anilist.co/character/209), the Cat, whom he believes should be isolated for the rest of his life. He hates [Tohru](https://anilist.co/character/207) most of all, since everyone seems to love and protect her.   \n\n~!The manga eventually reveals that Akito is female, which is where much of her anger for Tohru originates. The 2001 anime version of Akito is male.!~  \n\n~!Akito is the God of the zodiac!~\n\nAkito is voiced by [Junko Minagawa](https://anilist.co/staff/95062) in “Fruits Basket: The Last Story” commemorative voice comic.",
      "metadata": {
        "age": "19-20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b374-8BT4gMd8xyl5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 374
      },
      "rarity": "legendary"
    },
    {
      "id": "kagura-souma",
      "name": "Kagura Souma",
      "alt_names": [
        "草摩楽羅",
        "Kagura Soma"
      ],
      "role": "supporting",
      "description": "__Zodiac Animal:__ Boar\n\nShe has been in love with [Kyo](https://anilist.co/character/209) since they were young, although she doesn't know that Kyo is in love with her friend, [Tohru Honda](https://anilist.co/character/207). Because of her \"pity\" of him as a child, when he was all alone because he carried the curse of the cat, she played with and took care of him. Eventually, it developed into a near-obsessive love for him. She is convinced she will marry him, mainly because she threatened him into proposing to her (at age 7 with knives in the manga, or a boulder in the anime to a 5-year old Kyo), and partly because she thinks that they belong together because they can hug each other without transforming into their zodiac form. \n\nDespite this love, she often loses her head and beats him senseless when he does something to anger her or make her anxious. As one of the only three female members of the zodiac, she is able to hug any of the male members and neither she nor they transform.\n\nShe lives with her mother, who is perfectly okay with Kagura's double-edged personality, and [Rin](https://anilist.co/character/3892). Kagura seemingly is the only female member of the zodiac that has not been personally hurt by [Akito](https://anilist.co/character/374).",
      "metadata": {
        "age": "19",
        "dateOfBirth": "1991-07-06"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b366-5iIIhczrc3Qr.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 366
      },
      "rarity": "rare"
    },
    {
      "id": "momiji-souma",
      "name": "Momiji Souma",
      "alt_names": [
        "草摩紅葉",
        "Momiji Soma",
        "Momicchi"
      ],
      "role": "supporting",
      "description": "__Zodiac Animal:__ Rabbit\n\nA cute and seemingly happy teenager with a sad family life that he hides behind his cheery demeanor. His endless whining and crying often annoys Kyo. He is older than he looks, much to Tohru's surprise, he is only 1 year younger than Yuki, and Kyo, the same age as Hatsuharu. Momiji is the rabbit of the Zodiac and is the son of one of the richer members of the Soma family. His father is Japanese while Momiji's mother is German. Tohru unwittingly cleans Momiji's father's building for her job. He has a younger sister, Momo. Momo is unaware of the fact that she has an older brother. Her mom's memory of Momiji was erased because otherwise she might slip into utter madness. Momiji is actually very insightful and emotionally strong despite his upbringing. He took to Tohru very quickly, even ignoring the fact that he was a Zodiac and hugged her when they were formally introduced. Much to Kyo's horror, Momiji likes to wear the girl's version of their high school uniform, albeit with short shorts and not a skirt. Momiji sometimes sees Tohru at work, he sometimes helps her clean her share too. He even did Tohru's share once when she was sick with a cold. Momiji also develops feelings for Tohru. He tends to cross dress, meaning to wear clothing meant for the opposite sex.\n\n(Source: Wikipedia)",
      "metadata": {
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b367-Jc6wMVpL76Ib.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 367
      },
      "rarity": "rare"
    },
    {
      "id": "hatori-souma",
      "name": "Hatori Souma",
      "alt_names": [
        "草摩はとり",
        "Hatori Soma",
        "Tori"
      ],
      "role": "supporting",
      "description": "__Zodiac Animal:__ Dragon\n\nThe dragon of the Zodiac and the private doctor to the Soma clan. Hatori is serious and is often without a sense of humor. It's his job to erase the memories of those who discover the Soma clan secret, though it is not entirely clear if this is simply a form of hypnosis or more of a supernatural power. When his curse activates he turns into a seahorse rather than an actual dragon, because the Chinese consider the seahorse to be baby dragons and the actual name in Japanese translates to it. He is very self-conscious about his transformation in the fact that he is the \"great and powerful dragon\" but appears as a \"seahorse\". Like Shigure and Ayame, he is very tall, and he is really a nice guy upon deeper inspection.\n\n~! He has had a bad experience in love with his \"Spring\", a woman named Kana who was the assistant in his office. The relationship ended when Hatori asked Akito to give him permission to marry Kana. Akito threw a pot at Hatori and left him almost blind in the left eye. Kana felt so guilty about the incident and blamed herself completely. She was eventually driven insane with depression and guilt to the point where Hatori was forced to erase her memory in order to ease her suffering. !~\n\n(Source: Wikipedia)",
      "metadata": {
        "age": "27-28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b368-zJEE8gpxBb5f.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 368
      },
      "rarity": "rare"
    },
    {
      "id": "hatsuharu-souma",
      "name": "Hatsuharu Souma",
      "alt_names": [
        "草摩潑春",
        "Hatsuharu Soma",
        "Black Haru",
        "White Haru",
        "Haru"
      ],
      "role": "supporting",
      "description": "__Height__: 170.2 cm (5&#039; 7&quot;)\n__Grade/School__: Freshman at Kaibara High School\n__Zodiac Animal__: Ox\n\nThe ox of the Zodiac, Haru has something of a Yin and Yang personality related to the Ox's personality.\nHe is usually calm, placid, and otherwise an all-around nice guy, but can be goaded into \"stampeding\", where he's edgy and mean and slightly oversexed. White Haru is conscious during his \"black\" transformation, but is unable to do anything about it. He just either apologizes or doesn't care. Additionally, Haru has a rather bad sense of direction; he had become lost for three days in another town after trying to find Kyo so he could challenge him. He likes to make fun of Kyo passively and wants to fight with him on a regular basis. He is very protective and caring, especially towards Yuki, Kisa, and Rin, and is constantly looking out for these characters.\n\n(Source: Wikipedia)\n\nManga:   ~!It is revealed that he loves Isuzu (Rin) and he tried to strangle Akito (the god of the zodiac animals)  when he found out that she pushed her out of a Level 2 in a building.!~",
      "metadata": {
        "gender": "male",
        "age": "15-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b369-NDFi2A2BzqO6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 369
      },
      "rarity": "rare"
    },
    {
      "id": "ayame-souma",
      "name": "Ayame Souma",
      "alt_names": [
        "草摩綾女",
        "Ayame Soma"
      ],
      "role": "supporting",
      "description": "__Zodiac Animal:__ Snake\n\nThe snake of the zodiac, and big brother to Yuki, Ayame is vivacious, garrulous, and has a knack for making Yuki and Kyo angry. He runs a business that makes women's clothing, which men apparently wear as well, and he often wears women's clothing himself. He named his shop after himself and runs it with Mine, who is later revealed to be Ayame's girlfriend and the seamstress of the store. Ayame designs the dresses, erotic as some or all of them may be. Vain and somewhat self-conscious, he is really a thoughtful person underneath his \"selective\" skin. He has gorgeous gold eyes and silver hair in a startling contrast to Yuki's violet and grey. His fear, coincidentally, is a fear of being totally alone. Much to Yuki's chagrin and surprise, he was actually the student body president in high school. When Ayame was young, he did not care for Yuki at all until he realized that when he got older, he would be totally alone without Yuki, spurring his new obsession to gaining Yuki's love shown in the series. Yuki has slowly started to accept Ayame as a brother.\n\n(Source: Wikipedia)",
      "metadata": {
        "age": "27-28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b370-cdEW33vBsXBL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 370
      },
      "rarity": "rare"
    },
    {
      "id": "kisa-souma",
      "name": "Kisa Souma",
      "alt_names": [
        "草摩杞紗",
        "Kisa Soma"
      ],
      "role": "supporting",
      "description": "__Zodiac Animal:__ Tiger\n\nShe is very shy, cute, and withdrawn, largely because her classmates harass and ostracize her due to her naturally orange hair, a side effect of her curse of the tiger. In Japanese society, non-black hair is considered \"disrespectful\" or \"unnatural\" and being made fun of for this reason is really quite normal. [Tooru](https://anilist.co/character/207) helps her to come out of her shell, and she develops quite an attachment to Tooru, calling her \"big sister\", or \"oneechan\". She loves omelets and dislikes dry foods and loves an anime series called \"Mogeta\". Usually seen around [Hiro](https://anilist.co/character/372) or [Momiji](https://anilist.co/character/367). Her mother is extremely protective of her and worries about her often.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "age": "12-13",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b371-NHaNSFumvv2P.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 371
      },
      "rarity": "rare"
    },
    {
      "id": "hiro-souma",
      "name": "Hiro Souma",
      "alt_names": [
        "草摩燈路",
        "Hiro Soma"
      ],
      "role": "supporting",
      "description": "__Zodiac Animal:__ Sheep\n\nHiro is a very intelligent but verbally aggressive and smart-mouthed sophist. He is in love with [Kisa](https://anilist.co/character/371), and resents [Tohru](https://anilist.co/character/207) because she unwittingly monopolizes Kisa's time and attention. He starts out hostile to Tohru, but eventually eases his initial attitude through a combination of grudging admiration for Tohru and Kisa telling him to let up. He is sarcastic and pessimistic.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "11-12",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b372-D2TNU8Qky1pV.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 372
      },
      "rarity": "rare"
    },
    {
      "id": "ritsu-souma",
      "name": "Ritsu Souma",
      "alt_names": [
        "草摩利津",
        "Ritsu Soma"
      ],
      "role": "supporting",
      "description": "__Zodiac Animal:__ Monkey\n\nAs far back as he could remember, his parents always had to apologize for everything he did, so he is very unsure of himself. He feels that every day, he is robbing the world of its air by breathing.\n\nHe found that it always made him feel more comfortable to dress like a girl, but that only gave his parents even more to apologize for. Since he looks so much like a girl, that's what [Tohru](https://anilist.co/character/207) thought when she first saw him, until he accidently transformed. Somehow, Tohru convinced him that he does have a reason to live, he just hasn't found it yet. Shigure likes to play with Ritsu's insecurities and gullibility, much as he does his editor, [Mitsuru](https://anilist.co/character/9759).\n\n~!When the two meet, they realize they have this in common. In the final chapter of the manga, Ritsu tells Kagura, while giving her one of his women's kimonos, that he has asked Mitsuru on a date, and in a bonus story in the first fan-book, he and Mitsuru are a couple.!~  \n\nNatsuki Takaya derived his name from the eighth month, odakaritsuki or \"rice harvest month,\" which is the month of the monkey, of the traditional Japanese calendar. In an author's note, Takaya said that she regretted how little role Ritsu played in the main story.\n\n(Source: AbsoluteAnime.com)",
      "metadata": {
        "gender": "male",
        "age": "21-22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b373-2hzWde5fNiwk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 373
      },
      "rarity": "rare"
    },
    {
      "id": "arisa-uotani",
      "name": "Arisa Uotani",
      "alt_names": [
        "魚谷ありさ",
        "Uo-chan"
      ],
      "role": "supporting",
      "description": "Arisa is a former gang member (a *yankee*: a Japanese version of the American \"gangster thug\" image) and has been one of Tohru's closest friends since Tohru's mother helped her escape from the gang (called \"The Ladies\") when she wanted to leave it.\n\nArisa is tough, brash, and sometimes violent but cries easily when it comes to her friends. She wears long skirts, carries a lead pipe, and often speaks like a man (in Japanese, different word choices can categorize a speaker as male or female). Arisa likes to play cards, protect Tohru from Yuki's fangirls, and swim. Her \"convoluted\" personality stems from home problems early in her life, when her mother left Arisa and her father for another man; her father became an alcoholic after his rejection. This caused Arisa to become harsh and jaded in her views of the world until she met the kind Tohru and her mother, Kyoko. With her overprotective and rather \"parental\" protection of Tohru with Hana-chan, she comes off as the brash and direct \"father\" figure.\n~!She falls in love with [Kureno Sohma](https://anilist.co/character/4644/Kureno-Soma).!~",
      "metadata": {
        "gender": "female",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b375-RYqdBrPJL06c.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 375
      },
      "rarity": "rare"
    },
    {
      "id": "saki-hanajima",
      "name": "Saki Hanajima",
      "alt_names": [
        "花島咲",
        "Hana-chan"
      ],
      "role": "supporting",
      "description": "Saki is a psychic girl with a goth-like appearance who has the ability to sense people&#039;s &quot;auras&quot; and send out electric waves (denpa in Japanese). Much like Arisa, Saki is extremely protective of Tohru, who was the first person in school who had truly accepted her. She is very observant, polite, and loves to eat (and is rarely seen not eating outside of school). Her nickname (Hana-chan) and her manga symbol, a violet with fangs, relate humorously in that hana means &quot;flower&quot; in Japanese. Hanajima has a close relationship to her family who accept and even nurture her gifts (her younger brother, Megumi, looks up to Hanajima, has his own special ability so that she wouldn&#039;t be the only &quot;weird&quot; one in the family). Her mother seems to resemble Tohru&#039;s protective and caring nature (maybe explaining her attachment to Tohru). In the near &quot;parental&quot; protection she and Arisa give Tohru, she acts as the protective &quot;motherly&quot; figure. ~! When Kazuma comes in for Kyo&#039;s parent/teacher conference, Hana notes that he is &quot;handsome&quot;. Kyo is not too keen on the idea of Saki as his &quot;mother&quot;.!~",
      "metadata": {
        "gender": "female",
        "age": "16-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b376-gDdhShL8BIVg.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 376
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-26T07:09:49.040Z"
}