{
  "work_id": "deadman-wonderland",
  "count": 15,
  "characters": [
    {
      "id": "ganta-igarashi",
      "name": "Ganta Igarashi",
      "alt_names": [
        "五十嵐丸太",
        "Woodpecker",
        "N° 5580 "
      ],
      "role": "protagonist",
      "description": "The main protagonist of the story. Ganta is a seemingly harmless, ordinary middle school boy who is framed for the slaughter of his entire middle school class, perpetrated by the mysterious Red Man. Sentenced to \"death,\" he is sent to Deadman Wonderland, where he is initially confused and frightened by the brutality of the prison.",
      "metadata": {
        "gender": "male",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8630-Yv2hK4ye8lqW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8630
      },
      "rarity": "epic"
    },
    {
      "id": "shiro",
      "name": "Shiro",
      "alt_names": [
        "シロ"
      ],
      "role": "protagonist",
      "description": "A mysterious albino girl that Ganta encountered during his first days as an inmate. Clothed only in a skin-tight bodysuit and muffly gloves, which conceals her heavily scarred skin, Shiro stands out among the other prisoners due to her bizarre appearance and mannerisms. To Ganta, Shiro's manner of speaking and acting remind him of a small child, even though Shiro is the same age as him. However, Shiro possesses inhuman physical abilities and has an intimate knowledge of the prison, having apparently lived there most of her life. From the beginning of the story it is made clear that, as children, Shiro and Ganta were close friends. Ganta, however, has no memories of his childhood, which greatly saddens and annoys Shiro.   ~!Despite her seemingly harmless appearance, Shiro harbors a dark secret; she possesses two personalities and her second one is the 'Red Man' Ganta is searching for, who is also the 'Wretched Egg', the source of the Branch of Sin infection. Thanks to the Mother Goose mainframe, Deadman Wonderland's supercomputer, which constantly emits a lullaby audible only to Shiro and Tamaki's father, Shiro's true personality is repressed. When the lullaby is turned off, Shiro becomes a murderous, smirking maniac capable of massacring whole squads of armed men with little effort. It's at these times that she dons a crimson colored full body restraint, which gives her a taller, masculine appearance, hence Ganta's inability to recognize her (later it's revealed that this costume was made after the 'Aceman', a superhero character in a cartoon Shiro and Ganta used to watch together as kids). Shiro cares greatly for Ganta and constantly seeks his approval. She is willing to do anything that Ganta asks her as long as it will make him happy. Even when in her 'Red Man' state, she still seems to care for him, as it was implied that she butchered Ganta's classmates just so that he would be sent to Deadman Wonderland, where she was also living. !~ (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8631-c6VT3zQUGAU5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8631
      },
      "rarity": "epic"
    },
    {
      "id": "kiyomasa-senji",
      "name": "Kiyomasa Senji",
      "alt_names": [
        "千地清正",
        "Crow"
      ],
      "role": "protagonist",
      "description": "Senji was the first \"Deadman\" that Ganta encountered at the prison. After making their way to sector G, Crow destroyed the Necro Macro security robot which had been chasing Ganta, Shiro and Yoh. After a small skirmish, and an interruption by Shiro, Crow was subdued by the Deadman security. The next day, Ganta and Senji were slated to be the next two Deadmen to compete in the \"Carnival Corpse.\" Despite Senji's experience and skill with his 'branch' ability, Ganta managed to win by fooling Senji. As a consequence for losing, Senji's right eye was removed for research. He returns a short time later during Ganta's next match, sporting an eyepatch and gives Ganta assistance with figuring out his opponent's techniques. He also helps Ganta understand his own capabilities. His change in personality toward Ganta is due to his respect for Ganta's strength. Senji comments that because Ganta beat him, he is not allowed to lose until they have a rematch.   He seems to thoroughly enjoy violence, and his favorite phrase is \"Dead Center\" (or in the dub of the anime, \"Sssslice.\"). Despite his wild and battle-hungry attitude, he does have a sense of honor and respects strength and determination. In an ironic twist, Senji becomes flustered and embarrassed when a woman acts immodest. When he first notices Shiro's form fitting body tights, his face becomes red and he give her his coat telling her to quickly cover up.   His Branch of Sin is called \"Crow Claw\". It manifests as two large scythe-like blades, made of blood, extending from long cuts on his forearms. He makes these cuts using two bladed rings he wears on his thumbs. While the blades are typically two to three feet long, Senji has demonstrated the ability to greatly lengthen them allowing him to attack people at range. He is responsible for naming Ganta's 'Branch of Sin' (Ganta Gun).  He also has a supersonic attack called Invisible Black.   Senji used to be a policeman before his time in DW. It's hinted that he killed four friends.    ~!It's revealed in his fight with a Forgery that Senji did not kill them, but was indirectly responsible for their deaths. After the Tokyo massive earthquake, chaos ruled in Seiji's inspection area, and out of the corrupt police force, only Seiji and his friends were active against the local crimes. Their actions soon drew hostile attentions of many hoodlums, especially to Seiji since the branch of sin he possessed was a powerful asset. They challenged Seiji to a many-on-one battle, but his friends stopped him and took on the offer, and ended up savagely murdered in his place. As such, he partially believes Ganta in that he did not kill his friends, because he has experienced similar circumstances  !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12944-W5b3uu7HEGez.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12944
      },
      "rarity": "epic"
    },
    {
      "id": "you-takami",
      "name": "You Takami",
      "alt_names": [
        "鷹見羊",
        "Yoh Takami"
      ],
      "role": "protagonist",
      "description": "A kleptomaniac and an informant to Assistant Warden Tamaki, Yoh was hired to watch over Ganta in return of large amounts for Cast Points. Though apparently friendly and polite, in truth he is ruthless, scheming and somehow paranoid, given his position as a spy for the prison's staff. A rarity among the prison population, Yoh made himself captured and sent to Deadman Wonderland in hopes to find his sister Minatsuki and buy her freedom with the accumulated Cast Points he got from Tamaki. He cares deeply about her, so much so that he is often thought of suffering from a sister complex, much to Minatsuki's disgust. The two eventually manage to forge an estranged relationship.  (Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/15842.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15842
      },
      "rarity": "epic"
    },
    {
      "id": "minatsuki-takami",
      "name": "Minatsuki Takami",
      "alt_names": [
        "鷹見水名月",
        "Hummingbird"
      ],
      "role": "supporting",
      "description": "Minatsuki is the younger sister of Yoh Takami, and a Deadman known as \"Hummingbird\" in the complex. She initially appears as a very shy, reserved little girl who cannot stand violence and her horrible past. Minatsuki soon shows that it is a ruse to lure opponents into a false sense of security. She is actually very sadistic, deriving sexual pleasure from seeing the pained looks on her victim's faces. She especially likes the look of her brother blaming himself for their father's death, though he does know the real truth. After losing to Ganta, she reconciles somewhat with both Yoh and Ganta, but still lashes out at them frequently. Her Branch of Sin is called \"Whip Wing\", which uses blood from her ears to create whips that can quickly strike and restrain the target.   ~! Her sadistic character comes from her experience in the earthquake. When the earthquake first hit Japan, Minatsuki was with her mother. She tried holding on to her mother to help her escape but her mom let go of her and ran away for her own life. Leaving Minatsuki behind inside the house. That's when she became more sadistic and hating towards humanity. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b15843-bFwfZZHUdGfw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15843
      },
      "rarity": "rare"
    },
    {
      "id": "karako-koshio",
      "name": "Karako Koshio",
      "alt_names": [
        "興緒唐子",
        "Game Fowl"
      ],
      "role": "supporting",
      "description": "A member of Scar Chain, a group of Deadmen that oppose the prison and plan to leak the truth to the rest of the world. Karako loves its leader, Nagi, deeply and fights to help him achieve his dream of freeing the Deadmen. She is able to use her Branch of Sin to wrap blood around her body to increase her physical strength while using the Wushu martial art style to defend herself. She can also close up wounds using this technique.  She used to be a nurse before her time in DW.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/15844.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15844
      },
      "rarity": "rare"
    },
    {
      "id": "nagi-kengamine",
      "name": "Nagi Kengamine",
      "alt_names": [
        "剣ヶ峰凪",
        "Owl"
      ],
      "role": "supporting",
      "description": "The leader of Scar Chain, a group of Deadmen that oppose the the prison and plan to leak the truth to the rest of the world. Nagi speaks with a mechanical voice created by a synthesizer because of his vocal chords being removed after a rigged fight with his lover, who was later killed by Genkaku of the Undertakers. He has a son, left in the care of a nursery outside, and fights for freedom to see his child. His branch of sin is called &quot;Owl&#039;s Eyeball&quot;, which creates small floating explosive spheres that can be controlled and detonated remotely.     ~!  It&#039;s later revealed that Nagi&#039;s son actually died in his mother&#039;s womb when Nagi&#039;s wife was killed. This prompted Nagi to develop a second, horrifyingly savage and inhuman personality, which slaughtered numerous Undertakers in vengeance. Genkaku is especially fascinated by this and later drugs Nagi to bring to light this side of him, which causes Nagi to temporarily revert to his second personality and attacks his own comrades. Ganta manages to bring Nagi back to his senses, but then, Genkaku fatally wounds Nagi by blasting a hole in his stomach, as he claims that he loves Nagi&#039;s dark side and will kill Nagi to bring him salvation, if he chooses to stay the person he is. However, Nagi still manages to stop Genkaku from dodging Ganta&#039;s powerful attack, which permanently incapacitates Genkaku, and dies shortly afterwards.   !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/15845.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15845
      },
      "rarity": "rare"
    },
    {
      "id": "genkaku-azuma",
      "name": "Genkaku Azuma",
      "alt_names": [
        "東弦角"
      ],
      "role": "supporting",
      "description": "A squad leader of the Undertakers, Tamaki's special enforcement group which selects prisoners who could not be rehabilitated and survived a special 'correctional' program to be anti-Deadman soldiers, wielding weapons that allow them to nullify the Deadmen's Branches of Sin. He dresses like a monk (though he prefers to be called a \"Hyper Monk\") and wields a guitar that can split into two machine guns, fire shock waves, or just play music like a regular slide guitar.   ~!2 years ago he killed Nagi's wife after she conspired with her husband to rig their fight, and has taken an interest in Nagi since then, claiming Nagi possesses the insanity befitting of an Undertaker.  During the flashback in episode 12 Genkaku's past is revealed, describing the events that led up to his current insanity. As a young boy Genkaku was a monk at a monastery, where at first he was a quiet, gentle person. However after taking constant abuse at the hands of three other men present at the monastery (it can be assumed from the flashback that it was not only physical, but sexual abuse), coupled with the aftermath of the explosion in Tokyo, he snapped, killing all three of the men.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b15846-T7dqgLd39tZd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15846
      },
      "rarity": "rare"
    },
    {
      "id": "tsunenaga-tamaki",
      "name": "Tsunenaga Tamaki",
      "alt_names": [
        "玉木常長"
      ],
      "role": "supporting",
      "description": "A major antagonist form the first half of the story, Tamaki is Assistant Warden and de facto tyrant of Deadman Wonderland. Under his calm, almost idiotic attitude, he is something of a sadist, caring nothing about the fact that he butchers dozens of prisoners every day for the sole purpose of gathering money or experimenting on them, or simply for his amusement. As son of the dying Chief Warden of Deadman Wonderland, he eagerly hopes for the death of his father to become truly the supreme ruler of the prison, and he devotes much of his time and resources in studying and experimenting on the powers of the Branch of Sin and their origin. He also is in contact with the upper echelons of the Japanese government, his ultimate goal being the synthesis of artificial Deadmen. In sharp contrast with his cruelty, he enjoys playing with children toys.  \n\n(Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/15847.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15847
      },
      "rarity": "rare"
    },
    {
      "id": "hibana-daida",
      "name": "Hibana Daida",
      "alt_names": [
        "橙火花",
        "Punishment"
      ],
      "role": "supporting",
      "description": "A small, very polite and well-mannered girl who was warped considerably by torture performed by her mother for simple things like wetting the bed. She is an expert in torture, and uses a large sectioned sword as large as her body.   ~!She is killed by Mockingbird, right after Genkaku's defeat.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/20774.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 20774
      },
      "rarity": "rare"
    },
    {
      "id": "kiwako-flugel-makina",
      "name": "Kiwako Flügel Makina",
      "alt_names": [
        "蒔名フリューゲル季和子"
      ],
      "role": "supporting",
      "description": "Senior leader of the prison&#039;s guard staff, Makina is a harsh and cold enforcer which does not hesitate in punishing, often brutally, the prison&#039;s population. Known for her demeanor and her large breasts (G cup), she is infamous for carrying a decorated sword with herself at all times, and also for using it to cut whoever breaks the prison&#039;s rules, acts that almost always result in bloodshed. \n\nDespite her brutality she is far less twisted than Tamaki, whom she is greatly suspicious of, especially after discovering that she knows and has authority over only a part of Deadman Wonderland. This fact, coupled with Tamaki&#039;s ever more sick machinations, led her to forfeit her position and hunt him down with the aid of some allies, among them the Deadmen themselves, Ganta in particular.\n\n~!After the death of Tamaki, she came in possession of the data regarding the Wretched Egg, the Deadmen and the Forgeries.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/21400.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21400
      },
      "rarity": "rare"
    },
    {
      "id": "toto-sakigami",
      "name": "Toto Sakigami",
      "alt_names": [
        "咲神トト",
        "Mockingbird"
      ],
      "role": "supporting",
      "description": "A mysterious Deadman feared even by Senji, Toto is a mysterious boy dressed in a way reminiscent of Shiro, and appears not only to be one of the strongest Deadmen introduced so far, but also to know in great detail about the true nature and purpose of Deadman Wonderland.   His power, Love Labyrinth, allows him to copy the abilities of other Deadmen. However, he states that he recently was reset of his copied powers after his battle with the Red Man. However, even in his weakened state, he managed to take down two of the Forgeries with nothing but a copy of Crow's powers. Nicknamed Mockingbird, he freely comes and goes through the prison, and recently has become friends with Ganta. Toto is the only person to have fought the Red Man and have survived.   ~!He's later revealed to be the chief of Deadman Wonderland and true main antagonist, Hagire Rinichirou. By using the combined ability of his two bodyguard, \"Hollow Swallow\", Hagire was able to transfer his mind to Toto's body and took over it. What happened to Toto's personality is currently unknown. It's assumed that he is on the protagonists side, as he alerts Shiro about the data chip, and takes out Hibana with Invisible Black.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b26780-0YJ4xwEV7jdY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 26780
      },
      "rarity": "rare"
    },
    {
      "id": "bundo-rokuro",
      "name": "Bundo Rokuro",
      "alt_names": [
        "六路文堂"
      ],
      "role": "supporting",
      "description": "Chief of Intelligence for Scar Chain. His Branch of Sin takes the shape of a hexagonal shield with spikes on the side.   ~!He is the traitor that gives the Undertakers information about Scar Chain's breakout plan.!~ (Source: Deadman Wonderland Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/43227.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43227
      },
      "rarity": "rare"
    },
    {
      "id": "rei-takashima",
      "name": "Rei Takashima",
      "alt_names": [
        "高島麗"
      ],
      "role": "supporting",
      "description": "A sadistic doctor who works at Deadman Wonderland.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/43414.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43414
      },
      "rarity": "rare"
    },
    {
      "id": "kyoko-kasuga",
      "name": "Kyoko Kasuga",
      "alt_names": [
        "春日今日子"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/43415.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43415
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T08:53:04.988Z"
}