{
  "work_id": "akame-ga-kill",
  "count": 15,
  "characters": [
    {
      "id": "akame",
      "name": "Akame",
      "alt_names": [
        "アカメ",
        "Demon Sword Murasame",
        "Honors Student"
      ],
      "role": "protagonist",
      "description": "__Height:__ 164 cm (5'4\")\n\nAkame is one of the members of the Assassin's group, Night Raid. She is the first member to attack Tatsumi, and comes very close to killing him. She initially appears very serious and cold-hearted, but she is actually caring and worries about the safety of her comrades. She has a younger sister named Kurome, who is a member of the Jaegers, and loyal to the Empire. Her Teigu is the One-Cut Killer: Murasame, a katana known for being coated in an immensely deadly poison that could kill those cut by it within seconds, as the poison itself has no antidote.\n\n ~!When she was a child, her parents had sold both her and Kurome to the Empire. There, they were placed and raised as Assassins from childhood. Akame in particular became infamous enough to earned the top rank in the Imperial Assassin Division. At some point, many of her comrades had died and she become dissatisfied and resentful towards the government. It was not until she was sent to kill former General Najenda that Akame finally defected to the Rebels after being swayed by her.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b63351-0WmsDENpiscp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 63351
      },
      "rarity": "epic"
    },
    {
      "id": "tatsumi",
      "name": "Tatsumi",
      "alt_names": [
        "タツミ",
        "Tatsumi The Blacksmith"
      ],
      "role": "protagonist",
      "description": "Tatsumi is a swordsman from a small village. He set out to the capital with two of his companions in hope of raising money for the village. He got separated from his friends and reaches the capital. Tatsumi was not aware of the type of place the capital really was. After a series of events centered around his naivety of the true nature of the capital he found himself being saved be Night Raid (Assassination Group) and later join them to rid the capital of its corrupt inhabitants.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/64749-a2ZdRWW1D5TR.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64749
      },
      "rarity": "epic"
    },
    {
      "id": "leone",
      "name": "Leone",
      "alt_names": [
        "レオーネ",
        "Onee-San"
      ],
      "role": "supporting",
      "description": "__Height:__ 170cm (5'7)\n\nLeone is one of the older members of the assassination group, Night Raid. She has a very relaxed and a cheerful personality, which tends to display a lack of ladylike manners, such as shoving Tatsumi into her breasts, putting her feet on the table, or consuming large amounts of Sake. She serves as a sort of big sister figure to Tatsumi and the younger members in Night Raid, often referring to herself as \"Onee-San\". Despite the morally dodgy nature, she can sometimes display, Leone is not one to tolerate injustice and can be especially vicious to those who commit the vilest acts. She excels at gathering information and exercising calm judgement when necessary.  \n\nHer teigu is Lionel, a teigu is in the form of a belt, when activated, it enhanced her speed, reflexes, strength, and regeneration, as well as giving her animal-like characteristics.",
      "metadata": {
        "gender": "female",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65227-PWmfiEVJbCwQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65227
      },
      "rarity": "uncommon"
    },
    {
      "id": "mine",
      "name": "Mine",
      "alt_names": [
        "マイン",
        "Genius Sniper",
        "Bench-Warmer"
      ],
      "role": "supporting",
      "description": "__Height:__ 155 cm (5'1)\n\nMine is a self-proclaimed \"Genius Sniper\", as well as being a sharp-tongued and quick-witted member of the assassin's group, Night Raid. She is often quick to anger, and easily irritated with those she does not know well. Despite this cold exterior, she has shown to be warm and kind to those she has opened up to.  Mine wields a powerful Teigu in the form of a rifle called the \"Roman Artillery: Pumpkin\" that fires highly concentrated piercing shots of spirit energy. Her proficiency in its use allows her to strike any target with extreme precision. When Pumpkin's user is in a dangerous situation, the power of its shots is​ magnified.\n\nManga spoilers:\n~!Tatsumi and Mine retired from service and settled down away from civilization where they married and had a child.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65229-hYOZtUlIpd5G.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65229
      },
      "rarity": "uncommon"
    },
    {
      "id": "lubbock",
      "name": "Lubbock",
      "alt_names": [
        "ラバック",
        "Lubbo",
        "Rabakku"
      ],
      "role": "supporting",
      "description": "Lubbock is a member of the assassin group, Night Raid. He is often shown being a pervert, including trying to peep on Leone while bathing, usually these attempts end in failure. In the city, his cover is an owner of a bookstore. \nLubbock's teigu is, Infinite Uses: Cross Tail, a wire based teigu able to be used offensively and defensively \n\n  ~!Rabac was 4th son born into a wealth merchant family in a region in the Empire. During his childhood as a boy he met Najenda who just moved into the region for the first time. Falling in love at first sight he left the privileged life he no longer desired to follow her into the army. Using his talent, Rabac rose through the ranks to the point where he could serve and be by her side. He would also join Najenda in her deflection to the rebellion, even going as far risk his life to change the military records of both him and her to K.I.A. Because of this he shares a somewhat antagonistic relationship Susanoo who he views as a rival for Najenda's affections.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/65231-2QpM2yw2X86k.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65231
      },
      "rarity": "uncommon"
    },
    {
      "id": "sheele",
      "name": "Sheele",
      "alt_names": [
        "シェーレ",
        "Schere"
      ],
      "role": "supporting",
      "description": "__Age:__ Mid 20's\n__Height:__ 160cm (5'3)\n\nSheele is one of the members of the Assassin's group, Night Raid. While she seems to be clumsy and ditzy on the surface, she's a very caring and sweet person. She bears the Teigu \"Ecstasy\", a huge pair of scissors that can cut through anything.   ~!Growing up in the low districts of the Capital, her clumsy nature caused many people throughout her life often consider her useless, isolating her from nearly everyone. At one point in her past, she had a friend who didn't mind her personality but was attacked by her ex-boyfriend. Sheele killed the boyfriend in order to protect her, revealing that she had a strange talent for killing. However, in the end, this broke their friendship. Soon after, a gang-related to the man she killed earlier sought revenge against her and had already murdered her parents. Sheele defeated the group and was later scouted by the Revolutionary Army who learned of her ability.  By joining, she wanted to use her talent in a way that would make her useful to others by helping fix society. She is one of the first members to warm up to Tatsumi, comforting him while he mourned his deceased friends from his home village. Later, she is attacked by Seryuu, and killed while saving Mine from harm.!~  (Source: Akame ga Kill! Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/65233-f8RXB4LQiNh0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65233
      },
      "rarity": "uncommon"
    },
    {
      "id": "bulat",
      "name": "Bulat",
      "alt_names": [
        "ブラート",
        "Big Bro",
        "100 Man-Slayer Bulat"
      ],
      "role": "supporting",
      "description": "Bulat was once a high-ranking Imperial Officer known as \"100 Man-Slayer Bulat\". He later decided to betray the Empire when his superior was framed for not giving in to the Prime Minister's agenda. Bulat became disgusted with the Empire that cared more for bribes, than merit regardless of how hard he worked. After leaving the Empire, he joined the Revolutionaries, and eventually Night Raid.  \nBulat's teigu is the Demon Armor: Incursio an Armor-type teigu that took on the form of a short sword with a chain link tassel in its sealed form. Once released, the user was enveloped in a full body armor.\n\n ~! He died in battle, before his death at the hands of his former boss he entrusted the Incursio to Tatsumi.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/65235-KbSvHjKWY3z4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65235
      },
      "rarity": "uncommon"
    },
    {
      "id": "chelsea",
      "name": "Chelsea",
      "alt_names": [
        "チェルシー"
      ],
      "role": "supporting",
      "description": "A seasoned assassin working for the Revolutionary Army, having successfully carried out countless missions. While she is somewhat aloof and carefree when not on the job, she is also extremely objective and is often quite blunt when voicing her opinions.  Her Teigu, 'Gaea Foundation', is a cosmetics box that allows her to instantly change her appearance and build at will.\n\nLater in the series:\n~!she develops a crush on Tatsumi.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/65237-6r8wMUJ6pCOF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65237
      },
      "rarity": "uncommon"
    },
    {
      "id": "esdeath",
      "name": "Esdeath",
      "alt_names": [
        "エスデス",
        "Empire's Strongest General",
        "Ice Queen"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7)\n\nEsdeath is a high-ranking general of the Empire, and leader of the Jaegers. She enjoys torturing her enemies slowly, seen when she used her Teigu to put large blocks of ice in a cauldron so that the people inside would die slower and suffer more. Despite her sadistic actions, she is actually shown to have a compassionate heart when it comes to the lives of her men and others close to her. \nHer teigu is called Demons Extract, which allows her to manipulate ice and mold it from nothing.\n\n  ~!She is looking for love and although her expectations were high when she saw Tatsumi's skill, she smiled and fell in love with him instantly !~",
      "metadata": {
        "gender": "female",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65239-2S3t2vSyUew9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65239
      },
      "rarity": "uncommon"
    },
    {
      "id": "kurome",
      "name": "Kurome",
      "alt_names": [
        "クロメ"
      ],
      "role": "supporting",
      "description": "Kurome is a member of the Jaegers, and the younger sister of Akame. Like her sister, she has a big appetite and is often seen eating, usually candy. She stubbornly refuses to share her candy with even her comrades. Kurome wields an offensive Teigu like her sister, in the form of a sword named \"March of the Dead: Yatsuhusa\", which allows her to enslave up to 8 enemies killed with the Teigu. Also like her sister, she is extremely skilled in the art of the sword and assassination. ~!When she was a child, her parents had sold both Akame and her to the Empire.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65297-wz0HpmuUjolX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65297
      },
      "rarity": "uncommon"
    },
    {
      "id": "wave",
      "name": "Wave",
      "alt_names": [
        "ウェイブ"
      ],
      "role": "supporting",
      "description": "Wave is a member of the Jaegers who is very similar to Tatsumi. He is from a small town on the coast where he served in the Imperial Navy, and brought a massive bag full of seafood with him when he joined the Jaegers. Also similar to Tatsumi, he is often used for Comic Relief. When he first arrived at the meeting room for his new group, he first encountered Bors, who ignored him shyly until the rest of the crew showed up.  Like Tatsumi, Wave uses a sword in combat and has formidable skills. He Wields the Armor type Teigu, \" Grand Chariot \", which is a newer version of Incursio.  (Source: Akame ga Kill! Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n65555-3JyIFJNbFrZn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65555
      },
      "rarity": "uncommon"
    },
    {
      "id": "susanoo",
      "name": "Susanoo",
      "alt_names": [
        "スサノオ",
        "Suu"
      ],
      "role": "supporting",
      "description": "__Age:__ Approx. 1000\n__Faction:__ Night Raid\n__User:__ Najenda\n\nSusanoo is one of the new members of Night Raid that [Najenda](https://anilist.co/character/72267/Najenda) brought back with her from the Revolutionary Army HQ. He is a tall man with distinctive bull horns coming out of the sides of his head. He saves the members of Night Raid (except Tatsumi), who were all under the effects of a powerful poison created by Dr. Stylish. He is then caught in an explosion created by Stylish's exploding minions, and it is revealed that he is a Human Teigu, regenerating his lost limbs immediately.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65559-FZEHEfO374x9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65559
      },
      "rarity": "uncommon"
    },
    {
      "id": "bors",
      "name": "Bors",
      "alt_names": [
        "ボルス",
        "Bols"
      ],
      "role": "supporting",
      "description": "A member of Jaegars, he was formerly a member of the Incineration Squad. His Teigu is Rubicante, a flamethrower type Teigu. Despite his looks he is married to an attractive woman and has a child. He always wears a mask and tries to hide his face; yet  Esdese forcefully removes his mask at one point and claims there is nothing wrong with his face.   ~!He is killed by Chelsea while trying to retreat.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65793-xRWzkHVOKqd7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65793
      },
      "rarity": "uncommon"
    },
    {
      "id": "najenda",
      "name": "Najenda",
      "alt_names": [
        "ナジェンダ"
      ],
      "role": "supporting",
      "description": "Najenda, also known as The Hunk of the Rebellion is the head of the assassin group Night Raid. Taciturn, sharp-minded and level-headed, she leads the group with a surprisingly gentle but firm air. Her years of experience serving in the Empire as a general have made her a highly capable leader. Najenda is sometimes mistaken as a man due to her boyish appearance, even sometimes being nicknamed 'The Hunk of the Rebellion\" by her cohorts. She tends to have a habit of telling \"cold jokes\" and making bad puns. \n\nHer teigu is a biological type teigu named [Susanoo](https://anilist.co/character/65559/Susanoo)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72267-heLonNDtobAG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72267
      },
      "rarity": "uncommon"
    },
    {
      "id": "seryuu-ubiquitous",
      "name": "Seryuu Ubiquitous",
      "alt_names": [
        "セリュー・ユビキタス"
      ],
      "role": "supporting",
      "description": "Seryuu is a member of the Jaegers, formerly of the Imperial Guard. She has a strong fixation upon \"Justice\", originating from her father's service in the Emperial Army and subsequent death. She also highly respected Ogre the Demon, her superior and teacher, and was heavily anguished by his death as well.\n\nHer opinion of justice is blunt, she believes the Night Raid are evil for their actions as assassins, but believes killing in service to justice is always right, which ultimately makes her opinion of murder similar to theirs if not the complete same thing. However, Seryuu has a twisted sense of right and wrong, bordering on a completely black and white view of the world. All people who serve the empire, despite the deeds they do both publicly and not, are considered good by her, while those who oppose it, even those forced to against their will, are pure evil. Her twisted view of justice has caused a level of distrust towards her by her own teammates, as well as generally the entire emperial forces, on occasion, as she brutally murdered a group of prisoners long before they could interrogate the group.\n\n (Source: Akame ga Kill! Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/83405-JEbhNkj3bZkA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83405
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-25T01:53:27.103Z"
}