{
  "work_id": "ao-haru-ride",
  "count": 10,
  "characters": [
    {
      "id": "futaba-yoshioka",
      "name": "Futaba Yoshioka",
      "alt_names": [
        "吉岡双葉"
      ],
      "role": "protagonist",
      "description": "__Height:__ 160 cm  \n\n Futaba often shied away from boys, writing them off as crude, rough and vulgar all except the mild voiced- small built Kou. They shared a brief attraction to each other.   One day Kou suddenly moved away without any notice leaving behind a stunned Futaba.   Futaba's life took a drastic turn after Kou's departure - the other boys started to take notice of Futaba's flawless face, alienating her from the rest of the girls. They began to hate Futaba and blame her eventually exiling her altogether​. Now in high school, Futaba is determined to not be too girly in order to avoid a repetition of what happened in her middle school years. \n\n(Source: Ao Haru Ride wiki)",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b41025-X4hnr8jZG4vC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 41025
      },
      "rarity": "epic"
    },
    {
      "id": "kou-mabuchi",
      "name": "Kou Mabuchi",
      "alt_names": [
        "馬渕洸",
        "Kou Tanaka"
      ],
      "role": "protagonist",
      "description": "__Height:__ 176 cm (5'9\")\n\nKou was well liked in middle-school, he liked Futaba and they had a growing relationship, but then he suddenly moved away in the middle of the school year. His parents divorced and he now lives with his father (presumably he first lived with his mother after the divorce, but when starting high school he moved in with his father instead, for unknown reasons). Currently attending the same highschool as Futaba under a new last name (probably his mother's). He eventually admits to being \"Tanaka-kun\", and while acting cold and uncaring towards her most of the time, his nice side becomes gradually more prominent.\n\n(Source: Ao Haru Ride wiki)",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b41026-WkbhSjdpZISG.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 41026
      },
      "rarity": "epic"
    },
    {
      "id": "yuuri-makita",
      "name": "Yuuri Makita",
      "alt_names": [
        "槙田悠里"
      ],
      "role": "supporting",
      "description": "**Height:** 155 cm\n\nIntroduced in the first chapter, Yuuri's high school life is parallel to Futaba's middle school life. She is very cute, causing her to be despised by many girls in her class, and she is often left alone. Yuuri gets by very well, however, for she prefers to be hated for who she truly is than to be liked for someone she isn't. Yuuri and Futaba soon become best friends. She falls in love with Kou after he helps her during a class leader's camp. Yuuri greatly treasures her friendship with Futaba, but often gets jealous of Futaba's closeness with Kou.\n\n(Source: Ao Haru Ride wiki)",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43087-YKsDamxYeRo1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43087
      },
      "rarity": "uncommon"
    },
    {
      "id": "shuuko-murao",
      "name": "Shuuko Murao",
      "alt_names": [
        "村尾修子",
        "Shuu",
        "Lone Wolf"
      ],
      "role": "supporting",
      "description": "__Height__: 167 cm (5'6\")\n\nMuch like Yuuri, Shuuko is another \"lone wolf.\" She is very beautiful but has a cold exterior that drives others away. Due to experiences in middle school, Shuuko fails to trust girls. She has been in love with Tanaka-sensei, Kou's older brother, since her first year of high school after attending a guidance session between the two of them. Eventually, her trust in female relationships was restored after becoming friends with Futaba and Yuuri.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43088-Vrm5VEY5SqKN.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43088
      },
      "rarity": "uncommon"
    },
    {
      "id": "aya-kominato",
      "name": "Aya Kominato",
      "alt_names": [
        "小湊亜耶"
      ],
      "role": "supporting",
      "description": "__Height:__ 178cm (5'10\")\n\nOutgoing and spontaneous, Aya seems to be the only character without social problems. He is very open, caring, and sometimes even dense. He has an unrequited crush on Shuuko. Aya harbors a hatred for Tanaka-sensei, and initially did not like Kou due to his relation to him. He is good at Math.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43089-eiN8YhEhVFYQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43089
      },
      "rarity": "uncommon"
    },
    {
      "id": "youichi-tanaka",
      "name": "Youichi Tanaka",
      "alt_names": [
        "田中陽一",
        "Tanaka-sensei"
      ],
      "role": "supporting",
      "description": "__Height: __180 cm \n\nKou's older brother by eight years. He works as an English teacher at Futaba's high school. Futaba was initially interested in Youichi upon entering high school because he reminded her of Kou, but was unaware that the two were brothers. Youichi knows about Shuuko's crush on him but always rebuffs her advances, telling her that he will never see her as anything more than a student. However, he never hesitates to help her in times of need and is happy whenever he sees that she is fitting in. He enjoys a playful 'rivalry' with Aya over Shuuko. He often gives Futaba advice whenever she feels unsure about herself or about Kou.",
      "metadata": {
        "gender": "male",
        "age": "25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b49437-Lw8Yv9rw2RCo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 49437
      },
      "rarity": "uncommon"
    },
    {
      "id": "touma-kikuchi",
      "name": "Touma Kikuchi",
      "alt_names": [
        "冬馬",
        "GG-kun"
      ],
      "role": "supporting",
      "description": "__Height:__ 178.5 cm (5'10\")\n\nTouma is a boy in Futaba's year, making his first appearance in Chapter 12. He initially has a very bad impression of Futaba, during which she trips and ends up accidentally groping him. However, he eventually softens up to her when he notices how remorseful she feels about the incident. Due to his earnest appearance, his intentions after often misunderstood, usually causing Kou to get jealous over his interaction with Futaba. His friends call him \"Goodie-goodie\" and \"Hasabe\" due to his straight-laced and honest behavior. He has a piercing on his left ear and likes wombats.",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b58681-xgfP9JqWrO4C.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 58681
      },
      "rarity": "uncommon"
    },
    {
      "id": "yui-narumi",
      "name": "Yui Narumi",
      "alt_names": [],
      "role": "supporting",
      "description": "__Height:__ 157 cm (5'2\")\n\nNarumi is Kou's childhood friend. They share the same tragedy of divorced parents at a young age and losing a parent soon after. Narumi enters the story when Kou invites her to the school festival and sees how close Futaba and Kou are. She tries to keep Kou away from Futaba as much as possible.",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/67467.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 67467
      },
      "rarity": "uncommon"
    },
    {
      "id": "ren-ichinose",
      "name": "Ren Ichinose",
      "alt_names": [
        "一ノ瀬蓮"
      ],
      "role": "minor",
      "description": "__Height:__ 179 cm  \n\nRen Ichinose; wears glasses but prefers to wear contacts. He is currently dating Mayuka, who is Daiki's older sister. He later finds out that he is also in love with Ninako later on in the series. Mayuka understands Ren's feelings, and so they break up. Used to work at a cafe until he became aware of his feelings towards Ninako then switched to a gas station job.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23059-4wsYXmhMxKGa.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23059
      },
      "rarity": "common"
    },
    {
      "id": "ninako-kinoshita",
      "name": "Ninako Kinoshita",
      "alt_names": [
        "木下仁菜子"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/23127.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23127
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-24T14:29:30.655Z"
}