{
  "work_id": "second-life-ranker",
  "count": 11,
  "characters": [
    {
      "id": "yeon-woo-cha",
      "name": "Yeon-Woo Cha",
      "alt_names": [
        "차연우",
        "Cain"
      ],
      "role": "protagonist",
      "description": "__Height:__ 182 cm \n\nYeon-woo is the main protagonist of the Korean web Novel, Second Life Ranker. Prior to entering the tower, he served in the army and later on went to take on the revenge for his younger twin brother. Yeon-woo later reawakened as a 'Dragon Human' becoming a 'player' after receiving the powers from the pocket watch of [Jeon-woo](https://anilist.co/character/165469/JeongWoo-Cha). He continues to climb the tower taking revenge on those who betrayed his brother and killed him.\n\nHe is a hard-working and determined person who greatly cherishes his family. Yeon-Woo was different from his younger brother who did everything effortlessly. He often had to try over and over again to solve a problem, but he tried not to show the efforts he made, pretending he was doing fine. Unlike his younger brother who could be categorized as a natural genius, all his achievements all came from being a hard worker through which he was able to achieve results that are reflective of his effort.\n\nHowever, despite his rather advanced intellect and tactical genius, Yeon-Woo does indeed possess a childish side, where he was noted to possess a very bad sense of imagination when naming things and has a tendency of naming things with names usually though up by toddlers.\n\nThis is seen where he named the newborn Phoenix, \"Chirpy\" and when he obtained his Magical Dragon, he attempted to name it \"Growl\" and \"Roar\". Although initially thought to be him being insulting and condescending, it was later revealed that Yeoon genuinely did like those names despite their obvious childishness. This trait itself is seemingly shared with his niece, Sesha.\n\nLater after finding out about his niece, Sesha and his face being revealed to Brahm, Galliard, Phante and Edora, Yeon was noted to have begun becoming considerably warmer and less cynical due to finally opening up to others. Unlike before where he regarded them with a level of paranoia due to his brother's story, he has now begun to truly trust them.\n\n(Source: Second Life Ranking wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140547-8Oey7AgpfM8P.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140547
      },
      "rarity": "epic"
    },
    {
      "id": "jeong-woo-cha",
      "name": "Jeong-Woo Cha",
      "alt_names": [
        "차정우"
      ],
      "role": "supporting",
      "description": "Jeong-woo Cha is Yeon-woo Cha's younger twin brother. He was one of the strongest and the most famous high-ranker in the Tower before he was betrayed by his teammates leading to the events of the main story.\n\nJeong-woo was described by Yeon-woo as being a weak and introverted person who liked books, movies, and had a talent of not needing much work to succeed in most things. Furthermore, he also greatly valued his family, even leaving home in order to find a cure for his mother.\n\n(Source: Second Life Ranking wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b165469-RDIsp8lL0zuf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 165469
      },
      "rarity": "uncommon"
    },
    {
      "id": "edora",
      "name": "Edora",
      "alt_names": [
        "에도라"
      ],
      "role": "supporting",
      "description": "Edora is a member of the One Horn Tribe royal family. She is the daughter of the Martial King and the younger sister of [Phante](https://anilist.co/character/192568/Phante).\n\nUnlike her brother, Edora is calm and collected. She speaks politely and does not like to waste her time with anything unnecessary. In essence, she is cold towards most people. However, after meeting [Cain](https://anilist.co/character/140547/YeonWoo-Cha), she developed romantic feelings for him; she began to blush and feel embarrassed when someone refers to both of them having a relationship.\n\n(Source: Second Life Ranker wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b165471-rvODUwTDgcfI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 165471
      },
      "rarity": "uncommon"
    },
    {
      "id": "phante",
      "name": "Phante ",
      "alt_names": [
        "판트"
      ],
      "role": "supporting",
      "description": "Phante is a prince of the One-Horned Tribe and the one most likely to become the next King. He hails from the Cheonglam family with his mother being the tribe's current Psychic Medium.\n\n(Source: Second Life Ranker wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b192568-LVy6doGgn7VM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 192568
      },
      "rarity": "uncommon"
    },
    {
      "id": "nayu",
      "name": "Nayu",
      "alt_names": [
        "나유",
        "무왕 (Mu Wang)",
        "King Mu",
        "Walking Disaster",
        "Martial King"
      ],
      "role": "supporting",
      "description": "Nayu is the king of the One-Horned Tribe. He is commonly referred to as the Martial King and is one of the strongest people in the Tower. He is the only one among the Nine Kings that is capable of rivaling Summer Queen in individual might.\n\nHe is shown to possess a very care-free, mischievous and whimsical personality. Having become well known for being highly unpredictable in his actions by both his own Tribe's men and the other Rankers of the Tower. However despite his usually jovial disposition, Nayu has also shown the same immense blood-thirst, murderous intent and battle crazed craving as the rest of the One-Horned Tribe, a side of himself that he usually reveals in front of his enemies and his tribe's men in order to terrify or keep them in line.\n\nNayu as the Martial King was also shown to be highly intelligent and cunning when dealing with matters regarding the tribe's future, having been shown to be pragmatic and heartless enough to do the most dirties deeds in order to insure the tribe's prosperity and peace. \n\nHowever despite these traits, Nayu was shown to also have a very fatherly side to himself, as seen where he greatly enjoyed dotting and teasing his daughter Edora on her having successfully located a suitable marriage partner and was noted to be highly protective of her. Nayu was also shown to have a positive, but hard relationship with his son, Phante, having been known to constantly train him to increase his strength and was known to mercilessly beat him during training to increase his battle prowess. He however did show to have a kind side with him, as seen where he also enjoyed teasing his son similarly to his daughter. However despite him caring for his children, Nayu was also shown to have no hesitance in intimidating them and scaring them when they begin getting out of line, as seen with how he handled his son, Jang.\n\n(Source: Second Life Ranker wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b192564-0SvqPdaMocgI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 192564
      },
      "rarity": "uncommon"
    },
    {
      "id": "sesha",
      "name": "Sesha",
      "alt_names": [
        "세사",
        "Cha So-yeong",
        "BX-71"
      ],
      "role": "supporting",
      "description": "~!Sesha is the biological daughter of Cha Jeong-woo and Viera Dune, who had her in secret from her father to experiment and take advantage of her qualities as a quarter breed dragonborn. However, she was saved by Ananta and adopted by her and left in the care of Ananta's father, Brahm to protect her from her mother and her clan.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b301459-mc0EIpUtsVIY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 301459
      },
      "rarity": "uncommon"
    },
    {
      "id": "yvlke",
      "name": "Yvlke",
      "alt_names": [
        "Evilkega"
      ],
      "role": "supporting",
      "description": "Yvlke is the Floor Guardian of the Floor 0, in other words the floor guardian of the tutorial. However, he also holds a special position as one of the leaders of all the Floor Guardians.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b165468-7nUxRitLbYfF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 165468
      },
      "rarity": "uncommon"
    },
    {
      "id": "yul",
      "name": "Yul",
      "alt_names": [
        "율"
      ],
      "role": "supporting",
      "description": "Yul is a player that formerly climbed the Tower.\n\nHe is a determined boy. Although he is prone to cowering when bullied (like any boy his age), he is able to stand up for himself when he gets pushed too far.\n\n(Source: Second Life Ranker wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b192606-yhsKIkigiOnK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 192606
      },
      "rarity": "uncommon"
    },
    {
      "id": "doyle",
      "name": "Doyle",
      "alt_names": [
        "도일",
        "Foxy Tail"
      ],
      "role": "supporting",
      "description": "Doyle is one of the super rookies of the Tower. He was ranked 11th on the Tutorial's rankings before Yeon-woo Cha began his tutorial.\n\nHe is an extremely lazy young man such that he doesn't care about much outside of sleeping. He is also a clever guy but, due to his young age, he is still immature regarding certain matters.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b192630-i0YlFEVoIkJj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 192630
      },
      "rarity": "uncommon"
    },
    {
      "id": "leonte",
      "name": "Leonte",
      "alt_names": [
        "리언트",
        "Fist God"
      ],
      "role": "supporting",
      "description": "Leonte was a high-ranker of Cheonghwado. He was dubbed the Fist God and was one of the clan's five leaders. \n\nPreviously, he was a high-ranker and executive of Arthia, however, he defected to Cheonghwado when he realized that Arthia was bound to be destroyed, eventually. He was one of the five people that directly killed Cha Jeong-woo.\n\n(Source: Second Life Ranker wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b192567-wFqhBgctpjff.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 192567
      },
      "rarity": "uncommon"
    },
    {
      "id": "ismenios",
      "name": "Ismenios",
      "alt_names": [
        "이스메니오스",
        "The Summer Queen"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b297161-Cw0VabbZHa68.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 297161
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-25T07:05:39.378Z"
}