{
  "work_id": "attack-on-titan-season-3-part-2",
  "count": 50,
  "characters": [
    {
      "id": "eren-yeager",
      "name": "Eren Yeager",
      "alt_names": [
        "エレン・イェーガー",
        "Eren Jaeger",
        "Eren Jäger",
        "Suicidal Maniac",
        "Shi ni Isogi Yarou (死に急ぎ野郎)"
      ],
      "role": "protagonist",
      "description": "__Initial Height__: 170 cm (5'7\")\n__Affiliation:__ 104th Trainees Squad, Survey Corps. \n\nEren was born to Carla and Grisha Yeager in Shiganshina District within the southern region of Wall Maria. He grew up in the town with his parents and foster sister [Mikasa](https://anilist.co/character/40881), who moved in with the Yeagers as a child. Eren spent most of his time with Mikasa and their mutual best friend [Armin Arlert](https://anilist.co/character/46494), whom the pair often defended from neighborhood bullies.  \n\nEren is a passionate, determined, hardheaded, and impulsive young man. When they were children, Armin showed him a book depicting the wonders of the outside world. Eren grew to share Armin's curiosity of the world beyond the Walls and resolved to see it for himself. This dream inspired his admiration of the Survey Corps and his desire to join their ranks as soon as he became eligible for enrollment. \n\nWhen the Titans suddenly broke through Wall Maria into Shiganshina, Eren was forced to watch on as his mother became trapped under the rubble of their house and eaten by a titan. Forever changed from this event, Eren vows to kill every last titan.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40882-dsj7IP943WFF.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40882
      },
      "rarity": "legendary"
    },
    {
      "id": "mikasa-ackerman",
      "name": "Mikasa Ackerman",
      "alt_names": [
        "ミカサ・アッカーマン"
      ],
      "role": "protagonist",
      "description": "__Height:__ 170 cm (5'7\") - 176 cm (5'9½\")\n__Position:__ 104th Training Corps, Survey Corps\n__Relatives:__ [Birth Mother](https://anilist.co/character/84341/Mikasa-no-Haha) (Deceased), [Birth Father](https://anilist.co/character/84339/Mikasa-no-Chichi) (Deceased), [Grisha Yaeger](https://anilist.co/character/62477/Grisha-Yeager) (Foster Father), [Carla Yaeger](https://anilist.co/character/62475/Carla-Yeager) (Foster Mother, Deceased), [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) (Foster Brother)\n\nMikasa is Eren Yaeger's foster sister and mutual childhood friend of [Armin Arlert](https://anilist.co/character/46494), living with the two of them in Shiganshina District within the southern region of Wall Maria. \n\nWhen she was young, her parents were killed by human traffickers, and she was kidnapped. Eren discovered this and helped her escape her captors. Later, Eren gave her his scarf, which she constantly wears and shares an emotional attachment to. She was adopted by the Yaeger family soon after. Because of these past events, Mikasa shares an unbreakable bond with Eren and lives to protect him, constantly worrying for Eren's well-being. After the Titans broke through Wall Maria and killed her and Eren's mother, she chose to follow Eren into the military to try and keep him safe from danger. \n\nEven as a child, Mikasa possessed impressive fighting skill and strength, and that skill was only honed further during her training.  Mikasa is considered a genius among all the army trainees and is incredibly skilled at combat and agility, to the point that she was known as the greatest soldier among the 104th Training Corps and graduated in first place. Though being among the best of the best, she remains humble and refrains from displaying arrogance. Ultimately, Mikasa's loyalty remains with Eren no matter the circumstance, with her only true desire being to live a peaceful life with him.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40881-F3gr1PkreDvj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40881
      },
      "rarity": "legendary"
    },
    {
      "id": "armin-arlert",
      "name": "Armin Arlert",
      "alt_names": [
        "アルミン・アルレルト",
        "Armin Arlelt"
      ],
      "role": "protagonist",
      "description": "__Height:__ 163 cm (5'4\")\n__Position:__ 104th Trainees Squad, Survey Corps\n__Relatives:__ [Grandfather](https://anilist.co/character/84313/Armin-no-Ojiisan)\n\nArmin is a young boy who was born and raised in the Shiganshina District within the walls, being childhood friends with both [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) and [Mikasa Ackerman](https://anilist.co/character/40881). After Wall Maria was breached, he chose to join Mikasa and Eren in joining the military, both to try to make a good and meaningful impact on the world, and to fulfill his dream of seeing the outside world.\n\nEven when he was young, the naturally curious Armin has always had a deep fascination with the world beyond the Walls. As a child, he found and studied an illegal book about the outside world that was owned by his grandfather. He often shared the book and information contained in it with Eren Yeager, his best friend, and his dreams of seeing the world outside the walls. Armin was branded a heretic by other children for his unusual interest in the outside world and was thus frequently picked on. Too timid to defend himself, Armin would often rely on his friends Eren and Mikasa Ackerman to protect him from local bullies. This, coupled with his frail physique, was a deep shame for Armin, leading him to have poor self-esteem and to believe that he is a burden to others. Because of this, Armin has always been very eager to prove his worth, especially towards his close friends. \n\nArmin is known to be exceptionally loyal and selfless. He constantly worries for the safety of his friends, and he is always prepared to throw himself into dangerous situations to save them. Alongside his kindhearted nature and emotionally intelligence, Armin is a very analytical person. He likes to think deeply about situations and solve problems using his mind. These personality traits, in conjunction with his intelligence, good judgment, level headedness, ability to plan ahead, come up with creative ideas and to think outside the box, are what make him a great tactician. Although he may appear among the physically weakest of the 104th Training Corps, his incredible intelligence and strategic genius makes him an invaluable asset to any team.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46494-g7xYYuBtYPnO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46494
      },
      "rarity": "legendary"
    },
    {
      "id": "levi",
      "name": "Levi",
      "alt_names": [
        "リヴァイ",
        "Levi Heichou (リヴァイ兵長)",
        "Captain Levi",
        "Jinrui Saikyou no Heishi (人類最強の兵士)",
        "Humanity's Strongest Soldier",
        "Heishichou (兵士長)"
      ],
      "role": "protagonist",
      "description": "__Height:__ 160 cm (5'3\")\n\nSquad Captain of the Special Operations Squad (known as Squad Levi) within the Survey Corps. He is known as humanity's strongest soldier. \n\nLevi is abrasive, blunt, and has a strong respect for structure and discipline. He is a clean-freak, demanding spotless cleanliness of himself, his equipment, and his environment. Rumors say he was involved in underground crime in his life before coming a soldier. Despite his emotionless and unfriendly demeanor, Levi cares deeply for his squad and greatly values human life.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b45627-CR68RyZmddGG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 45627
      },
      "rarity": "legendary"
    },
    {
      "id": "erwin-smith",
      "name": "Erwin Smith",
      "alt_names": [
        "エルヴィン・スミス",
        "Eyebrow"
      ],
      "role": "protagonist",
      "description": "**Height:** 188 cm\n**Position:** 13th Commander, Survey Corps\n\nDiscerning, intelligent, and widely respected, Erwin is the unshakable and calculated 13th commander of the Survey Corps. While he cares deeply for his men, he does not hesitate to sacrifice them for the good and prosperity of mankind, and his men have proven more than willing to stake their lives at his order. Erwin developed the Long-Distance Enemy Scouting Formation.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46496-Mu86MENd5wNB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46496
      },
      "rarity": "legendary"
    },
    {
      "id": "reiner-braun",
      "name": "Reiner Braun",
      "alt_names": [
        "ライナー・ブラウン"
      ],
      "role": "supporting",
      "description": "__Height__: 185 cm (6'1\")\n\nMember of the Survey Corps and former cadet of the 104th Training Corps. Reiner is a passionate and strong-willed young man with a strong sense of duty. He ranked 2nd in his training class upon graduation, finishing behind only [Mikasa](https://anilist.co/character/40881). His comrades have great trust in him, and he is stated to be the \"big brother\" of the 104th cadets.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46484-P6A2GjNQn49F.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46484
      },
      "rarity": "epic"
    },
    {
      "id": "narrator",
      "name": "Narrator",
      "alt_names": [
        "ナレーター",
        "語り手",
        "ナレーション",
        "Narrador",
        "Rozprávač",
        "Vyprávěč",
        "Dış ses",
        "Narratore",
        "Pripovjedač",
        "Narradora",
        "Рассказчик",
        "Người dẫn chuyện",
        "Tagapagsalaysay",
        "내레이터",
        "Erzählperson",
        "מספר",
        "Narrátor",
        "讲述人",
        "راوي",
        "Forteller",
        "Berättare",
        "Αφηγητής",
        "Narrateur",
        "なれーしょん",
        "旁白",
        "Narrato"
      ],
      "role": "supporting",
      "description": "This character page is set to represent and list all narrators, which haven't been given a visual representation of themselves in their respective work. \n\nPlease add other narrator characters, which were given a visual representation of themselves, separately from this narrator page.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36309-6KM0riV4lqfN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36309
      },
      "rarity": "epic"
    },
    {
      "id": "sasha-blouse",
      "name": "Sasha Blouse",
      "alt_names": [
        "サシャ・ブラウス",
        "Sasha Braus",
        "Imo Onna (芋女)",
        "Potato Girl"
      ],
      "role": "supporting",
      "description": "__Initial Height:__ 168cm\n__Affiliations__: 104th Cadet Corps, Survey Corps; Soldier\n__Relatives__: [Artur Blouse](https://anilist.co/character/131281/Artur-Blouse) (Father), [Lisa Blouse](https://anilist.co/character/134952/Lisa-Blouse) (Mother)\n\nOriginally from Dauper, a remote and scarcely populated village of hunters located in a mountain forest in the southern area of Wall Rose, Sasha joined the military as a cadet of the 104th Training Corps, where she ranked 9th upon graduation. After graduating, she'd choose to enlist in the Scouting Regiment. \n\nSasha is a friendly and fun-loving girl. She speaks with a local accent from her home village, but initially hid it out of embarrassment by using overly formal and polite speech. She is a constant food hoarder and is known to have an incredible appetite; eating provided her with considerable gratification and relief, especially during times of great stress, and food was often the only thing on her mind when at ease. Raised as an animal hunter, Sasha specializes in archery, horseback riding, and tracking, although her eccentricity and unconventional methods tend to make her a poor fit for group operations.\n\n~!She later saves a child named [Kaya](https://anilist.co/character/132738/Kaya) from a titan attack, who her family ends up adopting.!~",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b45887-QPtJH0KwqthW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 45887
      },
      "rarity": "epic"
    },
    {
      "id": "connie-springer",
      "name": "Connie Springer",
      "alt_names": [
        "コニー・スプリンガー",
        "Conny"
      ],
      "role": "supporting",
      "description": "__Height__: 158 cm (5'2\")  \n__Relatives:__ [Mother](https://anilist.co/character/137287/Conny-no-Haha), Martin Springer (Brother), Sunny Springer (Sister)\n\nConnie Springer is a graduate of the 104th Training Corps, having ranked 8th in class. He is known to be one of the quickest soldiers while using ODM gear and is skilled at making very sharp turns. He hails from the rural Ragako Village within Wall Rose, his greatest ambition being to make his family and village proud of him. Upon graduation, he chose to join the Survey Corps. \n\nUpbeat and naive, Connie is rather unfocused outside of combat, and enjoys goofing around and messing with his friends, but can also be a bit dense at times, as he can have some difficulty comprehending new developments as they appear. Connie always tries to remain optimistic, consistently caring for the well-being of his friends, family and village, and being willing to help in any way he can. However, this soft spot and the struggles he goes through as a member of the Survey Corps takes a toll on him, as he often responds to grief and loss with anger, irritation and hatred, causing him to at times make rash, impulsive decisions. He will do anything to protect his family, whether it be his biological family or his closest friends.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n46486-izhPjzut6WCZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46486
      },
      "rarity": "epic"
    },
    {
      "id": "bertolt-hoover",
      "name": "Bertolt Hoover",
      "alt_names": [
        "ベルトルト・フーバー",
        "Bertholdt"
      ],
      "role": "supporting",
      "description": "__Height__: 192 cm (6'3\")  \n__Affiliation__: Survey Corps\n\nMember of the Survey Corps and former cadet of the 104th Training Corps. Bertoldt ranked 3rd in his training class upon graduation, finishing behind only [Mikasa](https://anilist.co/character/40881) and his hometown friend [Reiner](https://anilist.co/character/46484). He is a quiet young man who identifies himself as someone with a weak will that follows popular opinion. Despite ranking 3rd in his class, his training commandant noted him to be a person with great potential, but an utter lack of initiative. Bertoldt originally he enlisted in the military with aspirations of joining the Military Police and living in the safety of the inner wall, but after the Battle of Trost he instead decided to join the Survey Corps.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46488-wm6HvkdkHoZu.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46488
      },
      "rarity": "epic"
    },
    {
      "id": "annie-leonhart",
      "name": "Annie Leonhart",
      "alt_names": [
        "アニ・レオンハート"
      ],
      "role": "supporting",
      "description": "__Height__: 153 cm (5\")  \n\nA member of the 104th Southern Division in the Cadet Corps. After graduating from the 104th, ranked 4th place in the top 10, she ends up joining the Military Police. She is roommates with [Hitch Dreyse](https://anilist.co/character/86017).\n\nA stoic girl, Annie is considered to be an isolated, solitary type, being rarely seen smiling or socializing and often having an emotionless expression. She is apathetic and somnolent, with little desire to put in any effort into meaningless disciplines or activities. Nonetheless, what drives Annie more than anything is her desire for a normal life.",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46490-tan274Ifc1Jf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46490
      },
      "rarity": "epic"
    },
    {
      "id": "jean-kirstein",
      "name": "Jean Kirstein",
      "alt_names": [
        "ジャン・キルシュタイン",
        "Jean Kirschtein",
        "Jeanie",
        "Horse Face"
      ],
      "role": "supporting",
      "description": "__Height__: 175 cm (5'8\")\n__Relatives__: [Mother](https://anilist.co/character/131444/Jean-no-Haha)\n\nJean Kirschtein is a graduate of the 104th Cadet Corps, among whom he ranked 6th for his skills with ODM gear and ability to look at things through a more tactical lense. Jean hails from Wall Rose's Trost District, and joined the military with hopes of living a peaceful life within the walls as part of the Military Police. However, he would later find himself joining the Survey Corps after being convinced both by his close friend [Marco Bott's](https://anilist.co/character/62479/Marco-Bott) words, and after witnessing the death of several of his comrades.\n\nJean has a blunt personality. He holds no restraint when it comes to speaking his mind, even when he knows it would not be wise to do so or when it could spark conflict. Jean is also pragmatic: he has a strong aversion to exposing himself to dangerous situations. During his time as a cadet, Jean was extremely hot-headed, easily becoming frustrated and quick to resort to violence when pushed. Jean was also very cynical about defeating the Titans, believing that humanity has no chance against them and openly mocking more idealistic individuals like [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager), and saw resisting the Titans as a hopeless cause. However, despite these things, and although he presents himself as self-centered, Jean places high value on the lives of his comrades, and is willing to risk his life to prevent countless more deaths from his comrades. Even with his shortcomings, Jean has shown himself to be a natural leader, being able to understand others and assess situations well because of his flaws, and proves capable of leading his fellow soldiers when they are left confused and without a plan.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46498-ritqAj9FW6jX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46498
      },
      "rarity": "epic"
    },
    {
      "id": "carla-yeager",
      "name": "Carla Yeager",
      "alt_names": [
        "カルラ・イェーガー"
      ],
      "role": "supporting",
      "description": "Eren's mother.   ~!She's eaten alive in the second chapter.!~ Note: Carla Yeager is the official English translation by Kodansha.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n62475-CExspVnLfweu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62475
      },
      "rarity": "epic"
    },
    {
      "id": "grisha-yeager",
      "name": "Grisha Yeager",
      "alt_names": [
        "グリシャ・イェーガー",
        "Grisha Jaeger"
      ],
      "role": "supporting",
      "description": "Father of [Eren Yaeger](https://anilist.co/character/40882/Eren-Yeager) and caretaker of [Mikasa Ackerman](https://anilist.co/character/40881/Mikasa-Ackerman). He is a renowned doctor who was well respected in the District of Shiganshina after he saved the village from a mysterious viral epidemic by developing vaccines. He also provides a medical house call service to the people of Shiganshina and to various towns in addition to having a network of contacts within the Corps of the Shiganshina District. He is married to [Carla Yaeger](https://anilist.co/character/62475).\n\n~!In the basement of the Yeager family house, he hides a secret which he refers to as the \"truth\". Upon finding Eren after the fall of Wall Maria, he injects him with a series of chemicals and amnesiacs and entrusts him with the key to the \"truth\", before mysteriously disappearing. This strange serum resulted in Eren gaining the ability to transform into a titan.!~",
      "metadata": {
        "gender": "male",
        "age": "39",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62477-3AHBGul9bXK8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62477
      },
      "rarity": "epic"
    },
    {
      "id": "marco-bott",
      "name": "Marco Bott",
      "alt_names": [
        "マルコ・ボット",
        "Marco Bodt"
      ],
      "role": "supporting",
      "description": "__Height__: 178 cm (5'9\")\n__Affiliations__: 104th Training Corps\n\nOriginally from Jinae District. Marco ranked 7th in the 104th Training Corps and is widely respected by other cadets of the 104th. Marco is a very kind, calm, and idealistic person, valuing the good of the group above his own interests, as well as understanding and coping with his own shortcomings and limitations. He is seen as a natural leader, and desires to join the Military Police to serve near the King. \n\n*Note: Marco Bott is the official English translation by Kodansha.*",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62479-mYcTkU1RXymL.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62479
      },
      "rarity": "epic"
    },
    {
      "id": "krista-lenz",
      "name": "Krista Lenz",
      "alt_names": [
        "クリスタ・レンズ",
        "Christa",
        "Cattle-Taming Goddess"
      ],
      "role": "supporting",
      "description": "__Height__: 145 cm (4'8\")\n__Affiliations__: 104th Trainees Squad, Survey Corps\n\nRanked tenth in the trainee class, Krista is a very shy and kind, caring person, often being described as a \"goddess\" or \"angel\" by her peers. She is good friends with [Ymir](https://anilist.co/character/71479/Ymir).",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62481-ZZDa7vn17lMU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62481
      },
      "rarity": "epic"
    },
    {
      "id": "dot-pixis",
      "name": "Dot Pixis",
      "alt_names": [
        "ドット・ピクシス",
        "Dot Pyxis",
        "Commander Pyxis"
      ],
      "role": "supporting",
      "description": "The highest-ranked Administrator of the Southern Region. Head of the Garrison's Southern Territories, Pixis is a cunning leader with astute insights. However, he is also an alcoholic who is constantly watched over by his aid, [Anka](https://anilist.co/character/84331/Anka-Rheinberger), who constantly scolds him for sleeping and drinking during critical moments.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62485-I0U5Cat3z65K.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62485
      },
      "rarity": "epic"
    },
    {
      "id": "hange-zoe",
      "name": "Hange Zoe",
      "alt_names": [
        "ハンジ・ゾエ",
        "Hange Zoë",
        "Hanji",
        "Hans"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7\")\n__Affiliation:__ Survey Corps; Section Commander, Squad Leader.\n\nLeader of the Survey Corps' Fourth Squad, Hange is also in charge of conducting research on Titans, and pursues this knowledge so passionately that they have become obsessed with Titans as a result. After originally holding a deep hatred for the creatures, Hange decided to take on a new outside-the-box approach to their research by letting go of their resentment towards Titans and approaching the test subjects with compassion. \n\nHange is an energetic, freethinking and quirky scientist, with a unique way of conducting both themselves and their work. Hange is a genius outside of just Titan research too, using their brain to create weapons, tactical plans, and inventions for the benefit of humanity. As a leader, Hange is thoughtful of their comrades, and can easily figure out complex problems in order to create plans for their teammates to carry out.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71121-7R7CnQd3lHgt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71121
      },
      "rarity": "epic"
    },
    {
      "id": "nile-dok",
      "name": "Nile Dok",
      "alt_names": [
        "ナイル・ドーク"
      ],
      "role": "supporting",
      "description": "Chief of the Military Police.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71123-FswK9rrdbR9h.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71123
      },
      "rarity": "epic"
    },
    {
      "id": "darius-zackly",
      "name": "Darius Zackly",
      "alt_names": [
        "ダリス・ザックレー"
      ],
      "role": "supporting",
      "description": "The head of all three divisions of the army.   \n\n__ _Note:___ Darius Zackly is the official English translation by Kodansha.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71125-XXymqijVoYzV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71125
      },
      "rarity": "epic"
    },
    {
      "id": "marlo-freudenberg",
      "name": "Marlo Freudenberg",
      "alt_names": [
        "マルロ・フロイデンベルク"
      ],
      "role": "supporting",
      "description": "__Affiliations:__ Military Police, 104th Cadet Corps.\n\nRecruit of the Military Police stationed in Stohess District.\n\nWhile most who join the Military Police Regiment do so because they want a safe position far from the danger of the Titans, Marlo did so because he claims to want \"to uphold justice and do what's right.\", much to the amusement of his fellow officer, [Hitch Dreyse](https://anilist.co/character/86017/Hitch-Dreyse), whom he often clashes with due to them being near complete opposites. His goal is to rise to the top of the organization so he can stop the pilfering of taxes and misappropriation of land. Though steadfast in his idealism, he could make moral compromises to achieve his goal, confessing a willingness to act like \"scum\" in order to move up in rank. Due to his passion towards his ideals, he had often been compared to [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) by people who know both of them.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71457-7H5bMZezo4ze.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71457
      },
      "rarity": "epic"
    },
    {
      "id": "ymir",
      "name": "Ymir",
      "alt_names": [
        "ユミル",
        "Freckles",
        "Freckles Ymir"
      ],
      "role": "supporting",
      "description": "__Height:__ 172 cm (5'7\")\n__Affiliations:__ 104th Trainees Squad, Scouting Legion\n\nMember of the Scouting Legion. She seems selfish, cynical, bossy, sly, uncooperative, exploitative, and confrontational, but she can apparently be kind, especially to [Krista](https://anilist.co/character/62481/Krista-Lenz).",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71479-huCD908XIdqv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71479
      },
      "rarity": "epic"
    },
    {
      "id": "gustav",
      "name": "Gustav",
      "alt_names": [
        "グスタフ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84329-vLIxfAIYGPug.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84329
      },
      "rarity": "epic"
    },
    {
      "id": "anka-rheinberger",
      "name": "Anka Rheinberger",
      "alt_names": [
        "アンカ・ラインベルガー"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84331-9r0TU5kEFitO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84331
      },
      "rarity": "epic"
    },
    {
      "id": "hitch-dreyse",
      "name": "Hitch Dreyse",
      "alt_names": [
        "ヒッチ・ドリス"
      ],
      "role": "supporting",
      "description": "**Height:** 168 cm\n__Affiliations:__ 104th Cadet Corps.\n\nRecruit of the Military Police stationed in Stohess District. She was roommates with [Annie Leonhart](https://anilist.co/character/46490/Annie-Leonhart).\n\nHitch acts immature in certain ways, she has a sarcastic, easygoing personality and seems to mischievously enjoy teasing and needling her fellow officers, especially [Marlo Freudenberg](https://anilist.co/character/71457/Marlo-Freudenberg). She claims she chose to join the Military Police out of laziness, as it is well known that the senior staff are incredibly corrupt and she wanted to benefit from the system herself; however, she did not take into account that, as a new recruit, her superiors would dump all their work on her. Though she may act a bit air-headed at times, Hitch is not selfish and cares about those around her, especially her fellow comrades.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b86017-m6vXFRKWMwUo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86017
      },
      "rarity": "epic"
    },
    {
      "id": "zeke",
      "name": "Zeke",
      "alt_names": [
        "ジーク"
      ],
      "role": "supporting",
      "description": "__Height__: 183 cm\n\nZeke is the current inheritor of the Beast Titan, and is considered by [Reiner Braun](https://anilist.co/character/46484/Reiner-Braun) to be the strongest Warrior, contrasting [Levi's](https://anilist.co/character/45627/Levi) title of \"humanity's strongest soldier\".",
      "metadata": {
        "gender": "male",
        "age": "25-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125661-FiqFvAtNlL0v.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125661
      },
      "rarity": "epic"
    },
    {
      "id": "flagel-reeves",
      "name": "Flagel  Reeves",
      "alt_names": [
        "フレーゲル・リーブス "
      ],
      "role": "supporting",
      "description": "Flegel Reeves is the son of Dimo Reeves",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n127569-75UhiY7kpILW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127569
      },
      "rarity": "epic"
    },
    {
      "id": "moblit-berner",
      "name": "Moblit Berner",
      "alt_names": [
        "モブリット・バーナー"
      ],
      "role": "supporting",
      "description": "__Height:__ 176 cm (5'9\")\n__Affiliation:__ Survey Corps; Executive Officer, Fourth Squad.\n\nA veteran member of the Survey Corps and [Hange Zoe](https://anilist.co/character/71121/Hange-Zoe)'s second-in-command within the Survey Corps' Fourth Squad. He also serves as Hanji's assistant and messenger.\n\nHe comes across as an intelligent and responsible person, which may be the reason he was tasked to keep his overzealous and eccentric superior out of trouble. Much of the time, this leaves him in a state of near-panic, having to constantly remind Hange to be more careful or yanking them to safety. That he remains at Hange's side constantly suggests he is a loyal person, and that he cares deeply for his superior's safety, regardless of the stress involved with being under their command. He is also able to show signs of a serious nature when it comes to missions, going out of his way to investigate problems and put himself in danger before others.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n127573-VSYSvQ1VK1c7.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127573
      },
      "rarity": "epic"
    },
    {
      "id": "floch-forster",
      "name": "Floch Forster",
      "alt_names": [
        "フロック・フォルスター"
      ],
      "role": "supporting",
      "description": "Floch is a new recruit in the Survey Corps. He joined the Survey Corps during the two months between the attack at Orvud District and the return to Shiganshina District.\n\n~!After the rest of the Yeagerists are killed during the port battle, Floch hides on the ship to Marley. After shooting holes in the fuel tank of the flying boat, Floch is ultimately killed by Mikasa.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127703-qNIccR0yPZKu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127703
      },
      "rarity": "epic"
    },
    {
      "id": "harold",
      "name": "Harold",
      "alt_names": [
        "ハロルド"
      ],
      "role": "supporting",
      "description": "A team leader in the Scout Regiment.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130631-IbIEQ4cqGAdW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130631
      },
      "rarity": "epic"
    },
    {
      "id": "dirk",
      "name": "Dirk",
      "alt_names": [
        "ディルク"
      ],
      "role": "supporting",
      "description": "A member of the Scout Regiment and a team leader during the mission to reclaim Wall Maria.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130635-YZUqeuGi0eAG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130635
      },
      "rarity": "epic"
    },
    {
      "id": "roy",
      "name": "Roy",
      "alt_names": [
        "ロイ"
      ],
      "role": "supporting",
      "description": "As a veteran journalist, Roy has come to accept and conform to the restrictive nature of the monarchy, fearing retaliation for defiance.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130636-vO0Kv5crIyeD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130636
      },
      "rarity": "epic"
    },
    {
      "id": "pierre",
      "name": "Pierre",
      "alt_names": [
        "ピュレ"
      ],
      "role": "supporting",
      "description": "As a rookie reporter, Pierre has not yet become jaded like his superior Roy. He is very bold in his reporting, unafraid of asking questions of Military Police officers that would otherwise be considered \"off-limits.\" He takes his job of reporting the truth very seriously, becoming frustrated when he is kept from printing news that would be scandalous for the government.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130637-MHrUGfiFvMKZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130637
      },
      "rarity": "epic"
    },
    {
      "id": "klaus",
      "name": "Klaus",
      "alt_names": [
        "クラース"
      ],
      "role": "supporting",
      "description": "A member of the Scout Regiment and a team leader during the mission to retake Wall Maria.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130638-sAsP8fjERkJ1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130638
      },
      "rarity": "epic"
    },
    {
      "id": "marlene",
      "name": "Marlene",
      "alt_names": [
        "マレーネ"
      ],
      "role": "supporting",
      "description": "A member of the Scout Regiment and a team leader during the mission to reclaim Wall Maria.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130639-Rs1VbE0r4hbM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130639
      },
      "rarity": "epic"
    },
    {
      "id": "eren-krueger",
      "name": "Eren Krueger",
      "alt_names": [
        "エレン・クルーガー",
        "The Owl"
      ],
      "role": "supporting",
      "description": "Eren Kruger was an Eldian spy posing as a Marleyan officer in the Public Security Authorities. He founded the Eldia Restorationists, and used the pseudonym the Owl (フクロウ Fukurō) to communicate. Secretly, he possessed the power of the Attack Titan.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131440-ynAPKMtrhhj1.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131440
      },
      "rarity": "epic"
    },
    {
      "id": "fay-yeager",
      "name": "Fay Yeager",
      "alt_names": [
        "フェイ・イェーガー"
      ],
      "role": "supporting",
      "description": "Fay was the younger sister of Grisha Yeager and as an Eldian, she grew up in the Liberio Internment Zone in Marley. \n~!At a young age, she was said to be killed by Marley officers dogs.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b133214-iwb6wK8IhVEn.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133214
      },
      "rarity": "epic"
    },
    {
      "id": "dina-fritz",
      "name": "Dina Fritz",
      "alt_names": [
        "ダイナ・フリッツ"
      ],
      "role": "supporting",
      "description": "~!Dina is the first wife of Grisha Yeager. One year after their marriage, she gave birth to their son, Zeke Yeager.\n\nDina is of royal blood as member of the Fritz family. When the 145th Fritz King built the walls and decided to move to the island Paradis, her branch of the Fritz family stayed behind due to disagreements with the King's choice. She joined the Eldia Restorationists on Marley, in order to revive the pride and power of Eldia. In this group, she also met Grisha Yeager, whom she eventually married. She gave birth to their son, Zeke Yeager. At the age of 7, there son reported his parents to the Marley government. As a result, all the Eldia Restorationists were sent to Utopia. Sergeant Major Gross injected Dina with the Titan serum and she was thrown off the Borderline wall to Utopia, as Grisha, in horror, watched his wife turn into a Titan.!~\n\n~!After the Colossus Titan breaches Shiganshina District in Wall Maria, many Titans proceed inside and among them is Dina. She embarks inside the town and is seen by Eren and Mikasa as they try to free Carla Yeager, who is trapped under the debris of their house. Though Hannes initially comes to their aid and decides to face Dina, he stands catatonic in fear of her frightening appearance. After he realizes that he is too afraid to face it, he opts to instead take Eren and Mikasa to safety, leaving Eren's mother behind. Afterwards, Eren witnesses Dina pull Carla out of the debris, as it proceeds to violently incapacitate her and devour her shortly thereafter.!~\n\n~!Five years later, after Eren had already joined the Survey Corps, Dina appears again before Eren and Mikasa outside the Titan Forest during the military's pursuit of the Armored Titan. After killing Hannes, who was protecting Eren and Mikasa before he was devoured, the Titan reaches out for Eren, who punches its hand. This activates powers Eren was previously unaware of, and seemingly gains control over the surrounding Titans. The ones that are under his control proceed to kill Dina by ripping her to shreds and devouring her, avenging the deaths of Carla and Hannes.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b133215-ifxjiTHsEGNl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133215
      },
      "rarity": "epic"
    },
    {
      "id": "gross",
      "name": "Gross",
      "alt_names": [
        "グロス"
      ],
      "role": "supporting",
      "description": "Gross was a Marleyan Sergeant Major.\n\n~!When Grisha Yeager and his little sister Fay wandered outside of their Liberio Internment Zone without an exit permit to see a blimp, Gross and his fellow soldier were slacking off by the riverside and they spotted and caught them. Kruger delivered physical punishment to Grisha while Gross walked away with Fay. However, her mutilated body was found the next day in the river and Gross, accompanied with Kruger went to the Yeagers' house and informed them of the death of their daughter. Gross claimed that he took Fay to the border of Liberio and that it was her own fault for wandering around town without permission to begin with. He later revealed to Grisha that it was education when he fed his little sister to his sons' dogs and thanks to that, they grew up to be fine young men.!~\n\n~!Kruger pushes Gross off the Utopia wall, the Titan he just turned for Grisha, grabbed him and started eating at his face and he is killed.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b133217-5SjFoq6mKxmg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133217
      },
      "rarity": "epic"
    },
    {
      "id": "sandra",
      "name": "Sandra",
      "alt_names": [
        "サンドラ"
      ],
      "role": "supporting",
      "description": "She is a recruit  of the Survey Corps. She joined at some point after the crowning of Historia Reiss during the two months between the attack at Orvud District and the expedition returning to Shiganshina District, where she was assigned to Squad Klaus.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137143-FCDwN1ORNGsa.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137143
      },
      "rarity": "epic"
    },
    {
      "id": "gordon",
      "name": "Gordon",
      "alt_names": [
        "ゴードン"
      ],
      "role": "supporting",
      "description": "He is a recruit of the Scout Regiment. He joined the regiment after the crowning of Historia Reiss.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b139759-QQmi6ItQfHQI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 139759
      },
      "rarity": "epic"
    },
    {
      "id": "grice",
      "name": "Grice",
      "alt_names": [
        "グライス"
      ],
      "role": "supporting",
      "description": "He is a member of the Restorationists.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140764-HbMgfmYGSPFl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140764
      },
      "rarity": "epic"
    },
    {
      "id": "grisha-no-chichi-yeager",
      "name": "Grisha no Chichi Yeager",
      "alt_names": [
        "グリシャの父・イェーガー",
        "Grisha's Father Yeager",
        "Mr. Yeager"
      ],
      "role": "supporting",
      "description": "He is the father of [Fay](https://anilist.co/character/133214/) and [Grisha Yeager](https://anilist.co/character/62477/), as well as the grandfather of [Eren Yeager](https://anilist.co/character/40882/).",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140765-zkWt0zw1App6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140765
      },
      "rarity": "epic"
    },
    {
      "id": "grisha-no-haha-yeager",
      "name": "Grisha no Haha Yeager",
      "alt_names": [
        "グリシャの母・イェーガー",
        "Grisha's Mother Yeager"
      ],
      "role": "supporting",
      "description": "She is the mother of [Fay](https://anilist.co/character/133214/) and [Grisha Yeager](https://anilist.co/character/62477/), as well as the grandmother of [Eren Yeager](https://anilist.co/character/40882/).",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140851-gwlhPSYXcMVh.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140851
      },
      "rarity": "epic"
    },
    {
      "id": "tom-ksaver",
      "name": "Tom Ksaver",
      "alt_names": [
        "トム・クサヴァー",
        "Xaver"
      ],
      "role": "supporting",
      "description": "He is a man who knew Grisha Jaeger when he was growing up.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140852-TdGBEPLEJ2Mr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140852
      },
      "rarity": "epic"
    },
    {
      "id": "mitsumete-no-kyojin",
      "name": "Mitsumete no Kyojin",
      "alt_names": [
        "見つめての巨人",
        "Peering Titan"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140903-arzkiU9S48ZZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140903
      },
      "rarity": "epic"
    },
    {
      "id": "rod-reiss",
      "name": "Rod Reiss",
      "alt_names": [
        "ロッド・レイス"
      ],
      "role": "minor",
      "description": "~!is the true king of humanity, currently masquerading as a noble living in Wall Sina. He is a member of the Reiss family and Historia's illegitimate father.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/127360-UgSpq6e0DAYz.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127360
      },
      "rarity": "epic"
    },
    {
      "id": "kenny-ackerman",
      "name": "Kenny Ackerman",
      "alt_names": [
        "ケニー・アッカーマン",
        "Kenny the Ripper"
      ],
      "role": "minor",
      "description": "__Affiliation:__ Military Police; Captain of Anti-Personnel Control Squad.\n__Relatives:__ [Kuchel Ackerman](https://anilist.co/character/127940/Kuchel-Ackerman) (Sister), [Unnamed Grandfather](https://anilist.co/character/128589/Kenny-no-Ojiisan), \n\nKenny Ackerman is a member of the Military Police Brigade's First Interior Squad and also the Anti-Personnel Control Squad. Decades prior, however, Kenny was known as an infamous serial killer that stalked victims in the capitol. \n\nDespite his dark field of work, Kenny appears to be rather jovial and takes pleasure in taunting his adversaries during battle. When fighting, he becomes animated and lively, often making a scene or otherwise throwing insults and witticisms. However, he also fought with control and was able to effortlessly sneak up on his targets when they least expected him. His preferred method of killing during his time as a serial killer was to slit the throats of his victims which earned him his infamous handle \"Kenny the Ripper\", and it was rumored that he murdered over 100 members of the Military Police Brigade. However, decades later his killings ceased and the terror that he once inspired dwindled into an Urban Legend. He eventually was found working under the Royal Government, the reasoning for his sudden shift in behavior being a mystery. Kenny is ultimately, despite his comical personality, very cold and calculated, sparing little emotional attachment or loyalty to anyone, with only a few exceptions.\n\n~!ㅤ\nHe notably shares the same bloodline as both [Levi](https://anilist.co/character/45627/Levi) and [Mikasa Ackerman](https://anilist.co/character/40881/Mikasa-Ackerman).!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/127443-aVMXGOchpsvj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127443
      },
      "rarity": "epic"
    },
    {
      "id": "uri-reiss",
      "name": "Uri Reiss",
      "alt_names": [
        "ウーリ・レイス"
      ],
      "role": "minor",
      "description": "the younger brother of Rod Reiss and the paternal uncle of Frieda Reiss.\n~!He was the true king of the Walls for some time until the year 842 and was Kenny Ackermann's best friend. He inherited the Founding Titan from his father, and passed it along with the crown to his niece, Frieda Reiss.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/127570-b7zpa6DSq2iA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127570
      },
      "rarity": "epic"
    },
    {
      "id": "frieda-reiss",
      "name": "Frieda Reiss",
      "alt_names": [
        "フリーダ・レイス"
      ],
      "role": "minor",
      "description": "Frieda was Rod Reiss' eldest daughter and Historia's oldest half-sister. ~!She was the true queen of humanity from 842 to 845. She is known to appear in Eren and Historia's obtained memories. In his Titan form, Grisha invaded an underground cavern under the Reiss family chapel, where the family had gathered to pray. He battled Frieda and consumed her, thus gaining her powers and memories. He then slaughtered her mother and siblings, and finally destroyed the chapel. When Eren later eats Grisha, Frieda's memories are transferred to him along with Grisha's.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n127624-mmQqGCYRW69r.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127624
      },
      "rarity": "epic"
    }
  ],
  "updated_at": "2025-12-23T00:08:16.970Z"
}