{
  "work_id": "jojos-bizarre-adventure-part-1-phantom-blood",
  "count": 15,
  "characters": [
    {
      "id": "dio-brando",
      "name": "Dio Brando",
      "alt_names": [
        "ディオ・ブランドー"
      ],
      "role": "protagonist",
      "description": "__Height:__ 195 cm (6'5\")\n__Race:__ Human (formerly), Vampire (onwards)\n__Nationality:__ British\n\nDio is an immortal vampire and the arch rival of the Joestar clan.\n \n__Series 1: Phantom Blood__ \n~!Dio is the son of Dario Brando, an alcoholic and abusive father. Back when Dio was just a boy, he was brought into the household of George Joestar after the mysterious death of his father, so as to repay the debt he owed Dio's father for saving his life. But soon Dio's personality caused trouble for George's young son, Jonathan Joestar. Even more of a sociopath than his father, Dio was resolute to shatter Jonathan's spirit and take his place as the favored son, even going so far as to arrange for Jonathan's dog Danny to be burned to death. Initially, Dio is able earn the trust of the patriarch of the Joestar family through deceit (and at Jonathan's expense). However, his plans of taking over the Joestar household were discovered by Jonathan when he discovered that not only had Dio poisoned his biological father to death, he was doing the same to his adoptive father, all to take the Joestar estate for his own.  Determined not to be stopped, and understanding the potential to enjoy power over all things instead of just the Joestar estate, Dio wears and activates the Stone Mask, becoming a nearly unstoppable vampire. His gains supernatural abilities such as being able to walk on walls, and regenerating his body faster than fire can consume it. He is able to create two fluid jets from his eyes powerful enough to slice stone and kill living things. He is also able to vaporize his body fluid rapidly enough to freeze anything he touches. However, this is at the expense of having his body be sustained by sheer willpower alone, rather than vital energy. A sufficiently powerful vital force--specifically, sunlight or the Hamon force--will negate the sustaining force's presence and disintegrate the long-unliving body. Like all Jojo vampires, Dio sucks blood through tentacles in his fingers and has been seen at least once drinking blood from an unnamed girl.  At the end of Series 1, Dio's body was destroyed, but his severed head managed to kill Jonathan Joestar and together they sank to the bottom of the Atlantic Ocean.!~ \n\n__Series 3: Stardust Crusaders__ \n~!100 years later, at the bottom of the sea, Dio's severed head reattached itself to Jonathan Joestar's lifeless body (giving Dio the same star birthmark as the members of the Joestar family). Dio's casket is recovered by fishermen, who are implied to have been killed by Dio as he awakened. He finds that he is now in the year 1985. After he returns to land he develops a Stand (a sort of ghostly bodyguard), giving him vastly powerful new abilities on top of his vampiric powers. For most of Series 3, Dio is out of scene and in the shadows, and the question of exactly what his Stand \"The World\" can do is a mystery.  In Series 3, many of Dio's offensive vampiric abilities do not appear, though he displays a new ability described as \"evil implants\"; parasites generated in his hair that attach themselves to and brainwash victims, finding early success with Kakyoin and Polnareff. Dio's Stand \"The World\", as a sort of brother power to \"Star Platinum\", possesses great speed and strength and, crucially, is able to stop time, making Dio appear to teleport or move at impossible speed. Dio's ambition is to create a perfect world for himself and his servants. In the interim, he seeks to drain for himself the blood of the Joestar lineage, which will help him to fully fuse with Jonathan Joestar's body and take better control of The World. Once he does this, his powers will gradually increase, until he is able to stop time for as long as he likes. In the beginning of the story arc Dio's World, Dio mainly battles Kakyoin and Joseph. Kakyoin succeeds in leading Dio into a vast barrier created by his Stand, trapping him. Dio uses The World to stop time, allowing him to ignore the barrier and approach Kakyoin to deliver a fatal blow. Before dying, Kakyoin deduces the The World's time-stop ability and uses his last strength to give Joseph this message. Joseph then warns this to Jotaro before he is also killed by Dio.  After a long battle between Dio and Jotaro, Jotaro finds his own ability to stop time just before Dio drops a steamroller on him, proceeding in time-stop to break Dio's leg. Jotaro's intention was for the two to end the fight with a final blow once Dio's leg had healed. Dio, determined not to lose, squirts blood from his open leg into Jotaro's eyes. Dio then attempts a final kick with The World, which Jotaro blindly counters with a punch from Star Platinum. Star Platinum's hand breaks on The World's leg, but the punch sends a fissure through The World and through Dio, shattering Dio completely above the waist. Jotaro and doctors from the Speedwagon Foundation (an oil and medicine company loyal to the Joestar family) transfer the blood from Dio's lower half to Joseph Joestar, reviving him. Later, they lay Dio Brando's remains in the Sahara Desert to evaporate with the rising sun.!~ \n\n__Series 6: Stone Ocean__ \n~!In Part 6, it is revealed to the Joestars that his reemergence was planned to create a perfect world when the moon reached a certain angle and time. He stumbled upon Enrico Pucci not long before Part 3 and \"healed\" his disfigured foot for him. After piercing Pucci with a Stand arrow, the two spent considerable time together, plotting and scheming. He questioned Pucci's loyalty to him, wondering why he didn't use Whitesnake to remove The World from him. Pucci had explained that he loved Dio as he had loved God, and thus worshipped him too much to betray him. Ensuring that he wouldn't completely fade, he left one of his bones in Pucci's care. Dio's presence continues to haunt the series, emerging in flashbacks and his disfigured sons. His bone played a vital plot element for the first half of Part 6, an odd green baby inheriting a Stand to merge with it.!~",
      "metadata": {
        "gender": "male",
        "age": "13-121",
        "dateOfBirth": "1867-04-10"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4004-w0OtWuvjhftG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4004
      },
      "rarity": "rare"
    },
    {
      "id": "jonathan-joestar",
      "name": "Jonathan Joestar",
      "alt_names": [
        "ジョナサン・ジョースター",
        "JoJo"
      ],
      "role": "protagonist",
      "description": "__Height:__ 195 cm \n__Nationality:__ British \n__Occupation:__ Archaeologist \n\nBorn the unique son of the wealthy businessman George Joestar I, Jonathan is an honest, kind, and positive man whose life is fraught with tragedy after meeting his adopted older brother - and series antagonist - Dio Brando. In his battle against Dio, Jonathan becomes a Ripple user under the tutelage of the master Will Anthonio Zeppeli.\n\n**Part 5:**~!Jonathan is the biological father of Giorno Giovanna, the protagonist of Vento Aureo, as well as a handful of other illegitimate offspring.!~\n\n(Source: JoJo Wikia)",
      "metadata": {
        "gender": "male",
        "age": "12-20",
        "dateOfBirth": "1868-04-04"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8087-GTrObHQvujB5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8087
      },
      "rarity": "rare"
    },
    {
      "id": "will-a-zeppeli",
      "name": "Will A. Zeppeli",
      "alt_names": [
        "ウィル・A・ツェペリ",
        "Baron Zeppeli"
      ],
      "role": "protagonist",
      "description": "Will A. Zeppeli was on a ship with a crew studying Aztec ruins when he was younger when his father put on the mask and killed everyone in the crew but his son. After this horrific event, Zeppeli travels the world in order to destroy the mask, and sees a man cure someone using the Ripple. Zeppeli is then directed to his master Tonpetty, who teaches him to use the Ripple. However, Tonpetty foresees Zeppeli's death during his training, warning him that should he complete his training he will surely die. Zeppeli doesn't share this fact until the fight with Tarkus, where he afterwards gives his power to Jonathan, whom he trained after the Joestar's house burns down. His grandson is Caesar Anthonio Zeppeli.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/18062-FjIMwcBJra9L.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18062
      },
      "rarity": "rare"
    },
    {
      "id": "robert-e-o-speedwagon",
      "name": "Robert E. O. Speedwagon",
      "alt_names": [
        "ロバート・E・O・スピードワゴン"
      ],
      "role": "protagonist",
      "description": "Robert E. O. Speedwagon is a major ally featured in the 1st part of JoJo's Bizarre Adventure, Phantom Blood, and then the 2nd part, Battle Tendency. Formerly a Londoner thug residing in Ogre Street, Speedwagon befriends Jonathan Joestar and, despite remaining a powerless human, becomes a loyal ally to the Joestar Family during his whole life and beyond thanks to the company he's founded: the Speedwagon Foundation. His company supports the Joestars in Stardust Crusaders, Diamond is Unbreakable, and Stone Ocean.\n\n(Source: JoJo Wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n21938-7iTMOJ4i6ET8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21938
      },
      "rarity": "rare"
    },
    {
      "id": "erina-pendleton",
      "name": "Erina Pendleton",
      "alt_names": [
        "エリナ・ペンドルトン"
      ],
      "role": "supporting",
      "description": "Erina is a young girl from [Jonathan Joestar](https://anilist.co/character/8087/)'s hometown. ~!She becomes his love interest then wife. She is the mother to [George Joestar II](https://anilist.co/character/130262/), and the grandmother and guardian to [Joseph Joestar](https://anilist.co/character/6356/).!~\n\n(Source: JoJo Wikia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21937-mwAbJAgxE8yP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21937
      },
      "rarity": "common"
    },
    {
      "id": "george-joestar-i",
      "name": "George Joestar I",
      "alt_names": [
        "ジョージ・ジョースターI世"
      ],
      "role": "supporting",
      "description": "George is Jonathan Joestar's father and, after a tragic misunderstanding, adopts Dio Brando in his family, kick-starting the events of the first six parts of the series.\n\n(Source: JoJo Wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n21956-Mv5FsZ4EnKzs.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21956
      },
      "rarity": "common"
    },
    {
      "id": "straits",
      "name": "Straits",
      "alt_names": [
        "ストレイツォ",
        "Straizo"
      ],
      "role": "supporting",
      "description": "Straits is another of Tonpetty's followers. He aided Jonathan in the fight against Dio and his minions.  He, along with Dire, were named after the band Dire Straits.  ~!When Santana was discovered in the 1930s during Part 2, he betrayed Speedwagon and donned one of the newly discovered Stone Masks. He explained that he had always envied Dio's strength and beauty and, as a result, desired to stop his aging process. He died after battling and losing to Joseph Joestar in New York City, overloading his own vampire body with Ripple energy. He is also the adoptive father of Lisa Lisa. !~  \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21961-9JPMSyptHeWe.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21961
      },
      "rarity": "common"
    },
    {
      "id": "dire",
      "name": "Dire",
      "alt_names": [
        "ダイアー"
      ],
      "role": "supporting",
      "description": "Dire is a minor ally featured in Phantom Blood.\n\nDire is a Ripple disciple under the Ripple Master Tonpetty and is a very close friend of Will Anthonio Zeppeli.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74057-7SVzc5bAOSdm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74057
      },
      "rarity": "common"
    },
    {
      "id": "tompetty",
      "name": "Tompetty",
      "alt_names": [
        "トンペティ",
        "Tonpeti",
        "Tompeti",
        "Tonpetty"
      ],
      "role": "supporting",
      "description": "Tonpetty is a minor ally featured in Part I: Phantom Blood. He is a Ripple master who trained Will Anthonio Zeppeli as well as Straizo and Dire.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74097-I4hre57ad84b.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74097
      },
      "rarity": "common"
    },
    {
      "id": "dario-brando",
      "name": "Dario Brando",
      "alt_names": [
        "ダリオ・ブランドー"
      ],
      "role": "supporting",
      "description": "Dario is the father of Dio Brando. An alcoholic and abusive man, he is primarily responsible for contributing to Dio's descent into evil. After a tragic misunderstanding, George Joestar I decides to give him a favor and adopts his son Dio into the Joestar Family.\n\n(Source: JoJo Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74099-L9f89j4jraUQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74099
      },
      "rarity": "common"
    },
    {
      "id": "wang-chung",
      "name": "Wang Chung",
      "alt_names": [
        "ワンチェン",
        "Wan Chen",
        "Wang Chan"
      ],
      "role": "supporting",
      "description": "Wang Chan is a minor antagonist featured in Part I: Phantom Blood  Personality   As a human, Wang Chan has shown a greedy personality, selling a poison to Dio Brando without any regard for its use and heading back to the Joestar mansion to salvage for treasures and antiques. Upon becoming a vampire, however, he becomes entirely devoted to Dio's wishes.  Synopsis   Originally only known as the \"Oriental Man\", he owned a curiosity shop on Ogre Street. Wang Chang sold Dio the poison which Dio used in his murder of Dario Brando and his attempted murder of George Joestar, although Wang was not concerned with what the poison was to be used for. He told Dio, without much, if any, intent to provoke him, of a man in his own land who had a similar birthmark to Dio's who had had a harsh life, but in the end lived to be over 183.   Sometime after, he was was captured by Jonathan Joestar and taken to the the Joestar Manor. When he is used in an attempt to force Dio to go with the police, he again mentions his fortune telling, saying that Dio is far too lucky to fully have to give up this early. Dio uses George's blood to become a vampire, taking Wang Chan as his subordinate when the latter goes to search the Joestar manor for valuables.   Dio trusts him enough to be responsible for his head and implanting it onto Jonathan's body. This did not go according to plan, however as Jonathan use the last of his strength to crush Wang Chan's head and sent a ripple to take control of his body, and made him sink the ship of zombies by grinding his body into the machinery.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74101-DnFd7wYsk5BF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74101
      },
      "rarity": "common"
    },
    {
      "id": "jack",
      "name": "Jack",
      "alt_names": [
        "切り裂きジャック",
        "Jack the Ripper"
      ],
      "role": "supporting",
      "description": "Jack is a serial killer who meets Dio Brando and is transformed into a Zombie sent to fight the Joestar Group. He was inspired by the historical figure of the same name.\n\n(Source: JoJo Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74105-lLpzu5q6pwbo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74105
      },
      "rarity": "common"
    },
    {
      "id": "tarkus",
      "name": "Tarkus",
      "alt_names": [
        "タルカス"
      ],
      "role": "supporting",
      "description": "Tarkus the \"Dark Knight\" was a knight from 16th Century Great Britain who was executed after losing a war. Resurrected as a Zombie by Dio Brando, he is wholeheartedly loyal to his new master and fights the Joestar Group.\n\n(Source: JoJo Wikia)",
      "metadata": {
        "gender": "male",
        "age": "300+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74109-KiX6nLKONYw4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74109
      },
      "rarity": "common"
    },
    {
      "id": "bruford",
      "name": "Bruford",
      "alt_names": [
        "ブラフォード",
        "Blueford",
        "Bluford"
      ],
      "role": "supporting",
      "description": "Bruford is an antagonist featured in Part I: Phantom Blood. He is a vampire made from the centuries-old corpse of a brave and powerful warrior of ancient Britain. Along with Tarkus, Bruford was one of \"The Dark Knights\". He also had unusual battle prowess and powers associated with his dark hair.    \n~!Bruford and Tarkus were successful in the Challenge of the 77 in 1563, two of only five challengers to succeed in history. Prior to their corruption, Bruford and Tarkus were members of the Tudor Dynasty and retainers of Mary Stuart. Eventually they were beheaded for supporting Mary against her political rival, Elizabeth. However, Elizabeth's deception to force them to surrender led to a strong sense of betrayal that made them susceptible to manipulation by Dio.!~   \n~!The pair were eventually resurrected as vampires by Dio Brando to oppose Jonathan Joestar, Will A. Zeppeli, and Robert Speedwagon. Bruford's manipulation of his hair poses much challenge to Jonathan, eventually leading to them fighting underwater, until Jonathan swims downward to find air bubbles beneath the rocks, enabling him to draw breath and hit Bruford with a ripple overdrive. Moments before he disintegrates from the ripple, Bruford gives Jonathan his sword, Luck and Pluck. However, his corpse is kicked aside by a wrathful Tarkus, who attempts to finish off Jonathan and party on his own.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n74113-bwYgDlbf5oiY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74113
      },
      "rarity": "common"
    },
    {
      "id": "tattoo",
      "name": "Tattoo",
      "alt_names": [
        "刺青"
      ],
      "role": "supporting",
      "description": "Tattoo is a rugged looking grown man with a medium sized beard and unkempt hair. His wardrobe consists mainly of a fringed leather jacket, pants, and belt. His most noticeable feature, and the obvious source of his name, is a large tattoo stretching from cheek to cheek and from forehead to nose dorsum - the tattoo appears to be either a butterfly or a design similar to a Rorschach test image.\n\n(Source: JoJo's Bizarre Encyclopedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130251-c2xA45fZ6GVY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130251
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-25T02:55:14.869Z"
}