{
  "work_id": "noblesse",
  "count": 15,
  "characters": [
    {
      "id": "frankenstein",
      "name": "Frankenstein",
      "alt_names": [
        "프랑켄슈타인",
        "Principal Lee",
        "フランケンシュタイン"
      ],
      "role": "protagonist",
      "description": "Frankenstein (Kor. 프랑켄슈타인) (commonly referred to as chairman by the children) is Rai's devoted servant. He supports Rai whole-heartedly and calls him \"Master\". He had tried searching for his master after Rai's apparent \"disappearance.\"  Frankenstein is the principal/director of Ye Ran High School. He was stunned to find Rai in his school office after Rai had woken up and dressed in his school's uniform.  Frankenstein is a very cheerful and loyal person, especially toward his master, but can become quite serious and calculative when the situation calls for it. Although Frankenstein has shown somewhat of a sadistic side during his recurrent battles, like Rai, he is also compassionate towards human beings, especially towards the students in his school.   Frankenstein is immensely powerful but some of his powers had been sealed away by Rai due to him misusing them in the past. After 820 years of sealing, Rai has finally taken off the punishment. But whenever Frankenstein gets serious in fighting uses his full power, Rai shows a considerable amount of anxiety.    ~! He is the \"father\" of human modification and enchantment. !~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b48753-li5DHzOcqkuT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 48753
      },
      "rarity": "epic"
    },
    {
      "id": "cadis-etrama-di-raizel",
      "name": "Cadis Etrama di Raizel",
      "alt_names": [
        "카디스 에드라마 디 라이세르",
        "Rai",
        "カディス・エトラマ・デ・ライジェル"
      ],
      "role": "protagonist",
      "description": "Rai is a very elegant and mysterious Noble. He has no knowledge whatsoever of the 21st century, and will often become lost and confused especially with regards to modern day technology (such as using a cell phone). He is often used as the manhwa's comic relief with his love of ramen and the errors he makes with technology. He has fallen into a deep slumber for 820 years, and had woken up in an abandoned building in South Korea. After seeing what most of the humans on the streets were wearing, Rai took on the uniform of a student from Ye Ran High School, which is under the administration of Frankenstein, and inadvertently followed the students there.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b48967-JZb8UWYqYKFP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 48967
      },
      "rarity": "epic"
    },
    {
      "id": "shin-woo-han",
      "name": "Shin-Woo Han",
      "alt_names": [
        "한신우",
        "田代裕介"
      ],
      "role": "supporting",
      "description": "Han Shin-Woo, a student in Ye Ran High School, popular because of his excellent martial skills. On the day of Rai's awakening, he happens to meet him on the way to school and gradually becomes close to Rai at school, developing a bond which can be termed as friendship. Eventually he gets involved in many strange fights against people with extra-ordinary powers. Rai and Frankenstein rescues him and others from the mess everytime. Later he as well as the others are brainwashed for their own safety and so remember nothing of the strange happenings.  Shin-Woo is an energetic and athletic teenager with bright red hair. He is always seen with a bandage over the bridge of his nose. He is actually pretty good looking but not that many people realize it because of his behavior.  He is well-known within the city to be skilled in martial arts and feared by gangs. Shin-Woo is often shown sleeping (and drooling) in class and slacking off. Though he is shown as a lazy student, he is also very courageous and would protect his friends at all costs. He often tends to be late for school due to over sleeping. He has liked Yuna for a long time and it is disclosed that he confessed to her in past which led to an embarrassing situation. Since then they have been just good friends although Shin-Woo still has a liking for Yuna. Shin-Woo is also starting to like Seira.  Shin-Woo is an amazing Martial Artist excelling in Tae Kwon Do and Hapkido. He is well-known within the city to be skilled in martial arts and is feared by gangs. He is able to match the powers of M-24's Infected, and since then has been getting stronger.  Even for normal human parameters, it's been quoted that Shin-Woo possesses an incredible amount of strength, which he has displayed during his multiple battles; including those with the Infected.  It's been noted that one of Shin-Woo's most incredible atributes is his speed, shown as he instantly disappeared when he went to aid Yuna right after she yelled for help. Alongside his speed, his agility and reflexes have incresed during the progression of the series; to the point he was able to dodge one of Shark's attacks and counterattack at the same time.  Shin-Woo's most incredible strength relies in his durability, since he is able to endure attacks that would normaly kill a human being; as shown when he took a beating from Shark and was even able to stood up against him one more time right after he threatened to kill his friends. \n\n(Source: Nobelesse wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/49077.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 49077
      },
      "rarity": "uncommon"
    },
    {
      "id": "ik-han-woo",
      "name": "Ik-Han Woo",
      "alt_names": [
        "우익한",
        "加瀬学"
      ],
      "role": "supporting",
      "description": "Woo Ik-Han (Kor. 우익한) is a regular human and best friends to Shinwoo, Yuna and Suyi, in addition to Regis, Seira and Rai. He spends most of his free time on his computer.  Ikhan is 157cm in height (about the same as Regis) and wears spectacles.  A running gag throughout the Manhwa is Ikhan's worry about his relatively short height. Initially, when Regis and Seira joined his class at school, Ikhan showed extreme intrest in the new students, which others supposed was Ikhan developing a crush on Seira. However, it is later revealed that Ikhan was rather enraptured by Regis, for Ikhan stated that he always wanted a fellow 'short' friend. Throughout his adventures, Ikhan is seen giving Regis foods and candies that are long and thin (such as Pocky) stating that he and Regis must eat them to grow taller (a pun on the stature of the food).  His hacking and computing skills are extremely proficient. He was able to match Tao's speeds when Tao tried to hack into Ikhan's uncle's police databases. He is also the best when it comes to computer games as it is mentioned by Shinwoo that Ikhan defeated him everytime. Ikhan also shows to be quite brainy rather than brawny, taking school very seriously compared to Shinwoo.  [noblesse.wikia]",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/49079.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 49079
      },
      "rarity": "uncommon"
    },
    {
      "id": "regis-k-landegre",
      "name": "Regis K. Landegre",
      "alt_names": [
        "레지스 K. 란데그르",
        "レジス・K・ランデグル"
      ],
      "role": "supporting",
      "description": "Regis is a young noble. His caretaker is his companion Seira. Regis has high regard for elegance and is extremely prideful. He values manners and honor primarily. He and Seira appeared to investigate the possible appearance of an infected/mutant amongst the humans.  Regis is fairly short and when Ikhan first sees him, he becomes excited at having someone the same size as him. Ikhan has always felt self-conscious, but Regis does not feel bothered by his height.   ~! His grandfather is an old well-respected noble called Gejutel and also the current leader of the Landegre clan. It is revealed Regis father died in the rebellion and betrayal against the Lord.!~  He does not get along well M-21, especially when they first met because he has a strong dislike of modified humans who he thinks sold their humanity for power. However, once he sees how M-21 sacrifices himself for the children he reconsiders his opinion of him, but not enough to fix their \"sensitive\" relationship.  Against his will and better judgment, Regis gets recruited into Tao's group, Rai's Knights, as RK No. 3.",
      "metadata": {
        "age": "199",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/54209.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 54209
      },
      "rarity": "uncommon"
    },
    {
      "id": "tao",
      "name": "Tao",
      "alt_names": [
        "타오",
        "Number One",
        "タオ"
      ],
      "role": "supporting",
      "description": "Tao is a  young man who possesses a genius-level intellect in computer programming and other technological fields. He was one of the less cold-hearted members of the DA-5 group, made by Dr. Iris, and is yet another a modified human. He is currently residing with Takeo and M-21 in Frankenstein's residence and is also working as a security guard in Ye Ran High School. He is \"Number One\" of the RK-4 which is a group of four formed by himself.",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b56123-Il69XOlPFGSP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56123
      },
      "rarity": "uncommon"
    },
    {
      "id": "yuna-suh",
      "name": "Yuna Suh",
      "alt_names": [
        "서윤아"
      ],
      "role": "supporting",
      "description": "Race: Human Occupation: student Eye colour: brown Hair colour: brown Yuna is a beautiful young girl with a friendly, shy and quiet personality. Ik-Han and Shinwoo are childhood friends of her. She’s a student of Ye Ran High School and she’s in the same class as Shinwoo, Ik-Han and the others. Shinwoo had a crush on her since they were kids. She also becomes friends with Rai and visits him at Frankenstein’s home together with Shinwoo and Ik-Han. When she and Rai are introduced to video games, she appears to be quite competent despite it being her first try.   Sources: http://en.wikipedia.org/wiki/Noblesse_(manga) http://noblesse.wikia.com/wiki/Noblesse_Wiki",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/56347.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56347
      },
      "rarity": "uncommon"
    },
    {
      "id": "su-i-im",
      "name": "Su-I Im",
      "alt_names": [
        "임수이"
      ],
      "role": "supporting",
      "description": "Suyi is an attractive young girl and a pretty popular pop idol who is also studying at Ye Ran High School. She first appeared in chapter 94, when she returned to school after doing a concert while being escorted by Hansu. She’s a friend of Ik-Han, Shinwoo and Yuna and often hangs out with them. The kids tend to avoid visiting crowded places, because people would stare at Suyi. She often joins the others in visiting Frankenstein’s house. Even though Suyi is popular, she prefers leading a normal life.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/56349.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56349
      },
      "rarity": "uncommon"
    },
    {
      "id": "hansu-jung",
      "name": "Hansu Jung",
      "alt_names": [],
      "role": "supporting",
      "description": "Jung Hansu Race: Human Occupation: idol Hair colour: black Hansu is an idol and an acquaintance of Suyi. He appears in chapter 94 of the manga while escorting her back to school after a concert. She doesn’t really like him, but Shinwoo and the others wanted to meet him so she brought him along to do them a favour.    ~!When M-21 notices Hansu’s car on the school grounds while the place is off-limits for vehicles, he asks him to move it. Hansu refuses, stating that he won’t take long anyway. When M-21 insists, he asks his bodyguard to take care of it. This leads to quite some commotion, but eventually they back off and leave the school.!~  source: http://en.wikipedia.org/wiki/Noblesse_(manga) http://noblesse.wikia.com/wiki/Noblesse_Wiki",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/56351.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56351
      },
      "rarity": "uncommon"
    },
    {
      "id": "charles",
      "name": "Charles",
      "alt_names": [],
      "role": "supporting",
      "description": "Hansu's bodyguard",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/56353.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56353
      },
      "rarity": "uncommon"
    },
    {
      "id": "seira-j-loyard",
      "name": "Seira J. Loyard",
      "alt_names": [
        "세이라 J 로이아드",
        "セーラ・J・ロイアード"
      ],
      "role": "supporting",
      "description": "Race: Noble  \nOccupation: student, Loyard clan leader  \nEye colour: Red \nHair colour: Silver   \n\nSeira has a rather quiet and shy personality. She usually doesn’t show emotion on her face and is very calm, but she does blush when being complimented. She learns to cook very rapidly and is soon responsible for making meals in Frankenstein’s house with the exception of ramen, which is Frankenstein’s personal project.   Seira is the last remaining blood descendant and the leader of the Loyard clan. Her soul weapon is the Death Scythe. Since the death of her family members, she has been under Gejutel’s care. She and Regis are very close and they have a mental connection, due to which they can sense each others presence. When she can’t feel this presence this means he’s either very far away, unconscious or dead.   (Source: Wikipedia, Noblesse Wikia)",
      "metadata": {
        "age": "217",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/56355.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56355
      },
      "rarity": "uncommon"
    },
    {
      "id": "gejutel-r-landegre",
      "name": "Gejutel R. Landegre",
      "alt_names": [
        "게슈텔 R 란데그르"
      ],
      "role": "supporting",
      "description": "__Age:__ unknown (&gt;820)\n__Race:__ Noble\n__Occupation:__ Landegre clan leader\n__Eye color:__ Red\n__Hair color:__ Silver with two black lines\n\nGejutel is Regis’s grandfather and is seen with a walking stick and a monocle. He has the same sense of honour that Regis possesses and tests him on the issue of protecting humans. He seems to be on tense terms with Frankenstein. He is the head of the Landegre clan and he is the only one who served under the previous lord. The other clan leaders went to eternal sleep with the previous Lord or betrayed him. He was secretly given the task to guide the current Lord in order to lessen the confusion and chaos when the previous Lord and clan leaders went into eternal sleep. ~!Gejutel was sent out by the Lord to find out where Seira and Regis were staying and what they were doing. When he returns to report to the Lord, he tells Regis and Seira not to trust Frankenstein, but they can trust Rai. When reporting to the Lord, he conceals the truth to keep Rai and Frankenstein’s identity hidden. However, Rael lets out that he confronted unknown people with power, which leads to Gejutel being accused of treachery. !~\n\n(Source: Wikipedia, Noblesse Fandom Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/56357.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56357
      },
      "rarity": "uncommon"
    },
    {
      "id": "rajak-kertia",
      "name": "Rajak Kertia",
      "alt_names": [
        "라자크 케르티아"
      ],
      "role": "supporting",
      "description": "Age: unknown (&gt;500) Race: Noble Occupation: Kertia clan leader Eye colour: Red Hair colour: Blonde Rajak is the head of the house of Kertia, a clan of murderers, and Rael’s older brother. His soul weapon is Kartas and it takes the form of two daggers, the same as his younger brother’s soul weapon Grandia. Since Rael also has a soul weapon without being the clan leader, Rajak’s soul weapon is incomplete. Initially, it was assumed by Rael that Rajak didn’t know about this, but later it is revealed that he knew. Unlike Rael, he has impressive control over his soul weapon and uses it to hide his aura. This way he can be discreet like a true assassin. He can also create multiple copies of himself to surround the enemy. Combined with his hidden aura and enhanced speed, it is extremely hard for his enemy to know who’s the real Rajak and where the attack will come from. Rajak moves with an air of dignity. When he is ordered by the Lord to go to the human world to bring Seira back, he feels somewhat irritated. Being convinced by his younger brother that the work doesn’t suit his dignity, he lets Rael do it instead of him. When Rai manages to move past him, he couldn’t believe someone overstepped him. He is very loyal to the Lord and executes anything he has been bidden to do without question. He also shows great respect to the other clan leaders and scolds Rael when he insults Gejutel. He executes his job as a clan leader whole-heartedly. When Rael manages to wound Frankenstein during a fight with Rajak by using a sneak attack, Rajak slashed himself to compensate for his brother’s foul play.  Source: http://en.wikipedia.org/wiki/Noblesse_(manga) http://noblesse.wikia.com/wiki/Noblesse_Wiki",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/56359.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56359
      },
      "rarity": "uncommon"
    },
    {
      "id": "rael-kertia",
      "name": "Rael Kertia",
      "alt_names": [
        "라엘 케르티아"
      ],
      "role": "supporting",
      "description": "Age: unknown (&gt;500) Race: Noble Occupation: Kertia clan member Eye colour: Red Hair colour: Blonde Rael is very skinny, has a pale skin and is good-looking. He is Rajak’s ambitious younger brother. Even though he is not the Kertia clan leader, his father gave him an imperfect soul weapon, Grandia, which takes the form of two daggers. He displays a harsh nature and dislikes humans to the point he needs to restrain himself not to kill them. Rael possesses immense power, speed and combat skills, up to the point of being considered the strongest of his clan. However he has a major weakness: he tends to get emotional in combat, which results in him making mistakes. He is also overconfident of his abilities and continues to underestimate the enemy, even after losing to them. Like Rajak he can create multiple copies of himself with a maximum of 3-4, whereas his brother can create much more.  ~!He proposed to Seira 10 years ago, but was rejected. When he couldn’t contain his anger and destroyed everything around him, Rajak caught him and sentenced him to 10 years of confinement. According to Regis, it is suspected that Rael only wants to marry Seira to establish himself as a clan leader. After 10 years he comes back to the human world to fetch Seira and take her back to Lukedonia as ordered by the current Lord. !~\n\n(Source: Wikipedia, Noblesse Fandom Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/56361.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56361
      },
      "rarity": "uncommon"
    },
    {
      "id": "erga-kenesis-di-raskreia",
      "name": "Erga Kenesis Di Raskreia",
      "alt_names": [
        "에르가 케네시스 디 라스크레아",
        "The Lord"
      ],
      "role": "supporting",
      "description": "__Race:__ Noble\n__Occupation:__ Lord of the Nobles \n\nRaskreia is the current leader of the Nobles and her soul weapon is Ragnarok. She is the daughter of the previous lord who entered the eternal sleep 500 years ago. Unlike her predecessor, she is more strict and conventional, showing an arrogant and sever attitude. However, according to Gejutel, she is too sentimental in her decisions and this is one of the reasons why she is considered unfit to be Lord by the so-called traitors.   ~!Rai and Frankenstein are acquainted with her, but they’re not on friendly terms. Before the previous Lord’s eternal sleep, some of the clan leaders made excuses and didn’t enter the eternal sleep with him. The previous Lord agreed with their request, but as soon as he entered the eternal sleep they betrayed him. Therefore Raskreia holds a grudge against the traitors and she claims that Rai was the one responsible for the betrayal against the former Lord. However after facing Rai and receiving his incomplete Ragnarok, she discovers that Rai has been asleep for 820 years. Rai’s arrival triggers a message from the previous Lord in which he explains he wanted his daughter to embrace freedom rather than carry the heavy burdens the Lord has to face. After hearing that, she has the feeling she doesn’t really deserve Rai’s Ragnarok, so she doesn’t accept it because she thinks she needs to earn it. This triggers a new message from the previous Lord in which he praises her because she made an important decision when not accepting Rai’s offer.!~\n\n(Sources: Wikipedia and Noblesse Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b56363-aE72fOESACYy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 56363
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-26T01:39:39.239Z"
}