{
  "work_id": "food-wars-the-second-plate",
  "count": 15,
  "characters": [
    {
      "id": "souma-yukihira",
      "name": "Souma Yukihira",
      "alt_names": [
        "幸平創真",
        "Soma Yukihira"
      ],
      "role": "protagonist",
      "description": "__Height:__ 171 cm\n\nHe is the son of Jouichirou Yukihira and, until it closed, worked at his father's restaurant, Restaurant Yukihira. Souma fight his odds in the elite school to becoming the best chef in the world even with strong background discrimination of his academy. He is currently a student at Tootsuki Culinary Academy and a resident of Polar Star Dormitory.\n  \nSouma is a rather energetic child who has the constant drive to move forward with his cooking, mostly due to his rivalry with his father. Due to his drive to move forward Souma is willing to try odd things with food including \"Grilled Squid Tentacles Dressed in Peanut Butter,\" though these dishes usually don't go over too well. It is because the will of Soma to try to move forward, his dish often considered as creative and innovative by some peers and lecturers; lead his rivalry with all the students in the Tootsuki Culinary Academy even rough. Through all this Souma maintains a laid back attitude towards just about everything but cooking.  Souma can cook many different foods in many different styles, though he prefers what he calls \"Yukihira Style,\" which is the cooking style which he learned from his father. Souma shows an immense capability for cooking and a special adaption with learning from his mistakes and improvising through learning from said mistakes. It is due to his creativity and also resourcefulness, Souma is able to create the same dish with different ways of cooking that would create even . Unlike most student whom used lavish ingredient, Souma didn't care about the classes of the ingredient which claimed that neither expensive ingredients nor classy background nor fancy technique made the food better, is the wise usage and alternatives made the food interesting and the customer's satisfaction about the food matters. Further more, he also claimed that undefeated food in just the looks and taste in regal made him bored, which the boredom would made the chef stop improvise their food. To eliminate such boredom, Souma would continued to search different style of cooking around the world in order to improvised his cooking skills.",
      "metadata": {
        "gender": "male",
        "age": "15-25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b75216-KDU8333eIcqf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 75216
      },
      "rarity": "legendary"
    },
    {
      "id": "erina-nakiri",
      "name": "Erina Nakiri",
      "alt_names": [
        "薙切えりな",
        "Erina-cchi",
        "God Tongue"
      ],
      "role": "protagonist",
      "description": "__Height:__ 162 cm\n\nOne of the two main heroines in the manga, Erina is initially the primary antagonist of Sōma Yukihira, until this develops into more of a friendship. Erina is the only daughter of Azami Nakiri and an unnamed mother who is Senzaemon's biological daughter. Erina often detests whoever is considered \"common\" due to her regal pedigree and status within the Tōtsuki organization. Her \"God Tongue\" can accurately describe the taste and composition of any food, and she gives harsh critiques to chefs and students alike. However, there have been rare occasions where she gives credit to chefs with skill. She had been promoted as the Elite Ten's 10th seat as a middle-schooler.",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b75284-4Hiyq7DOwvy7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 75284
      },
      "rarity": "legendary"
    },
    {
      "id": "megumi-tadokoro",
      "name": "Megumi Tadokoro",
      "alt_names": [
        "田所恵",
        "Dunce",
        "Légumes Koro-pok-guru",
        "Légumes Zashiki-warashi",
        "Légumes Yuki-ko"
      ],
      "role": "protagonist",
      "description": "__Height:__ 154 cm\n__Cuisine Style:__ Hospitality\n\nMegumi is from a cold harbor town in the Tōhoku region and enrolled into Tōtosuki's junior high program hoping to be able to help her family's bed-and-breakfast the Shokei'en Inn. Because of her stage fright and shyness she performs poorly and causes her to rank at the bottom of her class. \n\nMegumi is clumsy and timid, thoughtful, kind and honest girl with polite manners. She is always looking out for others and is willing to assist them in any way she can. According to Gin Dōjima, Megumi's greatest gift is her warm hospitality as she cooks. She highly idolizes her mother.\nlthough Megumi is a capable chef, she does not fare well under pressure because she has stage fright. Because she is intimidated very easily, she makes simple mistakes when she cooks, causing many of her classmates to see her as a weak student. She is quick to panic when something goes awry and tends to over think situations when under pressure or stress, such as repeatedly packing and unpacking a suitcase to make sure she packed something, even though she did not need to pack a suitcase in the first place.\nInitially, she heavily relied on Sōma's creativity to pull them both through tough assignments both in the academy and at the Training Camp. After her first Shokugeki, Megumi's confidence grew tenfold.\n\n~!Megumi eventually even becomes the 10th seat of the Elite Ten Council of the Tōtsuki Culinary Academy after the Promotion Exams Arc.!~",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b76026-cQAQTlZFfG2e.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 76026
      },
      "rarity": "legendary"
    },
    {
      "id": "senzaemon-nakiri",
      "name": "Senzaemon Nakiri",
      "alt_names": [
        "薙切仙左衛門"
      ],
      "role": "supporting",
      "description": "Senzaemon is headmaster of Tōtsuki Academy and Erina's grandfather. Known as the \"Gastric Godfather\", he has the tendency of stripping his upper body when he eats a good dish. Despite his appearance and reputation, he is reasonable and gives accurate commentary and assessment for the food he tastes without being overly critical to the losers.\n\n~!Many years previously, Senzaemon and Gin noticed Jōichirō Saiba's critical condition at the start of a tournament, and took upon themselves some of the blame for pressuring Jōichirō into becoming mentally trapped in the creation of his dishes. Feeling Jōichirō's talent was beyond the tasks of the academy, Senzaemon freed his former student to travel abroad and learn independently, a proposal Jōichirō happily accepted, as well as Gin whom Senzaemon offered him as the head of resort planner as a mean to atone their sins to ensure no one will share a similar fate as what happened to Joichiro before. For a period thereafter, Senzaemon hired Jōichirō as his private chef.!~\n\n~!Six years ago, Senzaemon exiled his son-in-law, Azami, for abusing Erina with brainwashing, and turns out even worst and dangerous to rule the academy than Joichiro's previous ill-fate. Senzaemon became Erina's legal guardian and had Azami's name struck from the Tōtsuki records. However, in the year Erina enrolls in the academy, Azami returns and a majority of the Elite Ten vote to support Azami as headmaster, replacing Senzaemon. In the aftermath, Senzaemon revealed to Sōma that he advised Jōichirō to have him apply to the academy. Senzaemon remains active behind-the-scenes with Jōichirō, working through tips from informants to wrest control from Azami.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/76028-YhCTXMKjPc6I.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 76028
      },
      "rarity": "rare"
    },
    {
      "id": "fumio-daimidou",
      "name": "Fumio Daimidou",
      "alt_names": [
        "大御堂ふみ緒"
      ],
      "role": "supporting",
      "description": "She is the warden and guardian of Polar Star Dormitory.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b77489-sUUtK1ddnDdN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 77489
      },
      "rarity": "rare"
    },
    {
      "id": "roland-chapelle",
      "name": "Roland Chapelle",
      "alt_names": [
        "ローランド・シャペル"
      ],
      "role": "supporting",
      "description": "Roland Chapelle (Rōran Shaperu) is one of the stern lecturer in the Totsuki Culinary Academy, who was infamous for his extreme discipline. Earned the nickname as the Chef Who Never Smiles, Chapelle takes student's performance and presentation in a serious matter which every presentations counts as if it is their conduct in their future careers, not just in French cuisine but also others involves cookery. Whoever failed to reach his eligible standard shall faced his worst judgment upon them, making this veteran lecturer a judge, jury and even executioner in this prestige academy. He always has been this strict until Yukihira Soma, the Yukihira transfer student's resourceful and innovative cooking that made him smile for the first time with the impression Soma's version of Boeuf Bourguignon; making Soma is the first (and the only) rookie chef intrigued by this iron heart veteran.  As the professional lecturer with French Cuisine is part of his forte and pride, Chapelle is very serious upon his native dish and he is not tolerate any fools (student or anyone alike) making fun of it. It is also believed that rigid discipline meant 100% success, Chapelle has a concept that any student whom didn't pass with the flying colors are considered people who failed to prove their worth. With his grumpy and no-nonsense attitude combined, Chapelle's strict discipline is so extreme that every students feared him as his judgement meant absolute end should the requirement didn't meet his expectations, to extended that even the legendary Alumni 10 dares not to cross him.  Behind this iron heart, Chapelle is also rather a fair lecturer who treated his students with fair results.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/77491-s3jNP6To5Jqx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 77491
      },
      "rarity": "rare"
    },
    {
      "id": "jouichirou-yukihira",
      "name": "Jouichirou Yukihira",
      "alt_names": [
        "幸平城一郎",
        "Jouichirou Saiba",
        "Asura"
      ],
      "role": "supporting",
      "description": "The father of Sōma Yukihira, and owner of the diner Yukihira in the Sumire Shopping District. His passion for cooking knows no bounds and his skill is world-class. As the sole parental-figure and family member in Sōma's life, he is a mentor, teacher, and rival to his son. Like Sōma, Jōichirō is laid-back but professional and has a serious side that emerges when he is cooking. The two share the same habit of creating horrible experimental dishes. Jōichirō is supportive of his son but does occasionally like to see Sōma stressed and frustrated by challenging him to many cook-offs – always ending in Jōichirō's victory – to show him how much he has to grow. He left home to work abroad and sent his son to Tōtsuki Academy, telling Sōma that he needs to succeed in Tōtsuki if he ever wants to surpass him.",
      "metadata": {
        "gender": "male",
        "age": "38",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/77495-81D8lngS6l3G.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 77495
      },
      "rarity": "rare"
    },
    {
      "id": "satoshi-isshiki",
      "name": "Satoshi Isshiki",
      "alt_names": [
        "一色慧"
      ],
      "role": "supporting",
      "description": "He is a student at Totsuki Culinary Academy, a resident of Polar Star Dormitory and the current 7th seat of the Elite Ten Council. Aside from that, Satoshi's position as one of the Elite 10 also promote a strong determination for his kouhai(junior),Yukihira Soma to drive his dream to become one of the 10 seat and could be a potential challenge for Soma due to his natural cooking abilities.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b78475-pcxfAMiGe6xf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 78475
      },
      "rarity": "rare"
    },
    {
      "id": "ikumi-mito",
      "name": "Ikumi Mito",
      "alt_names": [
        "水戸郁魅",
        "Nikumi",
        "Nikumi-cchi",
        "The Meat Expert"
      ],
      "role": "supporting",
      "description": "She is one of the student of Tootsuki Culinary Academy whom is also a former rival to Yukihira Soma. As the sole successor of the meat culinary expert of the Mito family for abundance knowledge about the meat culinary (especially beef and donburi), Ikumi is responsible to hold the pride of her family's name and like any other students in Tootsuki Culinary Academy, Ikumi is extremely prejudice upon the society classes and use high class ingredient to make a high standard dish.  It is said that Ikumi's rigid family rules and regulations had made her cooking skill more elegant and grace like playing piano. Using all graces of cooking by using the high grade materials as well as expensive, Ikumi can almost made the dish as elegant as it look to impressed her clients.",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b78935-21Ac5ydcrLCj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 78935
      },
      "rarity": "rare"
    },
    {
      "id": "ryouko-sakaki",
      "name": "Ryouko Sakaki",
      "alt_names": [
        "榊涼子"
      ],
      "role": "supporting",
      "description": "Ryōko is a tall, mature-looking girl with long purple hair, orange eyes, and a large bust. She is gentle and kind, responding to the eccentrics of the other Polar Star residents in a level-headed manner and comforting the other students when they are troubled. Ryōko's specialty is fermented foods due to her parents owning a well-known fermented-goods shop, and she maintains a workshop near the dorms to produce her own ingredients. She also keeps a bottle of \"fermented rice drink\" that she would sometimes bring out during parties and celebrations, which Sōma suspects is illegally brewed sake.\n\n~!During the Autumn Elections, she presented a \"curry soy-natto rice\" using charcoal-fermented natto and homemade rice-sauce fermented with koji. The dish garnered praise from the judges, who suddenly felt as if they were in a festival due to the quintessentially Japanese and festive taste of the dish. She ultimately took 7th place in her block.!~\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85727-OnAFVVOOQYoW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85727
      },
      "rarity": "rare"
    },
    {
      "id": "yuuki-yoshino",
      "name": "Yuuki Yoshino",
      "alt_names": [
        "吉野悠姫",
        "Little Red Riding Hood of the Forest of Wild Beasts"
      ],
      "role": "supporting",
      "description": "She is a student at Tōtsuki Culinary Academy and a resident of Polar Star Dormitory. She and the other resident students from his hostel befriended with their fellow roommate Yukihira Soma and also aware to Soma's talent as one of the finest and unique of all. She is also a roommate and friend to her fellow student, Tadokoro Megumi and Sakaki Ryoko.  Yuki is more focus on animal meat as her main cuisine. Unlike Ikumi, the meat master in any meat culinary, Yuki often used the animal hunted game from domestic poultry to any other animals (like rabbits and deer) as her main theme. Yuki's cutting skill could be yet",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85773-PZJBayhHubcQ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85773
      },
      "rarity": "rare"
    },
    {
      "id": "shun-ibusaki",
      "name": "Shun Ibusaki",
      "alt_names": [
        "伊武崎峻",
        "Prince of Smoke"
      ],
      "role": "supporting",
      "description": "Shun is presumably known his senior, Isshiki Satoshi better than anyone else as he was stayed much longer than the rest of the Polar Star Gang.  Unlike his passionate room mates, Shun is very realistic on the terms and very serious upon making his style in perfection. Shun is also a quiet student who prefer speak only whenever is considered as crucial by many. It is also once claimed that he is a calculative chef whose choose to act wisely over hesitation.",
      "metadata": {
        "gender": "male",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85775-pDqXEd0DzFkt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85775
      },
      "rarity": "rare"
    },
    {
      "id": "takumi-aldini",
      "name": "Takumi Aldini",
      "alt_names": [
        "タクミ・アルディーニ ",
        "Takumi-cchi",
        "The One Who Cuts Through The Horizon of Flavors"
      ],
      "role": "supporting",
      "description": "__Height:__ 168 cm\n\nTakumi is the oldest nephew of the owner of the Trattoria Aldini, a trattoria (family-style restaurant) located in Florence, Italy. He is half-Japanese but, unlike his brother Isami, appears more European – with blond hair and blue eyes – and is noted as being extremely handsome, having fan clubs in Tōtsuki Academy and his hometown. He enrolled in Tōtsuki at the behest of his uncle, taking with him his mezzaluna (two-handed knife) and a bottle of homemade olive oil as a good luck charm. His specialty is Italian cuisine, although many professional chefs noted that he has a broad vision; like Sōma, he will incorporate ingredients and methods from other culinary styles to create inventive dishes, and can modify his recipes while cooking. He is very kind and supportive of his less-skilled brother, to the point of risking his pride to defend Isami's honor.\n\nTakumi has a fierce (and somewhat one-sided) rivalry with Sōma. Takumi sees Sōma as someone similar to himself – both having grown-up working at small family restaurants – and a worthy rival, and jumps at any chance to compete with him. He frequently tries to challenge Sōma to informal cooking challenges (usually leading to an embarrassing situation for himself), hoping to one day defeat Sōma in a formal Shokugeki. Despite their rivalry, both he and Sōma greatly respect each other, and likely view each other as friends outside of the arena.\n\nTakumi and his brother Isami are the main characters of the Shokugeki no Soma – Fratelli Aldini spinoff manga which focuses on their time in Italy before going to Tōtsuki Academy.",
      "metadata": {
        "gender": "male",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85777-up7wugPUGKBv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85777
      },
      "rarity": "rare"
    },
    {
      "id": "hinako-inui",
      "name": "Hinako Inui",
      "alt_names": [
        "乾日向子",
        "The Mist Princess"
      ],
      "role": "supporting",
      "description": "One of the graduated students from Tootsuki Culinary Academy who turned professional, she is one of the respected legends of both her former school and alumni, among the few students who successfully graduated academy.  Like most of the 10 alumni, Inui took the quality of the food very serious for it's freshness as well as. Fame for her nickname as the Mist Queen during her admission in the academy, Inui is able to know the quality of the food just by her nibble before she could bite into her mouth. With this, she can easily tell of the food is good or bad by just putting the food on her lips before finally eating them.  Behind her mature, stern and professional personality however, Inui may be childish and rather whenever she confused of either decision which she could made. Considered as a joke member of all alumni, Inui actually make several jokes to cheer her peers.  Inui's cooking style would preferred to the Japanese traditional style/ known as Washi. \n\n(Source: Shokugeki no Souma Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/85779-DhyNxYQSrR9w.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85779
      },
      "rarity": "rare"
    },
    {
      "id": "koujirou-shinomiya",
      "name": "Koujirou Shinomiya",
      "alt_names": [
        "四宮小次郎",
        "Kojiro",
        "The Légumes Magician",
        "Vegetarian Magician"
      ],
      "role": "supporting",
      "description": "Owner of a French cuisine restaurant called Shino's, Kojirou was a student of the 79th generation and held the first seat of the Elite Ten. He is commonly seen sporting glasses and red hair. Known as the \"Legumes Magician\", Kojirou was convinced he was going to be successful in France with his French–Japanese fusion restaurant, Shino's. However, his French staff refused to follow his recipes, even sabotaging his dishes. Facing financial ruin, he hardened himself emotionally and fired anyone who questioned his skills in the kitchen. Although this allowed him to reach the top, his proud and stubborn refusal to make exceptions resulted in his skills stagnating over the years.\n\n~!Kojirou returns to Toutsuki as a guest teacher, and \"fires\" Megumi for altering his recipe despite there being an insufficient quantity of suitable ingredients. He threatens to do the same to Souma for coming to her defense, leading Souma to challenge him to an unofficial Shokugeki. During this match, Shinomiya makes a technically perfect dish that is the unanimous winner. However, Gin gives a bonus vote for Megumi's dish, prompting Shinomiya to try it and admit that her flexible cooking style suits the tastes of the customer. Shinomiya is reminded of his mother's kindness, and taking this to heart lets Megumi pass.!~\n\n~!Kojirou reappears in the story when Souma is assigned as a stagiaire (intern) at his new restaurant, Shino's Tokyo. His personality has noticeably softened since their last encounter, and he helps Souma by improving the latter's dish which earns a place on his menu. It is revealed during this time that Kojirou chose to specialize in French cuisine in order to make his mother happy.!~\n\nShinomiya Kojirou is the main character of the Shokugeki no Soma – Etoile spinoff manga which focuses on his time in France after he graduates from Toutsuki Academy.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/85781.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85781
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T02:11:44.492Z"
}