{
  "work_id": "attack-on-titan-final-season-the-final-chapters-special-1",
  "count": 15,
  "characters": [
    {
      "id": "eren-yeager",
      "name": "Eren Yeager",
      "alt_names": [
        "エレン・イェーガー",
        "Eren Jaeger",
        "Eren Jäger",
        "Suicidal Maniac",
        "Shi ni Isogi Yarou (死に急ぎ野郎)"
      ],
      "role": "protagonist",
      "description": "__Initial Height__: 170 cm (5'7\")\n__Affiliation:__ 104th Trainees Squad, Survey Corps. \n\nEren was born to Carla and Grisha Yeager in Shiganshina District within the southern region of Wall Maria. He grew up in the town with his parents and foster sister [Mikasa](https://anilist.co/character/40881), who moved in with the Yeagers as a child. Eren spent most of his time with Mikasa and their mutual best friend [Armin Arlert](https://anilist.co/character/46494), whom the pair often defended from neighborhood bullies.  \n\nEren is a passionate, determined, hardheaded, and impulsive young man. When they were children, Armin showed him a book depicting the wonders of the outside world. Eren grew to share Armin's curiosity of the world beyond the Walls and resolved to see it for himself. This dream inspired his admiration of the Survey Corps and his desire to join their ranks as soon as he became eligible for enrollment. \n\nWhen the Titans suddenly broke through Wall Maria into Shiganshina, Eren was forced to watch on as his mother became trapped under the rubble of their house and eaten by a titan. Forever changed from this event, Eren vows to kill every last titan.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40882-dsj7IP943WFF.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40882
      },
      "rarity": "legendary"
    },
    {
      "id": "mikasa-ackerman",
      "name": "Mikasa Ackerman",
      "alt_names": [
        "ミカサ・アッカーマン"
      ],
      "role": "protagonist",
      "description": "__Height:__ 170 cm (5'7\") - 176 cm (5'9½\")\n__Position:__ 104th Training Corps, Survey Corps\n__Relatives:__ [Birth Mother](https://anilist.co/character/84341/Mikasa-no-Haha) (Deceased), [Birth Father](https://anilist.co/character/84339/Mikasa-no-Chichi) (Deceased), [Grisha Yaeger](https://anilist.co/character/62477/Grisha-Yeager) (Foster Father), [Carla Yaeger](https://anilist.co/character/62475/Carla-Yeager) (Foster Mother, Deceased), [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) (Foster Brother)\n\nMikasa is Eren Yaeger's foster sister and mutual childhood friend of [Armin Arlert](https://anilist.co/character/46494), living with the two of them in Shiganshina District within the southern region of Wall Maria. \n\nWhen she was young, her parents were killed by human traffickers, and she was kidnapped. Eren discovered this and helped her escape her captors. Later, Eren gave her his scarf, which she constantly wears and shares an emotional attachment to. She was adopted by the Yaeger family soon after. Because of these past events, Mikasa shares an unbreakable bond with Eren and lives to protect him, constantly worrying for Eren's well-being. After the Titans broke through Wall Maria and killed her and Eren's mother, she chose to follow Eren into the military to try and keep him safe from danger. \n\nEven as a child, Mikasa possessed impressive fighting skill and strength, and that skill was only honed further during her training.  Mikasa is considered a genius among all the army trainees and is incredibly skilled at combat and agility, to the point that she was known as the greatest soldier among the 104th Training Corps and graduated in first place. Though being among the best of the best, she remains humble and refrains from displaying arrogance. Ultimately, Mikasa's loyalty remains with Eren no matter the circumstance, with her only true desire being to live a peaceful life with him.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40881-F3gr1PkreDvj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40881
      },
      "rarity": "legendary"
    },
    {
      "id": "armin-arlert",
      "name": "Armin Arlert",
      "alt_names": [
        "アルミン・アルレルト",
        "Armin Arlelt"
      ],
      "role": "protagonist",
      "description": "__Height:__ 163 cm (5'4\")\n__Position:__ 104th Trainees Squad, Survey Corps\n__Relatives:__ [Grandfather](https://anilist.co/character/84313/Armin-no-Ojiisan)\n\nArmin is a young boy who was born and raised in the Shiganshina District within the walls, being childhood friends with both [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) and [Mikasa Ackerman](https://anilist.co/character/40881). After Wall Maria was breached, he chose to join Mikasa and Eren in joining the military, both to try to make a good and meaningful impact on the world, and to fulfill his dream of seeing the outside world.\n\nEven when he was young, the naturally curious Armin has always had a deep fascination with the world beyond the Walls. As a child, he found and studied an illegal book about the outside world that was owned by his grandfather. He often shared the book and information contained in it with Eren Yeager, his best friend, and his dreams of seeing the world outside the walls. Armin was branded a heretic by other children for his unusual interest in the outside world and was thus frequently picked on. Too timid to defend himself, Armin would often rely on his friends Eren and Mikasa Ackerman to protect him from local bullies. This, coupled with his frail physique, was a deep shame for Armin, leading him to have poor self-esteem and to believe that he is a burden to others. Because of this, Armin has always been very eager to prove his worth, especially towards his close friends. \n\nArmin is known to be exceptionally loyal and selfless. He constantly worries for the safety of his friends, and he is always prepared to throw himself into dangerous situations to save them. Alongside his kindhearted nature and emotionally intelligence, Armin is a very analytical person. He likes to think deeply about situations and solve problems using his mind. These personality traits, in conjunction with his intelligence, good judgment, level headedness, ability to plan ahead, come up with creative ideas and to think outside the box, are what make him a great tactician. Although he may appear among the physically weakest of the 104th Training Corps, his incredible intelligence and strategic genius makes him an invaluable asset to any team.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46494-g7xYYuBtYPnO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46494
      },
      "rarity": "legendary"
    },
    {
      "id": "levi",
      "name": "Levi",
      "alt_names": [
        "リヴァイ",
        "Levi Heichou (リヴァイ兵長)",
        "Captain Levi",
        "Jinrui Saikyou no Heishi (人類最強の兵士)",
        "Humanity's Strongest Soldier",
        "Heishichou (兵士長)"
      ],
      "role": "supporting",
      "description": "__Height:__ 160 cm (5'3\")\n\nSquad Captain of the Special Operations Squad (known as Squad Levi) within the Survey Corps. He is known as humanity's strongest soldier. \n\nLevi is abrasive, blunt, and has a strong respect for structure and discipline. He is a clean-freak, demanding spotless cleanliness of himself, his equipment, and his environment. Rumors say he was involved in underground crime in his life before coming a soldier. Despite his emotionless and unfriendly demeanor, Levi cares deeply for his squad and greatly values human life.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b45627-CR68RyZmddGG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 45627
      },
      "rarity": "rare"
    },
    {
      "id": "hange-zoe",
      "name": "Hange Zoe",
      "alt_names": [
        "ハンジ・ゾエ",
        "Hange Zoë",
        "Hanji",
        "Hans"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7\")\n__Affiliation:__ Survey Corps; Section Commander, Squad Leader.\n\nLeader of the Survey Corps' Fourth Squad, Hange is also in charge of conducting research on Titans, and pursues this knowledge so passionately that they have become obsessed with Titans as a result. After originally holding a deep hatred for the creatures, Hange decided to take on a new outside-the-box approach to their research by letting go of their resentment towards Titans and approaching the test subjects with compassion. \n\nHange is an energetic, freethinking and quirky scientist, with a unique way of conducting both themselves and their work. Hange is a genius outside of just Titan research too, using their brain to create weapons, tactical plans, and inventions for the benefit of humanity. As a leader, Hange is thoughtful of their comrades, and can easily figure out complex problems in order to create plans for their teammates to carry out.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71121-7R7CnQd3lHgt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71121
      },
      "rarity": "rare"
    },
    {
      "id": "connie-springer",
      "name": "Connie Springer",
      "alt_names": [
        "コニー・スプリンガー",
        "Conny"
      ],
      "role": "supporting",
      "description": "__Height__: 158 cm (5'2\")  \n__Relatives:__ [Mother](https://anilist.co/character/137287/Conny-no-Haha), Martin Springer (Brother), Sunny Springer (Sister)\n\nConnie Springer is a graduate of the 104th Training Corps, having ranked 8th in class. He is known to be one of the quickest soldiers while using ODM gear and is skilled at making very sharp turns. He hails from the rural Ragako Village within Wall Rose, his greatest ambition being to make his family and village proud of him. Upon graduation, he chose to join the Survey Corps. \n\nUpbeat and naive, Connie is rather unfocused outside of combat, and enjoys goofing around and messing with his friends, but can also be a bit dense at times, as he can have some difficulty comprehending new developments as they appear. Connie always tries to remain optimistic, consistently caring for the well-being of his friends, family and village, and being willing to help in any way he can. However, this soft spot and the struggles he goes through as a member of the Survey Corps takes a toll on him, as he often responds to grief and loss with anger, irritation and hatred, causing him to at times make rash, impulsive decisions. He will do anything to protect his family, whether it be his biological family or his closest friends.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n46486-izhPjzut6WCZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46486
      },
      "rarity": "rare"
    },
    {
      "id": "jean-kirstein",
      "name": "Jean Kirstein",
      "alt_names": [
        "ジャン・キルシュタイン",
        "Jean Kirschtein",
        "Jeanie",
        "Horse Face"
      ],
      "role": "supporting",
      "description": "__Height__: 175 cm (5'8\")\n__Relatives__: [Mother](https://anilist.co/character/131444/Jean-no-Haha)\n\nJean Kirschtein is a graduate of the 104th Cadet Corps, among whom he ranked 6th for his skills with ODM gear and ability to look at things through a more tactical lense. Jean hails from Wall Rose's Trost District, and joined the military with hopes of living a peaceful life within the walls as part of the Military Police. However, he would later find himself joining the Survey Corps after being convinced both by his close friend [Marco Bott's](https://anilist.co/character/62479/Marco-Bott) words, and after witnessing the death of several of his comrades.\n\nJean has a blunt personality. He holds no restraint when it comes to speaking his mind, even when he knows it would not be wise to do so or when it could spark conflict. Jean is also pragmatic: he has a strong aversion to exposing himself to dangerous situations. During his time as a cadet, Jean was extremely hot-headed, easily becoming frustrated and quick to resort to violence when pushed. Jean was also very cynical about defeating the Titans, believing that humanity has no chance against them and openly mocking more idealistic individuals like [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager), and saw resisting the Titans as a hopeless cause. However, despite these things, and although he presents himself as self-centered, Jean places high value on the lives of his comrades, and is willing to risk his life to prevent countless more deaths from his comrades. Even with his shortcomings, Jean has shown himself to be a natural leader, being able to understand others and assess situations well because of his flaws, and proves capable of leading his fellow soldiers when they are left confused and without a plan.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46498-ritqAj9FW6jX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46498
      },
      "rarity": "rare"
    },
    {
      "id": "reiner-braun",
      "name": "Reiner Braun",
      "alt_names": [
        "ライナー・ブラウン"
      ],
      "role": "supporting",
      "description": "__Height__: 185 cm (6'1\")\n\nMember of the Survey Corps and former cadet of the 104th Training Corps. Reiner is a passionate and strong-willed young man with a strong sense of duty. He ranked 2nd in his training class upon graduation, finishing behind only [Mikasa](https://anilist.co/character/40881). His comrades have great trust in him, and he is stated to be the \"big brother\" of the 104th cadets.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46484-P6A2GjNQn49F.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46484
      },
      "rarity": "rare"
    },
    {
      "id": "annie-leonhart",
      "name": "Annie Leonhart",
      "alt_names": [
        "アニ・レオンハート"
      ],
      "role": "supporting",
      "description": "__Height__: 153 cm (5\")  \n\nA member of the 104th Southern Division in the Cadet Corps. After graduating from the 104th, ranked 4th place in the top 10, she ends up joining the Military Police. She is roommates with [Hitch Dreyse](https://anilist.co/character/86017).\n\nA stoic girl, Annie is considered to be an isolated, solitary type, being rarely seen smiling or socializing and often having an emotionless expression. She is apathetic and somnolent, with little desire to put in any effort into meaningless disciplines or activities. Nonetheless, what drives Annie more than anything is her desire for a normal life.",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46490-tan274Ifc1Jf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46490
      },
      "rarity": "rare"
    },
    {
      "id": "pieck-finger",
      "name": "Pieck Finger",
      "alt_names": [
        "ピーク・フィンガー"
      ],
      "role": "supporting",
      "description": "__Height__: 155 cm\n\nPieck is an Eldian who serves as one of Marley's Warriors. She is shown to be somewhat sweet and kind, consistently shown to care about her fellow Warriors and the Warrior candidates. ~!She is the current inheritor of the Cart Titan.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125603-Z2rgiHUGbAmY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125603
      },
      "rarity": "rare"
    },
    {
      "id": "falco-grice",
      "name": "Falco Grice",
      "alt_names": [
        "ファルコ・グライス",
        "Ben (ベン)"
      ],
      "role": "supporting",
      "description": "__Height__: 140 cm\n__Position__: Warrior Candidate\n\nFalco Grice is an Eldian Warrior candidate working for the Marley government and is the younger brother of [Colt Grice](https://anilist.co/character/125665/Colt-Grice). Falco is close friends with his fellow warrior candidates; [Udo](https://anilist.co/character/125663/Udo), [Zofia](https://anilist.co/character/125664/Zofia), and [Gabi](https://anilist.co/character/125659/Gabi-Braun).\n\nWhile not as physically strong as his fellow soldiers, he makes up for it with his quick wit and improvisation. He is a very merciful and compassionate person, going out of his way to protect and save other people lives, even enemy soldiers. He is also very polite and respectful towards others, and is an empathetic person, being willing to hear people out and properly understand things from their points of view.\n\n~!He is a candidate to inherit the power of the Armored Titan. He has the desire to become the Armored Titan in order to prevent Gabi Braun from inheriting it, as he has a crush on her and wants them to live a long life.!~",
      "metadata": {
        "gender": "male",
        "age": "12-15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125660-mrmpOJLjJIkv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125660
      },
      "rarity": "rare"
    },
    {
      "id": "gabi-braun",
      "name": "Gabi Braun",
      "alt_names": [
        "ガビ・ブラウン",
        "Mia (ミア)"
      ],
      "role": "supporting",
      "description": "__Height__: 138 cm\n\nGabi Braun is an Eldian living in the Liberio internment zone and the cousin of [Reiner Braun](https://anilist.co/character/46484/Reiner-Braun). She is friends with her fellow warrior candidates [Udo](https://anilist.co/character/125663), [Zofia](https://anilist.co/character/125664/Zofia), and [Falco Grice](https://anilist.co/character/125660). \n\nGabi is very passionate and head-strong, expressing her emotions and opinions without inhibition. She is also brave, possessing boundless determination, and willing to put her life on the line to complete a goal for a perceived greater good. However, these attributes can also make her somewhat overbearing and domineering. This causes her to be tactless at times, forcing her opinions on others and taking charge regardless of whether it was asked for or not. She mostly shows this side around her fellow Warrior candidates, considering herself their de facto leader to an extent, and even threatening to 'punish' them when they disagree with her. Nonetheless, she is friendly enough that they have no issue with spending their leisure time with her. Aside from her resolve and determination, Gabi is care-free even on the battlefield, making remarks about her cuteness and claiming her commander loves her too much to sacrifice her.\n\n~!She is a Warrior candidate that is likely to inherit the Armored Titan.!~",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125659-O37MZQWibV7g.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125659
      },
      "rarity": "rare"
    },
    {
      "id": "onyankopon",
      "name": "Onyankopon",
      "alt_names": [
        "オニャンコポン"
      ],
      "role": "supporting",
      "description": "Onyankopon is one of the Anti-Marleyan Volunteers and aids the Survey Corps during the Raid on Liberio. He pilots an airship following orders from [Hange](https://anilist.co/character/71121/) for the Corps to use during their retreat.\n\n(Source: Attack on Titan Fandom)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b192909-81EoCndP0uEH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 192909
      },
      "rarity": "rare"
    },
    {
      "id": "yelena",
      "name": "Yelena",
      "alt_names": [
        "イェレナ"
      ],
      "role": "supporting",
      "description": "Yelena is the leader of the Anti-Marleyan Volunteers working under Zeke Yeager. She was one of the Marleyan soldiers on board the first survey fleet to Paradis Island after Marley's failed attack operation. She is a very tall woman with her blonde hair styled in a short bob with straight bangs. She has large dark eyes and somewhat androgynous features due to her build and style.\n\nYelena is a fervent follower of Zeke Yeager, holding great admiration and respect for him. She is usually calm and collected, her demeanour remaining unchanged even when Jean Kirstein yelled at her for failing to see her job through. Nonetheless, she is willing to take responsibility and apologizes should she fail in her task. Yelena appears to maintain a very relaxed demeanour while having dry, humorous undertones to much of her actions.\n\n~!It is later revealed that Yelena was born into an unassuming family in Marley, and eventually became disillusioned with her own country. After meeting Zeke Yeager, Yelena concocted a plan to solidify herself in history by helping Zeke save the world. As part of her narrative, Yelena created a false background for herself, claiming that her homeland was invaded and conquered by Marley. She was forcibly drafted as a soldier to fight in the Marleyan military, where she met similar-minded soldiers and organized them into the Anti-Marleyan Volunteers to fight against Marley.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b133216-HKl61n4F7eYv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133216
      },
      "rarity": "rare"
    },
    {
      "id": "floch-forster",
      "name": "Floch Forster",
      "alt_names": [
        "フロック・フォルスター"
      ],
      "role": "supporting",
      "description": "Floch is a new recruit in the Survey Corps. He joined the Survey Corps during the two months between the attack at Orvud District and the return to Shiganshina District.\n\n~!After the rest of the Yeagerists are killed during the port battle, Floch hides on the ship to Marley. After shooting holes in the fuel tank of the flying boat, Floch is ultimately killed by Mikasa.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127703-qNIccR0yPZKu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127703
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T23:38:41.914Z"
}