{
  "work_id": "jojos-bizarre-adventure-part-5-golden-wind",
  "count": 15,
  "characters": [
    {
      "id": "giorno-giovanna",
      "name": "Giorno Giovanna",
      "alt_names": [
        "ジョルノ・ジョバァーナ",
        "GioGio",
        "Haruno Shiobana"
      ],
      "role": "protagonist",
      "description": "__Height__: 172 cm (Manga), 175 cm (Anime)\n__Nationality:__ British-Japanese \n__Occupation__: ~!Passione Soldato, Passione Mafia Boss!~\n~!__Stand:__ Gold Experience, Gold Experience Requiem!~\n\nBorn Haruno Shiobana, Giorno is the son of Dio (fathered using Jonathan Joestar's body, which logically that would make him part of the Joestar family) and a Japanese woman. As a young child his mother remarried, to an Italian man, and they moved to Italy; hence Haruno Shiobana became Giorno Giovanna.    \n\nGiorno's great ambition in life is to become a mafia boss (a \"Gang Star\"), and as such he eventually joins the mob squad Passione. Though he is its youngest and newest member, he quickly proves his mettle and eventually becomes the de facto leader of the group. Unlike typical mafia bosses, he wanted to give divested riches to the poor, giving him an agenda similar to Robin Hood. He eventually influences all of Passione, ~!all but their boss, who later became their worst enemy.!~",
      "metadata": {
        "gender": "male",
        "age": "15-26",
        "dateOfBirth": "1985-04-16"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b10529-AloL8jjZwjsg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10529
      },
      "rarity": "epic"
    },
    {
      "id": "narancia-ghirga",
      "name": "Narancia Ghirga",
      "alt_names": [
        "ナランチャ・ギルガ"
      ],
      "role": "protagonist",
      "description": "__Height__: 170cm\n__Nationality__: Italian\n__Stand__: Aerosmith\n__Occupation__: Passione Soldato, Bucciarati's Subordinate\n\nNarancia is one of the heroes of part 5, a part of Bruno's gang. Narancia's mother died of sickness, and his father thinks he is a loser. At age 14 he was wandering around and was picked up by Fugo and from there he meets Bruno. Narancia was so overwhelmed with Bruno's kindness that he vowed to follow him forever. Aerosmith is an airplane-like stand, equipped with machine guns and missiles to attack enemies. It uses a radar to detect an enemy's position. It's radar detects only CO2, which makes it a problem when there is a big crowd.  Like Bruno, Narancia delivers his finishing line in segments. He'll say \"Vola, vola, vola...\" during his rapid-fire attack and end with \"Volare Via\" (Italian for \"Fly Away\") when he finishes.  While not a direct translation of the word, Narancia's name is derived from \"arancia\" which is Italian for \"blood orange\" His education doesn't extend past elementary school, a fact that he gets angered when people mention it. His favorite TV show is the anime Fist of the North Star.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": "1983-05-20"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b11895-qLSpMN3gVLHP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 11895
      },
      "rarity": "epic"
    },
    {
      "id": "bruno-bucciarati",
      "name": "Bruno Bucciarati",
      "alt_names": [
        "ブローノ・ブチャラティ",
        "Bruno Buccellati"
      ],
      "role": "protagonist",
      "description": "__Height__: 178cm\n__Nationality__: Italian\n__Occupation__: Passione Capo\n\nBruno Bucciarati makes his first appearance as a member of the fictional gang \"Passione\", interrogating Giorno Giovanna about the death of another gang member; \"Weepy Eye\" Luka. Afterwards, Giorno convinces Bucciarati to help him overthrow the boss of \"Passione\", in a plot to take over the gang. Eventually defecting from \"Passione\", Buccellati leads a group of rogue gang members against the boss, who is revealed to be a man named Diavolo.  As a child, Bruno was born in a poor fishing village, but he looked up to his father because of the love he had for his family. When his father became mixed up in the drug business and was badly injured, Bruno protected his father from the people that were trying to kill him, by killing them himself. This led him into the world of gangsters. Even though he was a member of \"Passione\", he had a kind personality; many people came to him for help.  Sticky Fingers is the name of Bucciarati's Stand. It has the ability to place a fully functional zipper with a touch. For example: Sticky Fingers can hit a wall, placing a zipper on it. It can then open the zipper, allowing entrance through or into the wall. Its ability is not limited to inanimate objects; it can be used on humans. Bucciarati is able to use its ability on himself. Its ability can also be used offensively, to take things apart, or to mismatch things.  \n\nBucciarati delivers his catch phrase while his Stand beats his opponents senseless with its fists. He begins stringing \"Ari ari ari\" to its rapid punches, saying \"Arrivederci\" on finish; \"Arrivederci\" meaning \"Goodbye\" in Italian.",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": "1980-09-27"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13045-TIpIF82cMkG9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13045
      },
      "rarity": "epic"
    },
    {
      "id": "pannacotta-fugo",
      "name": "Pannacotta Fugo",
      "alt_names": [
        "パンナコッタ・フーゴ "
      ],
      "role": "protagonist",
      "description": "__Height__: 178 cm\n__Nationality__: Italian\n__Occupation__: Passione Soldato, Bucciarati's Subordinate\n__Stand__: Purple Haze\n\nPannacotta Fugo is part of Bruno Bucciarati's gang. He is a serious and caring but easily enraged youth. A young and quick-tempered strategist, Fugo is a member of Bucciarati's team and, by extension, Passione. In addition to being one of the more calculated members on the team, he possesses the particularly deadly Stand, Purple Haze.\n\n~!He follows Giorno and Bucciarati in their mission to protect Trish Una. He uses his Purple Haze to help retrieve the key and after safely escort Trish to the boss, but he was not sure about following his gang in betraying the boss, so he dropped out of the gang.!~",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": "1985-04-10"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13083-vEmGajGdXqCu.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13083
      },
      "rarity": "epic"
    },
    {
      "id": "guido-mista",
      "name": "Guido Mista",
      "alt_names": [
        "グイード・ミスタ"
      ],
      "role": "protagonist",
      "description": "__Height__: 182cm\n__Nationality__: Italian\n__Stand__: Sex Pistols\n\nMista is one of the heroes of part 5, a part of Bruno's gang. When he was younger, he had a run-in with a group of gangsters, and was shot at. All of the gangster's shots missed, and that is where he saw an opportunity to pick up a gun, take aim, and shoot them all in the head. He was sentenced to prison for the rest of teenage years, and was eventually bailed out by Bucciarati, and passed Polpo's test. Guido tends to use a revolver as his firearm, and believes the number 4 is unlucky due to events from his childhood and the character for 4 in Japanese sounds similar to the word &quot;die&quot;.    Sex Pistols is a stand composed of Six bullet like &quot;people&quot; living inside a gun, numbered from 1 to 7 (with no number 4). Guido can control the bullets to hit any direction and can do tasks when instructed to. Each &quot;person&quot; has different personalities, love to eat, if not fed, they will not work. It is very similar to Hol Horse's The Emperor.",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": "1982-12-03"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13084-DMCv7SP1uRBq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13084
      },
      "rarity": "epic"
    },
    {
      "id": "leone-abbacchio",
      "name": "Leone Abbacchio",
      "alt_names": [
        "レオーネ・アバッキオ"
      ],
      "role": "protagonist",
      "description": "__Height__: 188\n__Nationality__: Italian\n__Stand__: Moody Blues\n__Occupation__: Passione Soldato, Police Officer\n\nLeone Abbacchio is a fictional character from the Japanese manga JoJo's Bizarre Adventure. Abbacchio is one of the heroes of part 5, a part of Bruno's gang. Abbacchio was a cop once. His dream was to protect people. Then one day, one of the police died protecting him. From then on, he has no hope of living and decided to join the gang.  Moody Blues can repeat the past of anything or any person. Moody Blues becomes an easy target for enemy to attack since it cannot attack when it's doing the \"rebroadcasting\". Once it is out of the \"rebroadcasting\", it can attack again.  (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "21",
        "dateOfBirth": "1980-03-25"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17525-mlrTtUKPeEOb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17525
      },
      "rarity": "epic"
    },
    {
      "id": "trish-una",
      "name": "Trish Una",
      "alt_names": [
        "トリッシュ・ウナ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 163 cm (5'4\")\n\nThe sole female member of Buccellati's gang. She is the daughter to their boss, Diavolo, and was living a normal life before she found out who her father was. From then on, she was on the run to meet her father. \n\n~!When she finally got to her father, she learned that he actually wanted to kill her, so all his ties with the past would be erased, including the people related to him. On her journey with Buccellati's gang, she was able to awake her stand power, Spice Girl, that was laying dormant within herself. \"Spice Girl\" can greatly increase an object's elasticity, making it nearly indestructible.!~",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": "1985-06-08"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27153-D3ru0eppKXRu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27153
      },
      "rarity": "epic"
    },
    {
      "id": "diavolo",
      "name": "Diavolo",
      "alt_names": [
        "ディアボロ",
        "Diaboro",
        "Soliddo Nazo",
        "Strawberry with legs"
      ],
      "role": "protagonist",
      "description": "__Height:__ 191 cm (6'3\")\n__Nationality:__ Italian\n__Occupation:__ ~!Passione Mafia Boss!~\n\n~!Diavolo, the Boss of Passione and main villain of Part 5, was born in a female prison. His birth is a mystery because his mother claimed that he was conceived two years before her sentence and all the guards were female. \n\nDiavolo was raised by a priest in his mother's hometown of Sardinia because she can't raise him while in prison. When he turned 19, when the priest was constructing an apartment for Diavolo, he found his mother buried alive under a stone tablet. Around the same time, a fire broke out and the priest and Diavolo were among the seven who died in the fire. However, in reality Diavolo survived and joined Passione soon after. \n\nDuring that time, Diavolo recovered the bow and six Arrows in Egypt and quickly ran off with them. He then sold five of the Arrows to Enya Geil and kept the remaining one for himself (that same arrow was attached to Polpo's Black Sabbath). Between Stardust Crusaders and Golden Wind, he sets out to kill all his blood relatives, and those who discover his identity, to ensure his name is erased from existence and he took the pseudonym Soliddo Nazo during his years in Passione. Diavolo means \"devil\" in Italian, fitting considering his personality and role as the main antagonist of Part 5.  \n\n__Stand:__ King Crimson - A light red humanoid whose face appears to have a smaller copy of itself in its forehead, perhaps to mirror Diavolo's psyche. King Crimson has the power to predict up to ten seconds into the future, and \"erase time\", effectively causing a time skip, where everything except itself and Diavolo is suddenly changed to be in the state they would have been a short time later (usually 3-10 seconds later). Time still flows normally for Diavolo, who can interact (or not interact, he can choose which objects to interact with) with the time-skipped objects for the amount of time that would have normally intervened (to Diavolo this appears in the form of the would-have-been intervening objects' states being superimposed on each other, in a fashion akin to Nude Descending a Staircase). The nature of the time skip is such that, for example, he predicts a bullet coming at him, and erases the time that it would have hit him in. To the viewer a bullet that would have hit Diavolo will suddenly be shifted to be on his other side as where it would be seconds later.!~",
      "metadata": {
        "gender": "male",
        "age": "~33",
        "dateOfBirth": "1967-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27155-ZqYlVLxAZjzV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27155
      },
      "rarity": "epic"
    },
    {
      "id": "vinegar-doppio",
      "name": "Vinegar Doppio",
      "alt_names": [
        "ヴィネガー・ドッピオ"
      ],
      "role": "protagonist",
      "description": "~!Vinegar Doppio is Diavolo's young, innocent, and bizarre second personality. He considers himself as Diavolo's most trusted subordinate. Doppio acts as a disguise for Diavolo, when he interacts socially with others in the outside world. He turns into Diavolo whenever someone finds out about Diavolo's identity. Doppio communicates with Diavolo with an object that only Doppio hears ringing, making people think that he's insane, or scary (to what children think of him). Doppio usually makes the sound とぅるるるる~ (Turururu~), which is similar to a phone ringing.    Doppio means \"Double\" in Italian, showing his nature as Diavolo's second personality.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27156-FXlIrGAdCwoO.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27156
      },
      "rarity": "epic"
    },
    {
      "id": "joutarou-kuujou",
      "name": "Joutarou Kuujou",
      "alt_names": [
        "空条承太郎",
        "JoJo",
        "Qtaro",
        "Professor Kuujou",
        "Jotaro Kujo"
      ],
      "role": "supporting",
      "description": "**Height:** 195 cm (6'5\")\n__Occupation:__ Student, Marine Explorer, Oceanographer\n__Nationality:__ Japanese \n\nJoutarou is Holly Kujo's son and Joseph Joestar's grandson. In Part 3, he has a recognizable attire of a blue trenchcoat-length school uniform jacket with yellow chains on the collar. He also wears a trademark hat which, while torn in the back, often seems to blend with his hair. When Joutarou first appears, he turned himself in to the police because he believes his Stand is an evil spirit possessing him. After he is released from jail, and learns what his Stand is, Joutarou gets used to Star Platinum -- a fierce, muscular, vaguely Aztec-looking spirit with \"the precision of a machine\" and the ability to destroy virtually anything with a sledgehammer barrage of fists. He has a very tough exterior, and is even rather rough and delinquent, but he also is very dedicated, intense, and loyal. He is very intelligent, but usually lets his (or Star Platinum's) fists do the talking with the enemy, even though he often has to rely on his wits to deal with stand users' attacks. He is also known for a quick and short temper. His catchphrase is \"Yare yare daze.\" It generally relates of being bored or exasperation. In Part 3, he is the main target of Dio, who realizes that Joutarou is his greatest threat.\n\nOne of the strongest stands in the JoJo universe; Star Platinum possesses super human senses, strength, stamina, accuracy and speed. It can see for great distances and at great magnifications. The Star tarot card that Star Platinum is named after symbolizes hope. Like other physically powerful stands, Star Platinum suffers from a narrow range of activity. It can only be active within a 2-3 meter radius from Joutarou. ~!It is similar to Dio's The World stand, and, it turns out, can likewise be used to stop time, but that ability is only revealed in Joutarou's epic battle with Dio Brando when Dio was about to drop a steamroller on him.!~\n\nIn the sixth story arc Stone Ocean, Joutarou becomes an oceanologist, moves to the United States, eventually marries, and his daughter, Jolyne inherits the potential to wield Stand powers.",
      "metadata": {
        "gender": "male",
        "age": "17-40",
        "dateOfBirth": "1970-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4003-gWDSEGbeOAll.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4003
      },
      "rarity": "common"
    },
    {
      "id": "jean-pierre-polnareff",
      "name": "Jean-Pierre Polnareff",
      "alt_names": [
        "ジャン＝ピエール・ポルナレフ"
      ],
      "role": "supporting",
      "description": "__Height:__ 185 cm (6'1\")\n\nJean-Pierre Polnareff is a 22 year old Frenchman who joins the Joestar group on their journey to Egypt after being freed from Dio's control by the group. He aims to avenge the murder of his sister. His brash nature and overconfidence combined with his general tomfoolery is often the source of trouble throughout the journey, and other members of the group often remark on his tendency to endanger himself and others.\n\n~!Polnareff reappears in 2001 (Part 5), now 36 years old and wheelchair-bound, to assist Giorno and the rest of Passione in their fight against the boss.!~\n\nHe also serves as the inspiration for many characters in other franchises such as Guile (Street Fighter), Paul (Tekken), Benimaru Nikaido (King of Fighters).",
      "metadata": {
        "gender": "male",
        "age": "23-36",
        "dateOfBirth": "1965-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4368-1KToX8uSi1U1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4368
      },
      "rarity": "common"
    },
    {
      "id": "kouichi-hirose",
      "name": "Kouichi Hirose",
      "alt_names": [
        "広瀬康一",
        "Koichi Hirose"
      ],
      "role": "supporting",
      "description": "An ally and classmate who meets Josuke when Jotaro is searching for him, resulting in the two becoming quick friends. His stand is Echoes, which has three distinct forms, or Acts (Koichi can only call upon one at any given time).",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24496-h2oMSeBxyYUc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24496
      },
      "rarity": "common"
    },
    {
      "id": "risotto-nero",
      "name": "Risotto Nero",
      "alt_names": [
        "リゾット・ネエロ"
      ],
      "role": "supporting",
      "description": "His stand is named Metallica, Metallica appears in the form of hundreds of tiny bodies, each resembling a small metal strip with vestigial arms, one or two scars, and featureless faces. Metallica is normally bound to Nero&#039;s blood, from which it can project magnetic auras. These auras allow Nero to reshape blood into any form by manipulation of the iron in hemoglobin. More specifically, he can manifest such sharp and deadly objects as razor blades, nails, and scissors directly inside his foe (apparently from memory, since the razor blades come with brand label etchings), and manipulate his own blood to create iron stitchings for any wounds he receives. One of Metallica&#039;s most dangerous qualities is that even if its target isn&#039;t killed by being slashed and pierced by the created objects, the immense iron deficit created in the victim&#039;s blood will probably be fatal in and of itself.",
      "metadata": {
        "gender": "male",
        "age": "28",
        "dateOfBirth": "1974-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n27152-StrBTCofwNhe.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27152
      },
      "rarity": "common"
    },
    {
      "id": "pesci",
      "name": "Pesci",
      "alt_names": [
        "ペッシ"
      ],
      "role": "supporting",
      "description": "Pesci is a member of La Squadra di Esecuzione. He operates together with Prosciutto, who he refers to as his \"big brother\" (most likely in the yakuza sense). Although he appears timid, he is actually even more dangerous than Prosciutto, which the heroes eventually find out the hard way.  His Stand is named Beach Boy (ビーチ・ボーイ Bīchi Bōi). This Stand takes the form of a fishing rod with a skull-shaped reel. The line can phase through any non-living thing, and sense living things in the immediate vicinity. The lure can also be affixed to a single place to await a victim. When a victim touches that area, Beach Boy will hook them, and begin burrowing into their body, usually aiming for the heart (Beach Boy is sensitive enough that Pesci can tell precisely where in the body the hook is). Any attack on the line itself is reflected back to the attacker.  Source: Wikipedia",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n78381-UMM0Y64wg4ne.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 78381
      },
      "rarity": "common"
    },
    {
      "id": "prosciutto",
      "name": "Prosciutto",
      "alt_names": [
        "プロシュート"
      ],
      "role": "supporting",
      "description": "Prosciutto is a member of La Squadra di Esecuzione. He is partnered with Pesci, who refers to Prosciutto as his \"big brother\" (or aniki), a title typically used by yakuza when addressing their superior. They try to assassinate Buccellati and his friends on a train headed to Florence.  His Stand is The Grateful Dead (ザ・グレイトフル・デッド（偉大なる死） Za Gureitofuru Deddo). A massive humanoid torso with no lower body. Instead, it trails wires from its \"waist\", and its entire surface is covered with evil-looking eyes. The eyes exude a vapor that rapidly accelerates living beings' aging. However, the aging is staved off by cold, meaning that women (who have a somewhat lower body temperature on average than men) age less rapidly, and, as Bucciarati discovers, one can completely avoid the effect by holding ice up to the affected areas. The aging process accelerates even further if The Grateful Dead actually makes physical contact with a victim. Prosciutto can choose whether he is affected; if so, his touch has the same effect as The Grateful Dead, and will reverse his own aging.  Source: Wikipedia",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n78383-jCRA2z6Xcfwm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 78383
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-25T15:05:11.129Z"
}