{
  "work_id": "a-certain-magical-index",
  "count": 15,
  "characters": [
    {
      "id": "index-librorum-prohibitorum",
      "name": "Index Librorum Prohibitorum",
      "alt_names": [
        "禁書目録",
        "インデックス",
        "Dedicatus545"
      ],
      "role": "protagonist",
      "description": "__Height:__ 148 cm (4'10\")\n__Classification:__ Magician\n__Affiliation:__ Anglican Church\n__Ability:__ Spell Intercept\n\nIndex, also known by her full name Index Librorum Prohibitorum, is one of the main heroines and the titular character of the series. She is a young nun from Necessarius, a branch of the Church of England. \n\nIndex is small in stature and has a petite build. About 14 or 15 years old, she has thigh-length, silvery-blue hair with very white skin and large green eyes. She also wears a white robe with golden embroidery sewed onto every edge of it, the Walking Church.",
      "metadata": {
        "gender": "female",
        "age": "14-15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13699-FRf8YNCXmhfb.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13699
      },
      "rarity": "epic"
    },
    {
      "id": "touma-kamijou",
      "name": "Touma Kamijou",
      "alt_names": [
        "上条当麻",
        "Kami-yan"
      ],
      "role": "protagonist",
      "description": "__Height:__ 168 cm\n__Classification:__ Esper (technically)\n__Esper Power:__ Imagine Breaker\n__Power Level:__ 0 (technically)\n\nThe main protagonist of Toaru Majutsu no Index and a supporting character in Toaru Kagaku no Railgun. He has the lowest psychic rank possible at Level 0&mdash;largely because the people testing psychic abilities cannot detect or classify his abilities. His power is Imagine Breaker, a power which negates all magic, psychic, or divine powers but also his own good luck. Due to the nature of his power, the founder of Academy City considers him neither a Psychic nor a Magician but rather a normal person with a unique ability. He tends to stay away from trouble but possesses a strong sense of justice, albeit somewhat shallow and dogmatic. He is a smart student and knowledgeable about certain subjects yet is a failure in his esper studies. While he is an idealist for the hopes of other people, ironically he is cynical about himself possibly because of his powers.",
      "metadata": {
        "gender": "male",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13700-UidPPlVkGJLP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13700
      },
      "rarity": "epic"
    },
    {
      "id": "mikoto-misaka",
      "name": "Mikoto Misaka",
      "alt_names": [
        "御坂美琴",
        "Railgun",
        "Number Three",
        "Tokiwadai's Ace",
        "Strongest Electromaster",
        "Electric Princess",
        "Biri-Biri (ビリビリ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 161 cm (5'3\")\n__Classification:__ Esper\n__School:__ Tokiwadai Middle School\n__Esper Power:__ Electromaster\n__Power Level:__ 5\n\nOne of the main heroines in the Toaru Majutsu no Index series and the protagonist of her side story, Toaru Kagaku no Railgun. An Esper of Academy City, her powers are ranked Level 5, the highest rank for the most powerful Espers. She ranks as third-strongest out of the seven people who hold this rank in Academy City.",
      "metadata": {
        "gender": "female",
        "age": "13-14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13701-aFJLRPGAWAae.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13701
      },
      "rarity": "uncommon"
    },
    {
      "id": "stiyl-magnus",
      "name": "Stiyl Magnus",
      "alt_names": [
        "ステイル＝マグヌス",
        "Fortis931"
      ],
      "role": "supporting",
      "description": "__Height:__ 200cm (6.56 ft)\n__Classification:__ Magician, Priest\n__Affiliation:__ Anglican Church (Necessarius)\n\nA sorcerer from Necessarius. His sorcery name is Fortis931. He is an extremely heavy smoker; he claims a world without nicotine would be hell. He specializes in using flames and is able to use a flame sword or summon a 3000 degree Celsius fire called Innocentius (\"King of Witch Hunters\") to battle his enemies. Despite his looks, he is actually fourteen-years-old and ironically is physically weak. He mostly has a bad temper but is actually kind, as he cares about Index very much and his failure to save her life without losing her memories was his greatest regret. When he learns the Church lied to him and Kaori about Index's condition, he decides to disobey orders to capture Index and let her live her life.  (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13915-My6j6ebFZ0vf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13915
      },
      "rarity": "uncommon"
    },
    {
      "id": "kaori-kanzaki",
      "name": "Kaori Kanzaki",
      "alt_names": [
        "神裂火織",
        "Salvere000"
      ],
      "role": "supporting",
      "description": "__Height:__ 175cm \n__Classification:__ Magician\n__Affiliation:__ Necessarius, Amakusa-Style Remix of Church (Priestess)  \n\nA  sorceress from Necessarius. Unlike her partner Stiyl, she uses magic to magically strengthen her body. Her sorcery name is Salvere000. She uses a 2 meter long katana (which actually is a Nodachi) called \"Seven Heavens Seven Swords\" as her weapon. She has a special attack called Nanasen (七閃, Nanasen? \"Seven Flash\") that uses her katana and some wires. She used to be a kind woman who treated Index like a sister, but when Index's memories were deleted by Necessarius, Kaori changed into a cold and silent woman as Index no longer remembered her and consequentially did not trust her. \n\nAfter Touma saves Index's life and her current memories, she decides to stay in Academy City to be with Index and protect her.  Later in the novels, more of her past is revealed. Not only is Kaori a skilled swordswoman, but she is a Catholic Saint possessing the \"Stigma\" — the ability to call upon God's power — and the former leader of the Amakusa Catholics. However, Kaori left the group as she resented that she had been fated since birth to become its leader, which led her to despise the concept of luck and fortune. Though she is Catholic, she joined Necessarius in hopes of changing her fate and befriended Index, developing a sisterly relationship with her. The repeated failed attempts to make Index remember her after each memory erasure resulted in her cold personality as Kaori began to accept that no matter how much a person tries, no one can change their destiny. She begins to show a kinder side to herself after Touma saves Index (thus giving her hope that anyone can defy their destiny) and gradually falls in love with him after he helps her face her past with the Amakusa Catholics, becoming more prone to showing emotion and sometimes showing a little embarrassment if she is with him. She is the protagonist of her own spin-off mini light novel bundled with the Toaru Kagaku no Railgun DVDs. \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13916-dtIzopanhdXM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13916
      },
      "rarity": "uncommon"
    },
    {
      "id": "accelerator",
      "name": "Accelerator",
      "alt_names": [
        "アクセラレータ",
        "Ippou Tsuukou (一方通行)",
        "Yuriko Suzushina (鈴科百合子)"
      ],
      "role": "supporting",
      "description": "__Height:__ 168 cm \n__Classification:__ Esper \n__Esper Power:__ Accelerator\n__Power Level:__ 5\n\nAccelerator is the most powerful Esper in Academy City. His real name is unknown, though Accelerator recalls his surname was composed of two characters and his given name consisted of three characters. \n\nA sadistic boy about the same age as Touma, he has the esper power \"Accelerator\", an ability unique to him. His ability includes \"Vector Change\", a form of telekinesis that allows him to change the vector values of anything he touches due in part of having a thin coat of AIM fields surrounding his body.",
      "metadata": {
        "gender": "male",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13917-160NVNDNgywA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13917
      },
      "rarity": "uncommon"
    },
    {
      "id": "komoe-tsukuyomi",
      "name": "Komoe Tsukuyomi",
      "alt_names": [
        "月詠 小萌"
      ],
      "role": "supporting",
      "description": "Despite her childish and very short (135 cm) appearance, she is actually an adult and one of Tōma's teachers. This is proven by her apartment being littered with beer cans and cigarettes. She also contradicts her age by acting childish to her students, having a child-like crush on Tōma, and ending her sentences with desu, something a child usually does. This irony means that she is often regarded as one of the seven great mysteries of Academy City. She has major interest in studying pyrokinesis and performs magic once, when Index requires her to participate in a magical ritual to heal her wounds. The fact that she is able to do so indicates she has no esper abilities of her own.  (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n16222-VGQaCcuSvCAv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16222
      },
      "rarity": "uncommon"
    },
    {
      "id": "kuroko-shirai",
      "name": "Kuroko Shirai",
      "alt_names": [
        "白井黒子"
      ],
      "role": "supporting",
      "description": "__Height:__ 152 cm (5'0\")\n__Classification:__ Esper\n__School:__ Tokiwadai Middle School\n__Affiliation:__ Judgment\n__Esper Power:__ Teleport\n__Power Level:__ 4\n\nKuroko is [Mikoto](/character/13701/)'s kouhai in Tokiwadai Middle School and a protagonist in Toaru Kagaku no Railgun, as well as a supporting character in Toaru Majutsu no Index. A Level 4 Esper, she is a member of Judgment, a special public committee group whose duty is to maintain peace and order in Academy City. She has an unhealthy obsession with Mikoto, whom she calls \"Onee-sama\" (big sister), and is on the constant lookout for a chance to get physically intimate with her (and getting called a pervert in the process). \n\nHer power is instant teleportation, which allows her to teleport herself and anything she touches as long it weighs under around 130-137 kilograms to anywhere in a radius of around 81-85 meters.",
      "metadata": {
        "gender": "female",
        "age": "12-13",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17017-jaDcukuCmx2S.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17017
      },
      "rarity": "uncommon"
    },
    {
      "id": "aisa-himegami",
      "name": "Aisa Himegami",
      "alt_names": [
        "姫神秋沙",
        "Deep Blood"
      ],
      "role": "supporting",
      "description": "__Height:__ 160 cm\n__Classification:__ Esper (Gemstone) \n\n A quiet young girl with a rather blunt personality who wears Miko attire.   ~!While she may seem normal, she is also known as \"Deep Blood\" and has the ability to kill vampires when they approach her, as her blood's smell attracts them. However, it made her miserable because it killed her family and friends that were turned into vampires. This prompts her to go to Academy City, hoping to find a way to get rid of her powers, until she meets the alchemist Aureolus Izzard. She cooperates with him because he told her that her blood can be used to save the life of a person he cared for (Index) in return for helping her get rid of her powers.!~  ~!When Aureolus learns Index's life was already saved by Tōma and tries to kill him, Aisa attempts to defend Tōma, which prompts Aureolus to use his alchemy to try to kill her as she was now useless to him. Her life was saved by Tōma who dispelled the spell on her with his right hand. When she asks Tōma about why he saved her, he told her that he did not have a reason to rescue her. After the incident, she lives with Tōma and Index but later moves to Komoe's apartment and wears a magical power-blocking cross, which enables her to live what she had always wanted: a normal life. She was formerly a student at Kirigaoka Academy for Girls, one of the five elite schools of Academy City, but was transfer to Tōma's school when her sponsor, Aureolus Izzard mysteriously disappear thus ending her enrollment at Kirigaoka Academy. Ever since Tōma saved her life, Aisa started to have feelings for him, which is ironic as she once joked that Tōma's life was like a dating sim. !~",
      "metadata": {
        "gender": "female",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17179-Bgv5FqV5XPVI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17179
      },
      "rarity": "uncommon"
    },
    {
      "id": "aureolus-izzard",
      "name": "Aureolus Izzard",
      "alt_names": [
        "アウレオルス＝イザード"
      ],
      "role": "supporting",
      "description": "Aureolus is an alchemist who has the power (called Ars Magna) to turn his thoughts into reality. He was once Index&#039;s partner and became obsessed about her. In order to save her he made Deep Blood help him and was up to turn Index into a vampire and save her, though she was always saved by Touma. That made him really mad.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n17378-bVxEwtxEmSmZ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17378
      },
      "rarity": "uncommon"
    },
    {
      "id": "misaka-10032",
      "name": "MISAKA 10032",
      "alt_names": [
        "御坂妹, ミサカ10032号",
        "Misaka Imouto",
        "Tennie",
        "Icchan"
      ],
      "role": "supporting",
      "description": "Misaka is the 10032nd clone of Misaka Mikoto, a Sister, that was first introduced in Toaru Majutsu no Index and plays a relatively small role in Toaru Kagaku no Railgun. Originally supposed to be killed in the 10032 experiment against Accelerator as part of the Level 6 Shift Project, she is one of the few Sisters that remained in Academy City for readjustments. She becomes the most prominent clone in the series after being rescued by Kamijou Touma, and is referred to as Misaka Imouto (御坂妹 Misaka Imōto?, lit. \"Misaka's little sister\") whenever they meet.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17729-nfpX0s8nZ4u8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17729
      },
      "rarity": "uncommon"
    },
    {
      "id": "maika-tsuchimikado",
      "name": "Maika Tsuchimikado",
      "alt_names": [
        "土御門 舞夏"
      ],
      "role": "supporting",
      "description": "[Motoharu’s](https://anilist.co/character/18926/Motoharu-Tsuchimikado) younger stepsister. She wears a maid attire as she goes to a Maid School to learn to become a maid and rides on top of a cleaning bot. She has a friendly relationship with Touma and knows that he has a girl living with him but keeps it a secret except to Tōma himself. Even though she lives in her school's dormitory, she sometimes go to live at her brother's apartment.  (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "age": "13-14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n17785-kLXJfK3cajtz.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17785
      },
      "rarity": "uncommon"
    },
    {
      "id": "motoharu-tsuchimikado",
      "name": "Motoharu Tsuchimikado",
      "alt_names": [
        "土御門元春",
        "Sis-con Sergeant"
      ],
      "role": "supporting",
      "description": "__Height:__ 176cm (5'9\")\n__Classification:__ ~! Magician-Esper hybrid !~ \n__Affiliation:__ ~! Necessarius, GROUP (Leader) !~  \n\nA blond teenager who is always seen with sunglasses and wearing an Aloha shirt. He is a friend and classmate of Tōma who just happens to be his next-door neighbor at the dormitory they're staying at. While he seem like a normal, average teenager, there's more to him than meets the eye.   ~!Secretly, Tsuchimikado is actually a former agent of Necessarius who became a freelance spy for Necessarius, Academy City, and other unknown organizations; the leaders of both Necessarius and Academy City are both aware of this but have decided to let him be for the time being. His sorcery name is Fallere825, 'the back-stabber'.!~   ~!He was formerly a skilled Onmyōji as his family are descendants of Abe no Seimei but gave up his abilities when he went under the ESP development curriculum. He has a younger step-sister named Maika, whom he is also in love with, and for this he is known as the Shisukon Gunsō (シスコン軍曹, \"Sis-com Sergeant\"?). He is also a member of one of Academy City's secret organizations, the \"GROUP\". His ESP ability is the Level 0 Auto Regeneration (肉体再生, Nikutai Saisei?, lit. \"Body Regeneration\"). Due to this power, he can still use magic as he can repair the damage done to his body, making him the only successful psychic/magician hybrid. Despite these advantages, he avoids using magic except in the most desperate situations as he cannot avoid the extreme pain caused by using it.!~ (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n18926-YhscVchixkoN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18926
      },
      "rarity": "uncommon"
    },
    {
      "id": "sasha-kreuzhev",
      "name": "Sasha Kreuzhev",
      "alt_names": [
        "サーシャ＝クロイツェフ ",
        "Misha"
      ],
      "role": "supporting",
      "description": "A character introduced in Toaru Majutsu no Index, she is an operative of Annihilatus of the Russian Orthodox Church, which specializes in the hunting down of spirits that are not supposed to exist. Her Misha form makes its appearance early in the series during the Angel Fall Arc, but her first actual appearance is seen much later in the series. She is hinted to be an avid drinker and doesn't mind enjoying Brandy in work hours even though she is not supposed to.\n\nSasha can easily be distinguished by her signature look, which consists of a red hood and cape (which hides her long curly blond hair) and matching pointy red shoes. Her torso and limbs are covered with leather belts, and has metal braces on her ankles, wrist and waist, the latter being used to carry her many eccentric weaponry. Underneath is a small layer of clothing that covers her torso and her arms up to the wrist, and acts like thigh-high socks. They are form-fitting which naturally shows Sasha's figure. Sasha's skimpy dress can be attributed to her female superior&mdash;Vasilisa&mdash;who forced Sasha to wear it as part of her hobby.",
      "metadata": {
        "gender": "female",
        "age": "13",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n19184-X7NbgnllS4mf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 19184
      },
      "rarity": "uncommon"
    },
    {
      "id": "etzali",
      "name": "Etzali",
      "alt_names": [
        "エツァリ",
        "Mitsuki Unabara"
      ],
      "role": "supporting",
      "description": "Etzali is an Aztec magician who was originally a member of Return of the Winged One. He was sent into Academy City to monitor the growing Kamijou Faction. He is later defeated by Kamijou Touma himself, and later joins GROUP.  Etzali usually takes the form of Unabara Mitsuki. His true form though is that of a young man with dark skin, and black wavy hair.  Etzali was a member of the magical Aztec organization known as Return of the Winged One and was a senior to fellow member Xochitl. A month before August 31st, Etzali was sent to Academy City in order to judge if the growing Kamijou Faction was dangerous and if it would destroy the balance between the magic and science side.  The radical actions of Kamijou Touma compel his organization to pit Etzali against the Kamijou Faction. His operation began when he was able to abduct Unabara Mitsuki and take his form, a week before August 31st, and set his sights on Mikoto, with the objective of taking her form and sowing distrust into Kamijou and his peers. Even though he has to follows orders he disclosed that he did in fact fall in love with Mikoto.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/19612.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 19612
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-25T17:14:57.446Z"
}