{
  "work_id": "anohana-the-flower-we-saw-that-day",
  "count": 16,
  "characters": [
    {
      "id": "jinta-yadomi",
      "name": "Jinta Yadomi",
      "alt_names": [
        "宿海仁太",
        "Jintan",
        "Leader"
      ],
      "role": "protagonist",
      "description": "__Height:__ 165cm\n\nJinta is the main character of the series. In the past, Jinta was an energetic, young boy and the leader of his group, the Super Peace Busters. When Naruko asked him if he had a crush on Menma, he said, \"Why would I be in love with such an ugly—?\" He had plans to apologize to her the next day, but she died later that night in a drowning accident.\n\nUnable to forgive himself, Jinta spent the next years of his life in a constant state of gloominess. He became withdrawn and eventually became a hikikomori, or a shut-in. He currently lives with his father. While he is enrolled at the same high school as Naruko, he stopped attending.    ~!Jinta now lives a life of exclusion and wears a disguise (consisting of a pair of glasses and a beanie) in order to comfortably leave his house. He has also shown to be socially awkward amongst strangers.  Perhaps Jinta's defining attribute is his ability to see Menma. While no one else can see her, Jinta can communicate with her as well as touch her. Menma says that Jinta needs to fulfill her wish, although neither he nor she can remember what this wish is; however, they do know that it has something to do with their entire childhood group. For Menma's sake, Jinta has been trying to reconnect and reunite with his old friends.!~",
      "metadata": {
        "gender": "male",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40591-PFcHVI98QgnI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40591
      },
      "rarity": "legendary"
    },
    {
      "id": "meiko-honma",
      "name": "Meiko Honma",
      "alt_names": [
        "本間芽衣子",
        "Menma"
      ],
      "role": "protagonist",
      "description": "__Height:__ 147cm\n\nMenma is a ghost girl who suddenly appears several years after her death to Jinta and asks him to reunite their group of friends so her wish can be granted. Yet, she does not seem to remember what is her wish, but she knows she has to reunite her friends in order to remember. Despite being \"dead\", she is a very positive, energetic and lively person. According to Jinta, she is quite selfless and cries very often for others when they are hurt or upset, but not for herself.  Jinta calls her \"the beast of the summer\" as he relates her to being a manifestation of his stress instead of a ghost girl.    ~!Matsuyuki admitted his love to her on the day that she died; however, she didn't return his confession in favor of chasing after Jinta. It is hinted that she has feelings for Jinta, and only Jinta is able to see her. This is confirmed when Menma wrote a letter for Jinta, which read, \" _I love you, Jin-tan. It's the \"I want to marry you!\" type of \"I love you.\"_\"  Menma is able to reveal her presence to her friends by carrying objects, flickering the lights, etcetera. She is also able to communicate with them by writing in her diary. She seems to think that her wish was to send a rocket to Heaven with a note to Jinta's mother, so the reunited Super Peace Busters attempt to create one. Menma also wishes to be reincarnated after passing on so she can be in the world again, back with her friends. Without her, Menma's family is falling apart. Her mother is unable to move on from her death. Her father, who is hinted at being abusive, wants their family to overcome the grief. He does this by hiding all of Menma's possessions, yet it does her mother very little good. Her younger brother barely remembers her but wishes that their family could move on. He feels neglected by his mother since she is still stuck on Menma. !~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40592-mAEyaQyJu5oc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40592
      },
      "rarity": "legendary"
    },
    {
      "id": "naruko-anjou",
      "name": "Naruko Anjou",
      "alt_names": [
        "安城鳴子",
        "Anaru"
      ],
      "role": "protagonist",
      "description": "__Height:__ 165 cm (5'5\")\n\nNaruko is a childhood friend of Jinta and Menma. While she displays a cold attitude towards Jinta, she is secretly concerned for him. She is perhaps the closest to him at present and is enrolled the same school (although Jinta stopped attending school). Chiriko comments that Naruko has not changed over the years: she is still easily persuaded by everyone around her. Naruko seems to be popular in high school and gets along well with girls that Chiriko deems \"sluts.\"   While they have grown apart, Naruko seems cares deeply about her childhood friends. She works at a video game store and has a large collection of manga and video games herself. Because of this collection, she started reconnecting with Jinta and Poppo. Naruko Anjou is left handed  ~!Naruko admits that, when she was a child, she was jealous of Menma. Insecure of her glasses and curly hair, she desperately wanted to have flowing hair like Menma. Moreover, she was jealous of Jinta's affection towards Menma. Naruko secretly had a crush on Jinta, which is why she asked him whether he had feelings for Menma. She blames herself for Menma's death, because her question ultimately precipitated in Menma's death. Presently, it is shown that Naruko still has lingering feelings for Jinta.  Naruko is involved in a scandal when an older boy, whom she was hanging out with, tries to force her into a love hotel. When she wouldn't agree to have sex with him, he attempts to force her into the hotel to rape her; however, Matsuyuki protects her. Despite this, the rumor that Naruko had sex with this man reaches her high school. Naruko has to face the judgments of her fellow students until she decides to stop going to school in favor of working full-time to get the money to build the rocket.  She feels slighted when Jinta focuses on Menma and continues to ignore her, even after they reunited. Matsuyuki, who feels similarly since Menma is denying him, asks Naruko out. However she later tells Chiriko on the bridge that she loves only Jinta and that he is irreplaceable.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40593-3N05kRft0s8d.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40593
      },
      "rarity": "legendary"
    },
    {
      "id": "atsumu-matsuyuki",
      "name": "Atsumu Matsuyuki",
      "alt_names": [
        "松雪集",
        "Yukiatsu"
      ],
      "role": "protagonist",
      "description": "__Height:__ 181 cm (5' 11\")\n\nAtsumu is a childhood friend of Jinta and Menma. In the present, Atsumu holds a condescending attitude towards Jinta. He becomes agitated when Menma is mentioned and is still distraught over her death. He, together with Chiriko, attend the same high school, which Jinta failed the entrance exams to enter. Atsumu and Chiriko were once mistaken as a pair.   ~!Atsumu is still in love with Meiko despite her death and keeps one of her sundresses in his closet. He buys hair scrunchies and other trinkets to place at her grave. He revealed that he is able to see Menma too. But in the end of episode 4, it's been proven that he is a crossdresser and tried to fool everyone. Once they got him, Atsumu confessed his love for Meiko and that he felt guilty for her death. In episode 5, Atsumu seems to have a kind of interest for Naruko, asking her to go out with him and if she is a virgin.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40594-ZKnNeogrL2K0.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40594
      },
      "rarity": "legendary"
    },
    {
      "id": "chiriko-tsurumi",
      "name": "Chiriko Tsurumi",
      "alt_names": [
        "鶴見知利子",
        "Tsuruko"
      ],
      "role": "protagonist",
      "description": "As a child, Chiriko was a shy girl and a member of the Super Peace Busters. Now, she is enrolled at an elite school with Matsuyuki. Currently, she is ranked fourth in her class. She is serious, stoic, and cocky. Upon meeting with Naruko, Chiriko insults both her and her friends; however, she has since made amends with Naruko. While the other members of the Super Peace Busters have fallen apart, Chiriko and Matsuyuki have remained friends after Menma's death.   ~!Chiriko is shown to have feelings for Matsuyuki; however, he does not reciprocate her affection. Matsuyuki's heart belongs to Menma. He asks Naruko out, although the current status of their relationship is unknown. Chiriko overhears this conversation and is devastated.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40595-WWFvfCf4C8If.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40595
      },
      "rarity": "legendary"
    },
    {
      "id": "tetsudo-hisakawa",
      "name": "Tetsudo Hisakawa",
      "alt_names": [
        "久川鉄道",
        "Poppo"
      ],
      "role": "protagonist",
      "description": "Poppo is the first friend that Jinta reconnects with. As a child, Poppo was uncontrollably energetic and friendly and was always loyal to Jinta recognizing him as the leader of the group. These  traits have not changed. Presently, Jinta reunited with him when he was searching for Menma. He visited their old clubhouse and found that Poppo was living there. Poppo explains that he works part-time jobs to earn money. When he makes enough, he goes on trips around the world. Because of this, Poppo has not attended school in several years.  Poppo seems to have questionable interests: Jinta found several pornographic magazines upon entering the clubhouse. Poppo also seems to have an obsession for foreign girls, especially Vietnamese girls. Overall, he has a lewd personality.   ~!One evening, Poppo saw Menma in the forest. He was the second reported person to have seen Menma after her death. Because of this, he decides to gather the old group of friends in order to fulfill Menma's wish.  The reason he travels so much is due to the fact that he had seen Meiko's dead body drifting away in the river. He travels in an attempt to escape the past and get away from the clubhouse, the river, and the memory of Meiko's death. Despite his attempts to escape his past he finds himself always returning to the clubhouse and living there between trips.  Upon fulfilling Meiko's wish Poppo is able to come to terms with his past. He returns to living a healthy life and begins studying and working part-time.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40596-hm4I6Cal3EaS.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40596
      },
      "rarity": "legendary"
    },
    {
      "id": "haruna",
      "name": "Haruna",
      "alt_names": [
        "春菜"
      ],
      "role": "supporting",
      "description": "A friend and classmate of Naruko.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/41943.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 41943
      },
      "rarity": "epic"
    },
    {
      "id": "aki",
      "name": "Aki",
      "alt_names": [
        "亜紀"
      ],
      "role": "supporting",
      "description": "One of the two friends that Naruko hangs out with at school.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/41944.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 41944
      },
      "rarity": "epic"
    },
    {
      "id": "naruko-no-haha",
      "name": "Naruko no Haha",
      "alt_names": [
        "鳴子の母",
        "Naruko's Mother"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42092.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42092
      },
      "rarity": "epic"
    },
    {
      "id": "irene-honma",
      "name": "Irene Honma",
      "alt_names": [
        "本間イレーヌ"
      ],
      "role": "supporting",
      "description": "Meiko Honma's mother.   In the story, she has hatred towards Yadomi group, the \"Super Peace Busters\".  ~!She is also found that she is stuck in the past and was unable to move forward until Yadomi's group made a move.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42863.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42863
      },
      "rarity": "epic"
    },
    {
      "id": "manabu-honma",
      "name": "Manabu Honma",
      "alt_names": [
        "本間 学"
      ],
      "role": "supporting",
      "description": "Menma&#039;s father.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42940.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42940
      },
      "rarity": "epic"
    },
    {
      "id": "satoshi-honma",
      "name": "Satoshi Honma",
      "alt_names": [
        "本間 聡志"
      ],
      "role": "supporting",
      "description": "Menma&#039;s brother.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42941.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42941
      },
      "rarity": "epic"
    },
    {
      "id": "atsushi-yadomi",
      "name": "Atsushi Yadomi",
      "alt_names": [
        "宿海 篤"
      ],
      "role": "supporting",
      "description": "Jinta's father. A funny and gentle old man, he likes calling things cute.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42942.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42942
      },
      "rarity": "epic"
    },
    {
      "id": "touko-yadomi",
      "name": "Touko Yadomi",
      "alt_names": [
        "宿海 塔子"
      ],
      "role": "supporting",
      "description": "Jinta's mother. She was hospitalized before Menma died.   ~!She also made a promise with Menma that she'd help make Jinta cry.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42943.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42943
      },
      "rarity": "epic"
    },
    {
      "id": "minako",
      "name": "Minako",
      "alt_names": [],
      "role": "supporting",
      "description": "Appears in episode 6. It's revealed that she has feelings to Matsuyuki.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42944.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42944
      },
      "rarity": "epic"
    },
    {
      "id": "yama",
      "name": "Yama",
      "alt_names": [
        "山"
      ],
      "role": "supporting",
      "description": "He was in charge of making the fireworks. He helped Yadomi in making the firework.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/44270.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 44270
      },
      "rarity": "epic"
    }
  ],
  "updated_at": "2025-12-24T12:03:10.596Z"
}