{
  "work_id": "dr-stone-stone-wars",
  "count": 27,
  "characters": [
    {
      "id": "senkuu-ishigami",
      "name": "Senkuu Ishigami",
      "alt_names": [
        "石神千空",
        "Sorcerer",
        "Sorcerer Gentleman",
        "Professor Senku",
        "String bean",
        "Dr. Senku",
        "Lab"
      ],
      "role": "protagonist",
      "description": "__Height:__ 171 cm (5'7\")\n\nSenkuu is a genius with a vast amount of scientific knowledge. He is able to invent various kinds of tools and gadgets in a short amount of time with ease. As a child, he designed and built a functioning miniature rocket ship. Senkuu also possesses an analytical mind, being able to correctly discern the situation he is in. Even in his pre-teens, he was intelligent and sharp-minded enough to create advanced machines.\n\nSenkuu's physical abilities are very low and he would lose against someone like [Kohaku](https://anilist.co/character/124143) in a brawl, something he himself admits.\n\n~!In \"Village Games Arc\" Senku unintentionally won and married [Ruri](https://anilist.co/character/143272), but divorced immediately afterwards.!~",
      "metadata": {
        "gender": "male",
        "age": "15-23+ (physically), 3700+ (chronologically)",
        "dateOfBirth": "2004-01-04"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124142-XUO1g7wRqkaT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124142
      },
      "rarity": "legendary"
    },
    {
      "id": "kohaku",
      "name": "Kohaku",
      "alt_names": [
        "コハク"
      ],
      "role": "protagonist",
      "description": "__Height:__ 160 cm (5'3\")\n\nKohaku is a young woman who is a descendant of modern humans. She is Ruri's younger sister and the daughter of Kokuyo. She appears to be well known in her village due to her combative abilities, as both Kinro and Ginro were afraid of her. Kohaku excels at fighting, hunting, and general survival skills. She is a tomboy by nature, having little interest in more typical feminine activities and has little knowledge about them, although she does seem to enjoy some lavish clothing that was provided to her. She possesses a sharp instinct and intellect.\n\nKohaku is a kind young woman, caring deeply for her sickly older sister, willing to participate in the tournament for her hand in marriage just to protect her. This care extends to her comrades, and anyone she's loyal to. In addition to this, she has a reckless and hotheaded personality, often reacting in anger to being called a gorilla or lioness due to her strength and physicality. She also acts on her emotions at times, going against rational thought. She also has a bit of a teasing side, asking Chrome if he could fall for her to her resemblance to her sister.",
      "metadata": {
        "gender": "female",
        "age": "16-23 (physically), 27 (chronologically)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124143-DABUFs3cPNrP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124143
      },
      "rarity": "legendary"
    },
    {
      "id": "tsukasa-shishiou",
      "name": "Tsukasa Shishiou",
      "alt_names": [
        "獅子王司",
        "The Strongest High School Primate"
      ],
      "role": "protagonist",
      "description": "__Height:__ 195 cm (6'4\")\n\nAccording to Taiju, Tsukasa has the reputation as \"The Strongest High School Primate\" due to his tremendous fighting abilities.\n\nTsukasa is essentially violent, but extremely careful and aware of his actions. He is a very kind, thoughtful, and polite man outside of his pessimistic ideals towards humanity. He offers help in the beginning to Senku and Taiju after they revive him and becomes their hunter for food, using his skills as a prominent athlete to aid them. It’s revealed later that Tsukasa plans to purge humanity of adults who hurt the young and weak, then thinks Senku will go along with him, but instead Senku rejects him. After this point, Tsukasa becomes fairly determined in carrying out his plans even to the point of leaving their group.",
      "metadata": {
        "gender": "male",
        "age": "18-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124144-KOjcmhunbvYn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124144
      },
      "rarity": "legendary"
    },
    {
      "id": "chrome",
      "name": "Chrome",
      "alt_names": [
        "クロム"
      ],
      "role": "protagonist",
      "description": "__Height:__ 170 cm (5'7\")\n\nChrome is the alleged sorcerer - eventually turned scientist - of Ishigami Village. As part of the Kingdom of Science, Chrome serves as the unofficial right hand of Senku; this trust is what makes him one of the Five Wise Generals.\n\nChrome is a highly energetic person with a lot of passion and curiosity. He is genuinely interested in science, although at first, he only knows it as sorcery. He is confident in his intellect, enough so to go toe to toe with Senku despite getting destroyed in a battle of wits. He also has a tendency to refer to something as \"bad\" when he thinks it is cool or amazing. Chrome has a deep love of science, though he admits his expertise and knowledge lies mainly in exploration, particularly pertaining to rocks and minerals and gathering them.\n\nHe is loyal and selfless to his friends and, while lacking in physical abilities, he is still able to think of clever solutions out of dangerous situations. He is also exceedingly brave, and in addition, while he is usually a loudmouth, he knows when to keep his mouth shut. He loves science and, in many ways, is an accomplished scientist in his own right, managing to create chemical reactions from the rocks he collected through frequent trial and error (reactions which were only made known in the seventeenth century), despite never knowing this knowledge before Senku's arrival.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124145-EEvQmsj8jku4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124145
      },
      "rarity": "legendary"
    },
    {
      "id": "gen-asagiri",
      "name": "Gen Asagiri",
      "alt_names": [
        "あさぎりゲン",
        "浅霧幻"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm (5'9\")\n\nGen Asagiri is an enemy turned ally of Senku. Originally de-petrified by Tsukasa Shishio, he was sent to find Senku, only to defect to the Kingdom of Science. Gen later becomes one of the Five Wise Generals.\n\nHe is somewhat full of himself and his abilities, taking pride in his status as a magician and a mentalist, along with his knowledge of the human psyche. Gen is rather quirky and can often be seen speaking in Pig Latin. He tends to be lazy, self absorbed, and perverted, and he is also perfectly capable of lying without a hint of stress or change in expression. While he frequently portrays an aura of selfishness, hard self-interest, manipulation and deviousness, Gen is intrinsically a good person who can't bring himself to harm others. His outward appearance is masked by his mastery in psychology, but his actions tell of loyalty, determination, kindness and even sacrifice at times.\n\nWhile not nearly as intelligent in terms of science compared to Senku, he proves to be his equal and one of his most vital allies due to his ability to understand the human psyche and manipulate people through lies in contrast to Senku's more honest nature. He uses his abilities to promote cooperation and enthusiasm, motivate allies, conduct negotiations, and outsmart enemies. He tends to shift between acting as a ditzy airhead when it suits him (such as to avoid work or going into battle) and an intelligent manipulator. He is confident and is shown to have nerves of steel, even in the face of death.\n\nHe has frequently stated that his favourite drink is cola, and that he cannot handle alcohol.",
      "metadata": {
        "gender": "male",
        "age": "19-",
        "dateOfBirth": "2000-04-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127445-oUCyS7Tl8l5D.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127445
      },
      "rarity": "legendary"
    },
    {
      "id": "taiju-ooki",
      "name": "Taiju Ooki",
      "alt_names": [
        "大木大樹"
      ],
      "role": "supporting",
      "description": "__Height:__ 189 cm (6'2½\")\n\nTaiju is an outgoing, friendly, and kind person. He's enthusiastic about performing even small tasks and a diligent worker. He is very determined when something is important to him. He tends to yell loudly and is enthusiastic regardless of the task so long as he proves useful. He is persistent and determined. Despite being emotional and expressive, he has great control of his temper, never losing his cool or acting impulsively.\n\nTaiju possesses an extremely sturdy body, something his friend Senku vouches him for. He is the first human to be able to withstand a kick from Tsukasa without losing consciousness. He also possesses immense stamina, able to cross 80 kilometers in 5 hours.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124146-TeXd4r0upuIX.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124146
      },
      "rarity": "rare"
    },
    {
      "id": "yuzuriha-ogawa",
      "name": "Yuzuriha Ogawa",
      "alt_names": [
        "小川杠"
      ],
      "role": "supporting",
      "description": "Yuzuriha is the love interest of Taiju and a friend of Senku.\n\nYuzuriha is a young woman with brown hair, brown eyes, and a slim build. She has two noticeable petrification scars, both in the shape of spirals, located on her shoulder and neck. Before her petrification, Yuzuriha wears a standard High School Uniform. After her depetrification, she wears a white cloth dress that's spit at her sides and matching cloth shoes. Noticeably, Yuzuriha wears a white hairband that's vaguely shaped like wrap-around headphones, both before and after her petrification.",
      "metadata": {
        "gender": "female",
        "age": "15-17 (physically), 3700+ (chronologically)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124147-y3uE9rBepdad.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124147
      },
      "rarity": "rare"
    },
    {
      "id": "suika",
      "name": "Suika",
      "alt_names": [
        "スイカ",
        "Ace Detective Suika"
      ],
      "role": "supporting",
      "description": "__Height:__ 119 cm (3'10\")\n\nSuika is a young girl who lives in the village with the other stone age humans. Her most notable feature is the large watermelon on her head, which she can climb inside to disguise herself as the fruit. Senku first meets Suika when he, Chrome, and Kohaku were searching for iron sand in a nearby river.\n\nSuika is eager to help Senku build his kingdom of science because she's never been useful to anyone before. She comes to work as an information gatherer for the kingdom of science, occasionally being referred to as 'Ace Detective Suika.'",
      "metadata": {
        "gender": "female",
        "age": "9-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/124162-htFFNeC04bzw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124162
      },
      "rarity": "rare"
    },
    {
      "id": "kaseki",
      "name": "Kaseki",
      "alt_names": [
        "カセキ"
      ],
      "role": "supporting",
      "description": "__Height:__ 155 cm (5'1\")\n\nKaseki is an elderly craftsman from the Ishigami Village. When Senku arrives at Ishigami village, Kaseki is introduced as an artisan, and through Senku, his dedication to his craft is reignited tenfold.",
      "metadata": {
        "gender": "male",
        "age": "60-",
        "dateOfBirth": "5678-02-09"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b136446-gpvtw5cb2I3Q.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 136446
      },
      "rarity": "rare"
    },
    {
      "id": "ginrou",
      "name": "Ginrou",
      "alt_names": [
        "銀狼"
      ],
      "role": "supporting",
      "description": "Ginrou is [Kinrou](https://anilist.co/character/143271/Kinrou)'s younger brother and one of the village guards. He is shorter and scrawnier than his brother, with short blonde hair and green eyes. He usually wears a karate gi-like uniform and belt and carries his spear wherever he goes. He and his brother were two of the first villagers to join the Kingdom of Science.\n\n~!During the adventure on Treasure Island, Ginrou manages to convince [Matsukaze](https://anilist.co/character/188816/Matsukaze) to serve him due to the resemblance Ginrou bears to his late master.!~",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": "5723-04-07"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143270-8kC2e32r7CyE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143270
      },
      "rarity": "rare"
    },
    {
      "id": "kinrou",
      "name": "Kinrou",
      "alt_names": [
        "金狼"
      ],
      "role": "supporting",
      "description": "Kinrou is the elder brother of [Ginrou](https://anilist.co/character/143270/Ginrou) and the son of Tetsuken and Shirogane. Originally having served as one of the guards of Ishigami Village alongside Ginrou, he quickly joined Senku as a member of the Kingdom of Science. \n\nKinrou is a muscular young man of average height, with a scar on the right side of his face and a cluster of hair hanging in between his eyes. He wears a sleeveless karate gi-like uniform with a belt and a buckler with a star pattern on his back. After the Grand Bout, Kinrou begins wearing a pair of glasses to correct his nearsightedness.",
      "metadata": {
        "gender": "male",
        "age": "18-",
        "dateOfBirth": "5720-07-09"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143271-6dNgt1Mcy3PU.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143271
      },
      "rarity": "rare"
    },
    {
      "id": "ruri",
      "name": "Ruri",
      "alt_names": [
        "ルリ"
      ],
      "role": "supporting",
      "description": "Ruri is [Kohaku](https://anilist.co/character/124143/Kohaku)'s elder sister and the daughter of [Kokuyo](https://anilist.co/character/150509/Kokuyo), and serves as the priestess of Ishigami Village. She is similar to Kohaku in appearance but has longer hair and a more hourglass-shaped body. She wears a black sundress and a piece of rope around her neck.",
      "metadata": {
        "gender": "female",
        "age": "18-",
        "dateOfBirth": "5721-04-14"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b143272-IHdEdAbE4C4t.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 143272
      },
      "rarity": "rare"
    },
    {
      "id": "you-uei",
      "name": "You Uei",
      "alt_names": [
        "上井陽",
        "Yo",
        "Sheriff Yo"
      ],
      "role": "supporting",
      "description": "__Height:__ 177 cm (5'10\")\n\nYou is a pre-petrification human and former policeman who is revived by [Tsukasa](https://anilist.co/character/124144/Tsukasa-Shishiou). He faked his death after [Chrome](https://anilist.co/character/124145/Chrome)'s escape to avoid the blame, then eventually joins the Kingdom of Science after the stone wars are over. As penance, he worked with [Yuzuriha](https://anilist.co/character/124147/Yuzuriha-Ogawa) to rebuild the statues that were destroyed by Tsukasa. He is constantly butting heads with [Magma](https://anilist.co/character/145095/Magma) due to each other's naivety of their respective worlds.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145061-BKjjznIkzV6C.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145061
      },
      "rarity": "rare"
    },
    {
      "id": "hyouga",
      "name": "Hyouga",
      "alt_names": [
        "氷月"
      ],
      "role": "supporting",
      "description": "__Height:__ 189cm (6'2\")\n\nHyoga is a survivor who was revived by Tsukasa Shishio. Initially, he was an elite member of the Tsukasa Empire since he was depetrified by Tsukasa.\n\n~!He ultimately betrays Tsukasa by attempting to take over his leadership and threatens Senku into joining, only to be defeated by the duo in the decisive battle for the Kingdom of Science. When the situation calls for it, he is depetrified once again and summoned to battle - now as a begrudging ally of the Kingdom of Science with a similar but slightly mellowed goal in mind. Since his third depetrification, Hyoga's goals are unknown.!~\n\nHyoga has an easy going attitude towards everything. Even in situation that do not work in his favour, he still remains calm. While he claims to share the same values as Tsukasa when it comes to only reviving the young and creating a community where no one takes from others, Hyoga himself is an elitist who believes in social darwinism. He categorizes humans as either enlightened (or strong) and unenlightened (or weak). He believes that the \"brainless incompetent masses\" should not be allowed to live and that only those who excel should be allowed to live. While he does follow a form of social darwinism, he does not believe it is only the physically strong who should survive, as he wanted Senku to join him in his endeavors and become the strongest duo, indicating he respected Senku's intelligence and understood his capabilities. He is very manipulative and cunning, seems to be observant, and can often be cruel, merciless, and uncaring. He tends to refer to things as being done \"properly\" or not.",
      "metadata": {
        "gender": "male",
        "age": "20s (physically), 3700+ (Chronologically)",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145062-eCEE4J0RRGvt.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145062
      },
      "rarity": "rare"
    },
    {
      "id": "nikki-hanada",
      "name": "Nikki Hanada",
      "alt_names": [
        "花田仁姫"
      ],
      "role": "supporting",
      "description": "__Height:__ 180 cm (5'11\")\n\nNikki is a survivor that was revived by [Tsukasa](https://anilist.co/character/124144/Tsukasa-Shishiou), who assigned her to keep watch over [Taiju](https://anilist.co/character/124146/Taiju-Ooki) and [Yuzuriha](https://anilist.co/character/124147/Yuzuriha-Ogawa). She later defected from the Tsukasa Empire and joined the Kingdom of Science, where her unofficial role is that of disciplinarian. She has great physical strength, constantly being shown keeping people like [Magma](https://anilist.co/character/145095/Magma) and [You](https://anilist.co/character/145061/You-Uei) in line.\n\nNikki is a massive fan of [Lillian Weinberg](https://anilist.co/character/149274/Lillian-Weinberg). In the modern world she was having a rough time at school and listening to Lillian's songs saved her.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145063-ALOeDMIyqCAE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145063
      },
      "rarity": "rare"
    },
    {
      "id": "ukyou-saionji",
      "name": "Ukyou Saionji",
      "alt_names": [
        "西園寺羽京",
        "Arrow Kid"
      ],
      "role": "supporting",
      "description": "__Height:__ 173 cm (5'8\")\n\nUkyou is a survivor that was revived by [Tsukasa Shishiou](https://anilist.co/character/124144/Tsukasa-Shishiou). He is pacifistic and dislikes needless bloodshed.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145064-cbgNBAEY9q4R.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145064
      },
      "rarity": "rare"
    },
    {
      "id": "homura-momiji",
      "name": "Homura Momiji",
      "alt_names": [
        "紅葉ほむら"
      ],
      "role": "supporting",
      "description": "__Height:__ 145 cm (4'9\")\n\nHomura acts as the right-hand man of [Hyouga](https://anilist.co/character/145062/Hyouga) in [Tsukasa](https://anilist.co/character/124144/Tsukasa-Shishiou)'s army. She was a competitive gymnast before the petrification.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145065-NjHaMBBRg49I.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145065
      },
      "rarity": "rare"
    },
    {
      "id": "magma",
      "name": "Magma",
      "alt_names": [
        "マグマ"
      ],
      "role": "supporting",
      "description": "Magma is a villager from the Ishigami village. Magma is known for being the strongest of all the Villagers in terms of strength.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145095-5kvEF2XUhNui.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145095
      },
      "rarity": "rare"
    },
    {
      "id": "minami-hokutouzai",
      "name": "Minami Hokutouzai",
      "alt_names": [
        "北東西南"
      ],
      "role": "supporting",
      "description": "__Height:__ 166 cm (5'4\")\n\nMinami is a Pre-Petrification human and former reporter before the Petrification occurred. ~!Originally a member of Tsukasa's army before Tsukasa's downfall at the hands of Hyoga's betrayal, she later joins and helps the Kingdom of Science.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145096-Xk4D4sK7nZy9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145096
      },
      "rarity": "rare"
    },
    {
      "id": "mirai-shishiou",
      "name": "Mirai Shishiou",
      "alt_names": [
        "獅子王未来"
      ],
      "role": "supporting",
      "description": "__Initial Age (mental):__ 6\n__Initial Age (physical):__ 12\n__Height__: 139 cm (4'7\")\n\nMirai is the beloved little sister of [Tsukasa](https://anilist.co/character/124144/Tsukasa-Shishiou). Mirai was clinically brain dead prior to the Petrification, the doctors saying she'd never wake up. Tsukasa refused to give up on her and took on his MMA matches to keep paying the medical bills that kept her on life support. ~!She was depetrified by [Senku](https://anilist.co/character/124142/Senkuu-Ishigami) as part of the deal to end the war between the Kingdom of Science and the Tsukasa Empire.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b145100-8n5wwBz7AclE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 145100
      },
      "rarity": "rare"
    },
    {
      "id": "mantle",
      "name": "Mantle",
      "alt_names": [
        "マントル"
      ],
      "role": "supporting",
      "description": "Mantle is a villager of Ishigami Village who idolizes Magma.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b147570-4oRDjkvGZIBU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 147570
      },
      "rarity": "rare"
    },
    {
      "id": "lillian-weinberg",
      "name": "Lillian Weinberg",
      "alt_names": [
        "リリアン ・ ワインバーグ"
      ],
      "role": "supporting",
      "description": "A famous American diva and songstress whose name is known by the whole world. Her passion in adventuring lead her aboard the International Space Station (ISS) alongside Senku's father, Byuakuya Ishigami.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": "1994-10-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149274-lYJFmrdqT7Hq.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149274
      },
      "rarity": "rare"
    },
    {
      "id": "kokuyo",
      "name": "Kokuyo",
      "alt_names": [
        "コクヨウ"
      ],
      "role": "supporting",
      "description": "Father of [Kohaku](https://anilist.co/character/124143/Kohaku) and [Ruri](https://anilist.co/character/143272/Ruri). He was the village chief of Ishigami Village at the time of [Senku](https://anilist.co/character/124142/Senkuu-Ishigami)'s reawakening. ~!Kokuyo at first refuses to accept Senku as the new village chief, even though Senku won the Grand Bout. After witnessing Senku's antibiotic cure Ruri he officially crowns Senku the new leader of Ishigami Village. Despite not being the chief anymore, he serves as something of a co-leader of Ishigami Village, focusing on more practical concerns like food gathering, while Senku focuses on scientific advancement.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b150509-6LyHh2A6wVyc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 150509
      },
      "rarity": "rare"
    },
    {
      "id": "natri",
      "name": "Natri",
      "alt_names": [
        "なとり"
      ],
      "role": "supporting",
      "description": "Villager from Ishigami Village. He is the father of [Carbo](https://anilist.co/character/255669) and the husband of [Alumi](https://anilist.co/character/255671/).",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b255670-tBg10oKDGlU0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 255670
      },
      "rarity": "rare"
    },
    {
      "id": "tetsuya-kinomoto",
      "name": "Tetsuya Kinomoto",
      "alt_names": [
        "基本徹夜",
        "Mr. Mangaka"
      ],
      "role": "supporting",
      "description": "__Height:__ 155 cm\n\nA modern member of the Kingdom of Science. He was a manga artist prior to the Petrification. He was revived to test the feasibility of reviving a broken statue, and was later tasked with helping bring back entertainment to the Stone World.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b282320-MdtThy8uLpAx.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 282320
      },
      "rarity": "rare"
    },
    {
      "id": "chalk",
      "name": "Chalk",
      "alt_names": [
        "チョーク"
      ],
      "role": "minor",
      "description": "Dog from Ishigami Village. He is Suika's friend.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b147567-mvwmIvzi8my5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 147567
      },
      "rarity": "uncommon"
    },
    {
      "id": "byakuya-ishigami",
      "name": "Byakuya Ishigami",
      "alt_names": [
        "石神百夜 "
      ],
      "role": "minor",
      "description": "Byakuya Ishigami was a Japanese astronaut who was residing on the International Space Station when the Petrification on Earth's surface occurred. He was a kind, playful, and mischievous man who always found a way to amuse himself and keep things lighthearted, no matter the stakes.\n\n~!He was [Senku Ishigami](https://anilist.co/character/124142/Senkuu-Ishigami)'s adoptive father.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b149275-ghZG8Itl5Iz9.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 149275
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-23T01:33:33.367Z"
}