{
  "work_id": "death-note-a-kira",
  "count": 8,
  "characters": [
    {
      "id": "ryuk",
      "name": "Ryuk",
      "alt_names": [
        "リューク",
        "Ryuu"
      ],
      "role": "protagonist",
      "description": "The original Shinigami who dropped the Death Note in the human world, which [Light Yagami](https://anilist.co/character/80/Light-Yagami) ended up picking up. \n\nActing out of pure boredom, Ryuk begins the story of Death Note on a whim. Perhaps neutral by nature, Ryuk often refuses to aid Light and instead enjoys watching him struggle for his goal. The most important facet of Ryuk's character is that he is not Light's friend. He acts for his own interests and entertainment, and often fails to tell Light key details about the Death Note. Ryuk is selfish, however, and will aid Light if it serves his own goals, such as providing amusement or obtaining apples, which he loves.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b75-IkEpzO21LgFy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 75
      },
      "rarity": "epic"
    },
    {
      "id": "minoru-tanaka",
      "name": "Minoru Tanaka",
      "alt_names": [
        "田中実",
        "A-Kira"
      ],
      "role": "protagonist",
      "description": "A middle schooler who chooses to use the Death Note for a different, unique purpose.\n\n~!Unlike Light Yagami, Minoru does not seem to have a strong sense of justice. Although he is morally opposed to using the Death Note himself, he has no issue with making it available to anyone who is willing to pay for it, regardless of how they plan to use it once he has sold it to them. In fact, when the USA and China promise, while bidding for the notebook, that they will use it for altruistic purposes, he makes a point of announcing that he does not care why they want it, he just wants to know how much they are willing to pay for it. \n\nAmong the Kiras, while it was not his main intention, Minoru's actions created the most economically positive influence for Japan. After his plan was complete, Japan's economy boomed, especially around the capital, and the event was known as the Reiwa Bubble or the Kira Bubble, and Japan's inhabitants praised Kira as a god once more.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b159442-5KyIzYs5Z2Tb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 159442
      },
      "rarity": "epic"
    },
    {
      "id": "nate-river",
      "name": "Nate River",
      "alt_names": [
        "ネイト・リバー",
        "Near (ニア)",
        "N"
      ],
      "role": "supporting",
      "description": "Near is the younger of [L's](https://anilist.co/character/71/L-Lawliet) two successors raised in Wammy's House—[Watari's](https://anilist.co/character/2179/Quillsh-Wammy) orphanage for gifted children, in Winchester, England. Of the successors, Near is the more level-headed one, able to remain calm and calculated, while the other, [Mello](https://anilist.co/character/463/Mihael-Keehl), is more emotional and quick to act. The two of them share a strong rivalry.\n\nNear is very intelligent, although his childish appearance and demeanor can cause others to question his abilities. He has an obsession with solving complex problems and views an investigation as solving a puzzle. Despite his genius abilities, Near has low social knowledge and is bad at interacting with others. Much like L, Near shows various odd behaviors during his normal life, such as usually seen hunched over rather than sitting, and constantly playing with various toys, which he uses in his theories, as well as idly twiddling strands of his hair. He shows a great respect for L, basing much of how he solves crime on L's methods, even to the point where he only takes cases that he is interested with rather than trying to pursue justice.",
      "metadata": {
        "gender": "male",
        "age": "17-18",
        "dateOfBirth": "1991-08-24"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n464-6KeJpU6g7Hwj.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 464
      },
      "rarity": "uncommon"
    },
    {
      "id": "touta-matsuda",
      "name": "Touta Matsuda",
      "alt_names": [
        "松田桃太",
        "Tota Matsuda",
        "Taro Matsui (松井太郎)",
        "Taichiro Yamashita (山下太一郎)"
      ],
      "role": "supporting",
      "description": "__Height:__  174 cm (5'8\")\n\nRecognized as the most outspoken member of the investigation team, Matsuda possesses an enthusiastic yet impulsive and naïve personality, often lacking the seriousness required for his work. Compared to his colleagues in the task force, he stands out as notably inexperienced, often being perceived as the weakest link within the group. Despite his evident shortcomings and lack of experience, Matsuda proves to be valuable and, at times, indispensable to the investigation. He is not afraid to take dangerous risks, going out of his way to support the team.\n\nWhile the majority of the Task Force sees Kira as a malevolent serial killer, Matsuda frequently questions whether Kira's actions could be construed as performing good deeds. This skepticism grows, particularly as more people seem to align with Kira's ideology. Matsuda displays a certain level of understanding and sympathy towards Kira's followers. However, his ultimate loyalty remains with the Task Force, and he is unwavering in his commitment to solving the Kira Case alongside his fellow officers. His allegiance is especially strong towards [Soichiro Yagami](https://anilist.co/character/1927/Souichirou-Yagami), whom he views as a mentor.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": "1978-12-14"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n1906-JCWKEGGook3Z.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1906
      },
      "rarity": "uncommon"
    },
    {
      "id": "shuuichi-aizawa",
      "name": "Shuuichi Aizawa",
      "alt_names": [
        "相沢周市",
        "Shuichi Aizawa"
      ],
      "role": "supporting",
      "description": "Aizawa is an intelligent, respected member of both the NPA and Task Force. He takes his work very seriously and chooses to work strictly within the law. Out of all the members in the Task Force, Aizawa is the most overtly skeptical, questioning L's basis for his conclusions and expressing the most doubt in them, and often finds himself clashing and opposing many of L's ideas and actions. He has a wife, [Eriko](https://anilist.co/character/84531/Eriko-Aizawa), and two children, including [Yumi](https://anilist.co/character/84527/Yumi-Aizawa), his daughter, and his baby son, whose name is unknown. Due to him rarely being able to visit home during his work on the Kira case, his personal life and relationship with his family becomes strained.",
      "metadata": {
        "gender": "male",
        "age": "34-",
        "dateOfBirth": "1969-05-11"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n3767-pSbmazo2I7ZD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3767
      },
      "rarity": "uncommon"
    },
    {
      "id": "halle-bullook",
      "name": "Halle Bullook",
      "alt_names": [
        "ハル・ブロック",
        "Halle Lidner"
      ],
      "role": "supporting",
      "description": "__Height:__ 180 cm\n__Likes:__ Jacuzzi \n__Dislikes:__ Insects\n\nHalle Lidner, real name Halle Bullook, works for Near as part of his investigation team, along with Gevanni and Rester. She is mentioned to be a former CIA agent.   \n\n~! In the manga, Lidner knows Mello and leaks SPK information to Mello; Near is unaware of Lidner's SPK information leaking. When Mello questions her and asks her which side she is on(Near or his), She replies that she is on neither side, and merely helps both of them because they are after Kira. Later on, she calls Mello and tells him about Near's plan (Having Mikami write everyone's name down in the notebook), and he replies \"I'm the only one who can do it.\". This can be seen as the real push that drove Mello to kidnap Takada and eventually save the lives of both investigation teams.  Mikami views her real name, Halle Bullook, with his Shinigami eyes and proceeds to write her name as well as the other SPK members' names into his Death Note, but she remains alive due to the notebook being a fake.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": "1980-02-18"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n3769-QJUZtTvWhOJt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3769
      },
      "rarity": "uncommon"
    },
    {
      "id": "anthony-carter",
      "name": "Anthony Carter",
      "alt_names": [
        "アンソニー・カーター",
        "Anthony Lester",
        "Anthony Rester"
      ],
      "role": "supporting",
      "description": "Anthony Lester is the Captain of a special force squad, and is now the SPK&#039;s number 2 and its operation leader. \n\nHe can be seen as [Near's](https://anilist.co/character/464/Nate-River) guardian and personal assistant, similarly to what [Watari](https://anilist.co/character/2179/Quillsh-Wammy) was to [L](https://anilist.co/character/71/L-Lawliet). He is an extremely honest person who has Near's complete trust, to the point he's comfortable with revealing some of his thought and plans to Lester. Lester also helps Near with actions he is not used to doing, such as booking a flight on a plane. He is often called \"Commander Lester\", and he is unable to match Near in intelligence and analytic skill despite being very intelligent himself. Nevertheless, being trustworthy, athletic, and a quiet person make him very useful to assist Near.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n23514-xhkKhgd0S5RJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23514
      },
      "rarity": "uncommon"
    },
    {
      "id": "donald-trump",
      "name": "Donald Trump",
      "alt_names": [],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b187216-xKtgQJDIoU3m.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 187216
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-26T07:23:18.826Z"
}