{
  "work_id": "dorohedoro",
  "count": 39,
  "characters": [
    {
      "id": "kaiman",
      "name": "Kaiman",
      "alt_names": [
        "カイマン",
        "Magician Killer",
        "Caiman"
      ],
      "role": "protagonist",
      "description": "__Height:__ 216 cm (7'1)\n\nKaiman is a human born in the Hole with an immunity towards magic. He has made it explicitly clear that \"Kaiman\" was not his actual name, but was given to him by Nikaido after he began suffering from amnesia. His lizard head being the result of a Magic User's curse, his main goal is to seek out the one who cursed him in order to change himself back. Because he can't remember who cursed him, due to his amnesia, he instead resorts to clamping his mouth around the head of every magic user he comes across, letting them see the \"little man\" in the back of his head before pulling them back out so he can ask them all the same question: \"What did the guy inside my head say?\"\n\nThroughout most of the series, Kaiman, true to his moniker, takes on the appearance of a lizard-like entity. Though his body is consistently human with a tall and muscular build, his face and head have changed dramatically due to the effects of a Magic User. He most closely resembles a Caiman lizard, (though some think he looks more like an Iguana) his hair being replaced by long, very sharp spikes. It appears that despite having his head chopped off, he can regenerate it in a few days time. He sports small crosses over his eyes and wears gas masks most of the time, though he refrains from wearing them later on in the series.\n\nKaiman usually takes on the personality of someone arrogant and lazy, but deep inside he's rather caring and cares a lot for his best friend, Nikaido. Rude, stubborn and prone to resolve anything with violence, there's a few things in Kaiman's mind and heart, wishing to have his normal head back, eat gyoza and having more money (in that specific order); only caring about subjects related to those three things and showing no regard or concern about anything else. He sees Magic Users as scum, killing them in the spot after interrogating them and showing no remorse for that, he hates them and he even would start a mass slaughter in the middle of their realm to find the one responsible for his head. He has constant nightmares about his creation and death, causing Kaiman to wake up tired, worried, scared and trying to forget them, even if sometimes they have a connection to his past. He has shown to be easily distractible as during both his jobs he finds himself easly distracted by things.\n\n~!Kaiman does eventually get his human face back, along with his lost memories, but the truth about his identity was more than he bargained for. It turns out he was originally a human boy from Hole named Ai Coleman. Ai put himself through surgeries to become an artificial magic user, and his self has since fragmented into several quasi-independent personalities attached to multiple heads, including Aikawa and Kai.  Kaiman actually wore one of Kai's heads for most of his time in Hole, as indicated by the crosses he had around his eyes. He switched to Aikawa's crossless head when he experienced a flashback at the Zagan school of magic. Kaiman was still wearing Aikawa's head during his fight with En when Ebisu's reptilian magic was dispelled, which is why he reverted to the Aikawa personality and not Kai at that time.!~",
      "metadata": {
        "gender": "male",
        "age": "25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b9192-Jly0Soaxc6DX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9192
      },
      "rarity": "epic"
    },
    {
      "id": "nikaido",
      "name": "Nikaido",
      "alt_names": [
        "ニカイドウ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 169 cm (5'6½)\n\nNikaido is a companion to Kaiman, who both hunt Magic Users. She is the owner of a restaurant called the Hungry Bug in the Hole. There she serves primarily gyozas with a few slices of shiso, which Kaiman adores. Nikaido's gyozas are constantly declared as the best in the Hole.\n\n~!As it progresses, it is revealed that Nikaido is also a magic user, and has some ties in the Magic Users' World. When she trains with the ex-devil, Kawajiri, she discoveres that her magic is related to Time and that it can only be used a limited amount of times before eventually becoming completely unusable.!~\n\nNikaido has long blond hair, blue eyes, an athletic body build, and a curvy figure (shown mostly after her Devil training). At the beginning of the series, her clothes consisted of dark baggy pants and a black jacket with Chinese design. About midway in the series, she wears a green overalls with combat boots and leather gloves. She has an easy going and friendly attitude, though keeps many of her worries and anxieties to herself. She is confident in her physical abilities and isn't easily frightened.",
      "metadata": {
        "gender": "female",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16057-eFteZol4cg9t.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16057
      },
      "rarity": "epic"
    },
    {
      "id": "shin",
      "name": "Shin",
      "alt_names": [
        "心",
        "Senpai"
      ],
      "role": "protagonist",
      "description": "__Height:__ 196cm (6'5)\n\nShin is an elite Magic-User, a cleaner for En, and the partner and long-time friend of Noi. His magic allows him to cut people up without killing them.\n\nShin is a tall man of muscular build, with short blonde hair, blue eyes, and pale skin. He is often seen in a formal suit while wearing a heart shaped mask backwards. He uses glasses when he isn't wearing his mask. He has stitches running along his arms and hands from his surgery to gain magic powers. He usually uses a hammer to fight, which is his primary weapon of choice besides his magic. Shin has a young looking face without any facial hair, but with a noticeable forehead, which wasn't very obvious at the beginning of the manga, though it became more prominent with the progress in art style. He also had spiky hair, but especially in later chapters his hair is closer to a more realistic or at least shorter hairstyle. As a teenager, Shin used to wear his then very long hair styled in a ponytail. At that time of his life he didn't yet wear glasses, so it can be assumed that with time, Shin's eyesight has gotten progressively worse since then.\n\nDespite his job as En's cleaner, Shin has a very easy-going personality and is rather approachable by all within the En family. He cares deeply for his partner, Noi, and the two share a close bond as a result. Though Shin is seen to be rather modest around Noi, since he is often embarrassed by her displays of affection, he does return it on occasion. He does not kill without reason, though it doesn't seem to detract from his enjoyment of the brutal nature of his job, as he is commonly seen grinning during challenging fights. Between himself and his partner, Shin acts as the more observant of the two, and usually remains calm and collected in order to counteract Noi's impulsiveness. He always eats fast and sleeps with one eye open, this is an old habit from his past life in Hole, which he developed after almost being lynched by people who found out he had Magic User blood in his veins.\n\nShin's magic allows him to slice up anything. He can use this ability to slice up living beings without worrying about the victim bleeding out and dying from organ failure, although their flesh will still rot. If he were to die, any current victim of his magic would immediately suffer the consequences of their wounds. Shin is also capable of projecting his smoke to stop incoming gunfire. His Smoke halting and shattering bullets on impact. Since he was born unable to actually utilize his magic at will, Shin cut off his hands and arms in a self-inflicted surgical procedure in order to find the smoke veins.",
      "metadata": {
        "gender": "male",
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16058-WGqEK3I9bH7c.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16058
      },
      "rarity": "epic"
    },
    {
      "id": "noi",
      "name": "Noi",
      "alt_names": [
        "能井",
        "NO1"
      ],
      "role": "protagonist",
      "description": "__Height:__ 209 cm (6'10\")\n\nNoi is an elite Magic-User, and the partner and long-time friend of Shin. She works with him as a cleaner for En, who is her older cousin.\n\nNoi has pink-white hair and red eyes. She is the fourth tallest character in the series and is very muscular. As a result, other characters are often unsure of her sex at first, until she opens her mouth or takes off her mask. Beneath the mask, she is a beautiful woman with long hair that often looks slightly disheveled. Her ears are pierced multiple times, with five piercings on each ear. Usually, Noi wears a zip-up tracksuit with her name on it in several places, gloves, and sneakers, though she also has other outfits for formal occasions. She wears a blue gimp mask with an exposed \"skeletal\" mouth, looking similar to a cenobite from the Hellraiser movies. The mask appears to have been patched with duct tape on top, similarly to the tracksuit, that seems to have duct tape around both the forearms including wrists and the calves.\n\nNoi is very confident and carefree. So carefree, in fact, that as Shin mentions, later on, she has stopped trying to avoid attacks because she can easily heal herself. Noi enjoys fighting and often competes with her dear senpai to see who can kill the most. Her bold personality can get her into trouble because she doesn't bother to carefully observe her surroundings. The person she shows the greatest affection and respect towards is Shin. She has a large appetite.\n\nNoi's power is healing, which is one of the rarest magic types. Her power is often used in the manga to heal Ebisu or the people that En turns into mushrooms. Thanks to her ability, Noi can heal herself quickly and without physically releasing the smoke. This makes her especially resilient to physical attacks and virtually unkillable.\n\n(Source: Dorohedoro Wiki, edited)",
      "metadata": {
        "gender": "female",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16059-mUfErMfV09e5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16059
      },
      "rarity": "epic"
    },
    {
      "id": "en",
      "name": "En",
      "alt_names": [
        "煙"
      ],
      "role": "protagonist",
      "description": "__Height:__ 183 cm (6'0\")\n\nBoss of the En family and is an elite Magic User. He is cousins with Noi and Kikurage's partner. He's also good friends with Chidaruma, who is the most powerful Devil. En controls most of if not all business within the Magic-User realm and is regarded as one of the strongest Magic Users in the world. He's shown to be a man who has a large expansive group of lackeys, and is currently Noi and Shin's boss.\n\nTypically seen in loosely worn formal attire and wears his long, red hair spiked upwards. He has a large forehead and menacing eyes further defined by his lack of eyebrows. His mask consists solely of a mouthpiece resembling something between a gas mask and the mouth of a skull. Beneath the mask, he is revealed to have a thin mustache with a goatee. En is cool and confident in everything he does. He often enjoys quietly drinking tea or tending to his exotic garden of mushrooms. En is very full of himself and his capabilities. The very thought of someone laying a finger on him in a fight, the world's most powerful magic user, can cause him to lose control of his emotions and go berserk, turning everything and everyone caught in the crossfire into mushrooms. Despite being a pretty big narcissist, he has shown that he truly does care about the members of his family. He is especially fond of Kikurage, often worrying about her safety and well being above everyone else. Regardless of what others think or wish, En's desires come first and he'll do anything to get his way, even if that means killing, kidnapping or forcing them to do as he says, forgoing a more diplomatic approach.\n\nEn possesses a powerful transformative type ability that allows the smoke he can exhale from his mouth or fingers to turn whatever it touches into mushrooms. Despite the somewhat silly nature of his magic, by his own admission, most don’t understand the truly terrifying degree to which he has mastered his ability. The various applications of En’s power appear only to be limited by his creativity.",
      "metadata": {
        "gender": "male",
        "age": "43",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16060-d7kczT3iuuWp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16060
      },
      "rarity": "epic"
    },
    {
      "id": "fujita",
      "name": "Fujita",
      "alt_names": [
        "藤田"
      ],
      "role": "protagonist",
      "description": "Fujita is a magic user residing in the Magic user&rsquo;s domain, working for a company headed by En: a powerful magic user. Fujita isn&rsquo;t a very good magic user at all, himself-- the only times he manages to produce any magical smoke at all are times when he or someone he cares about are in a bit of a bind. For example, when in the Hole (the domain of non-users,) he and a friend of his are stopped by Caiman, a nonuser who is mysteriously unaffected by magic due to his mutations. His friend is killed by Caiman, and in a scurry to get away with his own life he uses his smoke to open a door between the realms-- something that takes a fair bit of skill to do, as remarked by several characters later on.    Wanting to avenge his comrade, Fujita sets out to return to Hole heavily armed but is stopped by a messenger of En, who passes on the message that he&rsquo;s been assigned to find the user who transformed Caiman into a saurian. A bit of research reveals a reptilian transformation specialist-- Ebisu. Fujita recalls passing her while in the Hole with his friend-- and so, goes to find her before Caiman can kill her, too. Fujita&rsquo;s timing is just right, and so he manages to save Ebisu just as she&rsquo;s stuck in the jaws of Caiman, her fingers broken clean off after she attempts to use her smoke on him. Unfortunately, her life comes at the price of her sanity and her face-- En assigns one of the higher-ups, Noi, to heal Ebisu&rsquo;s face and fingers. Although physically in one piece once again, Ebisu is still traumatized by the incident, her personality reverted back to that of a small child and memory obliterated.    Noi and Shin are sent to exterminate Caiman-- Fujita tagging along partially because he wants revenge, partially to watch after Ebisu, of whose memory everyone is waiting on to return.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/16062.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16062
      },
      "rarity": "epic"
    },
    {
      "id": "ebisu",
      "name": "Ebisu",
      "alt_names": [
        "恵比寿"
      ],
      "role": "protagonist",
      "description": "Ebisu is a young, androgynous and sullen looking woman who first appears in chapter three, donning a skull shaped mask. She is walking through the Hole, unable to summon a door back to the Magic Users' world due to the barrier between worlds currently in effect. She runs in to Caiman and Nikaido, who advance on her in their common fashion. Caiman cuts off Ebisu's fingers to prevent her from using magic, and bites down on her head after removing her mask. Before he can withdraw to ask her his \"question\", a frantic Fujita appears from a door behind her and forcefully pulls her out of his clamped down jaws, in to the door. This sudden and jerky movement causes trauma to her face and head, but they both get to safety.   After this incident, Ebisu is shown to be haunted by nightmares - and has become somewhat insane. At En's residence, she is restrained until Noi can properly heal and restore her fingers and face. Past that point, it is evident her head trauma caused some (supposedly temporary,) brain damage as seen in her suddenly eccentric behavior. She is commonly seen with Fujita in the manga panels, possibly leading to believe that they are 'partners' now.   Her smoke is not seen directly, but records state she is skilled in Reptile transformation. However between panels it shows her having attacked someone with a surplus of power after being fed Black Powder by someone who appeared to have met her before.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16063-GIoMZpg8cKd6.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16063
      },
      "rarity": "epic"
    },
    {
      "id": "risu",
      "name": "Risu",
      "alt_names": [
        "栗鼠"
      ],
      "role": "protagonist",
      "description": "Risu couldn't produce any magic smoke. Believing himself to be one of the many magically-impaired members of sorcerer society, he joined the CrossEyes organization to make a living. ~!Risu later discovered that he actually possessed a very rare magical ability - the power of Curse. Overjoyed, he told his best friend Aikawa the good news. Little did he know that Aikawa was actually the unwilling alter-ego of the CrossEyes Boss.  As soon as the Boss learned of this ability, he murdered Risu and attempted to claim his Curse power, but it would not be so easy. Risu's Curse power activated upon death, releasing an avenging specter that proved too much for even the CrossEyes Boss to handle. Years later, Risu was resurrected and fused with his Curse specter. His Curse power will not let him rest until the one who killed him is dead.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b31212-Y8ZdrqTQ4Od7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31212
      },
      "rarity": "epic"
    },
    {
      "id": "kai",
      "name": "Kai",
      "alt_names": [
        "壊",
        "CrossEyes Boss"
      ],
      "role": "protagonist",
      "description": "Kai is the Boss of the CrossEyes organization, whose symbol and namesake comes from the cross marks around Kai's eyes. Kai's only two interests are food and power. He is a ruthless killer who targets powerful sorcerers and butchers them to appropriate their magical abilities. But he has his own ability, as well: an aura which has the same effect as Hole's rain, crippling any sorcerers in its range. Though Kai's murderous exploits started as relatively low-key, they later escalated to genocidal proportions, amassing mountains of corpses to fuel his scientific experiments.\n\n~!He is one of Ai's several alter-egos which share the same body.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/79437.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 79437
      },
      "rarity": "epic"
    },
    {
      "id": "aikawa",
      "name": "Aikawa",
      "alt_names": [
        "会川"
      ],
      "role": "protagonist",
      "description": "~!Aikawa is one of Ai's several alter-egos. He's an easy going guy who loves good food and always stands up for his friends. However, because he shares a body with the psychopathic Kai, another one of Ai's alter-egos, anyone Aikawa gets close to tends to meet an untimely death. This is because anything Aikawa overhears Kai learns too. Even Aikawa's best friend, Risu, fell victim to Kai after he told Aikawa of his newly-discovered magical abilities. Aikawa hates Kai and tries to sabotage him any way he can, even attempting to kill himself to take Kai down with him. Alas, their body isn't that easy to destroy.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/79513.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 79513
      },
      "rarity": "epic"
    },
    {
      "id": "vaux",
      "name": "Vaux",
      "alt_names": [
        "バウクス"
      ],
      "role": "supporting",
      "description": "Vaux, more commonly known to everyone in Hole as &quot;Doc&quot;, owns a hospital that treats Magic user victims. His job is morbid and gorey and he doesn&#039;t always manage to save his patients, but without him, many more residents of Hole would die.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/32745.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 32745
      },
      "rarity": "uncommon"
    },
    {
      "id": "chota",
      "name": "Chota",
      "alt_names": [
        "鳥太"
      ],
      "role": "supporting",
      "description": "Chota is an elite Magic-User, one of the \"big brass\" of The En Family, and the most avid fanatic of En. He is completely obsessed with En and ever-hopeful of being his partner. \n\n(Source: Dorohedoro Wiki)",
      "metadata": {
        "gender": "male",
        "age": "39",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40923.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40923
      },
      "rarity": "uncommon"
    },
    {
      "id": "kasukabe",
      "name": "Kasukabe",
      "alt_names": [
        "カスカベ",
        "Haze"
      ],
      "role": "supporting",
      "description": "__Height:__ 155cm (5'0)\n\nA doctor from the Hole who in the past helped Shin get to Magic Users world. He has a laboratory where he researches magic users and their magic. He is actually 64 years old and keeps his young appearance thanks to magic smoke he produced.\n\n~!He is married to the Devil and Magic User Haru.!~",
      "metadata": {
        "gender": "male",
        "age": "64",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40926.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40926
      },
      "rarity": "uncommon"
    },
    {
      "id": "asu",
      "name": "Asu",
      "alt_names": [
        "アス",
        "Kawajiri",
        "川尻"
      ],
      "role": "supporting",
      "description": "A magic user who used to take care of Nikaido as a child and her friend Yakumo. He was a devil named Asu.     Chidaruma, the strongest and naturally born devil, turned Kawajiri into a magic user again, because he hid information about Nikaido from other devils.",
      "metadata": {
        "gender": "male",
        "age": "32",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40955-e6oMwll0FI9Y.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40955
      },
      "rarity": "uncommon"
    },
    {
      "id": "dokuga",
      "name": "Dokuga",
      "alt_names": [
        "毒蛾",
        "Kaiko"
      ],
      "role": "supporting",
      "description": "Dokuga is one of five generals of the Crosseyes Gang, who serve directly under the Boss. Dokuga&#039;s magic is poisonous saliva, which isolates him even among his friends, and restrains him from expressing emotions such as anger or laughter, since any stray spittle is extremely dangerous. This makes Dokuga calm, intelligent, and focused. He cares a lot about his comrades, and is fanatically loyal to the Crosseyes Boss, whom he admires for giving meaning to his life in a world that rejected him. He is willing to do anything the Boss asks of him, perhaps because this is the only form of affection he can safely express. Dokuga is surprisingly strong for his size, and is a very mobile fighter highly skilled in the use of knives.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40982.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40982
      },
      "rarity": "uncommon"
    },
    {
      "id": "natsuki",
      "name": "Natsuki",
      "alt_names": [
        "夏木"
      ],
      "role": "supporting",
      "description": "Natsuki joined the CrossEyes because she believed they were working to make the world a better place for sorcerers who didn't have useful magic. For a long time she thought she had no magical abilities, but she later found out that she has powerful defensive magic which could repel any attack. She wanted to stay with the CrossEyes and be the Boss' bodyguard, but the Boss had other plans for her.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40983.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40983
      },
      "rarity": "uncommon"
    },
    {
      "id": "haru",
      "name": "Haru",
      "alt_names": [
        "ハル"
      ],
      "role": "supporting",
      "description": "Doctor Kasukabe&#039;s wife, she was a magic user before turning into a devil.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40984-A4eSBxndUkGu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40984
      },
      "rarity": "uncommon"
    },
    {
      "id": "shou",
      "name": "Shou",
      "alt_names": [
        "消"
      ],
      "role": "supporting",
      "description": "Member of En&#039;s family, an assassin. His magic ability is becoming invisible whenever he wants.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/40985.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40985
      },
      "rarity": "uncommon"
    },
    {
      "id": "kirion",
      "name": "Kirion",
      "alt_names": [
        "キリオン"
      ],
      "role": "supporting",
      "description": "A girl that together with Fukuyama works in Tanba's restaurant in the magic user world. She is immune to the effects of Hole's rain which cripple other sorcerers, which suggests she is either a human from Hole or a human/sorcerer hybrid.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b41002-cGFlhUxRTZ0Q.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 41002
      },
      "rarity": "uncommon"
    },
    {
      "id": "ai-coleman",
      "name": "Ai Coleman",
      "alt_names": [
        "アイ・コールマン"
      ],
      "role": "supporting",
      "description": "Ai Coleman used to be a quiet and withdrawn boy from Hole. He was raised by his grandfather, and was neglected by him. But Ai was a very intelligent kid, and the absence of stimulation in his life left him quite bored and depressed. He spent his time reading books. Or at least one about sorcerers written by Dr. Kasukabe. Ai hated living in Hole, and he hated that sorcerers came there to experiment on humans, but he was also fascinated by them. And so, Ai decided he'd find a way to become a magic user.\n\nThough Dr. Kasukabe tried to dissuade him, claiming it was impossible for a human to become a sorcerer, Ai was more clever. He figured out a way to incorporate powers from sorcerers by undergoing dangerous surgeries and experimenting on himself. Using these methods, Ai amassed a vast amount of power and left a trail of carnage in his wake. He surpassed the strongest sorcerers and set his sights even higher - to become like the Devils who rule over the sorcerers, and perhaps to surpass them too.\n\n~!For most of the story Ai lived in a dimensional distortion inside \"Kaiman,\" which was a kind of microcosm of Hole. He appeared as a boy who was missing the top half of his body and spoke with gurgling \"splosh\" noises coming from his exposed entrails. Ai very rarely left this dimensional distortion because his outer body was a zombie after having died and been revived on Living Dead Day. Instead, he exerted his influence from within by managing the multiple heads and spare body parts of his other personalities.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b41004-og4gYM0m1Xto.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 41004
      },
      "rarity": "uncommon"
    },
    {
      "id": "jonson",
      "name": "Jonson",
      "alt_names": [
        "ジョンソン",
        "Johnson"
      ],
      "role": "supporting",
      "description": "He's a cockroach, 2 years old, 268 cm tall. Became huge in size because of the rainwater where he lived in.\nPretty much there for comedic effect, as well as part of Dr. Vaux's baseball team. His catch phrase is, \"Shocking!\".",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/42321.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 42321
      },
      "rarity": "uncommon"
    },
    {
      "id": "tetsujo",
      "name": "Tetsujo",
      "alt_names": [
        "鉄条"
      ],
      "role": "supporting",
      "description": "Tetsujo is one of the five CrossEyes Officers. He lost his right eye defending Dokuga, another CrossEyes Officer, back when they were both kids. Despite this, Tetsujo is an excellent swordsman. He is very insightful and resourceful when he needs to be, though his hot temper sometimes gets him into trouble.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/54981.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 54981
      },
      "rarity": "uncommon"
    },
    {
      "id": "saji",
      "name": "Saji",
      "alt_names": [
        "佐治"
      ],
      "role": "supporting",
      "description": "Saji is one of the five Cross Eyes Officers. He is younger than he looks, and wishes his face wasn't so old for his age.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/54983.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 54983
      },
      "rarity": "uncommon"
    },
    {
      "id": "ton",
      "name": "Ton",
      "alt_names": [
        "豚"
      ],
      "role": "supporting",
      "description": "Ton is one of the five Cross Eyes Officers. He is a talented knife thrower and loves to eat. His name means \"Pig.\"",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/54985.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 54985
      },
      "rarity": "uncommon"
    },
    {
      "id": "ushishimada",
      "name": "Ushishimada",
      "alt_names": [
        "牛島田"
      ],
      "role": "supporting",
      "description": "Ushishimada is one of the five Cross Eyes Officers. He is short and stocky, but very strong, and could bend iron bars. He has the word \"cow\" in his name.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/54987.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 54987
      },
      "rarity": "uncommon"
    },
    {
      "id": "thirteen",
      "name": "Thirteen",
      "alt_names": [],
      "role": "supporting",
      "description": "Thirteen is an ordinary human from Hole. He is friends with Bauks and has a crush on Nikaido.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/68585.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 68585
      },
      "rarity": "uncommon"
    },
    {
      "id": "gyouza-otoko",
      "name": "Gyouza Otoko",
      "alt_names": [
        "ギョーザ男",
        "The Gyoza Man",
        "Gyouza no Yousei (ギョーザの妖精)",
        "The Gyoza Fairy"
      ],
      "role": "supporting",
      "description": "He is The Gyoza Fairy, currently residing in this restaurant called \"Hungry Bug\". His body is made of raw gyoza, he is as large as a beer can, but he is invisible to humans. His job is to make gyoza taste delicious. He does things like cooling the beer with pure willpower or putting in some chili oil for those who forgot to. However! He has no mercy for wretches who make light of gyoza!",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/74667.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74667
      },
      "rarity": "uncommon"
    },
    {
      "id": "fukuyama",
      "name": "Fukuyama",
      "alt_names": [
        "福山"
      ],
      "role": "supporting",
      "description": "Fukuyama works at Tanba's pie shop. His magical abilities allow him to turn anything and anyone into meat pies.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/79439.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 79439
      },
      "rarity": "uncommon"
    },
    {
      "id": "tanba",
      "name": "Tanba",
      "alt_names": [
        "丹波",
        "President"
      ],
      "role": "supporting",
      "description": "Tanba is the company president of a meat pie shop (also called \"Tanba\") in the magic user world. Fukuyama and Kirion are his employees, and Kaiman worked for him for a time.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/79441.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 79441
      },
      "rarity": "uncommon"
    },
    {
      "id": "chidaruma",
      "name": "Chidaruma",
      "alt_names": [
        "チダルマ"
      ],
      "role": "supporting",
      "description": "Chidaruma is leader of the Devils. He is friends with En and is very interested in Ai's tinkering with magical science.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b79443-lJrwt4yXwOFx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 79443
      },
      "rarity": "uncommon"
    },
    {
      "id": "kikurage",
      "name": "Kikurage",
      "alt_names": [
        "キクラゲ",
        "Judas' Ear"
      ],
      "role": "supporting",
      "description": "Kikurage (named after the Judas' Ear mushroom) is a devil animal who En adopted into his Family because she has the very rare magic of resurrection. As long as a sorcerer's devil tumor is intact, Kikurage can bring them back to life. Kikurage has developed a close bond with another member of the En Family, Ebisu.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/79445.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 79445
      },
      "rarity": "uncommon"
    },
    {
      "id": "turkey",
      "name": "Turkey",
      "alt_names": [
        "ターキー"
      ],
      "role": "supporting",
      "description": "Turkey is a member of the En Family. Her magic allows them to cook up living (though mute) copies of people from pictures or memories. The copies are drawn to the location of the originals, living or dead.",
      "metadata": {
        "gender": "female",
        "age": "33",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b79491-EAqLGoXVxTcO.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 79491
      },
      "rarity": "uncommon"
    },
    {
      "id": "matsumura",
      "name": "Matsumura",
      "alt_names": [
        "松村"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b153900-xkxJEO91rdaV.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 153900
      },
      "rarity": "uncommon"
    },
    {
      "id": "hole",
      "name": "Hole ",
      "alt_names": [
        "Holy"
      ],
      "role": "supporting",
      "description": "Hole has a long ragged sheet like head with black whorled bleeding eyes and multiple thin horns that circles it's head. Hole wears a big jacket with large pockets all over his chest to his legs. Hole also has thorn like horns poking out of it's arms along with some longs sharp claws running from his mitten like hands.\n\nHole is very tall (about twice the size of the average devil) at 4 meters tall and the things it can do with it's body is unknown. For example its mouth can only be visible when it's about to consume somebody and flow little people from it's eyes and mouth that drag it's enemies into it's mouth.\n\nHis debut appearance color scheme consisted in a uniform pallet of grey, later it was changed to a more remarked color difference, with a black overall clothes and his arms and mask white.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b156199-tYdgjU0bgibC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 156199
      },
      "rarity": "uncommon"
    },
    {
      "id": "asuka",
      "name": "Asuka",
      "alt_names": [
        "飛鳥"
      ],
      "role": "supporting",
      "description": "Asuka is a former Tanba restaurant's employee and has an unrequited love for her boss. She wears a bat-shaped mask that covers her entire face, leaving only her mouth and eyes exposed, her hair is black and spiky and she wears clothes with cleavage and mice hanging from them. Her troubled personality prevents her from advancing in her relationship with Tanba, however, she has always tried to conquer him using her magic.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b164745-aYf4Vzcl6ae1.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 164745
      },
      "rarity": "uncommon"
    },
    {
      "id": "yasaka",
      "name": "Yasaka",
      "alt_names": [
        "八坂"
      ],
      "role": "supporting",
      "description": "One of the new members of the cross-eyes, who joined in the gang to find the black powder.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b171152-vtUmwKtXSWjo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 171152
      },
      "rarity": "uncommon"
    },
    {
      "id": "syueron",
      "name": "Syueron",
      "alt_names": [
        "シュエロン"
      ],
      "role": "supporting",
      "description": "**Height:** 191 cm\n\nSyueron is a human from Hole and he was the former owner of the shop that became the Hungry Bug. At his shop, Syueron sold tea and desserts that were very popular with magic users and thus he became a target of the Magic-User haters of Hole.",
      "metadata": {
        "gender": "male",
        "age": "37",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209122-a7boJTLUd10k.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209122
      },
      "rarity": "uncommon"
    },
    {
      "id": "gura-gura",
      "name": "Gura-Gura",
      "alt_names": [
        "グラグラ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b245049-4TJnhE4oaNx5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 245049
      },
      "rarity": "uncommon"
    },
    {
      "id": "hajime-damemaru",
      "name": "Hajime Damemaru",
      "alt_names": [
        "一＝ダメ丸"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b158225-ZxLXOzfqcs1m.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 158225
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-24T02:22:02.275Z"
}