{
  "work_id": "clannad",
  "count": 15,
  "characters": [
    {
      "id": "tomoya-okazaki",
      "name": "Tomoya Okazaki",
      "alt_names": [
        "岡崎朋也",
        "Ginga Daiuchuu",
        "Eternal",
        "Ethanol"
      ],
      "role": "protagonist",
      "description": "__Height:__ 173cm\n__Class:__ 3-D\n\nTomoya Okazaki is the protagonist of Clannad. Due to his habit of always arriving late to school, skipping classes during the day, and staying out all night, he has been labeled as a delinquent.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": "1985-10-30"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4606-61r9h3WUrkA9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4606
      },
      "rarity": "legendary"
    },
    {
      "id": "nagisa-furukawa",
      "name": "Nagisa Furukawa",
      "alt_names": [
        "古河渚"
      ],
      "role": "protagonist",
      "description": "__Height:__ 155 cm\n\nNagisa is the daughter of Akio and Sanae Furukawa. Though she is in her senior year, Nagisa is one year older than her classmates; she had to repeat her third year again after an illness that lasted nine months. Nagisa meets Tomoya on the first day of this year.  Nagisa is very timid, and has a habit of saying the names of food that she wants to eat as a way of motivating herself. She wants to reestablish the suspended Theater Club, but does not have enough self-confidence to do so.",
      "metadata": {
        "gender": "female",
        "age": "18-19",
        "dateOfBirth": "1984-12-24"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4604-YFJiWeuGSIYf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4604
      },
      "rarity": "legendary"
    },
    {
      "id": "fuuko-ibuki",
      "name": "Fuuko Ibuki",
      "alt_names": [
        "伊吹風子",
        "Fuko",
        "Fuu-chan",
        "Isogai"
      ],
      "role": "protagonist",
      "description": "__Height:__ 150 cm\n\nFuko is a first year student at Tomoya's school (Technically, her age is same as Tomoya's), but she is always alone by herself, making wood carvings of starfish with a small knife to give to others as presents for her sister's upcoming wedding. Whenever Fuko sees something she thinks is incredibly cute she completely loses awareness of her surroundings, which Tomoya takes advantage of by playing a variety of pranks on her.   \n\n__In Clannad__\n~!It is later found that Fuko is actually in the hospital, still in a coma from a car crash. Everyone slowly starts to forget her when her health condition gets worse. Tomoya and Nagisa were the last to forget her since she spent most of her time with them. !~\n\n__In Afterstory__\n~!After accidentally releasing one of the light orbs, Tomoya unwittingly brings Fuko out of her coma. She has no memory of what happened, but her personality hasn't changed one bit. She is extremely fond of Ushio.!~",
      "metadata": {
        "gender": "female",
        "age": "18",
        "dateOfBirth": "1985-07-20"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4601-ndvzx7vVREJU.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4601
      },
      "rarity": "legendary"
    },
    {
      "id": "kotomi-ichinose",
      "name": "Kotomi Ichinose",
      "alt_names": [
        "一ノ瀬ことみ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 160cm (5'3'')\n\nKotomi is another schoolmate of Tomoya's in the same year, but, like Kyou, is in a separate class from Tomoya. The \"Koto\" in Kotomi is derived from the Japanese musical stringed instrument of the same name. She is in the top ten for every subject throughout the whole country in standardized exam results—she always goes to library to read extra materials, especially books in foreign languages. Kotomi is a very quiet girl and it is quite difficult to communicate with her. In her spare time, she plays the violin, although she is very poor at it to the point of causing pain to those who hear her play.   \n\n__In Clannad__\n~!Tomoya meets her for the first time when he enters the library and found Kotomi sitting on the floor barefoot, reading books with scissors in her hand, and acts oddly with Tomoya. After several meetings with Kotomi, Tomoya starts skipping the fourth period and spend time with Kotomi in the library. Tomoya decides to force Kotomi to join the drama club to make her more sociable. Just when Kotomi starts to open up to everyone, a bus accident causes her to breakdown in front of everyone and returns home later. Tomoya visits her in her house and learns that he and Kotomi were childhood friends, but lost contact with each other after Kotomi's parents died in an plane-accident. Not wanting to feel the pain of losing someone important anymore, and asks Tomoya to leave her alone. Wanting to bring Kotomi away from her past, Tomoya decides to renovate her garden, while the drama club members decide to gift her a violin, but was unfortunately destroyed. After renovating Kotomi's garden, Kotomi appears to Tomoya, and after some poignant conversation, Tomoya brings Kotomi out of her house to see the outside world inside her heart. The next day, her guardian presents Kotomi her parent's briefcase that has traveled all the way to Japan, and inside is a teddy bear and a testimony, asking Kotomi to live the way she wants and grow up to be an adult. Kotomi realizes she is still being loved by her parents even after their death and cries. After this, Kotomi becomes more mature, and the drama club members finally give Kotomi a violin.!~    \n\n__In After Story__  \n~!In the anime adaptation Clannad After Story, Kotomi moves to America to further her studies. She, however, occasionally visits Tomoya and the others, and in the movie adaptation, Kotomi only made a cameo appearance, as she is only seen conducting a song for the members of the Choir Club.!~",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": "1985-05-13"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4602-L9sSmkyQhZeC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4602
      },
      "rarity": "legendary"
    },
    {
      "id": "tomoyo-sakagami",
      "name": "Tomoyo Sakagami",
      "alt_names": [
        "坂上智代",
        "Tomo-pyon"
      ],
      "role": "protagonist",
      "description": "__Height:__ 161cm\n\nTomoyo transferred to Tomoya's school as a second year student during spring. Although Tomoya is older than her, Tomoyo does not show him his due respect as a senior student. She has a younger brother named Takafumi.\n\nShe is rumored to be violent and to have a misconduct record for fighting. These rumors are later confirmed, when she beats up several delinquents from her previous school at a day during school hours. Youhei challenges Tomoyo, unable to believe what he saw. After several meetings with Tomoyo, Tomoya learns from Tomoyo that she wants to be a student council president, and later, her reason of wanting to be one.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": "1986-10-14"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4603-pq4b7UGmmOyH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4603
      },
      "rarity": "legendary"
    },
    {
      "id": "kyou-fujibayashi",
      "name": "Kyou Fujibayashi",
      "alt_names": [
        "藤林杏"
      ],
      "role": "protagonist",
      "description": "__Height:__ 160 cm\n\nKyou is a bad-mouthed and aggressive girl well known as a good cook. She was in Tomoya&#039;s class in their second year, and has maintained a steady friendship with Tomoya even though they are put in different classes on their third year. She is currently the class representative of her class. She has a pet baby boar named Botan. She owns a scooter and she throws various types of dictionaries towards anyone she gets furious with, especially Youhei.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": "1985-09-09"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4605-a0D3NeVbCz1m.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4605
      },
      "rarity": "legendary"
    },
    {
      "id": "ryou-fujibayashi",
      "name": "Ryou Fujibayashi",
      "alt_names": [
        "藤林椋"
      ],
      "role": "protagonist",
      "description": "__Height:__ 159 cm\n\nRyou is Tomoya&#039;s classmate and class representative. She is the younger of the Fujibayashi twins. Unlike her older sister, she is timid and doesn&rsquo;t cook well, though she is good with other household chores. Ryou is very keen about fortune telling, but her predictions, while incredibly specific, always manage to be either somewhat skewed or extremely wrong. She aspires to become a nurse.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": "1985-09-09"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/4608.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4608
      },
      "rarity": "legendary"
    },
    {
      "id": "youhei-sunohara",
      "name": "Youhei Sunohara",
      "alt_names": [
        "春原陽平",
        "Baby Sunohara",
        "'Kazuto Miyazawa'"
      ],
      "role": "protagonist",
      "description": "__Height:__ 167 cm (5'4\")\n__Occupation:__ Student\n\nYouhei is Tomoya's friend and also a delinquent. He entered the school on an athletic recommendation in football (soccer), but was kicked out of the soccer club after being involved in a fight. After this incident, he became lazy, becoming the only student with a higher absence rate than Tomoya. He and Tomoya are known as the \"Dirty Pair\" in school. Youhei plays a major role in some character paths. Youhei plays the most role in Sunohara siblings' arc, which centers around his relationship with his sister Mei, who tries to bring back her brother's former self.  In After Story arc,  ~!he attends Nagisa's fake graduating ceremony after being begged by Tomoya, and visits Nagisa when she is sick and pregnant. According to the scriptwriters, he has the most appearance in the School Life arc.!~  In the movie, Youhei is depicted less as a comic relief character and is more serious about life, such as when he gets a part-time job due to his family's financial situations. He also gets along with Tomoyo and the two even worked together to ease Tomoya's depression.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": "1986-02-17"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4610-tMnUyYDlUbX1.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4610
      },
      "rarity": "legendary"
    },
    {
      "id": "yukine-miyazawa",
      "name": "Yukine Miyazawa",
      "alt_names": [
        "宮沢有紀寧",
        "Yuki-nee"
      ],
      "role": "supporting",
      "description": "Yukine is a second year student who hangs around in the library's reference room during lunchtime. She takes care of many newcomers from other schools who also happen to be delinquents - in particular, people who knew her brother. She's very kind, and avails [Tomoya](https://anilist.co/character/4606) and [Youhei](https://anilist.co/character/4610) an instruction book for magical spells for them to try.\n\n~!Yukine is actually involved deeply with the story relating to the delinquents. Her brother is well known for being a delinquent, and this sometimes gets her into different situations involving the delinquents of the town. It is later revealed, in After Story, that her brother died and nobody knew that other than the group of people that reside on her brother's side. Yukine later helps reunite the members of opposite gangs, and they all end up being friends.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4607-bIYTFfyghFx0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4607
      },
      "rarity": "rare"
    },
    {
      "id": "mei-sunohara",
      "name": "Mei Sunohara",
      "alt_names": [
        "春原芽衣"
      ],
      "role": "supporting",
      "description": "Mei is Youhei's younger sister who loves Youhei as a brother and lives in the countryside. Mei is a smart girl and likes to see new things. She is a fan of Yusuke Yoshino, an older male graduate from Tomoya's school, who is a member of a band. Worried about her brother's situation, she calls Youhei, but instead of her brother, Tomoya disguised as Youhei tells her to come.  Mei's personality is a direct opposite of that of her brother, Youhei. She can be very nosy about things, like trying to further Tomoya's relationship with Nagisa by becoming their cupid angel or learning Youhei's current situation.   \n\n__In After Story__\n~!Although Youhei tries to avoid Mei, he still cares for her, as seen when he stands up for her when she gets bullied by the soccer club in Sunohara sibling's path.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4611-YEXqF3N8hqGe.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4611
      },
      "rarity": "rare"
    },
    {
      "id": "misae-sagara",
      "name": "Misae Sagara",
      "alt_names": [
        "相楽美佐枝"
      ],
      "role": "supporting",
      "description": "Misae Sagara is the resident manager at Youhei&#039;s dorm. Misae is 23 years old at the time the story takes place; this is only mentioned in the visual novel. She was Hikarisaka&#039;s first female student council president when she was in high school. She achieved a full week of perfect attendance for the whole student body and she was loved by the students. Misae is friendly with the dorm students but strict when it comes to the dorm rules. She is also well-liked by the rugby members. Depending on decisions, Tomoya can change her to a violent dorm lady through his lecture, which is her original personality, who uses brute force to convince the dorm students to do their cleaning duty.      ~!Misae is waiting for her lover to return, which is actually her cat&mdash;Katsuki Shima. When Tomoya tries to pursue Misae, the cat gives Tomoya a dream about Misae&#039;s past. When Misae was still in high school, she met a boy named Katsuki Shima who insisted in granting her wish as a payment for encouraging him to recover. Misae&#039;s reluctance on having her wish granted and Katsuki&#039;s persistency eventually have their feelings for each other develop further, which also made her elected as the student council president due to her rumors with Katsuki. However, Katsuki realizes that his true identity is not Katsuki but his cat, who gave him the duty of granting Misae a wish before dying. Being conflicted with his duty and his love for Misae, he insisted her on having her wish granted. After announcing her wish on having Katsuki forever loving Misae, Katsuki obliged. Katsuki returned to his cat form, and waited for Misae like usual. Noticing the cat&#039;s fondness on her, Misae takes the cat as her pet, without knowing the cat&#039;s identity as her lover. At the town&#039;s festival, Tomoya tells Misae about her cat&#039;s true identity. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4609-IEH2MbDtFoBx.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4609
      },
      "rarity": "rare"
    },
    {
      "id": "sanae-furukawa",
      "name": "Sanae Furukawa",
      "alt_names": [
        "古河早苗",
        "Isogai Sanako"
      ],
      "role": "supporting",
      "description": "**Height:** 158 cm (5' 2\")\n\nSanae is Nagisa&#039;s mother. Normally she&#039;s very childish and a cry-baby, but when needed she can be very strong-willed and dependable. She runs the Furukawa Bakery with her husband Akio. She often tries out strange concepts to make breads that are anything but edible and never get sold. Outside of the bakery, she tutors children. She&#039;s quite proud of the way people often mistake her for Nagisa&#039;s older sister because of her youthful appearance.    ~!Sanae plays a larger role in After Story, often comes to Tomoya&#039;s aid when Nagisa is sick and needs to be accompanied, especially during Nagisa&#039;s pregnancy. Before being a baker at the Furukawa Bakery, she was a junior-high teacher, and had to quit her job due to Nagisa&#039;s health. Sanae is the mastermind behind Tomoya and Ushio&#039;s trip to the flower cape, in hope for them to reconcile. She knows Shino, Tomoya&#039;s grandmother in his father&#039;s side, although it is never revealed how they met. !~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6831-8jUtY6oLk5bp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6831
      },
      "rarity": "rare"
    },
    {
      "id": "kouko-ibuki",
      "name": "Kouko Ibuki",
      "alt_names": [
        "伊吹公子"
      ],
      "role": "supporting",
      "description": "Kouko is Fuko&#039;s older sister. She used to be an art teacher at Tomoya&#039;s school, and she treats everyone kindly. Kouko is one of the familiar faces in the Furukawa Bakery, and Nagisa admires her very much, being her former art teacher. Currently she is engaged with Yusuke Yoshino.  \n\n~!and is the major reason why Fuko still exists in the school, despite still sleeping in the hospital.!~  \n\nIn the movie, Kouko was a drama teacher instead of an art teacher. She, along with Youhei and Tomoya helped supervise and revive the drama club for Nagisa.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6971-EHkQK34Sriqi.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6971
      },
      "rarity": "rare"
    },
    {
      "id": "akio-furukawa",
      "name": "Akio Furukawa",
      "alt_names": [
        "古河秋生",
        "Akii",
        "the baker Cy Young"
      ],
      "role": "supporting",
      "description": "**Height:** 175 cm (5' 9\")\n\nAkio is Nagisa's father. Although he often talks and plays rough, he is kind and sympathetic. His childish side makes it easy for people to befriend him. He runs the Furukawa Bakery with his wife [Sanae](https://anilist.co/character/6831/Sanae-Furukawa). In his spare time, Akio plays baseball with children in the small park next to the bakery, and indulges in the Gundam fandom. He is often the victim of Sanae's bread, having to eat her bread in front of her while claiming that he loves it.\n\n~! \nDuring the School Life arc, Akio reveals that he was an actor in a theatrical company, but has to quit his job due to Nagisa's health. Akio replaces Youhei's role as the comic relief during the After Story arc, however, he can be serious when needed, as he often gives advice to Tomoya on what it is like to become a man. He tells the story about how Nagisa almost died due to their unintended negligence, and how her life is connected to the city after getting saved from her fever. \n!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7095-C1tzbivkPU0A.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7095
      },
      "rarity": "rare"
    },
    {
      "id": "yusuke-yoshino",
      "name": "Yusuke Yoshino",
      "alt_names": [
        "芳野祐介",
        "Yu-kun"
      ],
      "role": "supporting",
      "description": "Yusuke is an electrician who once attended Tomoya's high school and lived as a rock musician. He is admired by Mei for his infrequent rock play. Tomoya first met Yusuke during a street light accident involving a person's car, and assists Yusuke in his work. Through Yusuke, he realizes the pain of working in society. Yusuke is engaged to Kouko, and is also one of the reasons why Fuko exists in the school.   Clannad After-Story:  ~! He plays a more prominent role in After Story, giving Tomoya a job as an assistant electrician in his company, and sometimes gives him advice. Due to Tomoya's interest in him, Yusuke tells him of his past - how he became a rock musician, rose in fame, and ended due to his loss of his original motivation, along with stress and drugs. After being rehabilitated, no one wanted him anymore, except for Kouko, who had encouraged him to become a rock musician during his high school days. Throwing away his past, he now works as an electrician. Realizing that there are people who still love his music through Tomoya, Yusuke decides to create another music CD that sings his love for the city.  !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7096-WO9iY1KKOABn.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7096
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T18:03:38.759Z"
}