{
  "work_id": "yamada-kun-and-the-seven-witches",
  "count": 15,
  "characters": [
    {
      "id": "ryuu-yamada",
      "name": "Ryuu Yamada",
      "alt_names": [
        "山田竜"
      ],
      "role": "protagonist",
      "description": "__Class:__ 2-B \n__Affiliation:__ Supernatural Studies Club \n__Ability:__ Copy   \n\nRyuu Yamada is a second year student at Suzaku High. He is always late for school, naps in class, and gets abysmal grades. His life is a dead bore.    \n\n~!According to Urara Shiraishi, Yamada has the ability called \"Duplication\".  When Yamada kisses one of the witches with special powers he replicates their power and uses it when he kissed a normal person.  If Yamada kisses another witch then the abilities he had won't affect the said witch. This can be seen when he kissed Nene Odagiri he didn't swap bodies with her or when he kissed Urara after he replicated Nene's powers she didn't fall in love with him.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b57489-iZ6EILuI8HYZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 57489
      },
      "rarity": "epic"
    },
    {
      "id": "urara-shiraishi",
      "name": "Urara Shiraishi",
      "alt_names": [
        "白石うらら",
        "Sunshine"
      ],
      "role": "protagonist",
      "description": "Class: 2-B\nAffiliation: Supernatural Studies Club\nTitle: President of the Supernatural Studies Club\n\nA beautiful girl who is Suzaku High's brightest student. She is one of the seven (original) witches.\n\n~!Urara's ability as a witch is Body Swapping. When she kisses a person she will instantly swap bodies with said person. There is a limitation though, if the person she kissed is already under the effects of another witch's power then the body swap won't happen. According to Miyabi Itou, Urara's ability is cataloged into Immediate Reaction. Shiraishi Gained that power by her own dislike of her life.!~\n\n~!After everyone in the Supernatural club loses their memories of Yamada, it is discovered she was in love with Yamada, which she now remembers as other people in the Supernatural club.!~\n\nShe wears E-cup bras and lots of white underwear, but owns black ones as well. Yamada is the only person Shiraishi is willing to swap bodies with, i.e. kiss. In a special report, Miyamura does an in-depth analysis of the witches based on his observation. In it, he mentioned Shiraishi and her power, \"It's so awesome that I get to enjoy using this power! The risks of using are way too high, though. Shiraishi is pretty and nice, but she only kisses Yamada, which is a bummer. I want in on the fun!\"\n\n~!Throughout the chapters, there are many hints that she has feelings for Yamada. She later admits this in Chapter 90, and the two of them begin dating after that.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b57491-4vnzg6Zahvyi.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 57491
      },
      "rarity": "epic"
    },
    {
      "id": "nene-odagiri",
      "name": "Nene Odagiri",
      "alt_names": [
        "小田切寧々"
      ],
      "role": "protagonist",
      "description": "Nene is one of the seven witches and Vice president of the Student Council.   ~!Nene's abilities is captured. When she kisses, that person will fall in love with her and she can make them do whatever she wants.   There is a limitation though, if the person she kissed is already under the effects of another witch's power then the Captured won't happen.   Odagiri gained that power by the desire to become popular. !~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b57493-B1viX2ZWuERF.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 57493
      },
      "rarity": "epic"
    },
    {
      "id": "toranosuke-miyamura",
      "name": "Toranosuke Miyamura",
      "alt_names": [
        "宮村虎之介"
      ],
      "role": "protagonist",
      "description": "**Affiliation:** Student Council and Supernatural Studies\n\nCouncil vice president and supernatural club vice president. Knows of Yamada and Shiraishi switching secret.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b59317-IKHbvRkflxMr.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 59317
      },
      "rarity": "epic"
    },
    {
      "id": "miyabi-itou",
      "name": "Miyabi Itou",
      "alt_names": [
        "伊藤 雅"
      ],
      "role": "protagonist",
      "description": "__Height:__ 156 cm (5'1\")\n__Class:__ 2-C\n__Affiliation:__ Supernatural Studies Club\n\nMiyabi Itou is a girl that believes in the supernatural, that's why she also joins the Supernatural club. She later learns the secret of Yamada. Although Miyabi is a considerably attractive and cheerful girl, due to her being a fan of the supernatural phenomenons and alike, she is considered among her peers to be a fraud and liar. Because of this, she didn't have any friends at all.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62437-32tse1zFMino.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62437
      },
      "rarity": "epic"
    },
    {
      "id": "shinichi-tamaki",
      "name": "Shinichi Tamaki",
      "alt_names": [
        "玉木真一"
      ],
      "role": "protagonist",
      "description": "Class: 2-H Affiliation: Witch Ability: Plunder    ~!Shinichi is able to take away, or \"steal\", witches powers. He's ability is similar to Yamada's because he can also use the powers that of other witches but instead takes the power away from the witches that he kisses. If he kisses a witch but currently holds another witch's power, the previous one is cancelled and he will only be able to use the new one until he kisses another witch.  His current witch power that he stole makes him invisible after he kisses someone. He calls himself \"the invisible man\". !~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b81907-IB998KFboTGP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81907
      },
      "rarity": "epic"
    },
    {
      "id": "daichi-shinagawa",
      "name": "Daichi Shinagawa",
      "alt_names": [
        "品川大地",
        "Shina"
      ],
      "role": "supporting",
      "description": "__Height:__ 175 cm\n\nThe male protagonist of the story and known as \"Yankee-kun,\" Shinagawa is a short-tempered delinquent who does not like to be bothered and has no plans for his high school life until he meets Adachi. At first he is constantly annoyed about her repeated attempts at making him come on a school field trip until he learns about her past and her resolution to become a class representative. He is also an honorable person who will try everything to protect others. His best subject is math.  He has a love-hate relationship with Hana Adachi, liking her due to her nature to help others no matter what, but becoming annoyed with her due to her idiocy, lack of common sense, and forcing him to help with her bizarre plans and antics. He suspects that she is constantly with him because she likes him, but whenever he asks her about it, she ignores the question or acts ignorant on the subject. In the bonus chapter after 53, It was shown that Shinagawa decided to attend Mon Shiro only after seeing a beautiful girl at his entry exam (confirmed in chapter 61 to be Hana without her glasses and loose hair). Chiba, Izumi, and Akita were also presented. Shinagawa, although he always bicker with Hana, would do anything so that he won't hurt or upset her. Like, not telling her who he likes (which is obviously her, without glasses and with loose hair).  ~!In chapter 150, his past, before he became a delinquent, is revealed. At the time, due to innate talent and his being very hard working, he was one of the top students in Daishi Chugaku (大紫中学), a reputable private school, where his number one rival (in studies) at the time was a girl by the name of Hachioji Shizuku (八王子 雫). Upon realizing that delinquents were interfering with her ability to study, Shinagawa became directly involved to save her, resulting in his expulsion and his eventual lost of interest in studies. This event also marks his becoming a delinquent and when he got his current hairstyle.  Shinagawa's household background is also revealed to be other than what one expects. His father is a doctor and his mother is a lawyer.!~ (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/12969.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12969
      },
      "rarity": "uncommon"
    },
    {
      "id": "seiya-chiba",
      "name": "Seiya Chiba",
      "alt_names": [
        "千葉星矢",
        "Sei-chan"
      ],
      "role": "supporting",
      "description": "__Height:__ 193 cm \n__Favorite Phrase:__ \"Is that so?\"\n\nChiba is a tall, bespectacled, and fearsome-looking student. He is very smart and rich, and his mother is young and beautiful. He has a habit of unknowingly glaring at people which often cause a misunderstanding. He almost always scores 100 marks for his tests.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/16242.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16242
      },
      "rarity": "uncommon"
    },
    {
      "id": "karen-kimishima",
      "name": "Karen Kimishima",
      "alt_names": [
        "君島 カレン"
      ],
      "role": "supporting",
      "description": "She's the Suzaku High Junior Girls' Archery Team Captain.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/65883.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65883
      },
      "rarity": "uncommon"
    },
    {
      "id": "haruma-yamazaki",
      "name": "Haruma Yamazaki",
      "alt_names": [
        "山崎春馬"
      ],
      "role": "supporting",
      "description": "He is the Suzaki High Senior Student Council President.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65885-OzJY8lsZVE0a.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65885
      },
      "rarity": "uncommon"
    },
    {
      "id": "ushio-igarashi",
      "name": "Ushio Igarashi",
      "alt_names": [
        "五十嵐潮"
      ],
      "role": "supporting",
      "description": "Ushio was actually Yamada's friend from their old school. They had both decided to put behind their gang related past by going their separate ways. By coincidence, they end up going to the same school and they can not seem to fit in any cliques, so they decided to stay together. Ushio also had a deep hate for girls but that changed when he met Odagiri Nene and kissed her. Her power made him fall deep in love with Nene and betray his best friend, Yamada.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b68495-BkumJlG1jB0b.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 68495
      },
      "rarity": "uncommon"
    },
    {
      "id": "meiko-otsuka",
      "name": "Meiko Otsuka",
      "alt_names": [
        "大塚芽子"
      ],
      "role": "supporting",
      "description": "Class: 2-C \nAffiliation: Witch \nAbility: Thought/Telepathy   \n\nIs one of the seven witches.   \n\n~!Otsuka has the ability called \"Telepathy\". Because of her inability to talk out loud she gained this power so that she can communicate with others. If the person got kissed by the person with this ability, they can communicate with others as well as if they were the witches, they can send images as well.  Odagiri confirmed that this ability is like using a cellphone.   Ootsuka gained that power by her inability to talk out loud.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b68497-a1V5zAL4UuIo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 68497
      },
      "rarity": "uncommon"
    },
    {
      "id": "kentarou-tsubaki",
      "name": "Kentarou Tsubaki",
      "alt_names": [
        "椿健太郎"
      ],
      "role": "supporting",
      "description": "Kentarou is a member of the supernatural studies club.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b74345-DvNJR3mteqsJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74345
      },
      "rarity": "uncommon"
    },
    {
      "id": "maria-sarushima",
      "name": "Maria Sarushima",
      "alt_names": [
        "猿島マリア"
      ],
      "role": "supporting",
      "description": "__Class:__ 2-F \n\nMaria Sarushima is one of the seven witches in Yamada-kun to Nananin no Majo.   \n\n~!Ability: Premonition  Maria's witch abilities is Premonition, when Maria's kisses another person she can foresee a brief of the future. Sarushima is able to see the future. !~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b79985-7KmY1d7K0Dmf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 79985
      },
      "rarity": "uncommon"
    },
    {
      "id": "noa-takigawa",
      "name": "Noa Takigawa",
      "alt_names": [
        "滝川ノア"
      ],
      "role": "supporting",
      "description": "Class: 1-C \nAffiliation: \nWitch Ability: Retrospective   \n\nNoa is one of the seven witches in Yamada-kun to 7-nin no Majo, and she is able to see the past. She has three other friends. They attempt to get the other witches expelled from school in order to get their powers.   ~!Takigawa has the ability that allows her to see the past. It's very similar to Maria Sarushima's ability.   (Takigawa is able to see the past.)!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b80265-5kQeKznUkjDF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 80265
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-26T03:25:08.468Z"
}