{
  "work_id": "hells-paradise",
  "count": 69,
  "characters": [
    {
      "id": "gabimaru",
      "name": "Gabimaru",
      "alt_names": [
        "画眉丸",
        "Garan no Gabimaru (がらんの画眉丸)",
        "Gabimaru the Hollow"
      ],
      "role": "protagonist",
      "description": "__Race:__ Human\n__Tao Attribute:__ Fire\n__Occupation:__ Shinobi\n__Affiliation:__ Iwagakure (Formerly)\n\nGabimaru is an elite shinobi assassin formerly from Iwagakure. He is the husband of [Yui](https://anilist.co/character/151771/Yui) and the son-in-law to the chief of Iwagakure.\n\nGabimaru is calm, level-headed and rarely shows any emotions. He is calm to the point where he is unfazed by any sort of crisis, such as being executed or when he is confronted and attacked by a strong enemy. As noted by Sagiri, once Gabimaru calms down he tends to complain. He prefers to stick with his main objective at hand and not get tangled with anything else that doesn't involve his goals. Although he is viewed as being obnoxious (mainly by Sagiri), he can also be respectful and polite at times.\n\n~!During his time in Iwagakure, Gabimaru was known and admired by his peers for his cruelty and ruthless killings of his victims, but after being married to Yui, Gabimaru underwent a major change. Even though he was influenced by his leaders words of ridding himself of his emotions to become strong, Gabimaru was also influenced by Yui's kind and caring nature into believing that having emotions made him truly strong and would turn him into a true warrior. This overwrote his cruel nature as a ninja and made him want to avoid unnecessary killing.!~\n\nHe served as Iwagakure's most infamous shinobi until he was betrayed by his village for wanting to abandon his role as a murderer and live a peaceful life with his wife, resulting in him being handed over to the authorities to be executed. However, after the shogun calls for convict criminals to acquire the Elixir of Life from the dangerous island known as Kotaku, in exchange for a pardon for their past crimes, Gabimaru accepts the invitation to be a part of the competition mission in order to reunite with Yui and live the life he so desired. Upon taking the mission, [Yamada Asaemon Sagiri](https://anilist.co/character/137263/Sagiri) was chosen as his assigned monitor.\n\n~!Shortly after, Gabimaru becomes a part of a united front formed from the remaining surviving criminals and executioners to defeat Lord Tensen, work together in capturing the elixir, and have everyone escape the island.!~",
      "metadata": {
        "gender": "male",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137260-xmSis8FmwhEE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137260
      },
      "rarity": "legendary"
    },
    {
      "id": "sagiri",
      "name": "Sagiri",
      "alt_names": [
        "佐切",
        "Yamada Asaemon Sagiri (山田浅ェ門佐切"
      ],
      "role": "protagonist",
      "description": "__Race:__ Human\n__Tao Attribute:__ Wood\n__Occupation:__ Asaemon\n__Affiliation:__ Yamada Clan\n__Rank:__ 12th\n\nYamada Asaemon Sagiri is the 12th rank Asaemon in the Yamada Clan. After the shogun sent criminals to Kotaku to find the Elixir of Life, she was tasked with being [Gabimaru's](https://anilist.co/character/137260/Gabimaru) executioner.\n\nSagiri generally displays a calm demeanor when taking on her role as an executioner. However, after landing on Kotaku, she allowed herself to act casual around others as long as she continued to do her job. She is very polite and caring towards her fellow Asaemon members, despite the fact that she is aware that some view her as being unworthy of becoming a samurai. However, she is not afraid to speak her mind and to stand up for herself. Though she takes matters seriously, Sagiri does possess a sense of humor, often laughing at Shion's jokes. \n\n~!After her experience with working successfully with criminals and witnessing the deaths of her fellow clansmen, Sagiri resolved to abandon her role as an executioner on the mission and viewed everyone that came not as a criminal or an executioner but as allies so they can work together to return home safely.!~\n\nWhen she was young, Sagiri watched as her father skillfully decapitated a condemned performer with a single swing of his sword. From that day she became inspired to walk the path of an executioner and achieve the same level of skill as her father. As she began her training on how to wield a sword, Sagiri was looked down on by her fellow Yamada members, as well as her father, for being a female following the path of a samurai. Sagiri was also shunned by other children because of the clan's bad reputation. Despite the harsh treatment she faced, Sagiri managed to earn her name as a Yamada Asaemon.",
      "metadata": {
        "gender": "female",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137263-I2krXFEFOHjL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137263
      },
      "rarity": "legendary"
    },
    {
      "id": "choubei-aza",
      "name": "Choubei Aza",
      "alt_names": [
        "亜左弔兵衛",
        "Bandit King (賊王 Zoku-ou)",
        "Aza Chobei",
        "Aza Chobe"
      ],
      "role": "supporting",
      "description": "__Race:__ Human (Formerly), ~! Semi-Immortal Human !~\n__Tao Attribute:__ Metal\n__Occupation:__ Bandit\n\nAza Chobe also known as the Bandit King, is a well-known bandit leader in Iyo that is responsible for multiple crimes committed.\n\nChobe is an extremely barbaric individual who attacks anyone or anything that poses as a threat to him. He prefers to do things of his own accord and would rather resort to violence than talk things through. Chobe is also very sadistic whenever he engages in fights with his enemies, Chobe always stuck to taking on the role of the villain, and holds grudges to those that have bested him. Although he tends to act like a brute, Chobe is a rationale thinker that knows what is the best course of action in a serious situation.\n\n~! Chobe and Toma were born as sons to a retainer under the service of the daimyō of Akō Domain, Asano Takunori. However, after Asano Takunori attacked the court official Kira Yoshinaka at Edo Castle, he was sentenced to commit seppuku. As a result, their father and the rest of the retainers had their status removed and were left as ronin, leaving their family in poverty. They were eventually taken by bandits who planned on selling them but later came to live amongst them after Chobe managed to become their leader. !~",
      "metadata": {
        "gender": "male",
        "age": "19-20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137269-8sLwiijk0bti.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137269
      },
      "rarity": "rare"
    },
    {
      "id": "yuzuriha",
      "name": "Yuzuriha",
      "alt_names": [
        "杠",
        "Yuzuriha of the Seishu",
        "傾主の杠",
        "Seishu no Yuzuriha",
        "Fox (狐 Kitsune)"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Tao Attribute:__ Earth\n__Occupation:__ Kunoichi\n\nYuzuriha also known as Yuzuriha of the Keishu, is a kunoichi and one of the few criminals recruited to acquire the Elixir of Life.\n\nYuzuriha is friendly and cheerful around others with a typical teenage girl personality. She is shown to be carefree and prefers to do things at her own pace. Because of her reputation as a criminal, Yuzuriha has no problems when it comes to killing or who she has to sacrifice to achieve a goal. Underneath her friendly attitude, Yuzuriha's true nature is that of a complete narcissist, only focusing on her own well-being and shows little concern for others. This attitude stemmed from her past vow to her little sister to live only for the both of them. As a kunoichi, Yuzuriha uses her charms to get what she wants, but despite that she is shown to be a terrible liar after trying to make up her backstory.\n\n~! Though selfish, Yuzuriha can show compassion to others. As Senta was dying, she consoled him and had him die in peace by making him forget about his duties as an Asaemon and gave him the last bit of freedom he had to think about what he wanted to imagine as his last memory. !~\n\n~! Despite her beautiful appearence, with her mucus abilities she actually hides a body full of scars. !~\n\nYuzuriha grew up in a shinobi village living with her little sister, Saya, who was suffering from an incurable disease and eventually died. From then on, Yuzuriha swore to live her life for the both of them and started her career as a kunoichi. Sometime ago, Yuzuriha raided the Sagiwa Castle and defeated the retainers defending it.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137270-PTFen9fxyo4H.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137270
      },
      "rarity": "rare"
    },
    {
      "id": "touma",
      "name": "Touma",
      "alt_names": [
        "桐馬",
        "Yamada Asaemon Touma (山田浅ェ門桐馬)",
        "Toma"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Tao Attribute:__ Earth\n__Occupation:__ Asaemon (Unofficial)\n__Affiliation:__ Yamada Clan\n\nToma is a relatively new member of the Yamada clan trying to rise in their ranks and is the assigned monitor of [Chobe Aza](https://anilist.co/character/137269/Chobe-Aza).\n\n~! He turns out to be the younger brother of Chobe Aza and had a mission of infiltrating the Yamada clan to rescue him from prison. !~\n\nToma believes that the key to surviving in life is adapting to ones environment. Toma tends to act rather unfriendly when someone tries to communicate with him on friendly terms. He also displays a cocky attitude.\n\n~! He is very caring and loyal to Chobe since he has been his protector since they were children and stresses out whenever harm comes to him. Because of how his father died fighting for his allies, Toma is reluctant to cooperate with anyone except for his brother. In his own eye, Toma views himself as an extension of his brother instead of an ally and stated that the bandits that followed the two were merely pawns for them to use. However, Toma soon realizes that his reliance on his brother to protect him interferes with his growth rate to look after himself. !~\n\n~! Toma and Chobe were born as sons to a retainer under the service of the daimyō of Akō Domain, Asano Takunori. However, after Asano Takunori attacked the court official Kira Yoshinaka at Edo Castle, he was sentenced to commit seppuku. As a result, their father and the rest of the retainers had their status removed and were left as ronin, leaving their family in poverty. Their mother eventually died of an illness and their father was executed for being a part of the Akō Incident, leaving the two siblings left alone to defend for themselves. They were eventually taken by bandits who planned on selling them but later came to live amongst them after Chobe managed to become their leader. !~",
      "metadata": {
        "gender": "male",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137261-lWhxTwLOYLpO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137261
      },
      "rarity": "rare"
    },
    {
      "id": "nurugai",
      "name": "Nurugai",
      "alt_names": [
        "ヌルガイ"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Age:__ Unknown\n__Tao Attribute:__ Water\n__Affiliation:__ Sanka Mountain People (Formerly)\n\nNurugai is the last remaining member of the Sanka and a wrongly convicted death-row criminal. Her assigned monitor is Tenza\n\nNurugai looks down on samurai, viewing them as stupid. Her disdain for them stems from the fact that they were partially responsible for killing her people. Because of this incident, Nurugai feels a strong guilt for leading her village's extermination, even believed that the reason why she is on a dangerous mission is because she was receiving divine punishment for her actions and accepted death. \n\n~!However, after Tenza makes Nurugai take her own desires into account, Nurugai realizes that she wants to stay alive to return back to her home. After being influenced by Tenza and being by Shion's side, with his task of protecting her, Nurugai's opinion of samurai may have changed and sees that not all of them are bad. After the death of Tenza, Nurugai begged Shion to teach her swordsmanship and his ability to sense Tao to avenge him, stating that she could not stand by and watch as more people she cares for die in front of her.!~\n\nNurugai was raised with the Sanka Mountain People in a village where she had lived with her grandfather. Nurugai and her grandfather were in a friendly, familial relationship where she would learn off her grandfather's wisdom. Her village however were considered rebels against the current shogunate, refusing to submit to Tokugawa. Because of this, samurai were sent to locate the hillside tribes they defined as Emishis. One day, Nurugai crossed paths with a party of lost men, encouraging Nurugai to offer her help by seeking rest in the security of her village. Nurugai recognized her mistake when she realised that these men were samurai under the order of Tokugawa, who began a mass killing of her village that would leave her as the sole survivor.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137262-frEjtAk5zYRV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137262
      },
      "rarity": "rare"
    },
    {
      "id": "gantetsusai-tamiya",
      "name": "Gantetsusai Tamiya",
      "alt_names": [
        "民谷巌鉄斎",
        "Blade Dragon",
        "剣龍",
        "Kenryū",
        "Eight Provinces Unparalleled",
        "八州無双",
        "Hasshū Musō"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Age:__ Unknown\n__Tao Attribute:__ Fire\n\nTamiya Gantetsusai formerly known as Tetsunosuke is a renown master swordsman known throughout as the Blade Dragon and Eight Provinces Unparalleled.\n\nHe considers fighting to be fun and lives to seek out and battle strong opponents that can make him feel a thrill whenever he has to draw his blade. Even when critically injured, Gantetsusai's carries a satisfied smile from the adrenaline he gets from fighting and feels as though as he is becoming stronger with each injury. However, he is not very disciplined, preferring to recklessly fight his opponents head on without thinking of a clear strategy, or listen to his allies, and hates it when others try to interfere in his enjoyment. Gantetsusai also has a perverted side as he took note and commented on Yuzuriha's physique during the selection process. Despite his perverted behavior, Gantetsusai has morals as he felt disgusted of the thought of the Dōshi using Mei for sexual intercourse to complete their Tao training.\n\n~!Gantetsusai has a massive ego and wishes to go down in history as a legendary figure. He believes that by performing extraordinary feats and people remembering his name throughout generations is the true form of immortality rather than gaining the Elixir of Life.!~\n\nAt a young age, Tetsunosuke was trained in the art of swordsmanship. After being defeated by his master, Tetsunosuke asked how he was able to despite his old age. He explains to Tetsunosuke that he has become greedy with wanting to become stronger and says that he must throw away his strength in order to see everything in what he has left. Despite this lesson, Tetsunosuke was unable to understand what his master was telling him. As he grew up, Tetsunosuke renamed himself to Tamiya Gantetsusai and went around searching for strong opponents, eventually making a name for himself as a fame swordsman.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137264-qmjsYXb6YkX7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137264
      },
      "rarity": "rare"
    },
    {
      "id": "tenza",
      "name": "Tenza",
      "alt_names": [
        "典坐",
        "Yamada Asaemon Tenza (山田浅ェ門典坐)",
        "Tensa"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Tao Attribute:__ Unknown\n__Occupation:__ Asaemon\n__Affiliation:__ Yamada Clan\n__Rank:__ 10\n\nTenza is the 10th rank Asaemon in the Yamada Clan. After the shogun sent criminals to Kotaku to find the Elixir of Life, he was chosen as [Nurugai's](https://anilist.co/character/137262/Nurugai) assigned monitor.\n\nTenza is energetic and confident. He is a practitioner of bushido, taking in the lesson of continuing on forward no matter what is blocking his way. Tenza is also extremely righteous and does not let his duties as an Asaemon get in the way of doing what is right. He believes that Nurugai is innocent and does not deserve to die on the island. Although righteous he is, Tenza does not think things through, believing that without the elixir he would be able to convince his superiors to turn a blind eye.\n\n~!Tenza has a strong will to protect the people he cares about. After being badly injured, including having his throat and stomach punctured from Zhu Jin's attacks, Tenza refuses to give up and musteres up the strength to fight back, not allowing him to kill Nurugai and Shion even if it cost him his life. In the end Tenza was killed by Zhu Jin, but he was able to help Nurugai and Shion escape alive.!~\n\nFrom young, Tenza started off on the streets but was eventually picked up by Shion and made him into his apprentice in the Yamada Clan. He then earned his name as a Yamada Asaemon and became the 10th ranked.",
      "metadata": {
        "gender": "male",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137265-seGQMLb69BKV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137265
      },
      "rarity": "rare"
    },
    {
      "id": "shion",
      "name": "Shion",
      "alt_names": [
        "士遠",
        "Yamada Asaemon Shion (山田浅ェ門士遠)"
      ],
      "role": "supporting",
      "description": "__Race:__ Human \n__Tao Attribute:__ Wood\n\nShion is the 4th rank Asaemon of the Yamada clan and is the one chosen to be Akaginu's monitor. \n\nShion is a strict but kind man. He is well aware of the brutal nature of his work as an executioner, opting to spend the rest of his time helping others. Like the other Asaemon, he possesses a strong loyalty to the Yamada clan. Shion also has a witty sense of humor, often making puns and jokes regarding his eyesight, which has become a major part of his character to the people around him. Shion is shown to be fearless, showing no fear or hesitation when facing extremely strong enemies.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137267-D3mKSNS6H4o8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137267
      },
      "rarity": "rare"
    },
    {
      "id": "senta",
      "name": "Senta",
      "alt_names": [
        "仙汰",
        "Yamada Asaemon Senta (山田浅ェ門仙汰)"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n\nYamada Asaemon Senta is the 5th rank Asaemon in the Yamada Clan. After the shogun sent criminals to Kotaku to find the Elixir of Life, he was tasked with being [Yuzuriha's](https://anilist.co/character/137270/Yuzuriha) executioner.\n\nSenta is very nervous around others and tends to frequently sweat. He usually remains in the background and goes along with whatever is happening around him but will speak up when he feels that whatever he has to say would be helpful. Senta is capable of assessing the situation and makes good judgements as to how to approach them. He dislikes his role of killing people but feels that he has no choice in the matter and chooses to abandon his dream of becoming an artist. After observing Yuzuriha, he becomes envious and enchanted by her innate freedom. Despite his nervous demeanor, Senta is fearless and stands his ground no matter who he is up against.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137266-5BQ0RQI2SXjs.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137266
      },
      "rarity": "rare"
    },
    {
      "id": "fuchi",
      "name": "Fuchi",
      "alt_names": [
        "付知",
        "Yamada Asaemon Fuchi (山田浅ェ門付知)",
        "Yamada Asaemon Tsukechi"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Tao Attribute:__ Metal\n__Occupation:__ Asaemon\n__Affiliation:__ Yamada Clan\n__Rank:__ 9th\n\nYamada Asaemon Fuchi is the 9th rank Asaemon in the Yamada Clan and was chosen to be [Tamiya Gantetsusai's](https://anilist.co/character/137264/Gantetsusai-Tamiya) assigned monitor. \n\nFuchi is a rational thinker that has a good sense of judgement in situations and carries a no-nonsense view when it comes to matters that he deems are unscientific, pointless, and illogical. He has great pride as a Yamada Asaemon and does not tolerate anybody speaking disgracefully about the Yamada clan. He is very close with his Asaemon comrades and gives them nicknames instead of using honourifics. Even though the Yamada clan mainly deal with testing new swords and executions, Fuchi preferrs, and has a deep passion, for studying the human anatomy to improve medical science that came with the trade. He whole-heartedly believes that anatomical research would save lives and despises those who thought so little of this study.\n\n~! Although he was an executioner, after his experience working together with the surviving convicts, Fuchi found that both \"crime\" and \"evil\" were entirely different from one another, with Tamiya Gantetsusai as an example. From a scientific view point, Fuchi found that samurai and criminals were not so different since they are structured the same and had a will to live, which was reason enough for the survivors to band together in trying to return home. !~\n\n~! With both him and Gantetsusai badly injured Fuchi musters up the rest of his strength to administer first aid to Gantetsusai instead of himself resulting in him dying. In his last thoughts, Fuchi warns Shugen not to underestimate the survivors since they are not willing to die easily and wishes the best of luck to both his allies and enemies. !~",
      "metadata": {
        "gender": "male",
        "age": "19-20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137268-veVGOk95qa87.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137268
      },
      "rarity": "rare"
    },
    {
      "id": "genji",
      "name": "Genji",
      "alt_names": [
        "源嗣",
        "Yamada Asaemon Genji (山田浅ェ門源嗣)"
      ],
      "role": "supporting",
      "description": "__Height:__ 205 cm",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b302049-go8XyPxymI0S.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302049
      },
      "rarity": "rare"
    },
    {
      "id": "eizen",
      "name": "Eizen",
      "alt_names": [
        "衛善",
        "Yamada Asaemon Eizen (山田浅ェ門衛善)"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Age:__ Unknown\n__Tao Attribute:__ Unknown\n__Occupation:__ Asaemon\n__Affiliation:__ Yamada Clan\n__Rank:__ 1st\n\nEizen is the 1st rank Asaemon in the Yamada clan. He joined the Kotaku island expedition and was assigned to keep watch over the criminal, Rokurōta.\n\nEizen has great pride for the Yamada clan and believes that no task is impossible for them when it came to executing people, such as his assigned criminal Rokurōta. As an executioner, Eizen acts professional in his line of work as he knows that defiling the execution grounds by trying to bring pain to the condemned with his blade would defile the magistrate and he follows the Yamada clan's ideal way of ending lives by cutting his victims with no pain or emotion, a concept which he tried to impart to a young [Shugen](https://anilist.co/character/148752/Shugen). \n\nEizen is also kind and caring as he promised to look after Shugen when he was young, which brought a great influence to him in the present. Like his fellow clan members, Eizen believes that women in the Yamada clan should not follow the path of a samurai and is antagonistic when [Sagiri](https://anilist.co/character/137263/Sagiri) took the shogun's mission.\n\n~! Upon arriving to Kotaku, Eizen is almost instantly crushed by Rokurōta and dies. Shugen becomes devastated after finding Eizen's corpse and took the time to lay his soul to rest despite the fact that his team was being under attack. His death went on to impact Shugen on his mission a lot as he vowed to kill everyone on the island to avenge his master. !~\n\nEizen has a profound influence on Shugen as he is the one person the young man looks up to the most.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b151774-BYqBHZU6mWAQ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 151774
      },
      "rarity": "rare"
    },
    {
      "id": "kishou",
      "name": "Kishou",
      "alt_names": [
        "期聖",
        "Yamada Asaemon Kishou (山田浅ェ門期聖)"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Age:__ Unknown\n__Tao Attribute:__ Unknown\n__Occupation:__ Asaemon\n__Affiliation:__ Yamada Clan\n__Rank:__ 11th\n\nKishou is the 11th rank Asaemon in the Yamada Clan and was assigned to keep watch over the criminal, Warped Keiun.\n\nKishou is an individual who is known for never losing his composure and rarely acting assertive. He is able to see the big picture in situations and finds it annoying when people question his way of handling them. Kishou has shown that he doesn't mind taking the easy way out, offering to cut down Gabimaru to help Sagiri return home instead of following through with the mission. He also doesn't like to be pushed around.\n\n~! After Gabimaru kills Warped Keiun, Kishou has no reason to stay on the island and tries to escape. Kishou at some point becomes infected with Arborification and immediately dies. After trying to make an attempt at escaping the island, Nurugai & Tensa finds Kishou's bloomed corpse. As Tensa tries to get a response from Kishou, the dead Asaemon is split in half by the Watatsumi's large tentacle. Before departing Kishou also told Gabimaru that the Iwagakure might come to the island later on shogun's request. !~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b151777-wY3ktSkeiwe3.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 151777
      },
      "rarity": "rare"
    },
    {
      "id": "mu-dan",
      "name": "Mu Dan",
      "alt_names": [
        "牡丹",
        "ムーダン",
        "Fukuu Juukun (不空就君)",
        "Enthroned Amoghavajra",
        "Jiujun Amoghavajra"
      ],
      "role": "supporting",
      "description": "__Race:__ Tensen\n__Tao Attribute:__ Earth\n__Occupation:__ Ruler of Kotaku\n__Affiliation:__ Lord Tensen\n\nMu Dan is a member of Lord Tensen, as well as one of the rulers of Kotaku.\n\nMu Dan has a cheerful, yet very sadistic attitude. He is very blunt with his words and is not afraid to tell his enemies what they want because of the confidence in his own power. Mu Dan views humans as simply research material and \"toys\" that he can do whatever he wants with.  He seems to get along quite well enough with the other Tensens, shown as they were all having a nice conversation. However, he shows no signs of pity for them no matter what. Mu Dan stated that he is a believer in functional beauty and preferres the male gender because there was nothing wasted in its composition.",
      "metadata": {
        "gender": "male/female (prefers the male gender)",
        "age": "1000+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b148753-yLtDQsR4vB4f.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 148753
      },
      "rarity": "rare"
    },
    {
      "id": "ju-fa",
      "name": "Ju Fa",
      "alt_names": [
        "菊花",
        "ジュファ",
        "Ashuku Taitei (ア閦大帝)",
        "Great Emperor Akshobhya",
        "Dadi Aksho"
      ],
      "role": "supporting",
      "description": "__Race:__ Tensen\n__Tao Attribute:__ Fire\n__Occupation:__ Partial Ruler of Kotaku\n__Affiliation:__ Lord Tensen, Xu Fu\n\nJu Fa is a member of Lord Tensen, as well as one of the rulers of Kotaku.\n\nJu Fa is very short tempered and has aggressive tendencies towards anything that irritated him at the slightest, which also applied to his fellow Lord Tensen members. While its true that all members of Lord Tensen have a negative view on humans, Ju Fa is the one that truly despises them with a passion and believes that they are nothing more than \"livestock\". \n\nHe is very protective of [Tao Fa](https://anilist.co/character/151778/Tao-Fa) since they had been by each others side from the moment they were born, because of that Rien stated that the two were special in that they are in fact two of a whole. Despite their ability to heal themselves, Ju Fa hated when Tao Fa got hurt and was told that he cared greatly for Tao Fa as his partner.\n\nJu Fa found the male gender to be well-suited for him because of his moods and how he is able to easily handle situations.",
      "metadata": {
        "gender": "male/female (prefer the male gender)",
        "age": "1000+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b151772-6Q3z1oDIrqxT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 151772
      },
      "rarity": "rare"
    },
    {
      "id": "zhu-jin",
      "name": "Zhu Jin",
      "alt_names": [
        "朱槿",
        "ヂュジン",
        "Nyoi Genkun (如イ元君)",
        "Tathaataa Yuanjun"
      ],
      "role": "supporting",
      "description": "__Race:__ Tensen\n__Tao Attribute:__ Water\n__Occupation:__ Partial Ruler of Kotaku\n__Affiliation:__ Lord Tensen, Xu Fu\n\nZhu Jin is one of the rulers of Kotaku and one of the seven Lord Tensen.\n\nZhu Jin carries themselves with a calm and relaxed demeanor even when handling threats. Like their fellow Tensen, Zhu Jin has no sympathy for humans when it comes to killing them. Zhu Jin is also very perceptive of their opponents skills and can quickly adjust to them, causing them to become unfazed by whatever move they make. Zhu Jin can become easily irritated with troubling matters. Despite usually keeping a straight face at all times, when faced with an unbelievable crisis, Zhu Jin can break into a state of panic and fear and will take matters seriously. \n\nZhu Jin follows [Gui Fa's](https://anilist.co/character/170488/Gui-Fa) example of taking the Middle Way in terms of the two sexes. Therefore, unlike the other Tensens, Zhu Jin does not carry a preference to either being male or female and allows themselves to switch in and out of the two chi's over time.",
      "metadata": {
        "gender": "male/female (switches constantly)",
        "age": "1000+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b151775-1f264MokbLYd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 151775
      },
      "rarity": "rare"
    },
    {
      "id": "tao-fa",
      "name": "Tao Fa",
      "alt_names": [
        "桃花",
        "タオファ",
        "Ratna Taisei (ラトナ大聖)",
        "Great Sage Ratna",
        "Sagacious Dasheng Ratna"
      ],
      "role": "supporting",
      "description": "__Race:__ Tensen\n__Tao Attribute:__ Wood\n__Occupation:__ Partial Ruler of Kotaku\n__Affiliation:__ Lord Tensen, Xu Fu\n\nTao Fa is a member of Lord Tensen, as well as one of the rulers of Kotaku.\n\nTao Fa is very cheerful and always seems to be in a good mood. Unlike the other members of Lord Tensen, Tao Fa is rather friendly towards humans, or at least ones that are willing to cooperate with Lord Tensen's plans. However, she still carries the same view of using them as tools and shows no signs of sympathy towards them. Because she specializes in Bōchū Jutsu, Tao Fa is quite vulgar and often likes to flirt with others.\n\nTao Fa is always being protected by [Ju Fa](https://anilist.co/character/151772/Ju-Fa) since they had been by each others side from the moment they were born, because of that Rien stated that the two were special in that they are in fact two of a whole.\n\nTao Fa had stated that they preferred the female gender because of their liking to their appearance. As such, they also acted feminine on top of their appearance.",
      "metadata": {
        "gender": "female/male (prefers the female gender)",
        "age": "1000+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b151778-eaLrGLvveKGL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 151778
      },
      "rarity": "rare"
    },
    {
      "id": "gui-fa",
      "name": "Gui Fa",
      "alt_names": [
        "桂花",
        "Monju Koukou (文殊公々)",
        "Decorous Monju Koukou",
        "Gonggong Manjusri"
      ],
      "role": "supporting",
      "description": "A member of Lord Tensen and a partial ruler of Kotaku. Gui Fa maintains a complete deadpan demeanor and is known to be extremely shy around others, as they prefer to cover their face with a book at all times to avoid making eye contact.",
      "metadata": {
        "gender": "male/female",
        "age": "1000+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b170488-3YyeY3FGm7Sn.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 170488
      },
      "rarity": "rare"
    },
    {
      "id": "tokugawa-nariyoshi",
      "name": "Tokugawa Nariyoshi",
      "alt_names": [
        "徳川斉慶"
      ],
      "role": "supporting",
      "description": "11th Shogun of Japan.",
      "metadata": {
        "gender": "male",
        "age": "48",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b301606-08sCkI5L3d11.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 301606
      },
      "rarity": "rare"
    },
    {
      "id": "osa",
      "name": "Osa",
      "alt_names": [
        "長",
        "Sato no Naga (里の長)",
        "Village Chief"
      ],
      "role": "supporting",
      "description": "Chief of Iwagakure and father of [Yui](https://anilist.co/character/151771).",
      "metadata": {
        "gender": "male",
        "age": "Unknown",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b301607-ERwRfX9Ddda3.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 301607
      },
      "rarity": "rare"
    },
    {
      "id": "aoki",
      "name": "Aoki",
      "alt_names": [
        "青木"
      ],
      "role": "supporting",
      "description": "__Height:__ 175 cm\n\nOne of the shogun's retainers.",
      "metadata": {
        "gender": "male",
        "age": "30",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b302050-IX99PePUve0D.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302050
      },
      "rarity": "rare"
    },
    {
      "id": "rokurouta",
      "name": "Rokurouta",
      "alt_names": [
        "陸郎太",
        "Bizen no Daidarabotchi  (備前の大巨人)",
        "The Giant of Bizen"
      ],
      "role": "supporting",
      "description": "__Height:__ 321 cm\n\nOne of the criminals sent to acquire the Elixir of Life for the shogun. ~!Despite his size, he is an 8-year old child suffering from an abnormal case of gigantism.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b302052-avZhbeKO5Phy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302052
      },
      "rarity": "rare"
    },
    {
      "id": "adachi-matagorou",
      "name": "Adachi Matagorou",
      "alt_names": [
        "安達又五郎"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b302053-ZIkqWdlkdeja.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302053
      },
      "rarity": "rare"
    },
    {
      "id": "keiun",
      "name": "Keiun",
      "alt_names": [
        "慶雲",
        "Igami no Kyooun (いがみの慶雲)",
        "Warped Keiun",
        "Hyappongari (百本狩り)",
        "Hunter of the Hundred",
        "Twisted Keiun"
      ],
      "role": "supporting",
      "description": "__Height:__ 210 cm\n\nDeath row convict who is recruited to find the Elixir of Life. While undergoing training as a souhei (warrior monk), Keiun developed an obsession for weapons and armor and decided to take his training to the next level by slaughtering martials artists and stealing their weapons.",
      "metadata": {
        "gender": "male",
        "age": "35",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b302522-D9kb6Ho4EIw9.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302522
      },
      "rarity": "rare"
    },
    {
      "id": "rien",
      "name": "Rien",
      "alt_names": [
        "蓮",
        "リエン",
        "Fugen Joutei (普賢上帝)",
        "Shangdi Samantabhadra"
      ],
      "role": "supporting",
      "description": "__Race:__ Human; Tensen (Through her puppets)\n__Tao Attribute:__ Earth\n__Occupation:__ Leader of Lord Tensen, Ruler of Kotaku\n__Affiliations:__ Lord Tensen\n\nRien is a Tensen-class Sennin serving as the true ruler of Kotaku, the creator of the Tensens, and the leader of Lord Tensen.\n\n~!At some point during 3rd century BC, Rien was married to Jofuku and went with him on his voyage to the East to acquire the Elixir of Life for the ruler of the Qin Dynasty. Their journey ended on an island where they decided to use the island's resources and their knowledge of Taoism to discover the secrets to gaining immortality. This resulted in many experimental creations. As part of their research, Rien used her Tao to create a clone of herself that she could remotely control. After receiving a new body, Rien used the Tao puppet to create another fabricated clone named Mei, who assisted both her and Jofuku, along with six fabricated newborns. These seven then came to be known as Tensens. After Jofuku's death, Rien made a commitment to revive him. With the Tensens she created, Rien formed the group known as Lord Tensen to maintain order over the island and trained the six young ones in the ways of Tao.!~",
      "metadata": {
        "gender": "female; male/female (through her puppets)",
        "age": "1000+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b148754-YBgD5DYoerY3.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 148754
      },
      "rarity": "rare"
    },
    {
      "id": "mei",
      "name": "Mei",
      "alt_names": [
        "めい",
        "メイ"
      ],
      "role": "supporting",
      "description": "__Tao Attribute:__ Water\n\nAn islander from Kotaku. Mei is a shy and quiet girl. She is innocent and can easily be frightened when harm comes to her. Mei is especially kind and caring to the people around her that she views are her allies and can also be accepting of others when seeing their good qualities. When they first met, Mei was afraid of Gabimaru because of his intimating demeanor but after showing signs of respect towards her she wasn't afraid to come near him.\n\n~!Mei is a Tensen that was formerly affiliated with [Rien](https://anilist.co/character/148754/Rien) and Xu Fu but escaped after disagreeing with Rien's methods to unlock immortality. She then resided with Hōko and soon became an ally of Gabimaru and his group in their attempt to retrieve the elixir known as Tan from Lord Tensen and escape Kotaku.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b148755-KybQKJ8BPh1Q.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 148755
      },
      "rarity": "rare"
    },
    {
      "id": "ran",
      "name": "Ran",
      "alt_names": [
        "蘭",
        "Juntei Teikun (准胝帝君)",
        "Imperial Juntei Teikun",
        "Deified Dijun Cundi"
      ],
      "role": "supporting",
      "description": "__Race:__ Tensen\n__Tao Attribute:__ Water\n__Occupation:__ Partial ruler of Kotaku\n__Affiliation:__ Lord Tensen, Xu Fu\n\nRan is a member of Lord Tensen and part ruler of Kotaku.\n\nRan is very loyal to [Rien](https://anilist.co/character/148754/Rien) and carries the same view of seeing the Tensens as family. Like all the members of Lord Tensen, Ran has no sympathy for humans and uses them as they see fit. He believes that it is a futile effort for the trespassers to invade the palace and try their hand at opposing the Tensens, showing signs that he views them inferior compared to his family. However, he is not above praising or admiring them if they show impressive skills. Due to specializing in Dō'in, Ran is extremely passionate about the physical work of the body and fighting styles that can only be obtained through diligent training.\n\n~! Upon transforming into his Kishikai form, Ran expressed his physicality while attacking [Gabimaru](https://anilist.co/character/137260/Gabimaru) and [Yuzuriha](https://anilist.co/character/137270/Yuzuriha). He was also up to the challenge of facing the two in their use of ninjutsu in order to strengthen his Dō'in training. !~\n\n~! He is bested in a fight against Gabimaru and Yuzuriha and is killed. Ran slowly dies with his last thoughts about Rien. !~",
      "metadata": {
        "gender": "male/female (prefers the male gender)",
        "age": "1000+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b151773-THqI74IGmHsS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 151773
      },
      "rarity": "rare"
    },
    {
      "id": "houko",
      "name": "Houko",
      "alt_names": [
        "木人",
        "Mu Ren"
      ],
      "role": "supporting",
      "description": "__Race:__ Houko\n__Tao Attribute:__ Metal",
      "metadata": {
        "gender": "male",
        "age": "500+",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b305440-nNgZoPz0B2NE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 305440
      },
      "rarity": "rare"
    },
    {
      "id": "chou-doushi",
      "name": "Chou Doushi",
      "alt_names": [
        "Butterfly Doushi"
      ],
      "role": "supporting",
      "description": "This Doushi is a subordinate of Lord Tensen and was one of the few that were ordered to observe the humans that made landfall on Kotaku.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b306729-YW5YzEiDq3Cy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 306729
      },
      "rarity": "rare"
    },
    {
      "id": "mukade-doushi",
      "name": "Mukade Doushi",
      "alt_names": [
        "Centipede Doushi"
      ],
      "role": "supporting",
      "description": "This Doushi is a subordinate of Lord Tensen and was one of the few that were ordered to observe the humans that made landfall on Kotaku.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b306732-fJpadCcHf0Hl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 306732
      },
      "rarity": "rare"
    },
    {
      "id": "tesshin",
      "name": "Tesshin",
      "alt_names": [
        "鉄心",
        "Yamada Asaemon Tesshin (山田浅ェ門 鉄心)"
      ],
      "role": "supporting",
      "description": "__Height:__ 173 cm\n\nTesshin was a former Asaemon of the Yamada clan and the first apprentice of [Shion](https://anilist.co/character/137267/Shion).",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b306847-pTOq1RighbhL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 306847
      },
      "rarity": "rare"
    },
    {
      "id": "shokushu-doushi",
      "name": "Shokushu Doushi",
      "alt_names": [
        "道士",
        "Tentacle Doushi"
      ],
      "role": "supporting",
      "description": "A subordinate of Lord Tensen who was ordered to check to see if Aza Chōbei and Tōma were still in the pit becoming Tan.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b307701-vmr1ov2ZJNaq.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 307701
      },
      "rarity": "rare"
    },
    {
      "id": "yui",
      "name": "Yui",
      "alt_names": [
        "結",
        "画眉丸の妻"
      ],
      "role": "minor",
      "description": "__Race:__ Human\n__Occupation:__ House Wife\n__Affiliations:__ Iwagakure\n\nYui is the daughter of the Iwagakure chief and the wife of Gabimaru.\n\nYui is very kind, caring and gentle. She truly loves Gabimaru and believes that he is not completely emotionless as people make him out to be. She accepts the fact that he kills people and is not terrified being around him. Yui is also shown to be wise as she gave Gabimaru words of wisdom on why he should relax his body while giving him a bath. She is very civilized as she taught Gabimaru basic manners when they became a couple.\n\nYui was born as the daughter of the Iwagakure chief. Being born a female, Yui was not trained in the ways of the shinobi and instead lived a semi-normal life within the village. \n\n~! At some point, during her time with her father, the chief burned her face to make sure that she gave up on her dreams of ever living a normal, peaceful life as a woman. After Gabimaru proved his worth to the chief, Yui was forced by her father to marry him. The two then came to love each other as their days went by. Wanting to give his wife a peaceful life, Gabimaru came to the village chief requesting to abandon his duties as a shinobi, resulting in him being betrayed by the village and handed over to the authorities to be executed. After hearing news of her husband's captured, Yui went into a state of depression and refused to speak to anyone or eat as she waits in hopes for Gabimaru's return. !~",
      "metadata": {
        "gender": "female",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b151771-obZQxZPwjiud.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 151771
      },
      "rarity": "common"
    },
    {
      "id": "narrator",
      "name": "Narrator",
      "alt_names": [
        "ナレーター",
        "語り手",
        "ナレーション",
        "Narrador",
        "Rozprávač",
        "Vyprávěč",
        "Dış ses",
        "Narratore",
        "Pripovjedač",
        "Narradora",
        "Рассказчик",
        "Người dẫn chuyện",
        "Tagapagsalaysay",
        "내레이터",
        "Narratore",
        "Erzählperson",
        "מספר",
        "Narrátor",
        "讲述人",
        "راوي",
        "Forteller",
        "Berättare",
        "Αφηγητής",
        "Narrateur",
        "なれーしょん",
        "旁白",
        "Narrato"
      ],
      "role": "minor",
      "description": "This character page is set to represent and list all narrators, which haven't been given a visual representation of themselves in their respective work. \n\nPlease add other narrator characters, which were given a visual representation of themselves, separately from this narrator page.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36309-6KM0riV4lqfN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36309
      },
      "rarity": "common"
    },
    {
      "id": "kichiji",
      "name": "Kichiji",
      "alt_names": [
        "吉次",
        "Yamada Asaemon Kichiji (山田浅工門吉次)",
        "Sagiri no Chichi (佐切の父)"
      ],
      "role": "minor",
      "description": "Head of the Yamada clan. He is the father of [Sagiri](https://anilist.co/character/137263).",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b302527-tigkE4fAyNLW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302527
      },
      "rarity": "common"
    },
    {
      "id": "jikka",
      "name": "Jikka",
      "alt_names": [
        "十禾",
        "山田浅ェ門 十禾",
        "Yamada Asaemon Jikka"
      ],
      "role": "minor",
      "description": "__Race:__ Human\n__Age:__ Unknown\n__Tao Attribute:__ Earth\n__Occupation:__ Asaemon\n__Affiliation:__ Yamada Clan\n__Rank:__ 3rd\n\nJikka is the 3rd ranked Asaemon in the Yamada clan. After the shogun sent criminals to Kotaku to find the Elixir of Life, he was tasked with being Hōrubō's executioner.\n\nJikka is a laid-back individual who compared to his fellow clan members, especially Shugen, is less dedicated to his work as an Asaemon. He is rather dishonest and goes as far as to lie to shogun's officials. Jikka is also rude and disrespectful to others around him regardless of who they are, even towards his fellow Asaemon. Also, unlike his clan members who each show concern for one another, Jikka is the only member shown to have little to no concern over the safety of the other Asaemon. \n\nJikka stated that he is an individual that prefers to enjoy life to the fullest rather than focus on status and rank. This way of thinking greatly shows in his life as an executioner as he has been reported to attend his execution assignments while intoxicated and even sold his own sword as a way to collect money for his vulgar exploits. As a result, Jikka has received a bad reputation amongst his peers in the Yamada clan. Despite being so lazy and laid-back he is a very analytical individual and is incapable of being fooled through deception.\n\n~! He is one of the most mysterious people of the Yamada clan and also one of the strongest despite the attitude towards his duties, he is in fact so strong that he's the only person known who has come back from Kotatsu island alive and in perfect condition. Having sold his sword he now carries a simple takemitsu (bamboo sword), but even then he still manages to cut off criminal heads and kill monsters with ease. !~\n\nJikka believes that he and Gabimaru are similar in that they value life more than anything.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b148756-BRSo9v4Rzds2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 148756
      },
      "rarity": "common"
    },
    {
      "id": "hourubou",
      "name": "Hourubou",
      "alt_names": [
        "法流坊",
        "Koroshi Nenbutsu (殺し念仏)",
        "Killing Buddha",
        "The Killing Prayer"
      ],
      "role": "minor",
      "description": "Death row convict recruited to find the Elixir of Life. Due to how his body is constructed, he has the unique ability to stretch or contort his limbs to restrain and constrict his opponents.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b302525-iKmveUnK7Z6Z.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302525
      },
      "rarity": "common"
    },
    {
      "id": "akaginu",
      "name": "Akaginu",
      "alt_names": [
        "あか絹",
        "Hito Kui Oiran  (人喰い花魁)",
        "Cannibal Courtesan"
      ],
      "role": "minor",
      "description": "Death row convict recruited to find the Elixir of Life. She is a cannibal with a taste for male flesh, especially after first making them succumb to her sexual temptations.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b302523-gLqxyQKvyVWC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302523
      },
      "rarity": "common"
    },
    {
      "id": "moro-makiya",
      "name": "Moro Makiya",
      "alt_names": [
        "茂籠牧耶",
        "Korobi Bateren (ころび伴天連)",
        "The Apostate"
      ],
      "role": "minor",
      "description": "__Height:__ 191 cm\n\nDeath row convict recruited to find the Elixir of Life. Makiya had an ambition to overthrow the shogun and went about it by forming a cult that was based off of multiple religions.",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b302526-wT5r7s2l5O9O.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302526
      },
      "rarity": "common"
    },
    {
      "id": "hana-yoriki",
      "name": "Hana Yoriki",
      "alt_names": [
        "花与力"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b302058-DCJ3fUO3BKs5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302058
      },
      "rarity": "common"
    },
    {
      "id": "irezumimono",
      "name": "Irezumimono",
      "alt_names": [
        "入れ墨者"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b302057-05ESDHgJF5mU.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302057
      },
      "rarity": "common"
    },
    {
      "id": "karou",
      "name": "Karou",
      "alt_names": [
        "家老",
        "Chief Retainer"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302051
      },
      "rarity": "common"
    },
    {
      "id": "rouyakunin-a",
      "name": "Rouyakunin A",
      "alt_names": [
        "牢役人A"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 301608
      },
      "rarity": "common"
    },
    {
      "id": "rouyakunin-b",
      "name": "Rouyakunin B",
      "alt_names": [
        "牢役人B"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 301609
      },
      "rarity": "common"
    },
    {
      "id": "rouyakunin-c",
      "name": "Rouyakunin C",
      "alt_names": [
        "牢役人C"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 301610
      },
      "rarity": "common"
    },
    {
      "id": "tsumibito-a",
      "name": "Tsumibito A",
      "alt_names": [
        "罪人A"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302054
      },
      "rarity": "common"
    },
    {
      "id": "tsumibito-b",
      "name": "Tsumibito B",
      "alt_names": [
        "罪人B"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302056
      },
      "rarity": "common"
    },
    {
      "id": "yoriki",
      "name": "Yoriki",
      "alt_names": [
        "与力"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 302055
      },
      "rarity": "common"
    },
    {
      "id": "yakunin",
      "name": "Yakunin",
      "alt_names": [
        "役人"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 303159
      },
      "rarity": "common"
    },
    {
      "id": "monkasei",
      "name": "Monkasei",
      "alt_names": [
        "門下生"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 303160
      },
      "rarity": "common"
    },
    {
      "id": "machibugyou",
      "name": "Machibugyou",
      "alt_names": [
        "町奉行"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 303161
      },
      "rarity": "common"
    },
    {
      "id": "hanshu",
      "name": "Hanshu",
      "alt_names": [
        "藩主"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b303162-s8N4j5hXDfA0.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 303162
      },
      "rarity": "common"
    },
    {
      "id": "bugyou-yoriki",
      "name": "Bugyou Yoriki",
      "alt_names": [
        "奉行与力",
        "Magistrate"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b303222-SbKOdsiZHrVK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 303222
      },
      "rarity": "common"
    },
    {
      "id": "uwayaku",
      "name": "Uwayaku",
      "alt_names": [
        "上役"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 304198
      },
      "rarity": "common"
    },
    {
      "id": "nurugai-no-sofu",
      "name": "Nurugai no Sofu",
      "alt_names": [
        "ヌルガイの祖父",
        "Nurugai's Grandfather"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b304199-K3OkohtgVKkE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 304199
      },
      "rarity": "common"
    },
    {
      "id": "rokurouta-no-haha",
      "name": "Rokurouta no Haha",
      "alt_names": [
        "陸郎太の母",
        "Rokurouta's Mother"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b304847-kprr2DtDxR8Y.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 304847
      },
      "rarity": "common"
    },
    {
      "id": "rokurouta-no-chichi",
      "name": "Rokurouta no Chichi",
      "alt_names": [
        "陸郎太の父",
        "Rokurouta's Father"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b304848-qK6yP1whCc3C.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 304848
      },
      "rarity": "common"
    },
    {
      "id": "chounin-a",
      "name": "Chounin A",
      "alt_names": [
        "町人A"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 305983
      },
      "rarity": "common"
    },
    {
      "id": "chounin-b",
      "name": "Chounin B",
      "alt_names": [
        "町人B"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 305985
      },
      "rarity": "common"
    },
    {
      "id": "chounin-c",
      "name": "Chounin C",
      "alt_names": [
        "町人C"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 305982
      },
      "rarity": "common"
    },
    {
      "id": "samurai",
      "name": "Samurai",
      "alt_names": [
        "侍"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 305984
      },
      "rarity": "common"
    },
    {
      "id": "shugen",
      "name": "Shugen",
      "alt_names": [
        "殊現",
        "山田浅ェ門殊現",
        "Yamada Asaemon Shugen"
      ],
      "role": "minor",
      "description": "__Race:__ Human\n__Tao Attribute:__ Water\n__Occupation:__ Asaemon, Assistant Instructor\n__Affiliation:__ Yamada Clan\n__Rank:__ 2nd\n\nShugen is the 2nd ranked Asaemon, as well as an Assistant Instructor, in the Yamada clan. Shugen is the leader of the second team sent to Kotaku after the shogun became impatient waiting for the first team to comeback. \n\nShugen is very dignified and diligent in his duties as an Asaemon. Shugen cares greatly for his Yamada clansmen, having spent his years with them and being taught what they know. He greatly expressed his concern for their safety on the island and vowed to bring them back home no matter what the means were. Furthermore, Shugen has a tendency to become emotional whenever he thinks about his comrades. He's one of the only Yamada clan members who doesn't look down on women in the clan and vouches for their qualifications as executioners. He greatly despises all criminals and truly believes that they are evil no matter who they are. At a young age, Shugen could not understand the Yamada clan's way of thinking when executing criminals and believed that they should all deserve a painful death.\n\nShugen believes in order of all things in the world; the order in which those who abide by the law are to be protected while those who break them should be punish without mercy.",
      "metadata": {
        "gender": "male",
        "age": "19-20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b148752-WkhrTfWC7kC8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 148752
      },
      "rarity": "common"
    },
    {
      "id": "nikimaru",
      "name": "Nikimaru",
      "alt_names": [
        "二木丸",
        "Serial Firebug",
        "Renzoku Houka Ma"
      ],
      "role": "minor",
      "description": "\"Serial Firebug\" Nikimaru was a criminal put on death row and a candidate to partake in the expedition to Shinsenkyou.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b306731-ZAXAtJdrzhYr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 306731
      },
      "rarity": "common"
    },
    {
      "id": "tanio-seikichi",
      "name": "Tanio Seikichi",
      "alt_names": [
        "谷尾清吉"
      ],
      "role": "minor",
      "description": "Tanio Seikichi was a criminal put on death row and a candidate to partake in the expedition to Shinsenkyou.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b306736-slekxDYLpoPo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 306736
      },
      "rarity": "common"
    },
    {
      "id": "gabimaru-no-chichi",
      "name": "Gabimaru no Chichi",
      "alt_names": [
        "Gabimaru's Father"
      ],
      "role": "minor",
      "description": "He was a former jounin-class shinobi of Iwagakure and [Gabimaru](https://anilist.co/character/137260/Gabimaru)'s father.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b306845-cNQMCF4ubjrm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 306845
      },
      "rarity": "common"
    },
    {
      "id": "shuukan-kido",
      "name": "Shuukan Kido",
      "alt_names": [
        "木戸周監"
      ],
      "role": "minor",
      "description": "Kido Shuukan was a well known vicious criminal.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b306858-Tm5TYFOQwl4a.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 306858
      },
      "rarity": "common"
    },
    {
      "id": "gabimaru-no-haha",
      "name": "Gabimaru no Haha",
      "alt_names": [
        "Gabimaru's Mother"
      ],
      "role": "minor",
      "description": "She was a former jougnin-class kunoichi of Iwagakure and [Gabimaru](https://anilist.co/character/137260/Gabimaru)'s mother.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b306859-HnYYj7W4cpfL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 306859
      },
      "rarity": "common"
    },
    {
      "id": "houko-tachi-no-koe",
      "name": "Houko-tachi no Koe",
      "alt_names": [
        "木人たちの声"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 306994
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-23T02:15:16.397Z"
}