{
  "work_id": "more-than-a-married-couple-but-not-lovers",
  "count": 9,
  "characters": [
    {
      "id": "akari-watanabe",
      "name": "Akari Watanabe",
      "alt_names": [
        "渡辺星"
      ],
      "role": "protagonist",
      "description": "Akari Watanabe is a Gyaru who was assigned to be [Jirou Yakuin's](https://anilist.co/character/191673) partner during the marriage practical, a special course to train students how to function in a real romantic relationship, despite her wanting to be partnered with [Minami Tenjin](https://anilist.co/character/273110/Minami-Tenjin), her true fool love. She hopes by training by acting as a perfect newlywed with Jirou, she can earn the two of them enough points to swap each other out for who they truly want to pursue. However, after spending more time with Jirou, she begins to second guess herself and how she truly feels.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b191672-MozVAnqyv9oZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 191672
      },
      "rarity": "epic"
    },
    {
      "id": "jirou-yakuin",
      "name": "Jirou Yakuin",
      "alt_names": [
        "薬院次郎",
        "Virgin-kun",
        "Hunchback"
      ],
      "role": "protagonist",
      "description": "__Relatives:__ Himari and Leo (Younger Cousins).\n\nJirou Yakuin is the main protagonist, being an antisocial, pessimistic high school boy. He ends up forced to pair with [Akari Watanabe](https://anilist.co/character/191672) in their school's \"Couple Practical\" course, despite harboring feelings for his childhood friend [Shiori Sakurazaka](https://anilist.co/character/273105). Because of his crush, he makes it his goal to find a way to pair up with Shiori instead, being willing to do anything to reach his goal even if it means acting as a newlywed with Akari. However, the more time he spends with Akari, the more conflicted he becomes with his true feelings.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b191673-eD8IFBOdAFv5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 191673
      },
      "rarity": "epic"
    },
    {
      "id": "shiori-sakurazaka",
      "name": "Shiori Sakurazaka",
      "alt_names": [
        "桜坂詩織"
      ],
      "role": "supporting",
      "description": "Shiori is [Jirou Yakuin's](https://anilist.co/character/191673/Jirou-Yakuin) classmate and childhood friend (and crush). She was paired with [Minami Tenjin](https://anilist.co/character/273110/Minami-Tenjin) in their school's couples training.\n\nShe is a kind and gentle girl, but she isn't very confident in herself and has a shy demeanor. Shiori is academically intelligent and regularly scores high marks on her exams, although she is known to struggle athletically. She is especially bad at talking to boys she doesn't know due to past experiences she had in middle school, but is known to be very caring towards those close to her regardless of gender, including Jirou and [Mei](https://anilist.co/character/286619/Mei-Hamano). Despite the fact she is paired with Minami in the couples training, she seems to still harbor some feelings for Jirou.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b273105-BUCVawntAuJF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 273105
      },
      "rarity": "uncommon"
    },
    {
      "id": "sadaharu-kamo",
      "name": "Sadaharu Kamo",
      "alt_names": [
        "賀茂貞春",
        "Glasses-kun",
        "Hunchback"
      ],
      "role": "supporting",
      "description": "__Relatives:__ Keiichiro Kamo (Older Brother).\n\nSadaharu is a close friend of [Jirou Yakuin](https://anilist.co/character/191673/Jirou-Yakuin), being one of the few people Jirou is comfortable being open around. He is paired with Satsuki Kaneyama in their school's Marriage Practical.\n\nSadaharu is portrayed as being a mild mannered and eccentric otaku who enjoys reading manga, watching anime, and playing video games. Like Jirou, Sadaharu also has lousy luck with women, preferring the women to be \"2D\" instead of real so they can't end up hurting his feelings. However, it appears that he and his practice partner get along well which indicates that the practical has somewhat improved his social skills with women. Sadaharu is considered to be the series primary comic relief character, having a knack for making light of serious situations by comparing them to similar events found in many Japanese media and pointing out common tropes. He often showcases incredible creativity by imagining himself or others in fictional circumstances that almost appear to break the laws of reality, with his rampant imagination even causing him to the break the 4th wall on a few occasions. Despite his absurd antics, Sadaharu is ultimately a good, kindhearted person and will go out of his way to help and support those he cares for when he sees fit.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b273109-jirgwaM2atln.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 273109
      },
      "rarity": "uncommon"
    },
    {
      "id": "minami-tenjin",
      "name": "Minami Tenjin",
      "alt_names": [
        "天神岬波",
        "Mikkun (みっくん)"
      ],
      "role": "supporting",
      "description": "Considered to be the most popular student at Seishun Academy, Minami Tenjin is [Shiori Sakurazaka's](https://anilist.co/character/273105) partner in the Marriage Practical and [Akari Watanabe's](https://anilist.co/character/191672) crush. He works at a café together with [Shuu Terafune](https://anilist.co/character/286620) and Keiichiro Kamo.\n\nWhat makes Minami so admirable are the numerous amounts of traits and skills that he has that would make other boys jealous. He is a star athlete who is proficient in multiple sports including basketball, volleyball, and track-and-field, on top of him being academically intelligent. Above all else, he possesses a calm and cool demeanor in the presence of others which is what has earned him the respect and admiration of his peers. Despite his popularity amongst the school, Minami does not have an ego where he sees himself as superior to the other students, and is generally portrayed as a very friendly, humble person who treats everyone with respect. He is also known to be incredibly observant.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b273110-7MAyARecFkzI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 273110
      },
      "rarity": "uncommon"
    },
    {
      "id": "sachi-takamiya",
      "name": "Sachi Takamiya",
      "alt_names": [
        "高宮サチ"
      ],
      "role": "supporting",
      "description": "She is a friend of [Akari Watanabe](https://anilist.co/character/191672/Akari-Watanabe) alongside [Natsumi Ōhashi](https://anilist.co/character/286618/Natsumi-Oohashi)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b286617-MzE70k8Ebv7h.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 286617
      },
      "rarity": "uncommon"
    },
    {
      "id": "natsumi-oohashi",
      "name": "Natsumi Oohashi",
      "alt_names": [
        "大橋ナツミ"
      ],
      "role": "supporting",
      "description": "She is a friend of [Akari Watanabe](https://anilist.co/character/191672/Akari-Watanabe) alongside [Sachi Takamiya](https://anilist.co/character/286617/Sachi-Takamiya)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b286618-FoySjmfdX8iw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 286618
      },
      "rarity": "uncommon"
    },
    {
      "id": "mei-hamano",
      "name": "Mei Hamano",
      "alt_names": [
        "浜野めい",
        "Prince Mei"
      ],
      "role": "supporting",
      "description": "The overprotective friend of [Shiori Sakurazaka](https://anilist.co/character/273105/Shiori-Sakurazaka) and the assigned practice partner of [Shuu Terafune](https://anilist.co/character/286620/Shuu-Terafune). She is extremely supportive of Shiori and pushes her to get together with their childhood crush [Jirou Yakuin](https://anilist.co/character/191673/Jirou-Yakuin), despite her secretly having a crush on Shiori herself.\n\nMei is portrayed as a tomboy who enjoys playing sports. Fitting to the archetype, Mei does not usually wear clothes that are considered girly, preferring to wear t-shirts and pants as opposed to dresses. Despite being a star athlete, Mei has stated that she does not do well in academics, having to rely on Shiori to help tutor her. Mei's personality varies widely depending on who she is interacting with, tending to be more friendly and respectful towards girls. With boys, however, Mei often shows them her more brash, no-nonsense side. It's unclear Mei is lesbian or bisexual, but she at least has a strong preference for girls romantically. Mei is known to be a woman of action who prefers to be direct and to the point, having no qualms with being blunt with people and openly telling someone the truth no matter how much it may hurt.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b286619-SUZDi6Vi7UHd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 286619
      },
      "rarity": "uncommon"
    },
    {
      "id": "shuu-terafune",
      "name": "Shuu Terafune",
      "alt_names": [
        "寺船周"
      ],
      "role": "supporting",
      "description": "He is the assigned practice partner of [Mei Hamano](https://anilist.co/character/286619), a friend/coworker of [Minami Tenjin](https://anilist.co/character/273110/Minami-Tenjin), and the self-declared rival of [Jirou Yakuin](https://anilist.co/character/191673/Jirou-Yakuin) for [Akari Watanabe's](https://anilist.co/character/191672/Akari-Watanabe) affection.\n\nShuu is generally portrayed as a self-absorbed, conceited, and presumptuous young man. As a result, some characters find him irritating, especially when he acts up in situations that do not call for it. In cases where things don't go his way, Shū may come across as desperate, pathetic, whiny, or unintentionally rude. Even though he has a crush on Akari, Shū appears to be a womanizer who shows attraction to other women and tries to make himself more appealing to them. In spite of his generally negative traits, Shuu does genuinely care for Akari's safety and wellbeing when she is in trouble and tries his best to be considerate even towards folks he dislikes, such as Jirou.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b286620-PCUNwneMzpHb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 286620
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-26T05:46:30.108Z"
}