{
  "work_id": "kimi-ni-todoke-from-me-to-you",
  "count": 15,
  "characters": [
    {
      "id": "sawako-kuronuma",
      "name": "Sawako Kuronuma",
      "alt_names": [
        "黒沼爽子",
        "Sadako"
      ],
      "role": "protagonist",
      "description": "__Height:__ 158 cm  (5'2\")\n\nSawako is a shy and honest high school girl who in search of friendship, though her resemblance to Sadako from _The Ring_ makes this difficult.\n\nSawako tends to take things too literally and often over-analyzes situations. Her quiet nature makes it hard for her to socialize, and leads to her classmates spreading rumors and having negative misconceptions about her, to the point where many of them think her name is actually Sadako. Fortunately, Sawako is gradually able to open up to her classmates and talk to different people. With help from Kazehaya, Yano, and Yoshida, she gradually begins to make friends. \n\n~!When Kazehaya practically confessed right in front of her that he likes her, Sawako believes it was a misunderstanding and that he was just saying he doesn't hate her. However, after having everything cleared up they officially start dating, though this only brings up rumors that she somehow used black magic to get him.!~\n\n~!Currently, she is studying to be a high school Japanese Language teacher at the University of Education with her rival and later best friend, Ume Kurumizawa.!~",
      "metadata": {
        "gender": "female",
        "age": "15-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6977-rCtlFRoYgE07.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6977
      },
      "rarity": "epic"
    },
    {
      "id": "shouta-kazehaya",
      "name": "Shouta Kazehaya",
      "alt_names": [
        "風早翔太"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm (5'9\")\n\nKazehaya is Sawako's outgoing classmate and friend. He is so popular that during middle school, so many girls liked him that they formed a \"Kazehaya is Everyone's\" Alliance in order to maintain some level of peace among his admirers. Kazehaya has held a long standing interest in Sawako and admits (though not to Sawako) that he likes her, unaware that she feels the same for him.\n\n~!During their second year of high school, he begins to wonder if she actually likes him after she does not give him chocolates on Valentine's Day, not knowing that she had been too nervous to give him any. He seemingly becomes depressed and shows an expressionless face often. However, after being confronted by Ryuu (influenced by Chizuru) and Pin, Kazehaya goes to Sawako as his friends jokingly remark that he likes Sawako; however, Kazehaya takes the remark seriously and agrees, subsequently confessing directly to Sawako. However, after Sawako's misunderstanding of his confession, he believes she rejected him. However, as of chapter 41 was finally able to confess his feelings to Sawako and are officially dating.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n13531-z66ipM6nJioi.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13531
      },
      "rarity": "epic"
    },
    {
      "id": "chizuru-yoshida",
      "name": "Chizuru Yoshida",
      "alt_names": [
        "吉田千鶴",
        "Chizu",
        "Chi"
      ],
      "role": "protagonist",
      "description": "__Height:__ 167 cm\n\nYoshida Chizuru is another close friend of Sawako. She is the energetic girl of the group.  ~!In Kurumi's fake rumors it was passed around that she was a former Yankee. She is a close childhood friend with Ryuu Sanada, who is also the son of the owner of her favorite ramen shop, they are best friends and they even say brothers, she argues about who is the older. She went to Kazehaya's middle school as well. She has a crush on Ryuu's brother, Tooru. Chizuru is mostly only the slower side of things; she did not realize that Kazehaya liked Sawako (even though she and Ayane planned many events for them) until late in the series, after the 2nd year in their school has started.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13532-9xdtRTIdE0UW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13532
      },
      "rarity": "epic"
    },
    {
      "id": "ayane-yano",
      "name": "Ayane Yano",
      "alt_names": [
        "矢野あやね",
        "Yano-chin"
      ],
      "role": "protagonist",
      "description": "__Height:__ 161 cm\n\nAyane is a close friend of Sawako. She is the arguably the most mature of the group and she has a boyfriend in college as well as having her ears pierced multiple times. Initially the mangaka conceived of Yano and Yoshida as a pair, and in the first two chapters the two are difficult to tell apart. She then redrafted the characters, combing Yano's hair and styling it in a fashion that looks like a pony-tail. In Kurumi's fake rumors, it is said that Ayane has played more with more than 100 guys in middle school. In their current high school, it is said that Yano and Yoshida pretty much have authority in the year group. Perceptive and intelligent, a trait of Ayane's personality is that she gives just enough information to leave others wondering, thus forcing them to move forward, this as well as being able to figure out that it was Ume who spread the rumors and discovering that Sawako \"liked\" Kazehaya. Although she is usually calm and collected, she is easily infuriated if someone hurts Sawako and does not hesitate to attack the one responsible she believes is responsible (frequently Kazehaya) with kicks and sharp words. She's also fairly intimidating when angry, being called scary by Chizuru a number of times. \n\n~!As of Chapter 20 she broke up with her boyfriend, who had begun to become too possessive of her: calling her all times of the day, wondering what she has been up to, and the fact if she was with any guys. After she suggested they break up, he slapped her across the face. When he tried to apologize and ask her back, she realizes that the man she liked was not her boyfriend but rather, who he was when they started dating.  Ayane had been a great friend to Sawako and Chizu, but still believes she isn't a kind person. In Chapter 45, when she confessed that she doesn't believe she is a kind person (compared to Sawako and Chizu) because of how cunning she can be in front of Pin, she dreads another full-of-himself lecture from a surprisingly quiet Pin, who instead stares at a candy she gave him because he was whining about not getting one after the festival. Then, Pin pats her on the head and reassures her that she is kind before walking up the stairs, leaving her speechless that he could actually show a serious side. Also, Kento shows attraction to her as well. However, on chapter 54, a guy named Motoki-kun from class B suddenly confessed to her and Ayane accepted it immediately (shown in chapter 55).!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13533-h57wBVMsdCjo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13533
      },
      "rarity": "epic"
    },
    {
      "id": "ryuu-sanada",
      "name": "Ryuu Sanada",
      "alt_names": [
        "真田龍"
      ],
      "role": "protagonist",
      "description": "__Height:__ 179 cm\n\nSanada Ryuu is also one of Sawako's new group. He is quiet most of the time, but can still communicate well with Sawako (as they both don't talk much anyways). He is a close childhood friend with Chizuru. He is also good baseball mates with Kazehaya since they both played together in middle school.   \n\n~!He has had a crush on Chizuru since they were little.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13534-P70pfoclgBHM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13534
      },
      "rarity": "epic"
    },
    {
      "id": "kazuichi-arai",
      "name": "Kazuichi Arai",
      "alt_names": [
        "荒井一市",
        "Pin"
      ],
      "role": "supporting",
      "description": "__Height:__ 193 cm\n\nArai Kazuichi is the temporary homeroom teacher for the gang's class. He is nicknamed Pin and always is called that way (except Sawako who obeys the formalities and still calls him Arai-sensei). (The previous homeroom teacher had been said to be sick after he made Sawako do his work during the summer holidays.) He is a great fan of baseball as well as the school baseball team's coach. He used to be part of Kazehaya's father's league team, so he has known Shouta since when he was young. He had once said that he likes to 'interrupt' people. He nicknames Kazehaya and Sawako's found-beside-the-river puppy Pedro Martinez.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13535-Ab2YlBG5I0Pb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13535
      },
      "rarity": "uncommon"
    },
    {
      "id": "ume-kurumizawa",
      "name": "Ume Kurumizawa",
      "alt_names": [
        "胡桃沢梅",
        "Kurumi"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14117-zVBKFy2Qftpy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14117
      },
      "rarity": "uncommon"
    },
    {
      "id": "tooru-sanada",
      "name": "Tooru Sanada",
      "alt_names": [
        "真田徹"
      ],
      "role": "supporting",
      "description": "Tōru is Ryu's older brother by eight years and Chizuru's crush since she was young. Although he is Ryu's brother and they resemble one another, their personalities are nearly opposite. Tōru resembles Kazehaya personality-wise and looks extremely refreshing, except much more mature. He lives three hours away from his parents' house and returns home to get married.He cares about Ryu and Chizuru a lot and loves Chizuru like a little sister. He calls her Chi because when she says it, it looks like she's smiling.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b16725-4NERwHO0OfaW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 16725
      },
      "rarity": "uncommon"
    },
    {
      "id": "kento-miura",
      "name": "Kento Miura",
      "alt_names": [
        "三浦健人",
        "Kent",
        "Master"
      ],
      "role": "supporting",
      "description": "A student in Sawako's class during second year who sits next to her. When Sawako befriends Miura, Kazehaya becomes jealous of him as a potential rival for Sawako. He is interested in girls, particularly Sawako.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/17874.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17874
      },
      "rarity": "uncommon"
    },
    {
      "id": "tomoko-endou",
      "name": "Tomoko Endou",
      "alt_names": [
        "遠藤 朋子",
        "Tomo"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28460-7dCVg0MwgCgC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28460
      },
      "rarity": "uncommon"
    },
    {
      "id": "eriko-hirano",
      "name": "Eriko Hirano",
      "alt_names": [
        "平野依里子",
        "Ekko"
      ],
      "role": "supporting",
      "description": "A classmate of Sawako. After Sawako begins to open up, Hirano becomes one of her first friends. Her nickname is \"Ekko\".   (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28461-APAt93ZQ5Pcm.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28461
      },
      "rarity": "uncommon"
    },
    {
      "id": "yoshiyuki-arai",
      "name": "Yoshiyuki Arai",
      "alt_names": [
        "荒井善行",
        "Zen"
      ],
      "role": "supporting",
      "description": "The original home room teacher of Sawako&#039;s class. He and Pin have the same surname, but are not related. To distinguish between the two teachers Yoshiyuki Arai is called &quot;Zen&quot;. &quot;Zen&quot; is an alternate reading of the kanji for &quot;Yoshi&quot;. He seems to be afraid of Sawako and the rumors surrounding her as &quot;Sadako&quot;. Because he is easily ill, students often believe that Sawako has cursed him. Arai is newly-wed.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29975-zoSTQEv8O5yD.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29975
      },
      "rarity": "uncommon"
    },
    {
      "id": "yuka",
      "name": "Yuka",
      "alt_names": [
        "ユカ"
      ],
      "role": "supporting",
      "description": "Yuka is a classmate that has gossiped about Sawako. Eventually, she ends up bullying her in the school bathroom when Sawako was brave enough to them to tell her that the rumors being spread are fake, which causes an uproar among the students.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29976-PkKUVaSsiGkB.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29976
      },
      "rarity": "uncommon"
    },
    {
      "id": "genji-sanada",
      "name": "Genji Sanada",
      "alt_names": [
        "真田源次"
      ],
      "role": "supporting",
      "description": "Ryuu&#039;s father.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29977-eKMMkfewpV4K.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29977
      },
      "rarity": "uncommon"
    },
    {
      "id": "touta-kazehaya",
      "name": "Touta Kazehaya",
      "alt_names": [
        "風早透太"
      ],
      "role": "supporting",
      "description": "Shouta&#039;s brother.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29978-ojqXMHvHSxJ7.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29978
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-25T20:10:46.940Z"
}