{
  "work_id": "overlord-ii",
  "count": 15,
  "characters": [
    {
      "id": "momonga",
      "name": "Momonga",
      "alt_names": [
        "モモンガ",
        "Ainz Ooal Gown",
        "Dark Warrior Momon",
        "Great One",
        "The One",
        "Supreme Being",
        "Raven Black Hero",
        "Demon God",
        "Great Sorcerer King",
        "Undead King"
      ],
      "role": "protagonist",
      "description": "He is the guild master of Ainz Ooal Gown and regarded as the highest of the Almighty 41 Supreme Beings by the NPCs of the Great Tomb of Nazarick. He is also the creator of Pandora's Actor.\n\nA cautious and stingy person, Momonga always tries to plan and control details, avoiding any haphazard actions. Because he doesn't underestimate his opponents, he will usually overkill them. Since being transferred to a new world and becoming an actual Undead being, Momonga could feel himself becoming very cold and calculating, his emotions repressed.\n\nLoyal to his friends and creations, since becoming Lord ruler of Nazarick in the new world he acts with a certain degree of nobility for his devoted followers. Momonga only does things that will benefit Nazarick or himself, whether its information or prestige. Although he does have a sense of justice and doesn't hate humans as much as his followers, he holds no attachment to them, and he feels nothing toward their deaths.\n\n~!His real name is Satoru Suzuki.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89103-ZsnA0r77GHsR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89103
      },
      "rarity": "epic"
    },
    {
      "id": "shalltear-bloodfallen",
      "name": "Shalltear Bloodfallen",
      "alt_names": [
        "シャルティア・ブラッドフォールン"
      ],
      "role": "supporting",
      "description": "The Guardian of the First, Second, and Third floors of Nazarick, she has the form of a beautiful vampire girl. She's also in love with Momonga. She and Albedo constantly clash for his attention. While the two don't mind sharing Momonga, they still fight for superiority and who would ultimately appeal to Momonga. Shalltear is one of the most powerful guardians, allegedly capable of going toe-to-toe with Albedo. ~!Due to an incident where she is subjected to mind control by a member of the Black Scripture, she ends up unintentionally rebelling against Nazarick.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89121-N8hzLH4nfWna.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89121
      },
      "rarity": "uncommon"
    },
    {
      "id": "albedo",
      "name": "Albedo",
      "alt_names": [
        "アルベド"
      ],
      "role": "supporting",
      "description": "The overseer of the Floor Guardians and one of the most powerful NPC in Nazarick. She takes the form of a beautiful woman with fallen angel wings and horns. Because Ainz modified her settings on a whim, she ends up madly in love with him. Albedo's romantic obsessions are so strong that if Ainz were to even glance at her body, she would immediately become excited. Albedo's obsession with Ainz has led him to greatly regret his actions. While she tries to act calm, as befitting of her role, any perceived insult against Ainz or Nazarick, real or imagined, sends her into a rage. Like most inhabitants of Nazarick, she despises humans which she refers to as \"lower life-forms.\" ~!Though the reason is not yet known, Albedo holds a strong hatred towards all of the 41 Supreme Beings except for Ainz. It is hinted that she is scheming to annihilate all the other guild members if they are found.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89122-Gj7MBs7F5cMJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89122
      },
      "rarity": "uncommon"
    },
    {
      "id": "solution-epsilon",
      "name": "Solution Epsilon",
      "alt_names": [
        "ソリュシャン・イプシロン"
      ],
      "role": "supporting",
      "description": "One of the Pleiades. She's a slime and one of the most dangerous Pleiades to humans, since she enjoys devouring humans alive. An assassin and poisoner who can decide to protect or dissolve things she absorbs, she can also control the speed of her digestion. She gets along with Shalltear because of their similar tastes",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89123-HyiNAMbKvj5E.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89123
      },
      "rarity": "uncommon"
    },
    {
      "id": "demiurge",
      "name": "Demiurge",
      "alt_names": [
        "デミウルゴス",
        "Jaldabaoth"
      ],
      "role": "supporting",
      "description": "The Guardian of the Seventh floor of Nazarick, with the form of a demon wearing glasses. Demiurge is very intelligent, but is also considered the most evil NPC on Nazarick. He greatly enjoys the suffering of others, made clear by his vicious experiments on prisoners. He's in charge of tactics and defenses of Nazarick. Among the Guardians, he gets along the best with Mare, since he understands the more cunning side of the Dark Elf.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89125-pnLki4r5UyV5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89125
      },
      "rarity": "uncommon"
    },
    {
      "id": "mare-bello-fiore",
      "name": "Mare Bello Fiore",
      "alt_names": [
        "マーレ・ベロ・フィオーレ"
      ],
      "role": "supporting",
      "description": "One of the Guardians of the Sixth floor of Nazarick alongside his twin sister Aura. He's rather shy and calm in comparison to his sister, although he can fight and be ruthless when necessary. Like his sister, Mare is a Dark Elf. Mare specializes in Druid magic, capable of twisting the earth to his whims.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89126-1WY1bWNYPg44.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89126
      },
      "rarity": "uncommon"
    },
    {
      "id": "aura-bella-fiora",
      "name": "Aura Bella Fiora",
      "alt_names": [
        "アウラ・ベラ・フィオーラ"
      ],
      "role": "supporting",
      "description": "One of the Guardians of the Sixth floor of Nazarick, alongside her twin brother Mare. She's very energetic and extroverted, in contrast with her brother. Aura is a 70-year-old Dark Elf. Despite constantly fighting, she and Shalltear are quite close. Aura specializes in beast-taming and fights with a long, bladed whip.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89129-2Qrm5TnoKYct.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89129
      },
      "rarity": "uncommon"
    },
    {
      "id": "cocytus",
      "name": "Cocytus",
      "alt_names": [
        "コキュートス"
      ],
      "role": "supporting",
      "description": "Cocytus is the guardian of the Fifth floor of Nazarick. An insectoid heteromorph, he was created by Warrior Takemikazuchi to be an honourable warrior and is tasked with keeping a cache of powerful weapons for Nazarick. He has a neutral alignment, which stands out against the many evil entities in Nazarick. An extremely skilled fighter, Cocytus is an expert at selecting the right combination of weapons for the fight, and dealing huge amounts of damage quickly. With the help of his extra arms, he is capable of wielding four of his twenty-one weapons at once, allowing him to deal the highest damage per second of any floor guardian.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89138-HUcvLWduh6Mc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89138
      },
      "rarity": "uncommon"
    },
    {
      "id": "narberal-gamma",
      "name": "Narberal Gamma",
      "alt_names": [
        "ナーベラル・ガンマ",
        "Nabe",
        "Na"
      ],
      "role": "supporting",
      "description": "One of the Pleiades, combat maids of the Tenth floor under Sebas Tian. She's a Doppelgänger and, because she's one of the most human-looking of the maids, she is Momonga's companion in his exploration of the new world disguised as adventurers. Narberal takes great pride in this duty, often \"wearing\" it like a badge of honor. However, like most in Nazarick, she holds great disdain towards humans. This proves troublesome, as she becomes incredibly violent when human males make advances on her. \nWhile operating as a member of the adventuring guild, \"Darkness\", Narberal operates under the alias of \"Nabe\", which becomes \"Nabe, the Beautiful Lady\" when Darkness becomes famous. Narberal's beauty has been compared to that of the \"Golden Princess of Re-Estize\" by many of the country's inhabitants.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89152-S3WrhOMakSCq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89152
      },
      "rarity": "uncommon"
    },
    {
      "id": "sebas-tian",
      "name": "Sebas Tian",
      "alt_names": [
        "セバス・チャン"
      ],
      "role": "supporting",
      "description": "The butler of the Tenth floor of Nazarick, who specializes in unarmed combat, with power comparable with the other Floor Guardians. He has the appearance of an elderly gentleman with a neat beard, but is actually of a species known as Dragonoids. He has a strong sense of justice, like his creator. Thus, he dislikes when the other Guardians kill humans needlessly. Because of their opposite personalities, he and Demiurge don't get along.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89155-yVyhseUF82s9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89155
      },
      "rarity": "uncommon"
    },
    {
      "id": "evileye",
      "name": "Evileye",
      "alt_names": [
        "イビルアイ",
        "Prime Grade Magic Caster",
        "Crybaby",
        "Our Shorty"
      ],
      "role": "supporting",
      "description": "Evileye is an adamantite ranked adventurer and magic caster of Blue Roses as well as a former companion of the Thirteen Heroes. \n\nEvileye has the figure of a twelve-year-old girl. She covers herself with a reddish robe and an uncanny mask which hides her face. Because of this, she is considered an enigmatic woman by others. Due to her short stature, she is called \"Shorty\" by Gagaran. Evileye's young appearance is presumably due to being an immortal vampire, which caused her body to stop developing at the age of twelve.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n125881-G7IbEWaUyCqc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125881
      },
      "rarity": "uncommon"
    },
    {
      "id": "entoma-vasilissa-zeta",
      "name": "Entoma Vasilissa Zeta",
      "alt_names": [
        "エントマ・ヴァシリッサ・ゼータ",
        "Entoma Vuashirissa Zēta"
      ],
      "role": "supporting",
      "description": "One of the members of the battle maids originally created by Genjiro. \n\n~!She has the appearance of a normal girl but her true form is that of an arachanid hybrid. She has bug mask to cover her real face. She uses a leech that recreates human voices after it kills them to disguise her original voice. She has insect focused abilities and uses talismans.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126281-wjpp9rEaovPJ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126281
      },
      "rarity": "uncommon"
    },
    {
      "id": "shizu-delta",
      "name": "Shizu Delta",
      "alt_names": [
        "シズ・デルタ",
        "CZ2128・Δ",
        "CZ"
      ],
      "role": "supporting",
      "description": "One of the members of the battle maids originally created by someone except for Tabula Smaragdina.\n\nCZ2I28 Delta is an automaton battle maid and member of the \"Pleiades Six Stars,\" the battle maid squad of the Great Tomb of Nazarick.\n\nCZ2128 appears emotionless and has a silent nature. Her Karma is relatively high, which makes her, along with Yuri Alpha, one of the two \"safe\" Pleiades to humans. Though she usually ignores conversations from humans, sometimes there is a possibility to communicate with her. She hates cannibalism and likes cute things, such as Eclair.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126841-zO8B5EQgj2dj.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126841
      },
      "rarity": "uncommon"
    },
    {
      "id": "gazef-stronoff",
      "name": "Gazef Stronoff",
      "alt_names": [
        "ガゼフ・ストロノーフ",
        "Warrior Captain",
        " Strongest Warrior of the Kingdom"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Affiliation:__ Re-Estize Kingdom\n__Occupation:__ Warrior Captain\n\nGazeff Stronoff is the Warrior Captain of the Re-Estize Kingdom and King Ramposa III's personal bodyguard, and professes his utmost loyalty to him. Incredibly talented with the sword and well-versed in martial arts, he is famously considered the strongest warrior in the entire kingdom, and commands the respect and admiration of everyone who knows his name. Due to internal power struggles among the nobles in the kingdom, Gazeff is not knighted, so the King granted him the title of \"Warrior Captain\", which allows him to command his own unit comprised of \"Warrior Troops\".\n\nBorn a commoner in a frontier village, he later became a mercenary. During his travels, he encountered a former adamantite-ranked adventurer who taught him his extraordinary swordsmanship. He participated in the grand tournament and defeated Brain Unglaus, becoming the champion and earning the King's trust.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126869-oKHjOvk80dD6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126869
      },
      "rarity": "uncommon"
    },
    {
      "id": "lupusregina-beta",
      "name": "Lupusregina Beta",
      "alt_names": [
        "ルプスレギナ・ベータ",
        "Lupus",
        "Sadist with Smiling Mask"
      ],
      "role": "supporting",
      "description": "A member of the \"Pleiades Six Stars\", the battle maid squad of the Great Tomb of Nazarick. She serves as the role of battle cleric and focuses on healing magic. In terms of combat ability, she possesses the highest physical defense and resistances among the Pleiades, and has balanced stats overall. Being a werewolf, she is weak to silver weapons, but is blessed with resistance against other metals.\n\nHer appearance is that of a brown-skinned beauty with amber-colored eyes, and red hair which she ties in two long braids. She wears a maid uniform with short sleeves and long black gloves, white stockings, and a skirt that has a long slit on its left side. She is usually seen carrying her signature weapon slung across her back, a menacing black and silver scepter which looks like and oversized religious symbol, the Crosier.\n\nLupusregina boasts a very sociable and outgoing personality, and seems very friendly, even towards humans, a race considered unworthy of respect by other beings of Nazarick. For example, she adds \"-chan\" to the other maid's names, and often likes teasing Enri with lewd jokes. The Homunculus Maids (the ordinary maids of Nazarick) are convinced she's the friendliest of the Pleiades and even believe that being approached by her can be a sign of good fortune. However, her fellow battle-maid Yuri Alpha has commented that Lupusregina's friendliness is merely a facade, and that in reality she can be as brutal and sadistic as Solution.\n\nShe likes startling people by using her \"Complete Invisibility\" spell and appearing behind them unnoticed.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126870-DKc1B7cvoUu7.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126870
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-24T03:26:49.119Z"
}