{
  "work_id": "hajime-no-ippo-fighting-spirit",
  "count": 15,
  "characters": [
    {
      "id": "ippo-makunouchi",
      "name": "Ippo Makunouchi",
      "alt_names": [
        "幕之内一歩",
        "The Wind God",
        "Big-Mara Ippo"
      ],
      "role": "protagonist",
      "description": "__Nationality:__ Japanese \n__Boxing style:__ Infighter, Peek-a-Boo \n__Height:__ 5'5\" (164.0 cm)  \n__Reach:__ 65\" (165.0 cm) \n__Weight Class:__ Featherweight \n__Specialty:__ Liver Blow, Gazelle Punch, Dempsey Roll  \n\nIppo Makunouchi is the main protagonist of the series. He lives with his mother, Hiroko Makunouchi, and helps with the family charter boat fishing business. Ippo is a classic power in-boxer and is well known for his Peek-a-Boo style of boxing and hard punches which include three signature punches: a rib-cracking liver blow, Gazelle punch (an uppercut variant), and the Dempsey roll technique. His signature punches appear to be modeled after Mike Tyson, Floyd Patterson and Jack Dempsey respectively. Ippo is bullied throughout most of his school life. After being rescued by Takamura, he ends up being brought to Kamogawa Gym, where he displays an explosive punching power. After seeing a video of Mike Tyson, he becomes inspired to take up boxing to feel reborn with strength. He soon proves himself to Takamura and Kamogawa, and starts on the path to being a pro boxer.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": "1973-11-23"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b15-AAj73hDX9bor.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15
      },
      "rarity": "epic"
    },
    {
      "id": "mamoru-takamura",
      "name": "Mamoru Takamura",
      "alt_names": [
        "鷹村守",
        "The Bear Slayer",
        "Japanese Hawk",
        "Lord of perverts"
      ],
      "role": "protagonist",
      "description": "__Height:__ 185 cm (6'1\")\n\nTakamura is very hearty, rude and often behaves vulgarly. He is a loud arrogant boaster who tends to refer to himself as Ore-sama (a Japanese name suffix intended for people of great importance) and he rarely ever shows a shred of consideration towards other fighters after a loss.  Takamura was discovered on the streets by Coach Kamogawa Genji, and his speed, power, and technique are all high-level to the point that he is capable of handling both In Fighters and Out Boxers without too much trouble. Unlike most characters in Hajime no Ippo, he has no special finishing blow, but every punch he has possesses killer destructive power. With the wild power to always force out any situation he claims will happen, he is a man who does everything he says he will.  As the one who got Ippo, Aoki and Kimura into boxing, he is well respected at the Kamogawa Gym. Even though he constantly looks down on and ridicules their achievements, his unrivalled strength and the few moments his true kindness leaks out prevent them from losing their respect for him. Takamura loves to pick on his fellow gym mates, with Aoki usually the first on his list. Although he tends to get more serious when hearing about or training for his next match, he still finds the time to play pranks on everyone and goof around.  The character for Taka (鷹) in his name means hawk, and as a result he is sometimes nicknamed The Japanese Hawk by announcers and spectators (most notably during his matches against Brian Hawk and David Eagle). He lives alone at the Ohta Inn apartment complex, and his room is littered with junk, old food, pornography, and even his boxing belts. His pompadour hairstyle is his trademark.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": "1967-07-07"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b845-yzHSqt8WpnO5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 845
      },
      "rarity": "epic"
    },
    {
      "id": "masaru-aoki",
      "name": "Masaru Aoki",
      "alt_names": [
        "青木勝",
        "Leapfrog"
      ],
      "role": "protagonist",
      "description": "Aoki was a punk from his childhood up through high school, at which point he encountered, fought and got beat down by Takamura Mamoru (who was then a middleweight with two wins under his belt). This loss motivated him to quit school along with his close friend Kimura Tetsuya to become boxers at Kamogawa gym.  Although their initial goal was to land a clean hit on Takamura, they grew to love boxing and develop their own skills. Aoki became a clownish boxer whose signature techniques, the Frog Punch and Look-Away, eventually led him to a draw in a Japanese title match with then-champion Imae Katsuka. Currently in the series, Aoki has an ongoing rivalry with Papaya Dachiu, the lightweight champion of the Philippnes, with whom he has drawn two consecutive matches.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b846-x62keRQk14p9.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 846
      },
      "rarity": "epic"
    },
    {
      "id": "tatsuya-kimura",
      "name": "Tatsuya Kimura",
      "alt_names": [
        "木村達也"
      ],
      "role": "protagonist",
      "description": "Ippo&#039;s senpai and Aoki&#039;s best friend. He is the smooth, collected type and a romantic at heart, but trains as hard as anyone. His style incorporates a fast left and faster footwork. In the past, he and Aoki were the toughest high-school thugs around, but now Tatsuya&#039;s real job is at his family&#039;s flower shop. His current record stands at 13&ndash;5&ndash;3, with 8 KOs.  ~!After losing to Ryo Mashiba, he announced his retirement from boxing.Shortly after, unable to stay away from boxing, he returned saying he would spell his name in katakana (タツヤ) instead of kanji (達也).!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b847-Rp9l5vkXT79E.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 847
      },
      "rarity": "epic"
    },
    {
      "id": "manabu-itagaki",
      "name": "Manabu Itagaki",
      "alt_names": [
        "板垣学 ",
        "Speed King"
      ],
      "role": "protagonist",
      "description": "The most recent addition to the roster, the charming Manabu has a prodigy's talent and was the captain of his high school's boxing team. Cheerful and a lover of bad puns, Manabu is a fierce outboxer with extremely high speed and reflexes and whose fighting style is uncanny in its resemblance to Miyata's. His most powerful technique is a furious hail of mid-power blows known as the Hedgehog or Porcupine, which was employed in an East Japan Rookie Kings showdown with his longtime nemesis, Kyosuke Imai. Outside of boxing, Manabu is employed as an assistant at the Makounouchi family's fishing business. Itagaki's character is based on former world champion Oscar de La Hoya for his prodigy-like natural ability and good looks, whom Itagaki has admitted to idolizing in the manga. His current record as the Rookie King of his class stands at 9 Matches 8-1-0 (W-L-D), with 6 KOs.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5184-ZllG2KJqeuc2.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5184
      },
      "rarity": "epic"
    },
    {
      "id": "genji-kamogawa",
      "name": "Genji Kamogawa",
      "alt_names": [
        "鴨川源二"
      ],
      "role": "protagonist",
      "description": "Head coach and founder of the Kamogawa gym. He fought as a prizefighter in Japan shortly after the end of World War II. Along with his friends, Ginpachi Nekota and Dankichi Hama, Kamogawa developed a style of fighting that both presumably became the forerunner of boxing in Japan and emphasized scientific theory in its techniques. As a coach, Kamogawa&#039;s wealth of knowledge and experience has been tapped into on multiple occasions during training as well as in matches. Although he rarely admits it aloud, he is extremely proud of his two best boxers, Takamura and Ippo. \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b10156-um8cGNzGHxW5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10156
      },
      "rarity": "epic"
    },
    {
      "id": "ryou-mashiba",
      "name": "Ryou Mashiba",
      "alt_names": [
        "間柴了",
        "Shinigami",
        "The Executioner"
      ],
      "role": "supporting",
      "description": "Mashiba Ryo is one of the darker characters in the series, but has shown his lighter and good natured side from time to time. He lives with his sister, Kumi Mashiba, whom he is very protective of. Their parents are deceased, having died in an accident when Mashiba was in school. He is well known for his hitman style of boxing that utilizes one of his specialties, the flicker jab; both of which appear to be modeled after Thomas Hearns. His other specialty is a close range chopping right.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1817-zHq0XMkq9ETg.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1817
      },
      "rarity": "uncommon"
    },
    {
      "id": "kumi-mashiba",
      "name": "Kumi Mashiba",
      "alt_names": [
        "間柴久美"
      ],
      "role": "supporting",
      "description": "Kumi is Ryo Mashiba's sweet-natured, but hard-working and willful younger sister, and as such understands him better than anyone else. She will do almost anything to support her brother and make him happy, including going to his matches even though she doesn't like to see him get hurt. Ippo becomes infatuated with her early on, but didn't have a chance to tell her until more than a year later, when they met in an hospital as patient and nurse some months after the Ippo/Mashiba ring. They become friends and Kumi comes to like Ippo back, but their relationship tends to suffer from their friends' and relatives' constant interference. (Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": "1974-03-21"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b1818-9NwFptwpyihp.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1818
      },
      "rarity": "uncommon"
    },
    {
      "id": "takeshi-sendo",
      "name": "Takeshi Sendo",
      "alt_names": [
        "千堂武士",
        "Rocky",
        "Naniwa Tiger"
      ],
      "role": "supporting",
      "description": "Sendo is an In Fighter with arm strength on par with Makunouchi Ippo. To date, he is the only boxer to face Ippo more than once in the pro ring and is his chief rival. Sendo is a featherweight and his most well known move is his powerful smash. He greatly admires boxer Rocky Marciano, to the extent that he will personally point out that he is not the same &quot;Rocky&quot; from the film of the same name. He is also a fan of Takamura Mamoru.     Sendo is modeled after the real-life &quot;Naniwa Rocky&quot;, boxer turned actor Akai Hidekazu.    (Source: Ippo.wikia.com)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/1821.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 1821
      },
      "rarity": "uncommon"
    },
    {
      "id": "naomichi-yamada",
      "name": "Naomichi Yamada",
      "alt_names": [
        "山田直道",
        "Gero-michi",
        "Hammer Nao",
        "ハンマー・ナオ"
      ],
      "role": "supporting",
      "description": "Yamada was a weakling who, like his Kamogawa gym sempai Ippo, was often bullied. He was given the nickname Gero-michi because of his tendency to vomit whenever pushed physically.   However, after joining Kamogawa gym and taking up boxing in the Junior-welterweight class, his self-confidence and physical condition steadily improved.       ~!After developing a bond with Ippo, he moved away and joined Hachinoe gym.  There, he shaved his head and is eyebrows. And gained the nickname &quot;Hammer Nao&quot; because his fists were like hammers.  From there, he dropped down to the Featherweight class and challenged Makunouchi Ippo for the Japanese Featherweight title.  He lost by two-round Knockout.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": "1974-12-03"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4057-n1viqf3lpybg.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4057
      },
      "rarity": "uncommon"
    },
    {
      "id": "ichirou-miyata",
      "name": "Ichirou Miyata",
      "alt_names": [
        "宮田一郎",
        "The Prince of Counters",
        "The Lightning God"
      ],
      "role": "supporting",
      "description": "Ever since he was little, Miyata has always wanted to be like his dad. His dad, Suzuki Miyata, used to be a boxer, until a career-ending jaw bone injury forced him to retire. Miyata takes  his training dead seriously, and has always believed in his father's old beliefs, that skill can beat strength. You hardly ever see the guy smile because he thinks  that he doesn't have the privilege to smile unless he wins a boxing match. \n~!He had worked his way up to almost the top of the feather weight championship, until Ryo Mashiba beat him in a match. Miyata ended up in the hospital with a broken foot, as well as some other injuries.!~",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": "1973-08-27"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b4110-DpRhFgHxH3YQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 4110
      },
      "rarity": "uncommon"
    },
    {
      "id": "eiji-date",
      "name": "Eiji Date",
      "alt_names": [
        "伊達英二"
      ],
      "role": "supporting",
      "description": "At an age swiftly approaching thirty, Date is an old-timer for a boxer but is nevertheless the man that Ippo looks up to. Years ago, he lost his World Title Match to the champion, Ricardo Martinez, who was defending his title for the 2nd time. He was knocked out in the 2nd round, and among other injuries, got a scar on the bridge of his then-fractured nose.    Date gave up boxing after that in order to settle down with his wife Aiko (a woman from a rich family who sacrificed a lot to be with him, and who just had a miscarriage at that time) and raise a family. But Date was a born boxer -- he found he could not contain his combative nature for long, and after Aiko told him that she wanted their son Yuuji to see his dad fight, he picked his career back up to the top. Date is strong in every way, but his greatest weapon is the Heartbreak Shot, a corkscrew blow to the heart that immobilizes the opponent.      ~!He is the first boxer to have defeated Ippo in the ring, making Kamogawa throw the towel.    After this fateful match, Date went after the WBA title -- a rematch with Ricardo Martinez, who was making his 18th title defense -- but lost by K.O. in the 10th round. The injuries he received in this fight included broken hands and a fractured jaw, and seriously limited Date&#039;s chances of making a return to the ring. He has, however, passed on his dream to Ippo. Currently, he trains other boxers at the Nakadai Gym. Morikawa Jouji stated in an interview that Date was modeled after former OPBF Champion Ozaki Fujio.    At the time of his retirement, Date held a record of 23-2-0 with 17 KO&#039;s. He was the former OPBF Featherweight Champion as well as a two-time JBC Featherweight Champion and has twice been the #1 contender to Ricardo Martinez&#039;s WBA Featherweight Title.!~    (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5177-QoXjthY31y1t.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5177
      },
      "rarity": "uncommon"
    },
    {
      "id": "alexander-volg-zangief",
      "name": "Alexander Volg Zangief",
      "alt_names": [
        "アレクサンドル・ヴォルグ・ザンギエフ",
        "White Fang"
      ],
      "role": "supporting",
      "description": "The World Amateur Champion is a handsome boxer from Russia who excels at outboxing and taking points, but adopts a vicious infighting style when he moves to Japan (Ippo notices how depressed he looks after this happens). Raised by a single mother in a small town near to St. Petersburg, Volg originally takes up boxing in order to provide medical assistance for his seriously ill mom (who coincidentally looks a lot like Hiroko Makunouchi, but with longer and reddish hair), but after consecutive losses to both Ippo and Sendou, he is forced to leave the Otawa Gym and return to Russia, staying by his mother&#039;s side until her death. Besides his incredible outboxing technique, Volg&#039;s greatest weapon is a vertical combination called &quot;White Fang&quot; (a short, quick left uppercut, followed by an incredibly fast and powerful chopping right). Volg later returns to Japan to get his old boxing gloves from Ippo before he goes to America, and ends up helping Ippo train for his upcoming match against Sawamura Ryuhei. Currently Volg is in America fighting at the world stage and, under the training of Dankichi Hama, is the 4th ranked IBF Jr. Lightweight fighter. His personality is very humble and polite, though he&#039;s a very good boxer, Volg admits that he doesn&#039;t really like boxing as it hurts other people but only does it so he can help his ill mother back home but finally comes to realize he has passion for boxing. There was also a running gag at the beginning, related to his rusty Japanese. When Ippo met Volg when he couldn&#039;t read kanji in the subway, and few minutes after their first conversation he got in trouble with other native Japanese people for the very same reason.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b10446-D1EvOLDWrSko.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10446
      },
      "rarity": "uncommon"
    },
    {
      "id": "masahiko-umezawa",
      "name": "Masahiko Umezawa",
      "alt_names": [
        "梅沢正彦"
      ],
      "role": "supporting",
      "description": "Umezawa was originally the leader of Ippo&#039;s bullies at high school, but later became a fan of his after he became a pro boxer. During high school he would wear his hair in a pompadour style, a trademark of many Japanese delinquents. By the time they had graduated, Umezawa&#039;s relationship with Ippo changed from fan to friends, although he was not ready to admit this at the time.   During high school he was protrayed as mean and unwilling to admit that he viewed Ippo as a friend, but after graduation he grew out of his delinquent ways and was portrayed as friendly and a bit more comical. During high school and up through his years with Makunouchi Fishing Boat, he attended most of Ippo&#039;s matches, often wearing a handmade support headband and acting as Ippo&#039;s main cheer leader.   After he retired from Makunouchi Fishing Boat to become a manga artist, Itagaki Manabu took over his job. It is unknown whether he has attended any of Ippo&#039;s matches since he left. In some ways, Umezawa can be viewed as Morikawa Jouji&#039;s avatar character.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/12796.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12796
      },
      "rarity": "uncommon"
    },
    {
      "id": "ricardo-martinez",
      "name": "Ricardo Martinez",
      "alt_names": [
        "リカルド・マルチネス",
        "El Diablo"
      ],
      "role": "supporting",
      "description": "Ricardo Martinez is currently the only &#039;Super Champion&#039; in the series. He has the longest title run in the series, with 21 defenses of his WBA Featherweight Title over a decade. He became WBA Featherweight Champion at the age of 21. His fame is so great, even those in Mexico who don&#039;t know the President&#039;s name knows his name. Ricardo&#039;s strength far exceeds that of the other known featherweights. His power is on par with Ippo&#039;s; his damage retention allowed him to take several heavy blows from Date without any lasting damage; his jabs are able to stop Ippo&#039;s Dempsey Roll and knock him unconscious on their own. For reasons unknown, he has always stayed in the WBA and never tried to become undisputed champ, leaving the massive number of World contenders avoiding him to scramble for the WBC belt. George Morikawa listed Martinez as the second strongest character in the series (behind Takamura). Ricardo Martinez is based on Ricardo Lopez, one of the few boxers to retire undefeated.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b15841-Q818okUhiktd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 15841
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-26T02:19:53.189Z"
}