{
  "work_id": "guilty-crown",
  "count": 15,
  "characters": [
    {
      "id": "shuu-ouma",
      "name": "Shuu Ouma",
      "alt_names": [
        "桜満集",
        "Void Ouji"
      ],
      "role": "protagonist",
      "description": "__Height__: 170 cm (5'7\")  \n__Void__: The King's Heart  \n__Known relatives__:  ~!• Korosu Ouma (father, deceased) • Saeko Shijō (mother, deceased) • Haruka Ouma (step-mother, alive) • Mana Ouma (sister, deceased) • Inori Yuzuriha (partner, physically destroyed but her soul is alive in Shu) • Gai Tsutsugami(step-cousin, deceased) • Shuichiro Keido (step-uncle, deceased)!~  \n\nOne of the main protagonists of Guilty Crown, who's right hand holds a special power called \"The Power of the King\". This ability allows him to extract weapons from his friends known as a \"Void\" which is a manifestation of a person's personality.  He is an unsociable 17-year-old young man who usually tends to stay out of people's way so as to not cause them any trouble. However, this changes when he meets a girl named Inori Yuzuriha. From that moment on, he must learn how to make friends because of his ability \"The Power of King\".   \n\n__Episode 15 spoilers__\n~!After Hare dies, Shu goes to Inori and forces her Void out against her will to slaughter all four Endlaves with emotionless eyes. Afterwards, he says that kindness is pointless and that he is going to become \"The King\".   After the sudden resurrection of Gai, Shu's arm was cut off by Inori's Void, which was forced out by the-now 'evil' Gai.  After acquiring the second Void Genome Shu reacquires the King's Power and uses his own void as a replacement arm for the one that was cut off; It is shown that his Void absorbs all traits and also acts as a inventory allowing him to store voids; the trade back however is that he also acquires the negatives affects such as Souta's cancer when he used Souta's void.!~   \n\n__Episode 22 spoilers__\n~!After Shu kills Gai, the Void Genome he previously owned fuses with his Void. He decides to use his Void to absorb all of the Apocalypse Cancer, whilst sacrificing himself and going down together with Inori, who was about to die in his arms. When meeting Inori in that Void-dimension, she asks Shu to take the Cat's Cradle. He accepts it, unknowingly that Inori was about to sacrifice herself to save Shu. He then suddenly breaks out of the Apocalypse Crystals.  A few years later he's seen celebrating Hare's birthday. He has lost his sight, probably when he was absorbing everyone's cancer including that of Inori, losing his sight in progress.  Afterwards, he's seen reminiscing about Inori and the short time they've spent together.!~",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": "2012-07-21"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43278-qtyFTwAaLiLb.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43278
      },
      "rarity": "epic"
    },
    {
      "id": "inori-yuzuriha",
      "name": "Inori Yuzuriha",
      "alt_names": [
        "楪いのり",
        "Egoist",
        "Inorin"
      ],
      "role": "protagonist",
      "description": "__Height:__ 166 cm (5'5\") \n__Occupation:__ Singer, student \n__Partner(s):__ Shu Ouma \n__Affiliation:__ Funeral Parlor  \n\nInori Yuzuriha is one of the main protagonists of the anime Guilty Crown and a member of the resistance guerrilla group called \"Funeral Parlor\".  She is also the voice of the internet artist Egoist who sings to release her emotions.  Inori is a very soft, quiet, and sweet girl, who is also very determined to complete her missions successfully and without fail (shown when she was threatened but didn’t show any sign of fear, even when she was about to be killed). She also seems to think she’s a burden to others but tries to protect the people close to her.   She usually comforts Shu and gives him words of strength when she can tell he’s feeling weak and helpless. Gai is dear to Inori, and she tells Shu that he is the one that gave her a name and a world, when no one else has.  As a member of Funeral Parlor, Inori is extremely skilled in forms of combat such as hand-to-hand fighting and marksmanship, to the point where she is able to outmatch and kill several soldiers of the GHQ forces by herself.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43280-dxRTpIioqSg7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43280
      },
      "rarity": "epic"
    },
    {
      "id": "gai-tsutsugami",
      "name": "Gai Tsutsugami",
      "alt_names": [
        "恙神涯",
        "Triton"
      ],
      "role": "supporting",
      "description": "__Height:__ 180 cm (5’11\") \n__Birthday:__ January 9, 2006. \n\nAt his young age,​ he is the leader of the group, \"Undertaker\". He has great physical strength and pilots the Jeet Kune Do. He has a lot of charisma and is Shu's rival. He guides Shu who has the \"The Ability of King\" and aims for a successful revolution. He hopes to push the revolution to success with the help of the \"power of kings\". He has the power to see people's Voids.  His everlasting dream was to save Mana (Shu's older sister, Eve of the New World) from the Virus, thus releasing her from pain. He even says it several times that his reason for fighting is \"for a certain woman\".  ~!Later on, he also grabs Shu's Void and, by the very end, dies to Shu's hand.  Early on, it is shown that the only way for him to remain alive (due to the Virus) is to take Inori's blood. He dies twice; each time in the hands of Shu. !~",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43279-LFT3GGDngMoH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43279
      },
      "rarity": "rare"
    },
    {
      "id": "ayase-shinomiya",
      "name": "Ayase Shinomiya",
      "alt_names": [
        "篠宮綾瀬"
      ],
      "role": "supporting",
      "description": "__Height:__ 162 cm (5'4”)  \n\nAyase is an amazing and determined young girl who is paralyzed from the ​waist down and uses a wheelchair.  She is also Undertaker's sole Endlave combat pilot. She can't stand feeling dependent on others, so she firmly rejects any and all help from others. There are two things Ayase dislikes more than anything - being offered help by others because of her disability and if someone is watching her while she is trying to crawl back into her wheelchair on her own. She believes the process itself doesn't make her look very elegant.    Even though Ayase is disabled, she is valued and respected by all Undertaker members for her Endlave piloting skills. This paralyzed girl makes her Endlave which weights many tons of armor grade steel-alloy move on the battlefield with uncanny precision.  Ayase being the only pilot of Endlave mobile combat platform is instrumental to all Undertaker operations. Her primary job is to draw the attention of the enemy Endlaves away from the Undertaker's main objectives and provide support and cover for other Units.  Most of the time during combat Ayase finds herself outnumbered at least three to one, but still, are able to hold her own against enemy Endlaves. Originally, she piloted an older Endlave Jumeau model before it was destroyed by Daryl, but later gains Daryl's Endlave Steiner model.  Ayase has feelings for Gai and is very loyal to him. She was eager to accept all responsibility for losing her original Endlave in combat, after successfully holding off multiple, newer and more advanced enemy Endlave models with her older model for 18 minutes. After listening to her report, Gai simply tells her that the fault is his own and that he is not fit to be the Undertaker's Commander for giving her such cruel order, to which she blushed furiously.   \n\n ~!Ayase's Void is a compensation for the disabled girl's one and only shortcoming. It's a direct reflection of Ayase's hearts' deepest wish and decides - to be able to proudly stand on her own two legs. Something that most people take for granted. This powerful Void manifested itself as a reinforced lower-body exoskeleton providing its user with amazing agility, mobility, and jumping power. Strangely enough, it also possesses a roller-skates type capability allowing for a swift movement over flat surfaces. It is possible that because Ayase is so used to Endlaves which utilize skating instead of walking to quickly move in and out of combat - it caused the same ability manifest in her Void as well.!~  At first Ayase is apprehensive toward Shu, because of his lack of firm character and indecisiveness, but later on she warms up to him as she starts to see him change as a person and yet remain the same as a human being.   ~! As Shu ready to leave for the decisive battle and wishes to return everyone's voids in case he doesn't come back, Ayase is the first one who tells him that she wishes him to keep her void for if Shu loses - all their lives are forfeit.!~",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43281-KRzz5zmmrcC5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43281
      },
      "rarity": "rare"
    },
    {
      "id": "tsugumi",
      "name": "Tsugumi",
      "alt_names": [
        "ツグミ"
      ],
      "role": "supporting",
      "description": "__Height:__ 160 cm (5'3\")  \n\nAn excellent hacker who acts as the Operator and Cyber-warfare specialist for the Guerrilla Resistance Group \"Undertaker\". Tsugumi plays a purely supportive role from Undertaker's Command Hub Tractor-trailer outfitted with newest Cyber and Communications Hardware. She monitors the battles and relays important information between Undertaker Units.  Her primary task is​ to monitor and support Ayase and her Endlave.   She is very brash and cheeky and speaks unreservedly even to the leader, Gai. Her codename is \"Black Swan\". Her Void is a Hand Scanner, magical girl wand that can create holographic projections of people. Although Tsugumi has no special combat abilities, she is fearless and ruthless when it comes to her paralyzed friend Ayase. When Ayase is out of her Endlave and in trouble, Tsugumi suddenly comes out of nowhere swift as the wind and launches herself at the source of Ayase's troubles with a mighty Missile Kick!",
      "metadata": {
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43282-kYrfRKACKpkD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43282
      },
      "rarity": "rare"
    },
    {
      "id": "hare-menjou",
      "name": "Hare Menjou",
      "alt_names": [
        "校条祭"
      ],
      "role": "supporting",
      "description": "Height: 165 cm (5’5”) \n Birthday: July 4, 2013.  \n\nShu's classmate. They live in the same apartment building and they've been together since junior high school.   ~! She has a crush on Shu and confesses to him in episode 15 of the anime.  She dies while healing Shu, who tried to save her from a car explosion, because her Void got shot by a helicopter, causing her to crystallize. She then disintegrates when Shu embraces her and disappears.!~",
      "metadata": {
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/46083.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46083
      },
      "rarity": "rare"
    },
    {
      "id": "yahiro-samukawa",
      "name": "Yahiro Samukawa",
      "alt_names": [
        "寒川谷尋",
        "Sugar"
      ],
      "role": "supporting",
      "description": "Shu's classmate and member of the motion picture research club. Yahiro is one Shu's closes friends who bothers to socialize with him.   ~! Despite being seen as nice person, secretly he is a drug dealer by the name of \"Sugar\" and his image at school is actually a facade to hide his real anger. The reason he deals drugs is to pay for his little brother's medical bills. His Void is a pair of large shears. !~  ~!He later joins Shu's party and after Shu's election as the new student council president he becomes his most valuable assistant in charge. He is the creator of the Void Ranking System.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46085-aLRBe7odTpBy.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46085
      },
      "rarity": "rare"
    },
    {
      "id": "souta-tamadate",
      "name": "Souta Tamadate",
      "alt_names": [
        "魂館颯太"
      ],
      "role": "supporting",
      "description": "A motion picture research club member and is Shu's classmate. He is often told that he can't \"read the mood\". He is a big fan of Inori. His Void is a giant camera.",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46087-6PgSkwrXuDOv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46087
      },
      "rarity": "rare"
    },
    {
      "id": "kanon-kusama",
      "name": "Kanon Kusama",
      "alt_names": [
        "草間花音"
      ],
      "role": "supporting",
      "description": "Height: 162 cm  The chairman of class 2-A.   ~!Her Void is a visor which can zoom in even with great distances and can see through things.!~",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/46089.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46089
      },
      "rarity": "rare"
    },
    {
      "id": "arisa-kuhouin",
      "name": "Arisa Kuhouin",
      "alt_names": [
        "供奉院亞里沙"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm  \n\nThe student council president. Her grandfather is the head of the Kuhouin Group which is at odds with the GHQ, and Arisa is his heir. She however does want that, but is unable to face it, resulting in her Void \"The Coward's Shield\", which is a disk-shaped shield controlled by a ball-shaped device. The shield can divide itself in 6 parts, and even grow in size.",
      "metadata": {
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46091-OnDX0DFwuVj4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46091
      },
      "rarity": "rare"
    },
    {
      "id": "daryl-yan",
      "name": "Daryl Yan",
      "alt_names": [
        "ダリル・ヤン",
        "Kill 'Em All Daryl"
      ],
      "role": "supporting",
      "description": "A 2nd Lieutenant Juvenile officer and son of a General of the GHQ. He is a cruel and sadistic man who enjoys causing pain to others and due to having mysophobia, he hates being touched by others believing they are infected. His Void is a weapon called \"Kaleidoscope\", which is able to create a myriad of barriers to deflect attacks.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b48163-0EzBZfoUJNn9.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 48163
      },
      "rarity": "rare"
    },
    {
      "id": "shibungi",
      "name": "Shibungi",
      "alt_names": [
        "四分儀"
      ],
      "role": "supporting",
      "description": "The staff officer of the undertakers. He seems to enjoy teasing Gai, saying \"As expected of Gai\", his favorite phrase, which is usually used as sarcasm.",
      "metadata": {
        "age": "27",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b48165-RqjFexE6xnSv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 48165
      },
      "rarity": "rare"
    },
    {
      "id": "arugo-tsukishima",
      "name": "Arugo Tsukishima",
      "alt_names": [
        "月島アルゴ"
      ],
      "role": "supporting",
      "description": "A 17-year old member who is skilled in hand-to-hand combat and the use of knives. His void is a rod that temporarily blinds it's target in a sphere of complete darkness. He is a second-year student at Ryusen High School.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b48167-AA4dqgAoqu9q.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 48167
      },
      "rarity": "rare"
    },
    {
      "id": "oogumo",
      "name": "Oogumo",
      "alt_names": [
        "大雲"
      ],
      "role": "supporting",
      "description": "A member of the Undertakers who specializes with firearms and explosives. He usually keeps things to himself and is very quiet.   ~!He was injured while protecting Haruka, and later killed by Segai in episode 19.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b48169-X8vEIAihl8OK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 48169
      },
      "rarity": "rare"
    },
    {
      "id": "shuuichirou-keido",
      "name": "Shuuichirou Keido",
      "alt_names": [
        "茎道修一郎"
      ],
      "role": "supporting",
      "description": "Head of the GHQ Anti Bodies and a major antagonist.   ~!He is intent on eliminating the Apocalypse Virus through total purification by killing all individuals who are infected by the virus. However, Shuichiro has hidden motives much to General Yan suspicions particular the meteorite that the virus originated from. After Shuichiro is put under house arrest for stealing the meteorite, he secretly orders Major Segai and the Anti Bodies to launch a coup d'état against Major General Yan by causing an Apocalypse outbreak all over Tokyo. With the General dead, Shuichiro quickly takes command of GHQ and frames his predecessor's death on Funeral Parlor. In truth, Shuichiro real plan is to revive Mana using the meteorite to transfer her soul into Inori's body so both of them will start a new race and spread the outbreak worldwide. However, his plans are foiled by Gai and Shu who rescue Inori and free Mana's soul. He was assumed to be killed by his assistant Yuu but was later revealed to be alive as the new president of Japan's provisional government. It was revealed later that he is Haruka's older brother and was assumed to be Kurosu's best friend, but it turns out he wasn't and that he hated him so much that he killed him.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b50077-HdedNTf8XPLz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 50077
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-24T14:20:13.259Z"
}