{
  "work_id": "made-in-abyss",
  "count": 15,
  "characters": [
    {
      "id": "riko",
      "name": "Riko",
      "alt_names": [
        "リコ",
        "Rico"
      ],
      "role": "protagonist",
      "description": "**Occupation**: Delver\n**Relatives**: [Lyza](https://anilist.co/character/122465/Lyza) (mother), [Torka](https://anilist.co/character/161856/Torka) (father)\n\nRiko is the only child of the legendary White Whistle [Lyza](https://anilist.co/character/122465/Lyza), the Annihilator. When she was two, her mother began her last dive to the bottom of the abyss. She was left under the care of the Belchero Orphanage. Her dream is to become a White Whistle, a legendary type of  Delver, and explore the depths of the abyss to learn its many secrets and find her mother.\n\nRiko is a good-natured, joyful, and energetic child. She has a quick and inquisitive mind, gathering and properly organizing all the information available on subjects that interest her. Growing up, she diligently studied to become a Delver like her mother was, enchanted by its mysteries and secrets. By the age of twelve, she had become an Apprentice Delver with the right to explore the shallowest level of the abyss on her own. Compared to [Reg](https://anilist.co/character/122444/Reg), she is fragile and lacking in physical prowess. However, her ability to keep a cool head under pressure to make rational decisions allows her to tackle the abyss.",
      "metadata": {
        "gender": "female",
        "age": "12",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b122443-Md7TtolADEJh.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122443
      },
      "rarity": "epic"
    },
    {
      "id": "reg",
      "name": "Reg",
      "alt_names": [
        "レグ",
        "Regu",
        "The Treasure of the Deep"
      ],
      "role": "protagonist",
      "description": "Reg is a robotic being who appears to be a little boy. His actual age, origins, and even name are unknown because he cannot recall anything about his life before his encounter with [Riko](https://anilist.co/character/122443/Riko). He is named after a dog Riko used to have. Having a seemingly artificial body, Reg might be the only being completely immune to the Curse of the Abyss. Because of this, he is sometimes referred to as \"The Treasure of the Deep.\"\n\nReg’s body is extremely durable, even to the point that [Ozen the Immovable](https://anilist.co/character/122464/Ouzen) couldn’t break him even when slamming him into the floor with all her strength. Despite his high durability, Reg is agile and weighs little. His wounds heal at a faster rate than a human’s, and has a very high pain tolerance. His senses of smell and hearing are strong, one comparable to a dog. His arms can extend up to 40 meters each and can shoot them to the top of cliffs or grab things very far away. The cords attached are very durable. He is also equipped with an incinerator, which is a powerful incendiary cannon built into his hands and feet, emitting a beam of light, indicating the area to eliminate, penetrating through objects. Objects within the range of the light break apart and are absorbed into the spinning axes. The incinerator is connected to the Abyss in an unknown way, having the power to rewrite the rules of the Abyss. Reg passes out for 2 hours upon use, but it can be fired multiple times in the 10-minute deadline, and can also be set to not affect living beings.\n\nDespite being a formidable fighter, Reg is rather shy, naive, and unassertive. He blushes easily and often cries when in distress. However, when forced into danger or an unpleasant situation, he is shown to be hot-tempered and sharp, compared to Riko's analytic, noncombatant role. Regardless of his skittishness, Reg has made it his sworn duty to protect Riko and doesn't hesitate to put up a fight when she is in harm's way. According to Ozen, the way he speaks and handles his body is similar to [Lyza](https://anilist.co/character/122465/Lyza). One of his favorite words to say is \"irredeemable,\" which was a word that Lyza often said.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b122444-9rGUpcjwygHD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122444
      },
      "rarity": "epic"
    },
    {
      "id": "nanachi",
      "name": "Nanachi",
      "alt_names": [
        "ナナチ"
      ],
      "role": "protagonist",
      "description": "**Species**: Narehate\n\nNanachi is a Narehate — a person who’s survived the 6th layer’s Curse of the  Abyss and has been left deformed as a result. Unlike other Narehates, Nanachi has retained a sound mind, possessing vast knowledge of the Abyss — its ecosystem, vegetation and even the use of the medicines. Their gender is ambiguous, often using the gender-neutral pronoun \"oira.\" when referring to themself.\n\nMost of the time, Nanachi is cool and reserved, keeping their distance emotionally and physically. Their attitude often borders on being sarcastic and even cynical. However, behind this mask, Nanachi hides a kind and gentle soul, capable of deep compassion and selfless devotion. They are also quite bashful when complimented, seen in their reaction to being called \"fluffy\". They also express discomfort at being petted, especially by  [Reg](https://anilist.co/character/122444/Reg).",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b122445-5uDu8wMy8Jxi.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122445
      },
      "rarity": "epic"
    },
    {
      "id": "prushka",
      "name": "Prushka",
      "alt_names": [
        "プルシュカ"
      ],
      "role": "protagonist",
      "description": "__Species__: Human\n\nPrushka is the adoptive daughter of the White Whistle Delver [Bondrewd](https://anilist.co/character/122463/Bondrewd). She lives with him at the Forward Operation Base.\n\nPrushka is a cheerful and amiable girl who loves her adoptive father very much. She is incredibly devoted to him and would do anything to help him, holding him in higher regard than anyone else. Having lived the majority of her life in the 5th layer, she developed a strong curiosity for exploring and was fascinated by tales of others' travels through the Abyss. She is adventurous and quite brave, going on her own adventures through the 5th layer behind her father's back.\n\nDue to her horrible past and the influence of her father, she developed an amazing mental fortitude, and became very obstinate, to the point of being willing to challenge the curse of the 5th layer multiple times just to learn more about it.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b122466-RnolgKgexYDl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122466
      },
      "rarity": "epic"
    },
    {
      "id": "faputa",
      "name": "Faputa",
      "alt_names": [
        "ファプタ",
        "Princess of the Narehate"
      ],
      "role": "protagonist",
      "description": "**Race**: Narehate\n**Relatives**:~![Irumyuui](https://anilist.co/character/183025/Irumyuui) (mother)!~\n\nFaputa is referred to as \"Princess of the Narehate\" by the inhabitants of the Narehate Village Ilblu within the inviolable 6th layer of the Abyss. She is described by Majikaja as \"the embodiment of value\", and is incredibly highly regarded by all the Narehate in the village.\n\nFaputa appears to be unstable and unreasonable, displaying a wild behavior that makes her comparable to a beast. She speaks in a simplistic and primitive manner, referring to herself in third person, and communicating only with short sentences that are sometimes hard to understand. She is very possessive and seemingly quite jealous, claiming [Reg](https://anilist.co/character/122444/Reg) to be of her property entirely, and feels entitled to examine him thoroughly without any indication of shame or restraint. She seemed a bit shaken when Reg failed to remember her and grew upset when Reg said he wanted to spend time with [Riko](https://anilist.co/character/122443/Riko) and [Nanachi](https://anilist.co/character/122445/Nanachi) rather than her.\n\nFaputa is beloved by the Narehate of the village, but she is often irritated or angry according to Majikaja, and she seems to greatly dislike being observed. The Narehate in Ilblu freaks her out a bit, especially the ones with lots of eyes.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b160733-86kSKUGyAczO.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 160733
      },
      "rarity": "epic"
    },
    {
      "id": "bondrewd",
      "name": "Bondrewd",
      "alt_names": [
        "ボンドルド",
        "Lord of Dawn",
        "The Novel",
        "Delver of the Abyss"
      ],
      "role": "supporting",
      "description": "Bondrewd is a legendary white whistle delver who has made many great discoveries about the secrets of the Abyss. A researcher fascinated by the Abyss, he has often resorted to illegal and morally questionable means to get funds for and conduct his research, including selling artifacts illicitly, developing dangerous drugs, and even experimenting on living humans. Though how cruel, he still cared for the kids and people he brutally experimented on.\n\nHis methods went against all the ethical principles of delvers, but he was allowed to continue due to his outstanding results. Ten years ago, he did the unthinkable by establishing a large base named the Idofront in the deepest area within the 5th Layer of the Abyss, as well as securing a route to the then-inviolable 6th layer.\n\n~!During one of his experiments researching the Curse of the Abyss, Bondrewd offered children who wanted to unravel the secrets of the Abyss to come with him to the Ido Front. However, he never told them openly that they were going to be used as test subjects. Among the children were Nanachi and Mitty. As Bondrewd continued testing, more and more children were used up in his experiments until only Nanachi and Mitty were left. On his final test, he used both of them, resulting in Mitty being hit with the Curse of the Abyss, while Nanachi received the Blessing.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b122463-p4o7qOTJ2Lba.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122463
      },
      "rarity": "uncommon"
    },
    {
      "id": "ouzen",
      "name": "Ouzen",
      "alt_names": [
        "オーゼン",
        "Ozen",
        "The Immovable",
        "The Immovable Sovereign"
      ],
      "role": "supporting",
      "description": "Ouzen the Immovable is an elite White Whistle who lives at the Observation Base on the second level of the Abyss where she commands a small team of cave raiders known as \"The Layabouts.\" Ouzen was a mentor and a close friend of Riko's mother Lyza.\n\nOuzen is a peerless fighter—her unique relic \"Thousand Pins\" grants her superhuman strength, speed and longevity (even though Ouzen appears to be young, she's attained the rank of a white whistle more than 50 years back). She's over 2 meters tall and has a peculiar hairstyle which conceals the scalp deformations caused by the extended exposure to the Curse of the Abyss.\n\nOuzen has absolute control over her facial expressions and her actual feelings (or lack thereof) cannot be guessed with any certainty. The reasons behind her actions are unknowable as well—Ouzen rarely bothers to explain herself and even when she does it's impossible to know whether she's telling the truth or just toying with the audience.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b122464-xnYajKbuEa29.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122464
      },
      "rarity": "uncommon"
    },
    {
      "id": "lyza",
      "name": "Lyza",
      "alt_names": [
        "ライザ",
        "Lord of Annihilation",
        "The Annihilator"
      ],
      "role": "supporting",
      "description": "Lyza the Annihilator is a legendary White Whistle who accomplished many great discoveries about the secrets of the Abyss. She is Ozen's apprentice and Riko's mother.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b122465-YHQVVPnVZZX1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122465
      },
      "rarity": "uncommon"
    },
    {
      "id": "nat",
      "name": "Nat",
      "alt_names": [
        "ナット"
      ],
      "role": "supporting",
      "description": "**Gender**: Male\n**Species**: Human\n**Occupation**: Delver\n**Class**: Red Whistle\n**Relatives**: Unnamed sister\n\nNat is an orphan from the Belchero Orphanage in the town at the edge of the Abyss, Orth. Like all the children of the orphanage, he's studied to become a Delver since a young age and attained the rank of Red Whistle Delver after his first descent. He wants to become a Moon Whistle Delver like [Jiruo](https://anilist.co/character/123188/Jiruo) and someday build an orphanage somewhere in Orth.\n\nNat has short brown hair with bright blue eyes and wears, like his peers, a red whistle around his neck. He is often seen in his plain white sailor collar shirt, green pants, and track shoes.\n\nNat cares about the people around him, especially [Riko](https://anilist.co/character/122443/Riko). He was against Riko descending into the Abyss with [Reg](https://anilist.co/character/122444/Reg); he spoke of the difficulties of dealing with the Abyss alone and that she wouldn't be able to see anyone in Orth again. Although he was helping Riko and Reg descend into the Abyss, before the departure, he struggled to express he would miss Riko.\n\nNat used to live in the Wharf, where he lived in the slums. He didn't have any family besides his older sister. When his sister died, he was alone in the streets, but the orphanage took him in and he becoming a Delver.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/122748-UQiYQ5OjzkGT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122748
      },
      "rarity": "uncommon"
    },
    {
      "id": "shiggy",
      "name": "Shiggy",
      "alt_names": [
        "シギー"
      ],
      "role": "supporting",
      "description": "**Gender**: Male\n**Species**: Human\n**Occupation**: Delver\n**Class**: Red Whistle\n\nShiggy is an orphan from the Belchero Orphanage in the town at the edge of the Abyss, Orth. Like all the children of the orphanage, he has studied to become a Delver since a young age and attained the rank of Red Whistle Delver after his first descent.\n\nShiggy has short ashy black hair and bright-red eyes, wears rounded glasses, and bears a red whistle around his neck. He is often seen in his plain white sailor collar shirt and khaki green or black pants and track shoes.\n\nShiggy has a great inquisitiveness, especially when it comes to the maps of the Abyss. He gives [Riko](https://anilist.co/character/122443/Riko) plenty of advice.\n\nWhen Riko tells her friends that she will delve into the Abyss to find [Lyza](https://anilist.co/character/122465/Lyza), Shiggy is skeptical and explains each layer via a depth chart. He decides to aid [Reg](https://anilist.co/character/122444/Reg) and Riko anyways and the three meet up the next morning in the South District. Shiggy advises them to enter the Abyss through the entry point at the wharf slums, which are not monitored as closely.\n\n(Source: Made in Abyss Wiki, edited)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/122749-moyrPEkfL7gv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 122749
      },
      "rarity": "uncommon"
    },
    {
      "id": "marulk",
      "name": "Marulk",
      "alt_names": [
        "マルルク"
      ],
      "role": "supporting",
      "description": "Ozen's assistant and a Blue Whistle Diver.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/123145-wWYcJ3SOF426.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123145
      },
      "rarity": "uncommon"
    },
    {
      "id": "hablog",
      "name": "Hablog",
      "alt_names": [
        "ハボルグ",
        "Haborg",
        "Habo-san"
      ],
      "role": "supporting",
      "description": "Hablog (called Habo-san by Riko and the other children) is a well-known Black Whistle Delver and was the person who delivered Lyza's White Whistle and final notes to the surface.\n\nHablog is a very bright and kind person with a rather high level of curiosity, as is seen when he first meets Reg.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123185-lOJJvAS0tqF0.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123185
      },
      "rarity": "uncommon"
    },
    {
      "id": "kiwi",
      "name": "Kiwi",
      "alt_names": [
        "キウイ",
        "Kiyui",
        "Kiui"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/123186-lgKM1zM7SB1F.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123186
      },
      "rarity": "uncommon"
    },
    {
      "id": "jiruo",
      "name": "Jiruo",
      "alt_names": [
        "ジルオ",
        "Leader (リーダ)"
      ],
      "role": "supporting",
      "description": "**Gender**: Male\n**Species**: Human\n**Occupation**: Delver, Delving Instructor\n**Class**: Moon Whistle\n\nJiruo is a Moon Whistle Delver who serves as a teacher for Apprentice Delvers from the Belchero Orphanage in the town of Orth. While he works as an instructor for the children, he is also largely responsible for their upbringing and well-being.\n\nJiruo is serious and stern and tends to come off as cold at times but takes his job as a teacher and instructor seriously and prioritizes the childrens' safety. At times he is very insightful and gives good advice, and does his best to support Riko after her mother's whistle was brought back to the surface.\n\nJiruo was the apprentice of the legendary White Whistle Delver Lyza. Though he was only a red whistle at the time, before she made her last dive, Lyza entrusted him with watching over Riko and protecting her identity as a child of a White Whistle Delver.\n\n(Source: Made in Abyss Wiki, edited)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b123188-9yVeXsmPmtAY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 123188
      },
      "rarity": "uncommon"
    },
    {
      "id": "mitty",
      "name": "Mitty",
      "alt_names": [
        "ミーティ"
      ],
      "role": "supporting",
      "description": "**Species**: Narehate\n\nMitty is an amorphous Narehate who lived with Nanachi on the 4th layer of the Abyss. Mitty had been a regular human girl in the past and her appearance changed due to the result of the ascension from the 6th layer.\n\n~!In Ilblu, it is revealed that Belaf paid compensation to have an exact replica of Mitty born into the village from the time a \"masked man\" brought her along to the village. This reproduction even has an exact copy of Mitty's soul from that moment in time.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125877-nFoMWC2T67Tx.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125877
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-24T16:39:01.132Z"
}