{
  "work_id": "akame-ga-kill",
  "count": 81,
  "characters": [
    {
      "id": "akame",
      "name": "Akame",
      "alt_names": [
        "アカメ",
        "Demon Sword Murasame",
        "Honors Student"
      ],
      "role": "protagonist",
      "description": "__Height:__ 164 cm (5'4\")\n\nAkame is one of the members of the Assassin's group, Night Raid. She is the first member to attack Tatsumi, and comes very close to killing him. She initially appears very serious and cold-hearted, but she is actually caring and worries about the safety of her comrades. She has a younger sister named Kurome, who is a member of the Jaegers, and loyal to the Empire. Her Teigu is the One-Cut Killer: Murasame, a katana known for being coated in an immensely deadly poison that could kill those cut by it within seconds, as the poison itself has no antidote.\n\n ~!When she was a child, her parents had sold both her and Kurome to the Empire. There, they were placed and raised as Assassins from childhood. Akame in particular became infamous enough to earned the top rank in the Imperial Assassin Division. At some point, many of her comrades had died and she become dissatisfied and resentful towards the government. It was not until she was sent to kill former General Najenda that Akame finally defected to the Rebels after being swayed by her.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b63351-0WmsDENpiscp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 63351
      },
      "rarity": "legendary"
    },
    {
      "id": "tatsumi",
      "name": "Tatsumi",
      "alt_names": [
        "タツミ",
        "Tatsumi The Blacksmith"
      ],
      "role": "protagonist",
      "description": "Tatsumi is a swordsman from a small village. He set out to the capital with two of his companions in hope of raising money for the village. He got separated from his friends and reaches the capital. Tatsumi was not aware of the type of place the capital really was. After a series of events centered around his naivety of the true nature of the capital he found himself being saved be Night Raid (Assassination Group) and later join them to rid the capital of its corrupt inhabitants.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/64749-a2ZdRWW1D5TR.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 64749
      },
      "rarity": "legendary"
    },
    {
      "id": "leone",
      "name": "Leone",
      "alt_names": [
        "レオーネ",
        "Onee-San"
      ],
      "role": "protagonist",
      "description": "__Height:__ 170cm (5'7)\n\nLeone is one of the older members of the assassination group, Night Raid. She has a very relaxed and a cheerful personality, which tends to display a lack of ladylike manners, such as shoving Tatsumi into her breasts, putting her feet on the table, or consuming large amounts of Sake. She serves as a sort of big sister figure to Tatsumi and the younger members in Night Raid, often referring to herself as \"Onee-San\". Despite the morally dodgy nature, she can sometimes display, Leone is not one to tolerate injustice and can be especially vicious to those who commit the vilest acts. She excels at gathering information and exercising calm judgement when necessary.  \n\nHer teigu is Lionel, a teigu is in the form of a belt, when activated, it enhanced her speed, reflexes, strength, and regeneration, as well as giving her animal-like characteristics.",
      "metadata": {
        "gender": "female",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65227-PWmfiEVJbCwQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65227
      },
      "rarity": "legendary"
    },
    {
      "id": "mine",
      "name": "Mine",
      "alt_names": [
        "マイン",
        "Genius Sniper",
        "Bench-Warmer"
      ],
      "role": "protagonist",
      "description": "__Height:__ 155 cm (5'1)\n\nMine is a self-proclaimed \"Genius Sniper\", as well as being a sharp-tongued and quick-witted member of the assassin's group, Night Raid. She is often quick to anger, and easily irritated with those she does not know well. Despite this cold exterior, she has shown to be warm and kind to those she has opened up to.  Mine wields a powerful Teigu in the form of a rifle called the \"Roman Artillery: Pumpkin\" that fires highly concentrated piercing shots of spirit energy. Her proficiency in its use allows her to strike any target with extreme precision. When Pumpkin's user is in a dangerous situation, the power of its shots is​ magnified.\n\nManga spoilers:\n~!Tatsumi and Mine retired from service and settled down away from civilization where they married and had a child.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65229-hYOZtUlIpd5G.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65229
      },
      "rarity": "legendary"
    },
    {
      "id": "lubbock",
      "name": "Lubbock",
      "alt_names": [
        "ラバック",
        "Lubbo",
        "Rabakku"
      ],
      "role": "protagonist",
      "description": "Lubbock is a member of the assassin group, Night Raid. He is often shown being a pervert, including trying to peep on Leone while bathing, usually these attempts end in failure. In the city, his cover is an owner of a bookstore. \nLubbock's teigu is, Infinite Uses: Cross Tail, a wire based teigu able to be used offensively and defensively \n\n  ~!Rabac was 4th son born into a wealth merchant family in a region in the Empire. During his childhood as a boy he met Najenda who just moved into the region for the first time. Falling in love at first sight he left the privileged life he no longer desired to follow her into the army. Using his talent, Rabac rose through the ranks to the point where he could serve and be by her side. He would also join Najenda in her deflection to the rebellion, even going as far risk his life to change the military records of both him and her to K.I.A. Because of this he shares a somewhat antagonistic relationship Susanoo who he views as a rival for Najenda's affections.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/65231-2QpM2yw2X86k.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65231
      },
      "rarity": "legendary"
    },
    {
      "id": "sheele",
      "name": "Sheele",
      "alt_names": [
        "シェーレ",
        "Schere"
      ],
      "role": "supporting",
      "description": "__Age:__ Mid 20's\n__Height:__ 160cm (5'3)\n\nSheele is one of the members of the Assassin's group, Night Raid. While she seems to be clumsy and ditzy on the surface, she's a very caring and sweet person. She bears the Teigu \"Ecstasy\", a huge pair of scissors that can cut through anything.   ~!Growing up in the low districts of the Capital, her clumsy nature caused many people throughout her life often consider her useless, isolating her from nearly everyone. At one point in her past, she had a friend who didn't mind her personality but was attacked by her ex-boyfriend. Sheele killed the boyfriend in order to protect her, revealing that she had a strange talent for killing. However, in the end, this broke their friendship. Soon after, a gang-related to the man she killed earlier sought revenge against her and had already murdered her parents. Sheele defeated the group and was later scouted by the Revolutionary Army who learned of her ability.  By joining, she wanted to use her talent in a way that would make her useful to others by helping fix society. She is one of the first members to warm up to Tatsumi, comforting him while he mourned his deceased friends from his home village. Later, she is attacked by Seryuu, and killed while saving Mine from harm.!~  (Source: Akame ga Kill! Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/65233-f8RXB4LQiNh0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65233
      },
      "rarity": "rare"
    },
    {
      "id": "bulat",
      "name": "Bulat",
      "alt_names": [
        "ブラート",
        "Big Bro",
        "100 Man-Slayer Bulat"
      ],
      "role": "supporting",
      "description": "Bulat was once a high-ranking Imperial Officer known as \"100 Man-Slayer Bulat\". He later decided to betray the Empire when his superior was framed for not giving in to the Prime Minister's agenda. Bulat became disgusted with the Empire that cared more for bribes, than merit regardless of how hard he worked. After leaving the Empire, he joined the Revolutionaries, and eventually Night Raid.  \nBulat's teigu is the Demon Armor: Incursio an Armor-type teigu that took on the form of a short sword with a chain link tassel in its sealed form. Once released, the user was enveloped in a full body armor.\n\n ~! He died in battle, before his death at the hands of his former boss he entrusted the Incursio to Tatsumi.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/65235-KbSvHjKWY3z4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65235
      },
      "rarity": "rare"
    },
    {
      "id": "chelsea",
      "name": "Chelsea",
      "alt_names": [
        "チェルシー"
      ],
      "role": "supporting",
      "description": "A seasoned assassin working for the Revolutionary Army, having successfully carried out countless missions. While she is somewhat aloof and carefree when not on the job, she is also extremely objective and is often quite blunt when voicing her opinions.  Her Teigu, 'Gaea Foundation', is a cosmetics box that allows her to instantly change her appearance and build at will.\n\nLater in the series:\n~!she develops a crush on Tatsumi.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/65237-6r8wMUJ6pCOF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65237
      },
      "rarity": "rare"
    },
    {
      "id": "esdeath",
      "name": "Esdeath",
      "alt_names": [
        "エスデス",
        "Empire's Strongest General",
        "Ice Queen"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7)\n\nEsdeath is a high-ranking general of the Empire, and leader of the Jaegers. She enjoys torturing her enemies slowly, seen when she used her Teigu to put large blocks of ice in a cauldron so that the people inside would die slower and suffer more. Despite her sadistic actions, she is actually shown to have a compassionate heart when it comes to the lives of her men and others close to her. \nHer teigu is called Demons Extract, which allows her to manipulate ice and mold it from nothing.\n\n  ~!She is looking for love and although her expectations were high when she saw Tatsumi's skill, she smiled and fell in love with him instantly !~",
      "metadata": {
        "gender": "female",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65239-2S3t2vSyUew9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65239
      },
      "rarity": "rare"
    },
    {
      "id": "kurome",
      "name": "Kurome",
      "alt_names": [
        "クロメ"
      ],
      "role": "supporting",
      "description": "Kurome is a member of the Jaegers, and the younger sister of Akame. Like her sister, she has a big appetite and is often seen eating, usually candy. She stubbornly refuses to share her candy with even her comrades. Kurome wields an offensive Teigu like her sister, in the form of a sword named \"March of the Dead: Yatsuhusa\", which allows her to enslave up to 8 enemies killed with the Teigu. Also like her sister, she is extremely skilled in the art of the sword and assassination. ~!When she was a child, her parents had sold both Akame and her to the Empire.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65297-wz0HpmuUjolX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65297
      },
      "rarity": "rare"
    },
    {
      "id": "wave",
      "name": "Wave",
      "alt_names": [
        "ウェイブ"
      ],
      "role": "supporting",
      "description": "Wave is a member of the Jaegers who is very similar to Tatsumi. He is from a small town on the coast where he served in the Imperial Navy, and brought a massive bag full of seafood with him when he joined the Jaegers. Also similar to Tatsumi, he is often used for Comic Relief. When he first arrived at the meeting room for his new group, he first encountered Bors, who ignored him shyly until the rest of the crew showed up.  Like Tatsumi, Wave uses a sword in combat and has formidable skills. He Wields the Armor type Teigu, \" Grand Chariot \", which is a newer version of Incursio.  (Source: Akame ga Kill! Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n65555-3JyIFJNbFrZn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65555
      },
      "rarity": "rare"
    },
    {
      "id": "susanoo",
      "name": "Susanoo",
      "alt_names": [
        "スサノオ",
        "Suu"
      ],
      "role": "supporting",
      "description": "__Age:__ Approx. 1000\n__Faction:__ Night Raid\n__User:__ Najenda\n\nSusanoo is one of the new members of Night Raid that [Najenda](https://anilist.co/character/72267/Najenda) brought back with her from the Revolutionary Army HQ. He is a tall man with distinctive bull horns coming out of the sides of his head. He saves the members of Night Raid (except Tatsumi), who were all under the effects of a powerful poison created by Dr. Stylish. He is then caught in an explosion created by Stylish's exploding minions, and it is revealed that he is a Human Teigu, regenerating his lost limbs immediately.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65559-FZEHEfO374x9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65559
      },
      "rarity": "rare"
    },
    {
      "id": "bors",
      "name": "Bors",
      "alt_names": [
        "ボルス",
        "Bols"
      ],
      "role": "supporting",
      "description": "A member of Jaegars, he was formerly a member of the Incineration Squad. His Teigu is Rubicante, a flamethrower type Teigu. Despite his looks he is married to an attractive woman and has a child. He always wears a mask and tries to hide his face; yet  Esdese forcefully removes his mask at one point and claims there is nothing wrong with his face.   ~!He is killed by Chelsea while trying to retreat.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65793-xRWzkHVOKqd7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65793
      },
      "rarity": "rare"
    },
    {
      "id": "najenda",
      "name": "Najenda",
      "alt_names": [
        "ナジェンダ"
      ],
      "role": "supporting",
      "description": "Najenda, also known as The Hunk of the Rebellion is the head of the assassin group Night Raid. Taciturn, sharp-minded and level-headed, she leads the group with a surprisingly gentle but firm air. Her years of experience serving in the Empire as a general have made her a highly capable leader. Najenda is sometimes mistaken as a man due to her boyish appearance, even sometimes being nicknamed 'The Hunk of the Rebellion\" by her cohorts. She tends to have a habit of telling \"cold jokes\" and making bad puns. \n\nHer teigu is a biological type teigu named [Susanoo](https://anilist.co/character/65559/Susanoo)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b72267-heLonNDtobAG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 72267
      },
      "rarity": "rare"
    },
    {
      "id": "seryuu-ubiquitous",
      "name": "Seryuu Ubiquitous",
      "alt_names": [
        "セリュー・ユビキタス"
      ],
      "role": "supporting",
      "description": "Seryuu is a member of the Jaegers, formerly of the Imperial Guard. She has a strong fixation upon \"Justice\", originating from her father's service in the Emperial Army and subsequent death. She also highly respected Ogre the Demon, her superior and teacher, and was heavily anguished by his death as well.\n\nHer opinion of justice is blunt, she believes the Night Raid are evil for their actions as assassins, but believes killing in service to justice is always right, which ultimately makes her opinion of murder similar to theirs if not the complete same thing. However, Seryuu has a twisted sense of right and wrong, bordering on a completely black and white view of the world. All people who serve the empire, despite the deeds they do both publicly and not, are considered good by her, while those who oppose it, even those forced to against their will, are pure evil. Her twisted view of justice has caused a level of distrust towards her by her own teammates, as well as generally the entire emperial forces, on occasion, as she brutally murdered a group of prisoners long before they could interrogate the group.\n\n (Source: Akame ga Kill! Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/83405-JEbhNkj3bZkA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83405
      },
      "rarity": "rare"
    },
    {
      "id": "run",
      "name": "Run",
      "alt_names": [
        "ラン"
      ],
      "role": "supporting",
      "description": "Run is a member of the Jägers. He's a lover of literature. His teigu Banri Hishou Mastema is a wing type.\n\nRun is the kind of Esdeath's adviser, because he's probably the smartest person of Jägers.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b88578-regG6GCwGmSA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88578
      },
      "rarity": "rare"
    },
    {
      "id": "spear",
      "name": "Spear",
      "alt_names": [
        "スピア"
      ],
      "role": "supporting",
      "description": "Spear was the daughter of the former Prime Minister Chouri, and a disciple of the \"Temple of the Imperial Fist\".\n\n(Source: Akame ga Kill! Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b124797-jn55Dxdykonx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 124797
      },
      "rarity": "rare"
    },
    {
      "id": "suzuka",
      "name": "Suzuka",
      "alt_names": [
        "スズカ"
      ],
      "role": "supporting",
      "description": "Suzuka is a member of the Four Rakshasa Demons, who served as the Prime Minister's squad of executioners.\n\n(Source: Akame ga Kill! Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126273-91w8aUFMwwmH.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126273
      },
      "rarity": "rare"
    },
    {
      "id": "gozuki",
      "name": "Gozuki",
      "alt_names": [
        "ゴズキ"
      ],
      "role": "supporting",
      "description": "Gozuki is the leader of the newly formed assassination squad of the Empire, the Elite Seven.\n\n(Source: Akame ga Kill! Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126274-xagFDpAXo681.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126274
      },
      "rarity": "rare"
    },
    {
      "id": "mez",
      "name": "Mez",
      "alt_names": [
        "メズ"
      ],
      "role": "supporting",
      "description": "Mez is the daughter of Gozuki as well as a member of the Four Rakshasa Demons, who served as the Prime Minister's squad of executioners.\n\n(Source: Akame ga Kill! Wiki)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126276-M0j7uCQFk8mR.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126276
      },
      "rarity": "rare"
    },
    {
      "id": "daidara",
      "name": "Daidara",
      "alt_names": [
        "ダイダラ"
      ],
      "role": "supporting",
      "description": "Daidara is a member of Esdeath's former bodyguards, known as \"The Three Beasts\". He's a battle fanatic who will fight anyone who seems strong, and constantly takes every opportunity to improve himself when he can. He is first introduced attacking and assassinating the former Prime Minister, along with Liver and Nyau. Later, they are ordered by Esdeath to assassinate another political rival on a cruise ship. There they encountered Tatsumi and Bulat.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/127424-BF8tuLsSTRMq.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127424
      },
      "rarity": "rare"
    },
    {
      "id": "dr-stylish",
      "name": "Dr. Stylish",
      "alt_names": [
        "Dr.スタイリッシュ",
        "Doctor",
        "Glorious Hands of God"
      ],
      "role": "supporting",
      "description": "Dr. Stylish was a member of the Jaegers, and formerly was a Doctor in the service of the Empire.\n\nHe was obsessed with being Stylish and looking good. He is however at heart a classic mad scientist caring nothing for the lives of his subjects and more concerned for his own experiments than anything else. He was however very intelligent being able to see through Tatsumi's cover even when Esdeath could not. He has also been heavily hinted to be homosexual.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163191-1axpEo6UCU6J.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163191
      },
      "rarity": "rare"
    },
    {
      "id": "budou",
      "name": "Budou",
      "alt_names": [
        "ブドー",
        "Great General Budo"
      ],
      "role": "supporting",
      "description": "Described as a man who rarely leaves the battlefield, General Budou is a hardened man, with years of training and military hardship shaping him to his current state. As a general born from a celebrated lineage, Budou takes great pride in his honor, and that of the empire. Unlike most generals, he doesn't affiliate himself with the Prime Minister, and the general downright detests the pig. He even went on to state that once the rebels would be crushed, those who caused chaos in the country would incur his wrath. \n\nHis teigu is called \"Adrammelech,\" but its abilities are unknown.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163193-7aWeunXcWSdd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163193
      },
      "rarity": "rare"
    },
    {
      "id": "aria",
      "name": "Aria",
      "alt_names": [
        "アリア"
      ],
      "role": "supporting",
      "description": "Aria was a girl from the capital that offered Tatsumi a place to stay when she found him on the streets after being conned by Leone. She came from a wealthy family and had a habit of offering strays a place to stay in her mansion.\n\n~!Apparently, she and her family had an interest of luring people from the country to their place and tortured them to death. Night Raid killed her family, and Aria was killed by Tatsumi after he witnessed the death of his two friends, Sayo and Ieyasu, at the hands of Aria's family.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163197-IDh4gwV6D9Oc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163197
      },
      "rarity": "rare"
    },
    {
      "id": "aria-no-chichi",
      "name": "Aria no Chichi",
      "alt_names": [
        "アリアの父",
        "Aria's father"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163200-ApxOfvMURLVH.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163200
      },
      "rarity": "rare"
    },
    {
      "id": "dooya",
      "name": "Dooya",
      "alt_names": [
        "ドーヤ"
      ],
      "role": "supporting",
      "description": "Dooya was an assassin sent from the Northern Tribes. She was killed by Kurome and her dead body was turned into a puppet under Kurome's command. As mentioned by Kurome, she was a confident and cheerful person and she still exhibits her confidence even as a corpse puppet.\n\nShe wields two hand guns. She is shown to be an expert marksman even was able to overwhelm Mine, a self-titled \"genius marksman,\" for a while. Because of her state as a resurrected puppet, she does not feel pain or fatigue, enabling her to fight stronger opponents such as Teigu users without possessing a Teigu herself.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163203-1NRtQtnP2y3O.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163203
      },
      "rarity": "rare"
    },
    {
      "id": "gamal",
      "name": "Gamal",
      "alt_names": [
        "ガマル"
      ],
      "role": "supporting",
      "description": "Gamal was a corrupt oil merchant who was eventually targeted by Night Raid under contract, and killed by Leone and Akame.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163205-RD0xtvQRJJOK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163205
      },
      "rarity": "rare"
    },
    {
      "id": "ibara",
      "name": "Ibara",
      "alt_names": [
        "イバラ"
      ],
      "role": "supporting",
      "description": "Ibara is one of the Four Temple Rakshasa Demons, a group of executioners who serve the Prime Minister. He can freely control his body to stretch his body parts and manipulate them. \n\nIbara seems to have a cocky and bloodthirsty personality, nearly attacking Seryu upon the first meeting of the Demons and the Jaegers. He admonishes Seryu for her skepticism of the Four Demon's abilities, and tells her that she and the Jaegers should \"Just sit back and drink wine in this mansion\".",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163206-llMXa3MPZsEN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163206
      },
      "rarity": "rare"
    },
    {
      "id": "aria-no-haha",
      "name": "Aria no Haha",
      "alt_names": [
        "アリアの母",
        "Aria's Mother"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163208-OCPDfoxvF7oS.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163208
      },
      "rarity": "rare"
    },
    {
      "id": "hana",
      "name": "Hana",
      "alt_names": [
        "鼻"
      ],
      "role": "supporting",
      "description": "Hana was a member of Team Stylish.\n\nHana (鼻 ・はな) mean \"nose\" in japanese",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163210-Uzb59QXnfhVq.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163210
      },
      "rarity": "rare"
    },
    {
      "id": "honest-daijin",
      "name": "Honest  Daijin",
      "alt_names": [
        "オネスト大臣",
        "Prime Minister"
      ],
      "role": "supporting",
      "description": "A large man with a demonic appearance, including a crown of horns that give the idea that they are growing out of his head. He manipulates Emperor Makoto and runs the Empire behind the scenes this way. He is the primary antagonist of the series, and hates Night Raid and the Revolutionary Army strongly. He is often shown eating. He cares very little for anything and will do anything to maintain his own power.\n\nIt is stated that Emperor Makoto only won the battle of succession due to the Prime Minister's influence and planning. The Prime Minister before him was Chouri. A man that was a kindhearted but strong will. A strong adviser to the former emperor, who desired to return to the capital to stop the decline of the empire. When the Prime Minister became aware of this he had Esdeath's force's (The \"Three Beasts\") to kill him. He is known to have one son named Syura who is currently the leader of the secret police Wild Hunt, and he is also known to have one blood relative named Iwokaru, who was killed by Night Raid.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163214-XeaLxeVOz5vS.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163214
      },
      "rarity": "rare"
    },
    {
      "id": "liver",
      "name": "Liver",
      "alt_names": [
        "リヴァ",
        "General Liver"
      ],
      "role": "supporting",
      "description": "Liver was the leader of Esdeath's personal bodyguards and the strongest group in her army, known as \"The Three Beasts\". He was a refined and battle-hardened man, who was deeply loyal to Esdeath. \n\nHe once was an accomplished General in the Empire's army and Bulat's superior years ago. During the Empire's war against the Southern Lands, he was dismissed from his post due to being framed on false charges when he did not give in to the Prime Minister's bribes. At the military tribunal he attempted to valiantly defend himself using his records and merits, but it fell on deaf ears.\n\nAfter ultimately being left to rot prison for the rest of his life Esdeath appeared, and in a surprising move she freed him on the condition that he would join her army. She valued his abilities and achievements, thinking that it would be a waste to leave him imprisoned. Esdeath also offered him patronage against the Prime Minister and his other enemies. Grateful for being saved and granted a new life back in the military, he became indebted to Esdeath, leading some of her most loyal men. When he and Bulat met once again for the first time in years on the cruise ship \"Ryussen\" with their paths in life having diverged, they battled to the death with their loyalty and ideals on the line.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163218-rmBxBDF6KV0b.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163218
      },
      "rarity": "rare"
    },
    {
      "id": "horimaka",
      "name": "Horimaka",
      "alt_names": [
        "ホリマカ",
        "Holimaca"
      ],
      "role": "supporting",
      "description": "Owner of the teigu: Adayasu, a scythe teigu whose abilities are a mystery. Because the empire is unaware of this teigu, Horimaka is Bolick's trump card.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163219-BDAweOWHf51J.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163219
      },
      "rarity": "rare"
    },
    {
      "id": "kubikiri-zank",
      "name": "Kubikiri Zank",
      "alt_names": [
        "首斬りザンク",
        "The Executioner"
      ],
      "role": "supporting",
      "description": "Zank was once an imperial executioner. Possess the Imperial Arm Spectator, that has the form of a headpiece with a large eye attached to it. He was known for severing the heads of his victims. Night Raid was contracted to track him down and kill him.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163223-kkhBpoiR1DPg.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163223
      },
      "rarity": "rare"
    },
    {
      "id": "me",
      "name": "Me",
      "alt_names": [
        "目"
      ],
      "role": "supporting",
      "description": "Me was a member of Team Stylish.\n\nMe (目 ・め) means \"eye\" in japanese",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163224-kDbv37OlZeiU.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163224
      },
      "rarity": "rare"
    },
    {
      "id": "nyau",
      "name": "Nyau",
      "alt_names": [
        "ニャウ"
      ],
      "role": "supporting",
      "description": "Nyau is a member of Esdeath's bodyguard \"The Three Beasts\". Despite his playful personality and innocent looks, he was by far the most sadistic member of the group with his hobby of collecting human faces. \n\nLike the other members he was charged by Esdeath to lure out Night Raid while getting rid of the Prime Minister's political enemies in secret. He battled with Tatsumi and Bulat aboard the cruise ship \"Ryuusen\" where he caused all the passengers to fall asleep by using his Teigu, Scream.\n\n~!He was the last of the Three Beasts to fall, killed by Tatsumi in one blow after activating Incursio.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163226-4QEWX19fpIKQ.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163226
      },
      "rarity": "rare"
    },
    {
      "id": "ogre",
      "name": "Ogre ",
      "alt_names": [
        "オーガ",
        "Auger",
        "Ooga"
      ],
      "role": "supporting",
      "description": "Ogre was a captain from the Capital Guard, and the former superior of Seryuu. He was also the one that recommended Dr. Stylish to Seryuu, as she wanted to become stronger.\n\nHe had been accepting bribes from an oil merchant named Gamal and other criminals, and often framed innocent people to take the fall for the criminals.\n\n~!Ogre was killed by Tatsumi, after he threatened to annihilate the client and her family.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163227-JPcbvg52nErN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163227
      },
      "rarity": "rare"
    },
    {
      "id": "rokugou",
      "name": "Rokugou",
      "alt_names": [
        "ロクゴウ"
      ],
      "role": "supporting",
      "description": "Rokugou was a general serving The Empire before his attempt of defection which failed. He was assassinated by Kurome and became one of her puppets.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163228-Y6MEIOWXHoBB.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163228
      },
      "rarity": "rare"
    },
    {
      "id": "trooma",
      "name": "Trooma",
      "alt_names": [
        "トローマ"
      ],
      "role": "supporting",
      "description": "He is a member of Team Stylish.\n\nTrooma is one of Dr. Stylish's stronger henchmen. It is unknown whether he had Dr. Stylish perform experiments on him or not.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163230-tYYxSeRGUw9a.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163230
      },
      "rarity": "rare"
    },
    {
      "id": "koutei",
      "name": "Koutei ",
      "alt_names": [
        "皇帝",
        "Emperor"
      ],
      "role": "supporting",
      "description": "Koutei is the young ruler of the empire. He is shown to be a naive young boy who wishes to lead his people to a bright future. Unfortunately, due to the Prime Minister's influence, he is largely ignorant to the suffering of his people, and is actually contributing to the collapse of The Empire.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163232-EqDGlt0T80uw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163232
      },
      "rarity": "rare"
    },
    {
      "id": "shura",
      "name": "Shura ",
      "alt_names": [
        "修羅",
        "Son of the Prime Minister"
      ],
      "role": "supporting",
      "description": "Shura is a mysterious individual who has recently begun to make his move. He seems to share his father's lust for power as well as his corruption but wishes to surpass him in terms of being rotten. He created and is leading the majorly corrupt and twisted Secret Police \"Wild Hunt\" to aid the Jägers and to compensate for their losses; however, he regards the empire as a toy. The incident in the theater implies he solely enjoys causing carnage.\n\nAlso much like Cosmina, Champ, and Enshin, Shura took part in the mass rape during the Umatora Theater incident where the producer denies the accusation of it's plays criticizing the Empire and tries to bribe Shura, but he declines the money in a heartbeat declaring the death sentence on them leading to the entire team being raped and killed by Wild Hunt in which Shura shows his twisted side by calling this action an investigation. He then mentions that this is all because Esdeath was not present in the Capital.\n\nAfter his devilish act, Shura joyfully tells his father how much of a kick he gets from leading Wild Hunt telling he made preparations to take out Night Raid. Along with his father, he watches the Great General Budo arrive.\n\n~!In Chapter 52, he tortures what he thinks is an unarmed Lubbock; however, Lubbock manages to trick Shura into removing his shackles. He then pulls some string out of his mouth and immediately kills Shura.\n!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163233-8ARWDCFjWwh4.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163233
      },
      "rarity": "rare"
    },
    {
      "id": "shoui",
      "name": "Shoui",
      "alt_names": [
        "ショウイ"
      ],
      "role": "supporting",
      "description": "He is the baron of the Empire.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163235-qwPlIqU10L1n.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163235
      },
      "rarity": "rare"
    },
    {
      "id": "natala",
      "name": "Natala",
      "alt_names": [
        "ナタラ"
      ],
      "role": "supporting",
      "description": "Natala was a member of the Empire's assassination group Group of Terror appearing in the prequel series Akame Ga Kill!: Zero until his death. He is now serving as one of Kurome's main corpse puppets.\n\nNatala is one of the members of Kurome's group of assassins. He died some time before the main story and his deceased body was reanimated by Kurome using Yatsufusa.\n\nHe is later use in a battle against Night Raid, defending Kurome from her enemies. After the battle, Natala became one of the last two puppets, the other being Dooya.\n\nNatala wielded Trisula. Mine mistakenly thought it was a Teigu, but it is in fact a Shingu. Because the weapon's design allows it to expand and contract at will, its style of killing is to cut the opponent's body in two. Natala bifurcated Chelsea with this weapon.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163236-zFavmKZNDaYI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163236
      },
      "rarity": "rare"
    },
    {
      "id": "kaku",
      "name": "Kaku",
      "alt_names": [
        "カク",
        "カクサン",
        "Kakusan",
        "角行",
        "Bishop "
      ],
      "role": "supporting",
      "description": "Kaku was a member of Team Stylish. He was considered to be one of the strongest among Dr. Stylish's minions.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163237-W5BSUzYsg1ds.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163237
      },
      "rarity": "rare"
    },
    {
      "id": "mimi",
      "name": "Mimi",
      "alt_names": [
        "耳"
      ],
      "role": "supporting",
      "description": "Mimi was a member of Team Stylish.\n\nMimi (耳・みみ) means \"ear\" in japanese",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163238-umiWK1SXL5oM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163238
      },
      "rarity": "rare"
    },
    {
      "id": "chouri",
      "name": "Chouri",
      "alt_names": [
        "チョウ"
      ],
      "role": "supporting",
      "description": "The former prime minister and the father of Spear.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163239-dkJYukRYKmwV.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163239
      },
      "rarity": "rare"
    },
    {
      "id": "numa-seika",
      "name": "Numa Seika",
      "alt_names": [
        "ヌマ・セイカ"
      ],
      "role": "supporting",
      "description": "Numa Seika was the Prince of the Northern Tribes. Know for his in combat and tactics abilities.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163240-q3DDi6CLjBVw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163240
      },
      "rarity": "rare"
    },
    {
      "id": "sten",
      "name": "Sten",
      "alt_names": [
        "シュテン"
      ],
      "role": "supporting",
      "description": "Sten is one of the Four Rakshasa Temple Demons who serve as the Prime Minister's squad of executioners. He seems to think of murdering as \"releasing one's soul.\"\n\nSten is a large man with a heavily muscled build similar to Ibara. He has a long braided hairstyle with hair sticking far out at the sides and bald at the top of his head. He has long bushy beard and mustache, bushy eyebrows, and dark prominent circles around his eyes. Similar to his fellow Rakshasa Demons, he wears armor plating on his forearms. He also wears a large Iron pauldron on his left shoulder.\n\n~!In Chapter 36, Lubbock hits him with a spear made of threads. Sten is able to withstand the attack, but Lubbock uses the threads that pierced Sten's body to cut his heart into pieces.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163242-SmXjdRNRLn1w.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163242
      },
      "rarity": "rare"
    },
    {
      "id": "toby",
      "name": "Toby",
      "alt_names": [
        "トビー"
      ],
      "role": "supporting",
      "description": "Toby was a member of Team Stylish.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163243-Du9rC4Jyf9br.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163243
      },
      "rarity": "rare"
    },
    {
      "id": "ieyasu",
      "name": "Ieyasu",
      "alt_names": [
        "イエヤス"
      ],
      "role": "supporting",
      "description": "Ieyasu was a childhood friend of Tatsumi and Sayo that set out on a journey to the capital to earn money for their village. He seemed to have a bad sense of direction and was a known troublemaker.\n\nDuring their journey, they were attacked by night bandits which separated them. He managed to stay with Sayo and got invited by Aria to her mansion. They were served with a meal that made them lose consciousness. He was put on drugs which made him suffer from the \"Lubora disease.\" He survived until Tatsumi and Night Raid arrived at the place where he, Sayo, and other people that were lured by Aria and her family, were imprisoned. He seems to be glad when Tatsumi killed Aria. He then succumbed to the last stages of \"Lubora disease.\"\n\nIeyasu was shown to wield an axe. He presumably possessed combat abilities on par with Tatsumi, as they and Sayo trained together since they were little.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163244-3AyXXcJw9yGl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163244
      },
      "rarity": "rare"
    },
    {
      "id": "sayo",
      "name": "Sayo",
      "alt_names": [
        "サヨ"
      ],
      "role": "supporting",
      "description": "She set out with Tatsumi and Ieyasu to earn money for their village. On the way, they were attacked by night bandits and got separated. Sayo managed to stay with Ieyasu while Tatsumi was separated from them. She and Ieyasu were then invited by Aria to her mansion, and she provided them with a meal that was drugged, making them lose consciousness. Sayo was then tortured to death, although she didn't submit to Aria and her family even until the moment of her death. Tatsumi personally slays Aria after he is told the truth about Aria and her sadistic family. There is a chance that Tatsumi was in love with her, as the illusion that Zank showed revealed her to be the most important person in the world to him.\n\nSayo was seen carrying a bow and a stack of arrows. She seemed to have good combat abilities and presumably was a well-trained archer, as Tatsumi stated that both she and Ieyasu were strong.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163245-uZdzQXyuY9PP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163245
      },
      "rarity": "rare"
    },
    {
      "id": "gebaze",
      "name": "Gebaze",
      "alt_names": [
        "ゲバゼ"
      ],
      "role": "supporting",
      "description": "__Eye Color:__ Black\n__Hair Color:__ Black\n\n__Gebaze__ was the Head of Public Finance of The Empire. He was a large man with dark hair and a small mustache who wore clothing resembling those of a sultan. Additionally around his neck he wore a golden jeweled necklace.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166786-yuJaZ13H4TLO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166786
      },
      "rarity": "rare"
    },
    {
      "id": "shihandai",
      "name": "Shihandai",
      "alt_names": [
        "師範代"
      ],
      "role": "supporting",
      "description": "__Eye Color:__ Dark Blue\n__Hair Color:__ Blond\n\n__Shihandai__ is a rather tall man with long, blond hair which he wore in a braid. His outfit consists of a lightly armored, long white shirt and grey pants. He also wears a belt around his wasit and around his chest to attach his shoulder pieces. He was one of the bodyguards in charge of Iokal's protection, and a former instructor at the martial arts temple of The Empire.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166787-SNdn2yZNxldm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166787
      },
      "rarity": "rare"
    },
    {
      "id": "esdeath-no-chichi",
      "name": "Esdeath no Chichi",
      "alt_names": [
        "エスデスの父",
        "Esdeath's father"
      ],
      "role": "supporting",
      "description": "Esdeath's Father was a tribal leader of the Partas Clan. He taught Esdeath her primary survival skills and honed her hunting abilities. \n\nHe is a tall middle-aged man with light blue hair worn in a mullet-like style, as well as a short beard, and blue eyes. He wears tribal clothing consisting of a black short-sleeved turtleneck shirt, a long white kimono, and a red vest on top of it, with a sash on his waist and a golden medallion around his neck. He also wears a black headband with his clan's symbol on it.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166788-GJg2pqDfCCH0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166788
      },
      "rarity": "rare"
    },
    {
      "id": "the-first-emperor",
      "name": "The First Emperor",
      "alt_names": [
        "始皇帝",
        "Shikoutei"
      ],
      "role": "supporting",
      "description": "__Eye Color:__ Green\n__Hair Color:__ Green\n\n__Introduction:__\nThe First Emperor was the Empire's founder over a thousand years prior to the massive rebellion and the one who the prompted for the creation of more advanced weaponry that would serve as a means to protect his country.\n\n__Appearance:__\nHe is a middle-aged man with green hair, green eyes, and a beard. He wears what is now a standard attire for an Emperor, which consists of a blue mantle, a large headdress, and a golden scepter.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166790-lqLQrhMbOXPt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166790
      },
      "rarity": "rare"
    },
    {
      "id": "kaiser-frog",
      "name": "Kaiser Frog",
      "alt_names": [
        "カイザーフロッグ"
      ],
      "role": "supporting",
      "description": "__Abilities:__ Dissolving Acid, Enhanced Tongue\n\n__Introduction:__\nKaiser Frog is a giant, frog type Danger Beast species\n\n__Appearance:__\nIt has the appearance of a giant, frog creature. It is green with red spots and yellow eyes. It was considered the strongest of all frogs in the world and was known to have incredibly strong stomach acid that can dissolve anything they swallow. It also has a long tongue which can be used to grab prey.\n\n~! Thie particular Kaiser Frog was revealed during Kurome and Bols' battle against Night Raid to be one of Kurome's newest puppets. !~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166791-crB47TNpVwh0.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166791
      },
      "rarity": "rare"
    },
    {
      "id": "henter",
      "name": "Henter",
      "alt_names": [
        "ヘンター"
      ],
      "role": "supporting",
      "description": "__Henter__ was a survivor of the Ban Tribe. He was known to possess remarkable skill with knives, and for his tricky movement. He was killed by Kurome and was turned into one of her corpse puppets.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166793-PgblNwFnf84S.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166793
      },
      "rarity": "rare"
    },
    {
      "id": "kije",
      "name": "Kije",
      "alt_names": [
        "キジェ"
      ],
      "role": "supporting",
      "description": "__Age:__ Mid 20s\n__Eye Color:__ Purple\n__Hair Color:__ Light Brown\n\nKije is Bols' wife. She is known to be cheerful, very loving and caring towards Bols.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166794-FZNRsO767mx4.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166794
      },
      "rarity": "rare"
    },
    {
      "id": "the-lord",
      "name": "The Lord",
      "alt_names": [],
      "role": "supporting",
      "description": "__Eye Color:__ Purple\n__Hair Color:__ White\n\nThe Lord is the leader of the largest religious organization in the east of the Empire, The Path of Peace. He is a tall, slender man with the Path of Piece necklace around his forehead and long white hair. He wears priest-like clothing. \n\nHe is said to be part Danger Beast, however, the details of this heritage are unknown.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166795-TDmr977acwoH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166795
      },
      "rarity": "rare"
    },
    {
      "id": "ritone",
      "name": "Ritone",
      "alt_names": [
        "リトネ"
      ],
      "role": "supporting",
      "description": "Ritone is one of the spies for the Revolutionary Army. He is partnered up with [Pais.](https://anilist.co/character/166798)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166797-JGc8braxXXV7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166797
      },
      "rarity": "rare"
    },
    {
      "id": "pais",
      "name": "Pais",
      "alt_names": [
        "パイス"
      ],
      "role": "supporting",
      "description": "Pais is one of the spies for the Revolutionary Army. She's partnered with [Ritone](https://anilist.co/character/166797).",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166798-A5ocJ46DAvf2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166798
      },
      "rarity": "rare"
    },
    {
      "id": "bill",
      "name": "Bill",
      "alt_names": [
        "ビル",
        "Uncle Bill"
      ],
      "role": "supporting",
      "description": "Bill (otherwise known as Uncle Bill) was the leader of The Empire's assassination group, Group of Terror.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166799-DrqGNfnvZcy8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166799
      },
      "rarity": "rare"
    },
    {
      "id": "death-tagool",
      "name": "Death Tagool",
      "alt_names": [
        "デスタグール"
      ],
      "role": "supporting",
      "description": "__Class:__ Super Class\n__Abilities:__ Energy Beams, Enhanced Physical Abilities\n\nDeath Tagool is a giant dinosaur-like Danger Beast species.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166800-LmGpGobuF9ko.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166800
      },
      "rarity": "rare"
    },
    {
      "id": "logue",
      "name": "Logue",
      "alt_names": [
        "ローグ"
      ],
      "role": "supporting",
      "description": "Bols' daughter.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166801-SBSz9JBbt4Vr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166801
      },
      "rarity": "rare"
    },
    {
      "id": "jijo",
      "name": "Jijo",
      "alt_names": [
        "侍女",
        "Palace Maid"
      ],
      "role": "supporting",
      "description": "The Palace maid was one of the revolutionaries who was tasked with assisting Tatsumi and Lubbock with infiltrating the royal palace.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166803-nE0BQiPrXQiD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166803
      },
      "rarity": "rare"
    },
    {
      "id": "iokal",
      "name": "Iokal",
      "alt_names": [
        "ロラク"
      ],
      "role": "supporting",
      "description": "Iokal was a blood relative of the Prime Minister Honest.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166806-ausiSBK0YOzj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166806
      },
      "rarity": "rare"
    },
    {
      "id": "bolic",
      "name": "Bolic ",
      "alt_names": [
        "ボリック"
      ],
      "role": "supporting",
      "description": "Bolic was a spy working for the Prime Minister Honest posing as a high-ranking individual of the Path of Peace. His goal was to kill the leader of the Path of Peace without revealing his true identity and take his place, so that the Empire could manipulate the religious organization for its own purposes.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166807-d9JXKVdbobTK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166807
      },
      "rarity": "rare"
    },
    {
      "id": "apeman",
      "name": "Apeman",
      "alt_names": [
        "エイプマン"
      ],
      "role": "supporting",
      "description": "Apeman is a large, gorilla-like Danger Beast species.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166808-Kd99c9RAALba.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166808
      },
      "rarity": "rare"
    },
    {
      "id": "wall",
      "name": "Wall",
      "alt_names": [
        "ウォール"
      ],
      "role": "supporting",
      "description": "Wall was a famous guardsmanwho used a riot shield as his main weapon.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166809-S6ZkXhzHcUvo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166809
      },
      "rarity": "rare"
    },
    {
      "id": "hekatonkheires",
      "name": "Hekatonkheires",
      "alt_names": [
        "魔獣変化",
        "Coro",
        "Koro",
        "Hecatoncheir",
        "ヘカトンケイル"
      ],
      "role": "supporting",
      "description": "Magical Beast Transformation: Hekatonkheires, also known by its nickname Koro, was a biological Teigu owned by Seryu Ubiquitous who was often seen with her.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b198089-j36dnk4VAb5o.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 198089
      },
      "rarity": "rare"
    },
    {
      "id": "shoufu",
      "name": "Shoufu",
      "alt_names": [
        "娼婦",
        "Prostitute"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b244784-RgDevIH9427d.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 244784
      },
      "rarity": "rare"
    },
    {
      "id": "air",
      "name": "Air",
      "alt_names": [
        "エア"
      ],
      "role": "minor",
      "description": "Air was one of three girls who were sold to Bach, due to their village being deeply in debt by the over taxation of the Empire.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163196-nFEG903C3o9T.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163196
      },
      "rarity": "uncommon"
    },
    {
      "id": "fal",
      "name": "Fal",
      "alt_names": [
        "ファル"
      ],
      "role": "minor",
      "description": "Fal was one of three girls who were sold to Bach, due to their village being deeply in debt by the over taxation of the Empire.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163207-ROByovVX36gO.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163207
      },
      "rarity": "uncommon"
    },
    {
      "id": "luna",
      "name": "Luna",
      "alt_names": [
        "ルナ"
      ],
      "role": "minor",
      "description": "Luna was one of three girls who were sold to Bach, due to their village being deeply in debt by the over taxation of the Empire.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b163215-kdb4ZRbob4se.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 163215
      },
      "rarity": "uncommon"
    },
    {
      "id": "gin",
      "name": "Gin",
      "alt_names": [
        "銀"
      ],
      "role": "minor",
      "description": "__Eye Color:__ Cyan (Manga), Grey (Anime)\n__Hair Color:__ Blonde (Manga), Silver (Anime)\n\n__Introduction:__\nGin was a member of the Empire's assassination group Group of Terror.\n\n__Appearance:__\nShe is a young girl with silver hair worn in a long ponytail. She wears a sleeveless trench coat with a dark belt, black tights, boots and gloves.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166789-Gk1BXJJjQKBf.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166789
      },
      "rarity": "uncommon"
    },
    {
      "id": "cornelia",
      "name": "Cornelia",
      "alt_names": [
        "コーネリア",
        "Cora"
      ],
      "role": "minor",
      "description": "__Height:__ 168 cm (5'6'')\n__Eye Color:__ Blue\n__Hair Color:__ Blonde\n\n__Introduction:__\nCornelia was a member of the Empire's Assassination group (former group of Akame).\n\n__Appearance:__\nCornelia is a young girl with long blonde hair and blue eyes. She wears a long white shirt with black pants and shoes. She also wears silver hoop earrings.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166792-nz7IVpzkZaHz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166792
      },
      "rarity": "uncommon"
    },
    {
      "id": "najasho",
      "name": "Najasho",
      "alt_names": [
        "ナジャショ"
      ],
      "role": "minor",
      "description": "__Height:__ 162 cm (5'4'')\n__Eye Color:__ Golden\n__Hair Color:__ Blond\n\nNajasho is a member of the Empire's Assassination group (former group of Akame). He is the leader of the Elite Seven and is called \"Chief\" by the members.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166796-n8B2CiXLt6Mx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166796
      },
      "rarity": "uncommon"
    },
    {
      "id": "guy",
      "name": "Guy",
      "alt_names": [
        "ガイ"
      ],
      "role": "minor",
      "description": "Guy was a member of the Empire's Assassination group (former group of Akame).",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166802-wSN9GZF1wv1w.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166802
      },
      "rarity": "uncommon"
    },
    {
      "id": "green",
      "name": "Green",
      "alt_names": [
        "グリーン"
      ],
      "role": "minor",
      "description": "Green is a member of the Empire's Assassination group (former group of Akame)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166804-qJgOG1aH9YxF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166804
      },
      "rarity": "uncommon"
    },
    {
      "id": "tsukushi",
      "name": "Tsukushi",
      "alt_names": [
        "ツクシ"
      ],
      "role": "minor",
      "description": "Tsukushi was a member of the Empire's Assassination group (former group of Akame).",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166805-palcsJCVdiaG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166805
      },
      "rarity": "uncommon"
    },
    {
      "id": "poney",
      "name": "Poney",
      "alt_names": [
        "ポニ",
        "Pony"
      ],
      "role": "minor",
      "description": "Poney is a member of The Empire's assassination group Elite Seven (former group of Akame). She uses the Shingu Yocto-bottoms.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b166810-1fy5St1ti6sX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 166810
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-22T23:35:25.092Z"
}