{
  "work_id": "slam-dunk",
  "count": 40,
  "characters": [
    {
      "id": "hanamichi-sakuragi",
      "name": "Hanamichi Sakuragi",
      "alt_names": [
        "桜木花道",
        "Tensai Baskettoman",
        "The Rebound King",
        "Basket Genius"
      ],
      "role": "protagonist",
      "description": "__Height:__ 189.2 cm\n__Jersey Number:__ #10\n__Position:__ Power Forward\n\nAt the beginning, Sakuragi was a slacker, always trying to ask girls out but getting constantly rejected (the 50th rejection occurring at the start of the series). He then met Akagi Haruko, with whom he fell in love immediately. This passion led to him joining the Shohoku basketball team. However, as a complete beginner, he was not able to keep up with the rest of the team at first despite his physical attributes (great height, athleticism, stamina, speed and leaping ability). He regards himself as a genius though, with self-confidence that borders on arrogance. His most recognizable trait is his red hair, though he shaves his head as reparation for an error that led to the loss against Kainan.  At first, Sakuragi was known for his poor basketball skills as a beginner; in his first few official matches, he fouled out every game. However, his basketball skills advanced throughout the series. First he developed his basic skills, such as dribbling and layups. Then, trained by Akagi, he became a formidable rebounder; his rebounding became his claim to fame throughout the latter half of the series. He also is seen more than once defining the match for Shohoku in the last seconds, for instance, by dunking a ball that Akagi would have missed in the league round match with Ryonan. His jump shooting was then developed by Coach Anzai, who had him make 20,000 shots in a week. He hit a buzzer-beating jump shot to win the match against Sannoh. However, he also injured his back during the match against Sannoh, and underwent rehabilitation after Shohoku's subsequent loss to Aiwa Academy.  In spite of the setbacks he has had to face, Sakuragi displays a great deal of tenacity and determination that carry him through and help reciprocate for his other failings, both on and off the court. Although his love for Haruko and rivalry with Rukawa are the main driving forces motivating him to succeed in basketball, his injury during the Sannoh match makes him realize that he has actually come to love the game, leading him to give his all for his team and bring them victory.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b310-OJSiQRpJBsOE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 310
      },
      "rarity": "epic"
    },
    {
      "id": "kaede-rukawa",
      "name": "Kaede Rukawa",
      "alt_names": [
        "流川楓",
        "Super Rookie"
      ],
      "role": "protagonist",
      "description": "__Height:__ 187 cm (6'2\")\n__Position:__ Small Forward, SF\n\nKaede Rukawa is Sakuragi's rival as well as almost his opposite; he is attractive to girls, skilled at basketball, and very cold and unfeeling. The only traits they share are that they are not academically inclined and good fighters. He regards Sakuragi as an idiot and both normally fight. Actually, he knows Sakuragi can put his talents to a better use, but is ashamed to see the immaturity with which he deals with things. His hobby is sleeping, and is usually seen asleep whenever he's not on the court; he can even ride his bike while asleep often crashing with objects when doing so. Waking Rukawa from a nap is considered unforgivable, since he will almost automatically beat up the culprit. Unsurprisingly, he has also been in his fair share of off-court fights, but can hold his own. Rukawa's goal is to be the best high school player in Japan, and he considers Sendoh of Ryonan to be his greatest rival. A fact being that he is often nicknamed the \"super-rookie\", the \"ace of Shohoku\", even.   \n\nRukawa is extremely good at basketball, and possesses a wide range of skills to complement his height, athleticism and drive to win. Despite being merely a first-year high school player, he is the undisputed ace of Shohoku's team. In the Kanagawa Interhigh Tournament, he was named one of the top five players, the only first year player so honored. He has managed to change the course of many games, such as when he single-handedly brought Shohoku back from a double-digit deficit against Kainan (Rukawa scored 15 straight points for Shohoku in 2 minutes and 5 seconds just before the end of the first half). However, his style was criticized as being too selfish, and he sometimes comes into conflict with his teammates for various reasons; this was one of the reasons why Coach Anzai refused to give him his blessing when Rukawa told him that he intended to go to the USA, and told him to become the best in Japan before he even thought of it. When he was outplayed by Sawakita during the match against Sannoh Technical, though, he realized what Sendoh reminded him as a challenge: To defeat Sendoh, Rukawa had to change his style and pass the ball. It was his pass that led to Hanamichi's buzzer-beating shot, winning the match. Rukawa is subsequently named a member of the All-Japan basketball team.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b311-uxwHnw9lXk4e.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 311
      },
      "rarity": "epic"
    },
    {
      "id": "ryouta-miyagi",
      "name": "Ryouta Miyagi",
      "alt_names": [
        "宮城リョータ",
        "Lightning",
        "Shorty",
        "Ryo-chin"
      ],
      "role": "protagonist",
      "description": "__Height:__ 168 cm (5'6)\n__Position:__ Point Guard (PG)\n\nHe joined the basketball team because of his love for the game in the first place. But soon it seems that he is also playing for the love of his life Ayako, the team manager. Although Ryonan's coach asked him to join the Ryonan Basketball Team, Miyagi chose for Shohoku because of Anzai. Miyagi is a problem kid, he gets into fights a lot and gets himself beaten up.\n\nMiyagi is a smart but kinda rude person, who is only nice and sweet to Ayako. He tried to date other girls to forget Ayako, but he failed to. So he can be a very sensitive person too. Miyagi is a bit short-tempered sometimes and hates when people make fun of his height.",
      "metadata": {
        "gender": "male",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b312-QZ0Jv451096U.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 312
      },
      "rarity": "epic"
    },
    {
      "id": "hisashi-mitsui",
      "name": "Hisashi Mitsui",
      "alt_names": [
        "三井寿",
        "Mit-chan",
        "Mit-chin",
        "Mitchi",
        "Man of Fire"
      ],
      "role": "protagonist",
      "description": "__Year:__ 3rd Year \n__Height:__ 184 cm (6 ft ½ in) \n__Shoe Brand:__ Asics \n__Jersey Number:__ 14 \n__Position:__ Shooting Guard \n\nBefore joining Shohoku, Mitsui Hisashi was an MVP for Takeishi Junior High. Despite having opportunities to join more prestigious high schools like Ryonan, he choose to go to Shohoku because of Coach Anzai; Anzai had given him the courage to win in the Junior High tournament by encouraging him during the last seconds of the match. However, an injury to his left knee in a training session interrupted his basketball career. An imprudent early return to the basketball court reinjured the knee more severely, leading to a basketball hiatus of over a year.  Although he eventually healed, he was embittered by his exclusion from the court, and Mitsui quit basketball and became the leader of a gang. His gang got in a fight with Miyagi, and during the fight Miyagi beat Mitsui senseless before taking a beating himself. Afterwards, Mitsui attempted to ruin the basketball team by instigating them into fighting with his gang, as the team would have been banned from competition for fighting. In the end, Sakuragi's own gang - Yohei, Takamiya, Ohkusu and Noma - voluntarily took the blame for the fight, and Mitsui was filled with remorse when he saw Anzai again. He rejoined the team and vowed never to fight again.  Mitsui is best known on the team as a three-point specialist, though his skills extend to other areas; during a practice match, he once managed to shut down Sakuragi, playing center. His defensive ability completely shut down Fukuda's scoring abilities. His three-pointers helped Shohoku catch up when they were 12 points down against Shoyo, and again when the team was 20 points down against Sannoh in the National Championships. His greatest weakness, though, is his lack of stamina due to his long break from playing basketball. Thus, in the latter halves of games, he has not always been as reliable - he missed a potential game-winning shot against Kainan, and collapsed on-court during the game against Ryonan. \n\n(Source: hoopiedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b313-D720Nz8fAUxw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 313
      },
      "rarity": "epic"
    },
    {
      "id": "takenori-akagi",
      "name": "Takenori Akagi",
      "alt_names": [
        "赤木剛憲",
        "Gori"
      ],
      "role": "protagonist",
      "description": "__Year:__ 3rd Year \n__Height:__ 197 cm \n__Jersey Number:__ #4 \n__Position:__ Center \n\nTakenori Akagi is the captain of the Shohoku basketball team and Haruko's older brother. Despite at first not thinking too much of Sakuragi (who addresses him as \"Gori\" for gorilla due to his immense physical presence), he actually realizes Sakuragi's potential as a basketball player. Serious and disciplined, Akagi's dream is to lead Shohoku to the national championship. His determination is shown in the match against Kainan, where he played on despite a serious injury to his ankle. Akagi considers Uozumi of Ryonan to be his biggest rival, though their rivalry is not antagonistic; indeed, there is respect that borders on friendship.  Akagi differs from the other starters in two respects. First, he is the most academically talented out of all them and is considered a model student. After the loss to Aiwa knocks Shohoku out of the Nationals, Akagi leaves the team along with Kogure to study for the college entrance exams. In contrast, the other four had to beg their teacher to be given the chance to retake some exams they had flunked; they would otherwise have been disqualified from playing in the Nationals for having failed too many classes. Second, Akagi is the only starter not to have gotten into an actual fight, although he has used physical force against his own players (most notably Sakuragi, and once Mitsui after the gym fight) to keep them in line. He is the only other character besides Rukawa able to take one of Sakuragi's trademark headbutts without being knocked out and the only other character who has had Sakuragi inadvertently dunk a ball on his head (Murasame of Miuradai was the second, in the manga; in the anime, the second one to be dunked on the head is Naito, also from Miuradai).  Regarded as the best center in the Kanagawa prefecture, Akagi plays as a fairly typical center, using his height and power to score close to the basket. He also has a reputation for being a virtually unbeatable defender. As captain of the team, he keeps discipline among his players during matches. Akagi met his match during the game against Sannoh, in the form of Masashi Kawata, considered one of the best centers at the high school level. Initially intimidated when Kawata outplayed him, he regained his confidence thanks to Uozumi's encouragement and led his team to victory.  \n\n(Source: hoopedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b314-MPvsR4ndNZDd.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 314
      },
      "rarity": "epic"
    },
    {
      "id": "akira-sendou",
      "name": "Akira Sendou",
      "alt_names": [
        "仙道彰"
      ],
      "role": "supporting",
      "description": "The ace of Ryonan High School who is considered one of the top players in Kanagawa.\n\nHe is known to be an easygoing, carefree and optimistic person who usually doesn't take much of anything seriously but when it comes to basketball, he seems to enjoy accepting challenges, mostly on 1 on 1 game.\n\n(Source: Slam Dunk Fandom)",
      "metadata": {
        "gender": "male",
        "age": "16-17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3403-YkPE1BmqEGGn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3403
      },
      "rarity": "uncommon"
    },
    {
      "id": "kiyota-nobunaga",
      "name": "Kiyota Nobunaga",
      "alt_names": [
        "清田信長"
      ],
      "role": "supporting",
      "description": "__Year:__ 1st yr\n__Height:__ 178 cm\n__Jersey Number:__ #10\n__Position:__ SF\n\nNobunaga Kiyota is what could be called the personification of arrogance (something like Kainan's parallel to Sakuragi, only slightly more skilled during the events of the Kanagawa Trials). He is always bragging about how he's the real star rookie of Kanagawa, instead of Rukawa. However, he tends to underestimate other teams, especially Shohoku, and this can lead to embarrassing situations, such as when Akagi flattened him with a dunk, and also when Sakuragi faked past him and scored. Kiyota likes to call Hanamichi &quot;Red-furred Monkey&quot; while Hanamichi calls him &quot;Wild Monkey.&quot; Despite being so arrogant, Kiyota has a high level of respect towards his teammates, especially towards his captain Maki.    Kiyota is known for his leaping ability and ball-handing skills. Despite being only 178 cm, he can dunk and block shots quite regularly. He memorably dunked over Uozumi during Kainan's match against Ryonan despite Uozumi's height. Kiyota is the only starter for Kainan who is a 1st year.\n\n(Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8389-EOuhBm7HrtT8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8389
      },
      "rarity": "uncommon"
    },
    {
      "id": "toru-hanagata",
      "name": "Toru Hanagata",
      "alt_names": [
        "花形透"
      ],
      "role": "supporting",
      "description": "__Height:__ 197 cm\n__Year:__ 3rd Year  \n__Position:__ Center  \n__Jersey Number:__ #5  \n\nHanagata is considered one of the top centers in the Kanagawa prefecture. He mixes strength and tactical skill in his playing, being able to easily avoid defensive play. When Fujima is not on the court, he takes the role of captain, being responsible for psyching up the team. For this, he is quite a trustworthy player for Shoyo. He is known for his fade-away shot, which is difficult to block. Hanagata is the only starter shown to wear glasses, though they are knocked off his face when Sakuragi commits his fourth foul, and Hanagata plays the rest of the match without them. Hanagata holds his own in the Shohoku match against Akagi, but when he is matched up with Sakuragi, he is totally outclassed in rebounding. \n\nBeing a top center, he is quite agile for his height. He takes on the cudgels of scoring for his team when Fujima is not on the court. He also knows how to use his teammates effectively. He and Nagano are knocked off by Sakuragi after the latter dunks on them, but despite the effort, Sakuragi still got his fifth foul. Nevertheless, he is cheered by the fans. Hanagata also missed a desperate three-point attempt against Shohoku, marking the final score, 62-60.",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8450-axm4NDis9L93.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8450
      },
      "rarity": "uncommon"
    },
    {
      "id": "kiminobu-kogure",
      "name": "Kiminobu Kogure",
      "alt_names": [
        "木暮公延"
      ],
      "role": "supporting",
      "description": "__Year:__ 3rd Year  \n__Height:__ 178 cm  \n__Jersey Number:__ #5  \n__Position:__ Small Forward  \n\nKiminobu Kogure is Shohoku's vice-captain and a good friend to Akagi and Mitsui. He and Akagi are the only two players who have been on the team for all three years - Mitsui left during their first year, while other players quit the team because they found Akagi's training regimen to be too strenuous. Along with Miyagi and Ayako, he always tries to bring out the most of Hanamichi's talent. He is gentle, empathic, and always friendly, and is almost never seen without his glasses on (this is why Sakuragi calls him \"Megane-kun\" which loosely translates as \"glasses-wearing guy\"); however, when needed he shows notable willpower and brutal honesty, such as when he barely flinched after being slapped twice and cruelly insulted by the embittered Mitsui during the gym fight.   Despite spending a lot of time on the bench, Kogure brings experience and considerable firepower to the team when he's on the court; he is the player most likely to be subbed in to replace one of the starters. A pretty good shooter and tactician, he hit a crucial three-pointer against Ryonan.   (Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8451-7nS7RUkepKmG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8451
      },
      "rarity": "uncommon"
    },
    {
      "id": "haruko-akagi",
      "name": "Haruko Akagi",
      "alt_names": [
        "赤木晴子"
      ],
      "role": "supporting",
      "description": "__Year:__ 1st Year  \n\nHaruko Akagi is the younger sister of Takenori Akagi and the love interest of Hanamichi Sakuragi who was responsible for uncovering his potential in basketball.\n\nShe is a kind, sweet and friendly girl with a captivating personality who is always around to cheer on the players, especially her brother Takenori Akagi, who is extremely protective of her and taught her the basics of basketball, and Hanamichi Sakuragi, whom she considers her best friend. Haruko often appears at matches together with Sakuragi's cohorts and her two best friends, Fujii and Matsui. She, like most girls in Shohoku, has a strong obsession for Kaede Rukawa, although he never reciprocates her feelings and, later , she acknowledges that he will not love her the way she wants him to and tries to let go of her crush, however unsuccessfully.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/8485.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8485
      },
      "rarity": "uncommon"
    },
    {
      "id": "yohei-mito",
      "name": "Yohei Mito",
      "alt_names": [
        "水戸洋平"
      ],
      "role": "supporting",
      "description": "Sakuragi's best friend.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b9721-XPim17gJHSCT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9721
      },
      "rarity": "uncommon"
    },
    {
      "id": "shinichi-maki",
      "name": "Shinichi Maki",
      "alt_names": [
        "牧紳",
        "Old Man"
      ],
      "role": "supporting",
      "description": "__Year:__ 3rd Year    \n__Height:__ 184 cm\n__Jersey Number:__ #4    \n__Position:__ Point Guard/Center (if Takasago is out)    \n\nShinichi Maki is reputed to be the best player in the whole prefecture of Kanagawa. Captain of Kainan High, he exerts great leadership over his team, being quite a field leader whose orders are followed to the letter by his teammates. Though not as strict in personality regularly, he can be as strict as Akagi, but mostly only towards Kiyota. Sakuragi calls him, \"Old Man\" because he looks older than he really is; Maki responds by pointing out that Akagi looks even older. Kenji Fujima is considered his primary rival.    \n\nMaki plays mostly as a point guard, although he has the all-round skills to play in virtually any other position. Extremely muscular and strong, he likes to use his physical attributes to drive into the lane to score while drawing fouls. His scoring ability is incredibly difficult to stop and in one game four players from Shohoku were needed to completely shut him down. When teams double or triple-team him, he can then pass the ball to open teammates on the perimeter, such as Soichiro Jin, for open three-point shots. Maki uses his height and power to create mismatches against other point guards, which his team usually capitalizes on effectively.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12798-ZZ3VQRcNXCyT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12798
      },
      "rarity": "uncommon"
    },
    {
      "id": "kenji-fujima",
      "name": "Kenji Fujima",
      "alt_names": [
        "藤真健司"
      ],
      "role": "supporting",
      "description": "__Height:__ 178 cm  \n__Year:__ 3rd Year  \n__Position:__ Point Guard/Coach \n__Jersey Number:__ #4   \n\nKenji Fujima is the player/coach of Shoyo High. As such, he only enters the court when his presence is really needed, such as when the team is behind and struggling. Fujima is so respected by his teammates that as much as possible they try not to make it necessary for him to get on the court, and even the hint of his getting off the bench to join them inspires them to play harder. His personality also varies depending on which role he is playing in the game; as a coach and off the court, he is calm, mild-mannered, and friendly (he even personally deals with his fangirls and is very kind to them), but he becomes confident, high-spirited and even ruthless when he's on court. As Maki says in volume #10, \"As a player, he's far from rational.\"\n\nFujima plays as a typical point guard, leading his team and passing the ball, but also shooting and scoring when necessary. He is one of the top point guards in the Kanagawa prefecture and a force to be reckoned with on the court.   Fujima is referenced during the first round of the National Championships when Shohoku plays against Toyotama High School. Toyotama's captain, Tsuyoshi Minami, known as the \"Ace Killer\" injured Fujima in a match resulting in his removal from the game due to his injury. Subsequently, Shoyo lost the match to Toyotama. Throughout the National Championships, there are occasional cut scenes showing Fujima training.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12799-bxHmT7J9UEOt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12799
      },
      "rarity": "uncommon"
    },
    {
      "id": "mitsuyoshi-anzai",
      "name": "Mitsuyoshi Anzai",
      "alt_names": [
        "White-Haired Buddha",
        "Demon"
      ],
      "role": "supporting",
      "description": "The coach of the Shohoku High basketball team, and one of the best ones in Japan. Even the coaches of other teams call him \"Anzai-sensei\" with respect. His calm and collected attitude contrasts with the temper he had in the past, when he was nicknameed \"White-Haired Devil\" as a demanding college coach.  A talented player, Ryuji Yazawa, trained under him and was eyed with high regard by Anzai. However, Yazawa was unhappy about Anzai's tough training for him (especially the repetitive and strenuous basic technique training), and against the Coach's wish, left Japan to play in the USA, where he thought he would have better opportunities to show his talent. 5 years passed without any news, other than an unaddressed video tape showing Yazawa playing in a team, whose players had virtually no concepts of teamwork. One day Anzai learned from the press that Yazawa died in a high-speed head-on car collision, reportedly under drug influence. While visiting Yazawa's grave, Yazawa's mother gave Anzai a letter written 4 years prior, which Yazawa never had the courage to post back. In the letter, Yazawa expressed profound regret about his rebellious decision to leave, and the depression from his experience in the unsupportive American college basketball career. Anzai grieved deeply for the loss of Yazawa and resigned from college basketball coaching ever since. This also changed Anzai's former strict attitude to his now mild temper, for which he is now known as the \"White-Haired Buddha.\"  Sakuragi always calls Coach Anzai \"Oyaji\" (old man) and has the habit of jiggling his fat when hyped, which makes the others - Mitsui in particular - mad at him, as this is considered disrespectful. Anzai, however, appears to tolerate this and has not reprimanded Sakuragi for his behavior. However, Anzai did punish the four players (Mitsui, Miyagi, Sakuragi and Rukawa) involved in the fight against Mitsui's gang, by initially benching them during the first interhigh tournament match against Miuradai High School.  However behind such an impassible demeanor is a brilliant strategist, who always knows how to turn the tide of a match for his team. Anzai like Haruko Akagi, realized Sakuragi's potential early on and decided to make him a starter even though some of his basketball skills were not yet par. Recognizing that shooting was Sakuragi's weakness, he made him make 20,000 baskets in a week to get ready for the national tournament. Anzai is also very charismatic and able to inspire his players to greater heights, as evidenced before the match against Sannoh, where he managed to bring down the insecurity within Miyagi, Mitsui and, to a lesser extent, Sakuragi. Although they were directly recruited by Coach Moichi Taoka of Ryonan, both Mitsui and Ryota turned him down, citing Anzai's presence at Shohoku as the primary factor. Mitsui respects Anzai the most, and once put a picture of him on the bench and prayed to it when Anzai was unable to come to the inter-high Shohoku-Ryonan match due to heart attack.\n\n(Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/12862.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12862
      },
      "rarity": "uncommon"
    },
    {
      "id": "kicchou-fukuda",
      "name": "Kicchou Fukuda",
      "alt_names": [],
      "role": "supporting",
      "description": "Fukuda is the other ace Ryonan has up their sleeve. His offensive power rivals many of the best players in the Kanagawa prefecture and is seen throughout the series doing alley oops with Sendoh as the passer but his defensive ability is weak and can be easily exploited. He has something of a special rivalry going on with Hanamichi from the first time they knew of each other, when the latter was depressed over the loss to Kainan and was near a basketball court where Fukuda was practicing. Fukuda had previously heard about Hanamichi from Sendoh and had wanted to play him, but the latter refused. They do not actually meet each other until the last match of the Interhigh Tournament, when Fukuda outplays Sakuragi for the first half and lights the fire within him, with the words \"I won, Sakuragi\". Unwilling to accept the loss, Hanamichi strengthens his marking over Fukuda in the second half.  Ryonan coach Moichi Taoka saw potential in both Fukuda and Sendoh starting from when they joined the team together. However, as Fukuda still seemed green and thick-skinned, Taoka would frequently criticize him while praising Sendoh. Fukuda however, turned out to be quite sensitive. As a result, in an exhibition match at Ryonan, Fukuda released his pent-up aggression on Taoka. This incident resulted in a suspension from all games up until the Interhigh Tournament. Thus he does not play in the practice match against Shohoku and is not seen until Ryonan plays Kainan. Possibly because of all the rudeness he used to be treated with, Fukuda loves to be respected and praised. He even bursts into tears when the crowd cheers him on against Kainan.  Source: &lt;http://en.wikipedia.org/wiki/Ryonan_High_School_basketball_team&gt;",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/12863.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12863
      },
      "rarity": "uncommon"
    },
    {
      "id": "ryoji-ikegami",
      "name": "Ryoji Ikegami",
      "alt_names": [],
      "role": "supporting",
      "description": "__Year:__ 3rd Year \n__Height:__ 183 cm \n__Jersey Number:__ #5 \n__Position:__ Small Forward\n\nAs pointed out by Taoka himself, Ikegami is the best defender in the team. In the last half of the Shohoku-Ryonan match he was asked to mark Mitsui and he did manage shut him down(only for some time). He leaves the team with Uozomi after the loss to Shohoku knocks Ryonan out of the National Championship run. Unlike Uozomi however, who starts to get emotional in encouraging his teammates to bring Ryonan further the next time around, Ikegami is cool and collected.  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/12864.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12864
      },
      "rarity": "uncommon"
    },
    {
      "id": "hiroaki-koshino",
      "name": "Hiroaki Koshino",
      "alt_names": [],
      "role": "supporting",
      "description": "__Year:__ 2nd Year  \n__Height:__ 174 cm\n__Jersey Number:__ #6  \n__Position:__ Shooting Guard  \n\nKoshino is one of Ryonan's main playmakers. Although not up to the level of Mitsui or Jin, he is still a good long range shooter. He also has a rather dry wit.   (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/12865.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12865
      },
      "rarity": "uncommon"
    },
    {
      "id": "tomoyuki-uekusa",
      "name": "Tomoyuki Uekusa",
      "alt_names": [],
      "role": "supporting",
      "description": "__Year:__ 2nd Year \n__Height:__ 170 cm\n__Jersey Number:__ #8 \n__Position:__ Point Guard \n\nUekusa has a discreet court presence, but still has his share of importance in playmaking for Ryonan, especially when Koshino is off court. Though not a strong player, he can hold his own quite well in play. Even Sendoh recognizes him as the player with a high stamina but in the Shohoku game, Uekusa was totally outplayed and exhausted by Miyagi.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12866-W8c5Fyv3y9SM.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12866
      },
      "rarity": "uncommon"
    },
    {
      "id": "jun-uozumi",
      "name": "Jun Uozumi",
      "alt_names": [],
      "role": "supporting",
      "description": "__Year:__ 3rd Year \n__Height:__ 202 cm\n__Jersey Number:__ #4 \n__Position:__ Center  \n\nJun Uozomi is the team captain. He considers Takenori Akagi his rival, but has never managed to personally beat him, although Ryonan has beaten Shohoku on occasion. However their rivalry is not antagonistic; indeed, there is respect that borders on friendship. When Akagi was outplayed and discouraged in the match against Sannoh, Uozumi was able to restore Akagi's spirits. After the loss to Shohoku in the Kanagawa prefectural trials eliminated Ryonan from national competition, Uozumi left the team to train as a chef, since his family owns a ramen restaurant; Sendoh succeeds him as team captain. Sakuragi likes to refer to him as \"Boss Monkey\" because he is as well-built as Akagi, and even taller.  \n\nUozumi's size and power are unmatched in high school basketball. However, he started as a very weak player, and was ridiculed and bullied by his upperclassmen for only having height but very little of everything else. Ryonan's coach Taoka Moichi encouraged him to continue playing though, and eventually Uozumi developed into becoming a fearsome center. He is considered as one of the top centers in the Kanagawa prefecture. However, his bad temper and lack of control in game situations has led to serious consequences for his team on more than one occasion; during the second match with Shohoku, Hanamichi tricked him into committing four fouls and almost got him ejected.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/12867.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12867
      },
      "rarity": "uncommon"
    },
    {
      "id": "moichi-taoka",
      "name": "Moichi Taoka",
      "alt_names": [],
      "role": "supporting",
      "description": "Moichi Taoka is Ryonan's coach and a contemporary of Kainan's Riki Takato, who is a year younger than him. Both of them have known each other since high school, when Taoka was known as “Kanagawa's Taoka”. Taoka compares himself to Sendoh, which his players find hard to believe. Both men are still friends, but are also rivals. Taoka trained his team hard enough that when he asked them to close their eyes and think about it, they became agitated. If he had had his way, his dream team would have consisted of Sendoh, Uozomi, Mitsui, Miyagi, and Rukawa, with the latter three playing the same positions they now play for Shohoku. He personally recruited them, but each turned him down for various reasons (Mitsui and Miyagi because of Anzai, and Rukawa because Shohoku is closer to his home). Still, Taoka is happy with his current team and believes that out of all the teams he has coached, it has trained the hardest. He even believes that this team can beat his dream team.   Taoka is a good coach, but has made mistakes in judging his players and the opposition. He still has an eye for talent though, as he recognized Uozomi's potential and gave him encouragement when Uozomi's skills were weak and he was thinking of quitting. Taoka also realized that when Sendoh and Fukuda joined the team that they would become key players. However, he thought that he could encourage Fukuda by criticizing him while at the same time praising Sendoh. Fukuda's personality turned out to be more sensitive, and after a year of criticism, he snapped, attacking Taoka during a practice match. This resulted in his suspension from the team, which is why Fukuda did not play during the practice match with Shohoku. Having learned from his mistake, Taoka uses Fukuda to great effect during the match with Kainan. During the league round match with Shohoku, Taoka underestimates how much Sakuragi's abilities have grown in the short time since Shohoku first played Ryonan. He also underestimates Kogure's abilities. Both of these underestimations cost Ryonan a shot at the national championships, and Taoka acknowledges them after the game.   (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12868-ZLA7xRcuQhlV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12868
      },
      "rarity": "uncommon"
    },
    {
      "id": "hikoichi-aida",
      "name": "Hikoichi Aida",
      "alt_names": [],
      "role": "supporting",
      "description": "__Year:__ 1st Year  \n__Height:__ 165 cm\n\nCheerful and energetic, Hikoichi aspires to become a player like his Ryonan teammates but, not being up to their level, he just stays with the reserves (more specifically with the coach, Moichi Taoka) and acts more as a team manager than a full player, taking detailed notes during matches. His catchphrase is \"gotta check it,\" aside from shouting \"Unbelievable!!!\" every time something exciting happens during a match. He too considers Hanamichi a great player, because he was talked into it when they first met. Hikoichi also idolizes Ryota because he is a starter for Shohoku despite his short height (Ryota is only three centimeters - about one inch - taller than Hikoichi). He has an older sister, Yayoi Aida, who is a reporter for a basketball magazine (and from whom Hikoichi might have gotten his habit of taking notes).",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12869-tvY4h69L5lzT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12869
      },
      "rarity": "uncommon"
    },
    {
      "id": "soichiro-jin",
      "name": "Soichiro Jin",
      "alt_names": [
        "神宗一郎"
      ],
      "role": "supporting",
      "description": "__Year:__ 2nd Year  \n__Height:__ 189 cm\n__Jersey Number:__ #6  \n__Position:__ Shooting Guard  \n\nJin is one of the best, if not the best, sharpshooters in Kanagawa, matched only by Mitsui. He originally used to be a center, but his slender build, slow movement and weak leaping ability never allowed him to perform well in this position. Instead of being discouraged, he became a shooting guard, where he could put his talents to better use. Jin became well-versed in 3-pointers as a result of making 500 3 point shots a day after practice. His coach was very much impressed by his tenacity and dedication. Jin has a very mild personality and is always looking calm and agreeable. Jin knows Fukuda from junior high school because they were both on the basketball team.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/13038.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13038
      },
      "rarity": "uncommon"
    },
    {
      "id": "nozomi-takamiya",
      "name": "Nozomi Takamiya",
      "alt_names": [
        "高宮望"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13686-75Owb29VqqiE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13686
      },
      "rarity": "uncommon"
    },
    {
      "id": "yuji-ookusu",
      "name": "Yuji Ookusu",
      "alt_names": [
        "大楠雄二"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13687-tS9Bf6M7eeLv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13687
      },
      "rarity": "uncommon"
    },
    {
      "id": "chuuichirou-noma",
      "name": "Chuuichirou Noma",
      "alt_names": [
        "野間忠一郎"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13688-XYESbO76eZMI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13688
      },
      "rarity": "uncommon"
    },
    {
      "id": "toki-kuwata",
      "name": "Toki Kuwata",
      "alt_names": [],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/14599.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14599
      },
      "rarity": "uncommon"
    },
    {
      "id": "ayako",
      "name": "Ayako",
      "alt_names": [
        "彩子",
        "Aya-chan"
      ],
      "role": "supporting",
      "description": "Ayako is the manager of the team and object of Ryota's affections. Strong-willed, somewhat tomboyish and good-natured, at first Ayako does not seem to reciprocate Ryota's feelings for her, which she knows of, and will not until the end of the series. She is directly responsible for sharpening Hanamichi's abilities for real matches, by training him in the basics, such as ball possession and dribbling. Her disciplinary style is midway between Akagi and Anzai - while not as soft as the latter, she is also not as hard as the former. Her last name is unknown. Curiously, Hanamichi treats her almost as respectfully as Anzai, even though she is in a lower position in the team; possibly because of her gender, since he is generally more respectful towards females. Ryota refers to her as \"Aya-chan\" because of his attraction to her, and she responds by calling him \"Ryota\" rather than by his surname.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23827-Nt1oz7obcO4F.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23827
      },
      "rarity": "uncommon"
    },
    {
      "id": "dai-moroboshi",
      "name": "Dai Moroboshi",
      "alt_names": [],
      "role": "supporting",
      "description": "The team's captain, shooting guard Dai Moroboshi, is known as the \"Star of Aichi\". He was injured by Meihou's Hiroshi Morishige during the Aichi Interhigh finals, and despite returning to the game later, could not push Aiwa over the top because of Meihou's insurmountable lead. Some consider Moroboshi as the only one who can beat Sannoh's Eiji Sawakita in a one-on-one, though Moroboshi himself does not think so.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b55793-K7Gfe2YqOmbj.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 55793
      },
      "rarity": "uncommon"
    },
    {
      "id": "riki-takatou",
      "name": "Riki Takatou",
      "alt_names": [
        "高頭力",
        "Rookie from Hell"
      ],
      "role": "supporting",
      "description": "Riki Takato is Kainan's coach and a contemporary of Ryonan's Moichi Taoka, who is a year older than him. Both of them have known each other since high school, when Takato was known as the \"Rookie from Hell\" in his first year. He has been responsible to some degree for the team's dominating the Kanagawa Inter High Tournament for the past 17 years. His training regime is so tough that half the incoming players are weeded out within the first week, and more within the first month. After a year, barely a fifth of the new players remain. In the previous year, Takato also coached the team up to the semifinal round of the national championships, which they lost to Sannoh.   He is very shrewd, a fact demonstrated by the ease with which he uncovers Sakuragi's prime weakness in the game against Shohoku. He substitutes Miyamasu for Jin, causing Sakuragi to lose focus and Shohoku to lose many points to Kainan.   Cool and collected when his team is dominating, Takato becomes very agitated and anxious when pressed, and starts yelling at his players.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/57353.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 57353
      },
      "rarity": "uncommon"
    },
    {
      "id": "nakamura",
      "name": "Nakamura",
      "alt_names": [
        "中村"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/57371.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 57371
      },
      "rarity": "uncommon"
    },
    {
      "id": "yayoi-aida",
      "name": "Yayoi Aida",
      "alt_names": [
        "相田弥生"
      ],
      "role": "supporting",
      "description": "Yayoi Aida is Hikoichi's older sister, who works as a reporter for a weekly basketball magazine. Even though her brother plays for Ryonan, she is mostly designated to cover Shohoku matches, in which she is always impressesed about Shohoku players' performances, as they mostly play stronger opponents like Kainan or Sannoh. In the National Championship though, she gets to watch Sannoh's exercise training routines. She is almost always accompanied by a bubbly trainee called Nakamura, who does the driving when they need to go from gym to gym even though he drives slowly, as he had just gotten his driving license.She also has a huge crush on Ryonan ace Sendoh.   (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/57373.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 57373
      },
      "rarity": "uncommon"
    },
    {
      "id": "norio-hotta",
      "name": "Norio Hotta",
      "alt_names": [
        "堀田徳男"
      ],
      "role": "supporting",
      "description": "Norio Hotta is the leader of a gang of fellow Third Year students who are the reigning delinquents at Shohoku. Sakuragi catches his attention on the first day of school when he gets into an altercation with two of his cronies, resulting in his issuing a direct challenge to Sakuragi by interrupting one of his classes. Before Sakuragi and his Gang arrive, Hotta and his cronies run into Rukawa on the school roof, who singlehandedly knocks out all four of them.   Hotta is a good friend of Mitsui, and backed him up when he challenged Miyagi to a fight a year ago. He and his friends provide the muscle again after Miyagi returns, and they join Mitsui in his attack on the basketball team. From Kogure's revelation of Mitsui's prior history with basketball, Hotta realizes that Mitsui deep down wants to play again, and is persuaded by Sakuragi's Gang to share the blame with them for attacking the team, getting the team off the hook for fighting. It should be noted that though Hotta and his friends failed to win in fights against Sakuragi's Gang or even Rukawa, they are portrayed as among the best fighters in Shohoku. Hotta and his cronies later become supporters of the basketball team during the National Championship Tournament (though even they get scared by the aggressiveness of the Toyotama crowd), largely because of their friendship with Mitsui, who they give the epithet Honoo no Otoko (lit. \"Flaming Man\").   (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/57383.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 57383
      },
      "rarity": "uncommon"
    },
    {
      "id": "tatsuhiko-aota",
      "name": "Tatsuhiko Aota",
      "alt_names": [
        "青田龍彦"
      ],
      "role": "supporting",
      "description": "The captain of the Shohoku judo team, Tatsuhiko Aota is a childhood friend of the Akagi siblings, having argued with Takenori over which sport was better, judo or basketball, since their youth. This grudge continued until their present age, where their feud is over which team will be National Champion first. He once tried to make Sakuragi join the judo team because he considered his fighting skills exceptional, and to achieve this, \"bribed\" him with some photos of Haruko when she was younger. Still, Sakuragi refused, saying simply, \"because I'm a basketball player\" (actually because he knew he would actually be closer to Haruko if he stayed with the basketball team). But Tatsuhiko does not give up on trying once in a while. He is rather loyal to Takenori when the need arises, cheering him on when he is outplayed and hard-pressed during the second Ryonan match.   Despite his inability to physically coerce Sakuragi into joining the judo team, Tatsuhiko has proven that he is skilled, as he is the sole member of the judo team to qualify for the National Championships in judo. It is also worth noting that Tatsuhiko has had a crush on Haruko since they were young. She calls him \"Ta-chan\" instead of by his last name, which irritates Sakuragi immensely.   (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/57385.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 57385
      },
      "rarity": "uncommon"
    },
    {
      "id": "yasuharu-yasuda",
      "name": "Yasuharu Yasuda",
      "alt_names": [
        "安田靖春"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b57399-RFrPfXQ9r30A.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 57399
      },
      "rarity": "uncommon"
    },
    {
      "id": "eiji-sawakita",
      "name": "Eiji Sawakita",
      "alt_names": [
        "沢北栄治"
      ],
      "role": "supporting",
      "description": "__Year:__ 2nd year\n__Height:__ 189 cm\n__Position:__ Small Forward\n__Jersey Number:__ #9\n\nEiji Sawakita is considered Japan's No.1 High School Player and is the ace of Sannoh. Unlike many other characters who are extremely skilled as he is, he has a goofy attitude sometimes and has comical moments of extreme shock when an opponent does something impressive. It was known that the high profile player, like Rukawa, has many fangirls that send him fan mails. Masashi, on the other hand, has none and picks on Eiji because of this.\n\nSawakita plans to go to America following the summer's Interhigh Tournament.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b184431-QBB2aAh2ISUB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 184431
      },
      "rarity": "uncommon"
    },
    {
      "id": "kazunari-fukatsu",
      "name": "Kazunari Fukatsu",
      "alt_names": [
        "深津一成"
      ],
      "role": "supporting",
      "description": "He is one of the best High School players in the nation. He is the captain of reigning champions Sannoh Kogyo and is highly respected by teammates and spectators like the rest of his team.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b218058-Zi6tODQW2wVZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 218058
      },
      "rarity": "uncommon"
    },
    {
      "id": "minoru-matsumoto",
      "name": "Minoru Matsumoto",
      "alt_names": [
        "松本稔"
      ],
      "role": "supporting",
      "description": "He is a 3rd year shooting guard for Sannoh Industry Affiliated High School. He subbed in for Ichinokura in the 2nd half and was matched up against Mitsui.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b218059-ulWnHGkKONpz.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 218059
      },
      "rarity": "uncommon"
    },
    {
      "id": "masahiro-nobe",
      "name": "Masahiro Nobe",
      "alt_names": [
        "野辺将広"
      ],
      "role": "supporting",
      "description": "He is a 3rd year Power Forward for Sannoh Industry Affiliated High School, called as Totem Pole by Sakuragi.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b218060-niVJaYGFs6YA.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 218060
      },
      "rarity": "uncommon"
    },
    {
      "id": "masashi-kawata",
      "name": "Masashi Kawata",
      "alt_names": [
        "河田雅史"
      ],
      "role": "supporting",
      "description": "He is the Center of Sannoh Industry Affiliated High School and is also known as Japan's #1 Center.\n\nHe started out as a small player, only standing at 165 cm but grew taller (25 cm) the next year, eventually claiming the Center position. He now stands at 190 cm in his 3rd year.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b218061-IIj7LTReUltl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 218061
      },
      "rarity": "uncommon"
    },
    {
      "id": "goro-domoto",
      "name": "Goro Domoto",
      "alt_names": [
        "堂本五郎"
      ],
      "role": "supporting",
      "description": "Sannoh High School's basketball coach.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 309285
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-24T06:03:14.907Z"
}