{
  "work_id": "attack-on-titan-final-season",
  "count": 75,
  "characters": [
    {
      "id": "eren-yeager",
      "name": "Eren Yeager",
      "alt_names": [
        "エレン・イェーガー",
        "Eren Jaeger",
        "Eren Jäger",
        "Suicidal Maniac",
        "Shi ni Isogi Yarou (死に急ぎ野郎)"
      ],
      "role": "protagonist",
      "description": "__Initial Height__: 170 cm (5'7\")\n__Affiliation:__ 104th Trainees Squad, Survey Corps. \n\nEren was born to Carla and Grisha Yeager in Shiganshina District within the southern region of Wall Maria. He grew up in the town with his parents and foster sister [Mikasa](https://anilist.co/character/40881), who moved in with the Yeagers as a child. Eren spent most of his time with Mikasa and their mutual best friend [Armin Arlert](https://anilist.co/character/46494), whom the pair often defended from neighborhood bullies.  \n\nEren is a passionate, determined, hardheaded, and impulsive young man. When they were children, Armin showed him a book depicting the wonders of the outside world. Eren grew to share Armin's curiosity of the world beyond the Walls and resolved to see it for himself. This dream inspired his admiration of the Survey Corps and his desire to join their ranks as soon as he became eligible for enrollment. \n\nWhen the Titans suddenly broke through Wall Maria into Shiganshina, Eren was forced to watch on as his mother became trapped under the rubble of their house and eaten by a titan. Forever changed from this event, Eren vows to kill every last titan.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40882-dsj7IP943WFF.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40882
      },
      "rarity": "legendary"
    },
    {
      "id": "mikasa-ackerman",
      "name": "Mikasa Ackerman",
      "alt_names": [
        "ミカサ・アッカーマン"
      ],
      "role": "protagonist",
      "description": "__Height:__ 170 cm (5'7\") - 176 cm (5'9½\")\n__Position:__ 104th Training Corps, Survey Corps\n__Relatives:__ [Birth Mother](https://anilist.co/character/84341/Mikasa-no-Haha) (Deceased), [Birth Father](https://anilist.co/character/84339/Mikasa-no-Chichi) (Deceased), [Grisha Yaeger](https://anilist.co/character/62477/Grisha-Yeager) (Foster Father), [Carla Yaeger](https://anilist.co/character/62475/Carla-Yeager) (Foster Mother, Deceased), [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) (Foster Brother)\n\nMikasa is Eren Yaeger's foster sister and mutual childhood friend of [Armin Arlert](https://anilist.co/character/46494), living with the two of them in Shiganshina District within the southern region of Wall Maria. \n\nWhen she was young, her parents were killed by human traffickers, and she was kidnapped. Eren discovered this and helped her escape her captors. Later, Eren gave her his scarf, which she constantly wears and shares an emotional attachment to. She was adopted by the Yaeger family soon after. Because of these past events, Mikasa shares an unbreakable bond with Eren and lives to protect him, constantly worrying for Eren's well-being. After the Titans broke through Wall Maria and killed her and Eren's mother, she chose to follow Eren into the military to try and keep him safe from danger. \n\nEven as a child, Mikasa possessed impressive fighting skill and strength, and that skill was only honed further during her training.  Mikasa is considered a genius among all the army trainees and is incredibly skilled at combat and agility, to the point that she was known as the greatest soldier among the 104th Training Corps and graduated in first place. Though being among the best of the best, she remains humble and refrains from displaying arrogance. Ultimately, Mikasa's loyalty remains with Eren no matter the circumstance, with her only true desire being to live a peaceful life with him.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40881-F3gr1PkreDvj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40881
      },
      "rarity": "legendary"
    },
    {
      "id": "armin-arlert",
      "name": "Armin Arlert",
      "alt_names": [
        "アルミン・アルレルト",
        "Armin Arlelt"
      ],
      "role": "protagonist",
      "description": "__Height:__ 163 cm (5'4\")\n__Position:__ 104th Trainees Squad, Survey Corps\n__Relatives:__ [Grandfather](https://anilist.co/character/84313/Armin-no-Ojiisan)\n\nArmin is a young boy who was born and raised in the Shiganshina District within the walls, being childhood friends with both [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) and [Mikasa Ackerman](https://anilist.co/character/40881). After Wall Maria was breached, he chose to join Mikasa and Eren in joining the military, both to try to make a good and meaningful impact on the world, and to fulfill his dream of seeing the outside world.\n\nEven when he was young, the naturally curious Armin has always had a deep fascination with the world beyond the Walls. As a child, he found and studied an illegal book about the outside world that was owned by his grandfather. He often shared the book and information contained in it with Eren Yeager, his best friend, and his dreams of seeing the world outside the walls. Armin was branded a heretic by other children for his unusual interest in the outside world and was thus frequently picked on. Too timid to defend himself, Armin would often rely on his friends Eren and Mikasa Ackerman to protect him from local bullies. This, coupled with his frail physique, was a deep shame for Armin, leading him to have poor self-esteem and to believe that he is a burden to others. Because of this, Armin has always been very eager to prove his worth, especially towards his close friends. \n\nArmin is known to be exceptionally loyal and selfless. He constantly worries for the safety of his friends, and he is always prepared to throw himself into dangerous situations to save them. Alongside his kindhearted nature and emotionally intelligence, Armin is a very analytical person. He likes to think deeply about situations and solve problems using his mind. These personality traits, in conjunction with his intelligence, good judgment, level headedness, ability to plan ahead, come up with creative ideas and to think outside the box, are what make him a great tactician. Although he may appear among the physically weakest of the 104th Training Corps, his incredible intelligence and strategic genius makes him an invaluable asset to any team.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46494-g7xYYuBtYPnO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46494
      },
      "rarity": "legendary"
    },
    {
      "id": "reiner-braun",
      "name": "Reiner Braun",
      "alt_names": [
        "ライナー・ブラウン"
      ],
      "role": "protagonist",
      "description": "__Height__: 185 cm (6'1\")\n\nMember of the Survey Corps and former cadet of the 104th Training Corps. Reiner is a passionate and strong-willed young man with a strong sense of duty. He ranked 2nd in his training class upon graduation, finishing behind only [Mikasa](https://anilist.co/character/40881). His comrades have great trust in him, and he is stated to be the \"big brother\" of the 104th cadets.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46484-P6A2GjNQn49F.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46484
      },
      "rarity": "legendary"
    },
    {
      "id": "gabi-braun",
      "name": "Gabi Braun",
      "alt_names": [
        "ガビ・ブラウン",
        "Mia (ミア)"
      ],
      "role": "protagonist",
      "description": "__Height__: 138 cm\n\nGabi Braun is an Eldian living in the Liberio internment zone and the cousin of [Reiner Braun](https://anilist.co/character/46484/Reiner-Braun). She is friends with her fellow warrior candidates [Udo](https://anilist.co/character/125663), [Zofia](https://anilist.co/character/125664/Zofia), and [Falco Grice](https://anilist.co/character/125660). \n\nGabi is very passionate and head-strong, expressing her emotions and opinions without inhibition. She is also brave, possessing boundless determination, and willing to put her life on the line to complete a goal for a perceived greater good. However, these attributes can also make her somewhat overbearing and domineering. This causes her to be tactless at times, forcing her opinions on others and taking charge regardless of whether it was asked for or not. She mostly shows this side around her fellow Warrior candidates, considering herself their de facto leader to an extent, and even threatening to 'punish' them when they disagree with her. Nonetheless, she is friendly enough that they have no issue with spending their leisure time with her. Aside from her resolve and determination, Gabi is care-free even on the battlefield, making remarks about her cuteness and claiming her commander loves her too much to sacrifice her.\n\n~!She is a Warrior candidate that is likely to inherit the Armored Titan.!~",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125659-O37MZQWibV7g.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125659
      },
      "rarity": "legendary"
    },
    {
      "id": "falco-grice",
      "name": "Falco Grice",
      "alt_names": [
        "ファルコ・グライス",
        "Ben (ベン)"
      ],
      "role": "protagonist",
      "description": "__Height__: 140 cm\n__Position__: Warrior Candidate\n\nFalco Grice is an Eldian Warrior candidate working for the Marley government and is the younger brother of [Colt Grice](https://anilist.co/character/125665/Colt-Grice). Falco is close friends with his fellow warrior candidates; [Udo](https://anilist.co/character/125663/Udo), [Zofia](https://anilist.co/character/125664/Zofia), and [Gabi](https://anilist.co/character/125659/Gabi-Braun).\n\nWhile not as physically strong as his fellow soldiers, he makes up for it with his quick wit and improvisation. He is a very merciful and compassionate person, going out of his way to protect and save other people lives, even enemy soldiers. He is also very polite and respectful towards others, and is an empathetic person, being willing to hear people out and properly understand things from their points of view.\n\n~!He is a candidate to inherit the power of the Armored Titan. He has the desire to become the Armored Titan in order to prevent Gabi Braun from inheriting it, as he has a crush on her and wants them to live a long life.!~",
      "metadata": {
        "gender": "male",
        "age": "12-15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125660-mrmpOJLjJIkv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125660
      },
      "rarity": "legendary"
    },
    {
      "id": "zeke",
      "name": "Zeke",
      "alt_names": [
        "ジーク"
      ],
      "role": "protagonist",
      "description": "__Height__: 183 cm\n\nZeke is the current inheritor of the Beast Titan, and is considered by [Reiner Braun](https://anilist.co/character/46484/Reiner-Braun) to be the strongest Warrior, contrasting [Levi's](https://anilist.co/character/45627/Levi) title of \"humanity's strongest soldier\".",
      "metadata": {
        "gender": "male",
        "age": "25-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125661-FiqFvAtNlL0v.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125661
      },
      "rarity": "legendary"
    },
    {
      "id": "levi",
      "name": "Levi",
      "alt_names": [
        "リヴァイ",
        "Levi Heichou (リヴァイ兵長)",
        "Captain Levi",
        "Jinrui Saikyou no Heishi (人類最強の兵士)",
        "Humanity's Strongest Soldier",
        "Heishichou (兵士長)"
      ],
      "role": "supporting",
      "description": "__Height:__ 160 cm (5'3\")\n\nSquad Captain of the Special Operations Squad (known as Squad Levi) within the Survey Corps. He is known as humanity's strongest soldier. \n\nLevi is abrasive, blunt, and has a strong respect for structure and discipline. He is a clean-freak, demanding spotless cleanliness of himself, his equipment, and his environment. Rumors say he was involved in underground crime in his life before coming a soldier. Despite his emotionless and unfriendly demeanor, Levi cares deeply for his squad and greatly values human life.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b45627-CR68RyZmddGG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 45627
      },
      "rarity": "epic"
    },
    {
      "id": "sasha-blouse",
      "name": "Sasha Blouse",
      "alt_names": [
        "サシャ・ブラウス",
        "Sasha Braus",
        "Imo Onna (芋女)",
        "Potato Girl"
      ],
      "role": "supporting",
      "description": "__Initial Height:__ 168cm\n__Affiliations__: 104th Cadet Corps, Survey Corps; Soldier\n__Relatives__: [Artur Blouse](https://anilist.co/character/131281/Artur-Blouse) (Father), [Lisa Blouse](https://anilist.co/character/134952/Lisa-Blouse) (Mother)\n\nOriginally from Dauper, a remote and scarcely populated village of hunters located in a mountain forest in the southern area of Wall Rose, Sasha joined the military as a cadet of the 104th Training Corps, where she ranked 9th upon graduation. After graduating, she'd choose to enlist in the Scouting Regiment. \n\nSasha is a friendly and fun-loving girl. She speaks with a local accent from her home village, but initially hid it out of embarrassment by using overly formal and polite speech. She is a constant food hoarder and is known to have an incredible appetite; eating provided her with considerable gratification and relief, especially during times of great stress, and food was often the only thing on her mind when at ease. Raised as an animal hunter, Sasha specializes in archery, horseback riding, and tracking, although her eccentricity and unconventional methods tend to make her a poor fit for group operations.\n\n~!She later saves a child named [Kaya](https://anilist.co/character/132738/Kaya) from a titan attack, who her family ends up adopting.!~",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b45887-QPtJH0KwqthW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 45887
      },
      "rarity": "epic"
    },
    {
      "id": "connie-springer",
      "name": "Connie Springer",
      "alt_names": [
        "コニー・スプリンガー",
        "Conny"
      ],
      "role": "supporting",
      "description": "__Height__: 158 cm (5'2\")  \n__Relatives:__ [Mother](https://anilist.co/character/137287/Conny-no-Haha), Martin Springer (Brother), Sunny Springer (Sister)\n\nConnie Springer is a graduate of the 104th Training Corps, having ranked 8th in class. He is known to be one of the quickest soldiers while using ODM gear and is skilled at making very sharp turns. He hails from the rural Ragako Village within Wall Rose, his greatest ambition being to make his family and village proud of him. Upon graduation, he chose to join the Survey Corps. \n\nUpbeat and naive, Connie is rather unfocused outside of combat, and enjoys goofing around and messing with his friends, but can also be a bit dense at times, as he can have some difficulty comprehending new developments as they appear. Connie always tries to remain optimistic, consistently caring for the well-being of his friends, family and village, and being willing to help in any way he can. However, this soft spot and the struggles he goes through as a member of the Survey Corps takes a toll on him, as he often responds to grief and loss with anger, irritation and hatred, causing him to at times make rash, impulsive decisions. He will do anything to protect his family, whether it be his biological family or his closest friends.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n46486-izhPjzut6WCZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46486
      },
      "rarity": "epic"
    },
    {
      "id": "bertolt-hoover",
      "name": "Bertolt Hoover",
      "alt_names": [
        "ベルトルト・フーバー",
        "Bertholdt"
      ],
      "role": "supporting",
      "description": "__Height__: 192 cm (6'3\")  \n__Affiliation__: Survey Corps\n\nMember of the Survey Corps and former cadet of the 104th Training Corps. Bertoldt ranked 3rd in his training class upon graduation, finishing behind only [Mikasa](https://anilist.co/character/40881) and his hometown friend [Reiner](https://anilist.co/character/46484). He is a quiet young man who identifies himself as someone with a weak will that follows popular opinion. Despite ranking 3rd in his class, his training commandant noted him to be a person with great potential, but an utter lack of initiative. Bertoldt originally he enlisted in the military with aspirations of joining the Military Police and living in the safety of the inner wall, but after the Battle of Trost he instead decided to join the Survey Corps.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46488-wm6HvkdkHoZu.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46488
      },
      "rarity": "epic"
    },
    {
      "id": "annie-leonhart",
      "name": "Annie Leonhart",
      "alt_names": [
        "アニ・レオンハート"
      ],
      "role": "supporting",
      "description": "__Height__: 153 cm (5\")  \n\nA member of the 104th Southern Division in the Cadet Corps. After graduating from the 104th, ranked 4th place in the top 10, she ends up joining the Military Police. She is roommates with [Hitch Dreyse](https://anilist.co/character/86017).\n\nA stoic girl, Annie is considered to be an isolated, solitary type, being rarely seen smiling or socializing and often having an emotionless expression. She is apathetic and somnolent, with little desire to put in any effort into meaningless disciplines or activities. Nonetheless, what drives Annie more than anything is her desire for a normal life.",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46490-tan274Ifc1Jf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46490
      },
      "rarity": "epic"
    },
    {
      "id": "jean-kirstein",
      "name": "Jean Kirstein",
      "alt_names": [
        "ジャン・キルシュタイン",
        "Jean Kirschtein",
        "Jeanie",
        "Horse Face"
      ],
      "role": "supporting",
      "description": "__Height__: 175 cm (5'8\")\n__Relatives__: [Mother](https://anilist.co/character/131444/Jean-no-Haha)\n\nJean Kirschtein is a graduate of the 104th Cadet Corps, among whom he ranked 6th for his skills with ODM gear and ability to look at things through a more tactical lense. Jean hails from Wall Rose's Trost District, and joined the military with hopes of living a peaceful life within the walls as part of the Military Police. However, he would later find himself joining the Survey Corps after being convinced both by his close friend [Marco Bott's](https://anilist.co/character/62479/Marco-Bott) words, and after witnessing the death of several of his comrades.\n\nJean has a blunt personality. He holds no restraint when it comes to speaking his mind, even when he knows it would not be wise to do so or when it could spark conflict. Jean is also pragmatic: he has a strong aversion to exposing himself to dangerous situations. During his time as a cadet, Jean was extremely hot-headed, easily becoming frustrated and quick to resort to violence when pushed. Jean was also very cynical about defeating the Titans, believing that humanity has no chance against them and openly mocking more idealistic individuals like [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager), and saw resisting the Titans as a hopeless cause. However, despite these things, and although he presents himself as self-centered, Jean places high value on the lives of his comrades, and is willing to risk his life to prevent countless more deaths from his comrades. Even with his shortcomings, Jean has shown himself to be a natural leader, being able to understand others and assess situations well because of his flaws, and proves capable of leading his fellow soldiers when they are left confused and without a plan.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46498-ritqAj9FW6jX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46498
      },
      "rarity": "epic"
    },
    {
      "id": "grisha-yeager",
      "name": "Grisha Yeager",
      "alt_names": [
        "グリシャ・イェーガー",
        "Grisha Jaeger"
      ],
      "role": "supporting",
      "description": "Father of [Eren Yaeger](https://anilist.co/character/40882/Eren-Yeager) and caretaker of [Mikasa Ackerman](https://anilist.co/character/40881/Mikasa-Ackerman). He is a renowned doctor who was well respected in the District of Shiganshina after he saved the village from a mysterious viral epidemic by developing vaccines. He also provides a medical house call service to the people of Shiganshina and to various towns in addition to having a network of contacts within the Corps of the Shiganshina District. He is married to [Carla Yaeger](https://anilist.co/character/62475).\n\n~!In the basement of the Yeager family house, he hides a secret which he refers to as the \"truth\". Upon finding Eren after the fall of Wall Maria, he injects him with a series of chemicals and amnesiacs and entrusts him with the key to the \"truth\", before mysteriously disappearing. This strange serum resulted in Eren gaining the ability to transform into a titan.!~",
      "metadata": {
        "gender": "male",
        "age": "39",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62477-3AHBGul9bXK8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62477
      },
      "rarity": "epic"
    },
    {
      "id": "krista-lenz",
      "name": "Krista Lenz",
      "alt_names": [
        "クリスタ・レンズ",
        "Christa",
        "Cattle-Taming Goddess"
      ],
      "role": "supporting",
      "description": "__Height__: 145 cm (4'8\")\n__Affiliations__: 104th Trainees Squad, Survey Corps\n\nRanked tenth in the trainee class, Krista is a very shy and kind, caring person, often being described as a \"goddess\" or \"angel\" by her peers. She is good friends with [Ymir](https://anilist.co/character/71479/Ymir).",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62481-ZZDa7vn17lMU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62481
      },
      "rarity": "epic"
    },
    {
      "id": "dot-pixis",
      "name": "Dot Pixis",
      "alt_names": [
        "ドット・ピクシス",
        "Dot Pyxis",
        "Commander Pyxis"
      ],
      "role": "supporting",
      "description": "The highest-ranked Administrator of the Southern Region. Head of the Garrison's Southern Territories, Pixis is a cunning leader with astute insights. However, he is also an alcoholic who is constantly watched over by his aid, [Anka](https://anilist.co/character/84331/Anka-Rheinberger), who constantly scolds him for sleeping and drinking during critical moments.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62485-I0U5Cat3z65K.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62485
      },
      "rarity": "epic"
    },
    {
      "id": "hange-zoe",
      "name": "Hange Zoe",
      "alt_names": [
        "ハンジ・ゾエ",
        "Hange Zoë",
        "Hanji",
        "Hans"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7\")\n__Affiliation:__ Survey Corps; Section Commander, Squad Leader.\n\nLeader of the Survey Corps' Fourth Squad, Hange is also in charge of conducting research on Titans, and pursues this knowledge so passionately that they have become obsessed with Titans as a result. After originally holding a deep hatred for the creatures, Hange decided to take on a new outside-the-box approach to their research by letting go of their resentment towards Titans and approaching the test subjects with compassion. \n\nHange is an energetic, freethinking and quirky scientist, with a unique way of conducting both themselves and their work. Hange is a genius outside of just Titan research too, using their brain to create weapons, tactical plans, and inventions for the benefit of humanity. As a leader, Hange is thoughtful of their comrades, and can easily figure out complex problems in order to create plans for their teammates to carry out.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71121-7R7CnQd3lHgt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71121
      },
      "rarity": "epic"
    },
    {
      "id": "nile-dok",
      "name": "Nile Dok",
      "alt_names": [
        "ナイル・ドーク"
      ],
      "role": "supporting",
      "description": "Chief of the Military Police.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71123-FswK9rrdbR9h.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71123
      },
      "rarity": "epic"
    },
    {
      "id": "darius-zackly",
      "name": "Darius Zackly",
      "alt_names": [
        "ダリス・ザックレー"
      ],
      "role": "supporting",
      "description": "The head of all three divisions of the army.   \n\n__ _Note:___ Darius Zackly is the official English translation by Kodansha.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71125-XXymqijVoYzV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71125
      },
      "rarity": "epic"
    },
    {
      "id": "keith-shadis",
      "name": "Keith Shadis",
      "alt_names": [
        "キース・シャーディス"
      ],
      "role": "supporting",
      "description": "Keith Shadis was the head instructor of the 104th Trainees Squad. He seemed to be a friend or have some sort of relationship with Dr. Grisha, as he knew Eren is the son of the doctor and praised Eren for his effort.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n84305-15nngV5nTUp6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84305
      },
      "rarity": "epic"
    },
    {
      "id": "anka-rheinberger",
      "name": "Anka Rheinberger",
      "alt_names": [
        "アンカ・ラインベルガー"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84331-9r0TU5kEFitO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84331
      },
      "rarity": "epic"
    },
    {
      "id": "hitch-dreyse",
      "name": "Hitch Dreyse",
      "alt_names": [
        "ヒッチ・ドリス"
      ],
      "role": "supporting",
      "description": "**Height:** 168 cm\n__Affiliations:__ 104th Cadet Corps.\n\nRecruit of the Military Police stationed in Stohess District. She was roommates with [Annie Leonhart](https://anilist.co/character/46490/Annie-Leonhart).\n\nHitch acts immature in certain ways, she has a sarcastic, easygoing personality and seems to mischievously enjoy teasing and needling her fellow officers, especially [Marlo Freudenberg](https://anilist.co/character/71457/Marlo-Freudenberg). She claims she chose to join the Military Police out of laziness, as it is well known that the senior staff are incredibly corrupt and she wanted to benefit from the system herself; however, she did not take into account that, as a new recruit, her superiors would dump all their work on her. Though she may act a bit air-headed at times, Hitch is not selfish and cares about those around her, especially her fellow comrades.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b86017-m6vXFRKWMwUo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86017
      },
      "rarity": "epic"
    },
    {
      "id": "pieck-finger",
      "name": "Pieck Finger",
      "alt_names": [
        "ピーク・フィンガー"
      ],
      "role": "supporting",
      "description": "__Height__: 155 cm\n\nPieck is an Eldian who serves as one of Marley's Warriors. She is shown to be somewhat sweet and kind, consistently shown to care about her fellow Warriors and the Warrior candidates. ~!She is the current inheritor of the Cart Titan.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125603-Z2rgiHUGbAmY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125603
      },
      "rarity": "epic"
    },
    {
      "id": "porco-galliard",
      "name": "Porco Galliard",
      "alt_names": [
        "ポルコガリアード",
        "Pock (ポッコ)"
      ],
      "role": "supporting",
      "description": "__Height:__ 175 cm\n__Position:__ Marley's Warrior\n\nPorco Galliard is an Eldian and the younger brother of Marcel Galliard. \n\n~!He is one of Marley's Warriors and inherited the Jaw Titan from Ymir.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125662-an9dgh4LZ016.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125662
      },
      "rarity": "epic"
    },
    {
      "id": "udo",
      "name": "Udo",
      "alt_names": [
        "ウド"
      ],
      "role": "supporting",
      "description": "__Height__: 146 cm\n__Position__: Warrior Candidate\n\nUdo is an Eldian Warrior candidate working for the Marley government. \n\n~!He is a candidate to inherit the Armored Titan power.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125663-GBJ8dfETGk6q.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125663
      },
      "rarity": "epic"
    },
    {
      "id": "zofia",
      "name": "Zofia",
      "alt_names": [
        "ゾフィア"
      ],
      "role": "supporting",
      "description": "__Height__: 142 cm\n__Position__: Warrior Candidate\n\nZofia is an Eldian Warrior candidate working for the Marley government.\n\n~!She is a candidate to inherit the Armored Titan power.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125664-e6U9YCj9f7R7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125664
      },
      "rarity": "epic"
    },
    {
      "id": "colt-grice",
      "name": "Colt Grice",
      "alt_names": [
        "コルト・グライス"
      ],
      "role": "supporting",
      "description": "__Height__: 180 cm\n__Position__: Warrior Candidate\n\nColt Grice is an Eldian living in Marley and the older brother of [Falco Grice](https://anilist.co/character/125660).\n\n~!He is a Warrior candidate who is selected to be the next wielder of the Beast Titan power.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125665-TicVG3OEhTqc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125665
      },
      "rarity": "epic"
    },
    {
      "id": "kenny-ackerman",
      "name": "Kenny Ackerman",
      "alt_names": [
        "ケニー・アッカーマン",
        "Kenny the Ripper"
      ],
      "role": "supporting",
      "description": "__Affiliation:__ Military Police; Captain of Anti-Personnel Control Squad.\n__Relatives:__ [Kuchel Ackerman](https://anilist.co/character/127940/Kuchel-Ackerman) (Sister), [Unnamed Grandfather](https://anilist.co/character/128589/Kenny-no-Ojiisan), \n\nKenny Ackerman is a member of the Military Police Brigade's First Interior Squad and also the Anti-Personnel Control Squad. Decades prior, however, Kenny was known as an infamous serial killer that stalked victims in the capitol. \n\nDespite his dark field of work, Kenny appears to be rather jovial and takes pleasure in taunting his adversaries during battle. When fighting, he becomes animated and lively, often making a scene or otherwise throwing insults and witticisms. However, he also fought with control and was able to effortlessly sneak up on his targets when they least expected him. His preferred method of killing during his time as a serial killer was to slit the throats of his victims which earned him his infamous handle \"Kenny the Ripper\", and it was rumored that he murdered over 100 members of the Military Police Brigade. However, decades later his killings ceased and the terror that he once inspired dwindled into an Urban Legend. He eventually was found working under the Royal Government, the reasoning for his sudden shift in behavior being a mystery. Kenny is ultimately, despite his comical personality, very cold and calculated, sparing little emotional attachment or loyalty to anyone, with only a few exceptions.\n\n~!ㅤ\nHe notably shares the same bloodline as both [Levi](https://anilist.co/character/45627/Levi) and [Mikasa Ackerman](https://anilist.co/character/40881/Mikasa-Ackerman).!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/127443-aVMXGOchpsvj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127443
      },
      "rarity": "epic"
    },
    {
      "id": "flagel-reeves",
      "name": "Flagel  Reeves",
      "alt_names": [
        "フレーゲル・リーブス "
      ],
      "role": "supporting",
      "description": "Flegel Reeves is the son of Dimo Reeves",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n127569-75UhiY7kpILW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127569
      },
      "rarity": "epic"
    },
    {
      "id": "marcel-galliard",
      "name": "Marcel Galliard",
      "alt_names": [
        "マルセル・ガリアード"
      ],
      "role": "supporting",
      "description": "~!Marcel was a comrade and childhood friend of Reiner Braun, Bertolt Hoover, and Annie Leonhart. He was part of the group sent by Marley to attack the Eldians of Paradis in year 845, but his mission was cut short by the sudden appearance of Ymir in her mindless Titan form.!~\n\n(Source: Shingeki no Kyojin Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127683-VDnuXVkMerjU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127683
      },
      "rarity": "epic"
    },
    {
      "id": "floch-forster",
      "name": "Floch Forster",
      "alt_names": [
        "フロック・フォルスター"
      ],
      "role": "supporting",
      "description": "Floch is a new recruit in the Survey Corps. He joined the Survey Corps during the two months between the attack at Orvud District and the return to Shiganshina District.\n\n~!After the rest of the Yeagerists are killed during the port battle, Floch hides on the ship to Marley. After shooting holes in the fuel tank of the flying boat, Floch is ultimately killed by Mikasa.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127703-qNIccR0yPZKu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127703
      },
      "rarity": "epic"
    },
    {
      "id": "roy",
      "name": "Roy",
      "alt_names": [
        "ロイ"
      ],
      "role": "supporting",
      "description": "As a veteran journalist, Roy has come to accept and conform to the restrictive nature of the monarchy, fearing retaliation for defiance.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130636-vO0Kv5crIyeD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130636
      },
      "rarity": "epic"
    },
    {
      "id": "pierre",
      "name": "Pierre",
      "alt_names": [
        "ピュレ"
      ],
      "role": "supporting",
      "description": "As a rookie reporter, Pierre has not yet become jaded like his superior Roy. He is very bold in his reporting, unafraid of asking questions of Military Police officers that would otherwise be considered \"off-limits.\" He takes his job of reporting the truth very seriously, becoming frustrated when he is kept from printing news that would be scandalous for the government.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n130637-MHrUGfiFvMKZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130637
      },
      "rarity": "epic"
    },
    {
      "id": "annie-no-chichi",
      "name": "Annie no Chichi",
      "alt_names": [
        "アニの父",
        "Annie's Father",
        "Mr. Leonhart",
        "レオンハート"
      ],
      "role": "supporting",
      "description": "Father and trainer of Annie Leonhart. He relentlessly trained Annie to fight, using mostly kicks and the attacker's weight against them.\n~!Memories of his pleas for forgiveness later create an opening for Annie to crystallize herself before Eren Jaeger has the chance to capture her!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131257-EywhPQF0aqVU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131257
      },
      "rarity": "epic"
    },
    {
      "id": "artur-blouse",
      "name": "Artur Blouse",
      "alt_names": [
        "アルトゥル・ブラウス",
        "Artur Braus"
      ],
      "role": "supporting",
      "description": "__Relatives:__ [Lisa Blause](https://anilist.co/character/134952/Lisa-Blouse) (Wife), [Sasha Blause](https://anilist.co/character/45887/Sasha-Blouse) (Daughter).\n\nArtur Blouse is the father of Sasha Blouse and a hunter in the Dauper village. It was his words that motivated Sasha to leave home and join the military.\n\nArtur appears to be a mature father figure who is deeply devoted to his clan. Though he appreciates his way of life, he realizes that many people's homes were taken by Titans and that they must share the forest for the greater good. He appears to be very wise, willing to accept change and move beyond their traditions if it meant a better way of life for everyone, and is very clearly a selfless person who puts others before himself. Like his daughter, he has a native Dauper accent. \n~!ㅤ\nAfter his daughter Sasha saved [Kaya](https://anilist.co/character/132738/Kaya), he and his wife decided to adopt her and open their home up to other orphaned children whose family was slain by the titans, going so far as to refer to them as his \"family.\"!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131281-TDm3VmnXgseC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131281
      },
      "rarity": "epic"
    },
    {
      "id": "willy-tybur",
      "name": "Willy Tybur",
      "alt_names": [
        "ヴィリー・タイバー",
        "Lord Tybur",
        "Savior's Descendant"
      ],
      "role": "supporting",
      "description": "~!An Eldian noble living in Marley. He was the head of the Tybur family and controlled Marley behind the shadows, although he chose not to interfere with Marley's military decisions.!~\n\n(Source: Attack on Titan Wiki)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131762-kOPlEZO6nkyC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131762
      },
      "rarity": "epic"
    },
    {
      "id": "theo-magath",
      "name": "Theo Magath",
      "alt_names": [
        "テオ・マガト"
      ],
      "role": "supporting",
      "description": "A commander of the Eldian Unit of the Marley army. Formerly one of the chief overseers of the first Warrior candidates during their training, he later led the Eldian Warriors in the Marley Mid-East War against the Mid-East Allied Forces, playing a key role in Marley's victory.\n\n~!Through the support of Willy Tybur and the governmental party of Marley, along with the death of General Calvi, Magath is next in line to become the general of the Marleyan military forces.!~\n~!He sacrifices himself by blowing up the Marleyan ship to prevent the Yeagerists from catching the allies!~\n\n(Source: Attack on Titan Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131763-YNYd9scK4Den.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131763
      },
      "rarity": "epic"
    },
    {
      "id": "kaya",
      "name": "Kaya",
      "alt_names": [
        "カヤ"
      ],
      "role": "supporting",
      "description": "A civilian living within Wall Rose. She was saved by Sasha Blouse from a Titan during the Wall Rose invasion, and now lives with the Blouse family.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n132738-I8jNSdoNIhZI.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 132738
      },
      "rarity": "epic"
    },
    {
      "id": "dina-fritz",
      "name": "Dina Fritz",
      "alt_names": [
        "ダイナ・フリッツ"
      ],
      "role": "supporting",
      "description": "~!Dina is the first wife of Grisha Yeager. One year after their marriage, she gave birth to their son, Zeke Yeager.\n\nDina is of royal blood as member of the Fritz family. When the 145th Fritz King built the walls and decided to move to the island Paradis, her branch of the Fritz family stayed behind due to disagreements with the King's choice. She joined the Eldia Restorationists on Marley, in order to revive the pride and power of Eldia. In this group, she also met Grisha Yeager, whom she eventually married. She gave birth to their son, Zeke Yeager. At the age of 7, there son reported his parents to the Marley government. As a result, all the Eldia Restorationists were sent to Utopia. Sergeant Major Gross injected Dina with the Titan serum and she was thrown off the Borderline wall to Utopia, as Grisha, in horror, watched his wife turn into a Titan.!~\n\n~!After the Colossus Titan breaches Shiganshina District in Wall Maria, many Titans proceed inside and among them is Dina. She embarks inside the town and is seen by Eren and Mikasa as they try to free Carla Yeager, who is trapped under the debris of their house. Though Hannes initially comes to their aid and decides to face Dina, he stands catatonic in fear of her frightening appearance. After he realizes that he is too afraid to face it, he opts to instead take Eren and Mikasa to safety, leaving Eren's mother behind. Afterwards, Eren witnesses Dina pull Carla out of the debris, as it proceeds to violently incapacitate her and devour her shortly thereafter.!~\n\n~!Five years later, after Eren had already joined the Survey Corps, Dina appears again before Eren and Mikasa outside the Titan Forest during the military's pursuit of the Armored Titan. After killing Hannes, who was protecting Eren and Mikasa before he was devoured, the Titan reaches out for Eren, who punches its hand. This activates powers Eren was previously unaware of, and seemingly gains control over the surrounding Titans. The ones that are under his control proceed to kill Dina by ripping her to shreds and devouring her, avenging the deaths of Carla and Hannes.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b133215-ifxjiTHsEGNl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133215
      },
      "rarity": "epic"
    },
    {
      "id": "yelena",
      "name": "Yelena",
      "alt_names": [
        "イェレナ"
      ],
      "role": "supporting",
      "description": "Yelena is the leader of the Anti-Marleyan Volunteers working under Zeke Yeager. She was one of the Marleyan soldiers on board the first survey fleet to Paradis Island after Marley's failed attack operation. She is a very tall woman with her blonde hair styled in a short bob with straight bangs. She has large dark eyes and somewhat androgynous features due to her build and style.\n\nYelena is a fervent follower of Zeke Yeager, holding great admiration and respect for him. She is usually calm and collected, her demeanour remaining unchanged even when Jean Kirstein yelled at her for failing to see her job through. Nonetheless, she is willing to take responsibility and apologizes should she fail in her task. Yelena appears to maintain a very relaxed demeanour while having dry, humorous undertones to much of her actions.\n\n~!It is later revealed that Yelena was born into an unassuming family in Marley, and eventually became disillusioned with her own country. After meeting Zeke Yeager, Yelena concocted a plan to solidify herself in history by helping Zeke save the world. As part of her narrative, Yelena created a false background for herself, claiming that her homeland was invaded and conquered by Marley. She was forcibly drafted as a soldier to fight in the Marleyan military, where she met similar-minded soldiers and organized them into the Anti-Marleyan Volunteers to fight against Marley.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b133216-HKl61n4F7eYv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133216
      },
      "rarity": "epic"
    },
    {
      "id": "niccolo",
      "name": "Niccolo",
      "alt_names": [
        "ニコロ",
        "Nicolo",
        "Nikoro"
      ],
      "role": "supporting",
      "description": "Nicolo is a former Marleyan soldier who served on Marley's Navy and was part of the first survey fleet to Paradis Island after the failed Paradis Island Operation. After being taken captive, he begins working on the island as a chef for the military.\n\nNiccolo was at first a very typical Marleyan, fearing the Eldians of Paradis Island and calling them devils. He was very disgusted with having been captured by them and having to live by their side, but after spending a lot of time with the Survey Corps, he and his comrades have developed grudging respect and shaky friendships with the ones they once thought of as devils. He notably grew a soft spot for a Survey Corp member, [Sasha Blouse](https://anilist.co/character/45887/Sasha-Blouse), after she complimented him on his cooking skills. Over time, the two gradually grew closer, enough for [Kaya](https://anilist.co/character/132738/Kaya) to believe they were in love. Niccolo credits Sasha with saving him from the war and teaching him that he can cook to make people happy.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b133218-G3SQp19jnFIJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133218
      },
      "rarity": "epic"
    },
    {
      "id": "lisa-blouse",
      "name": "Lisa Blouse",
      "alt_names": [
        "リサ・ブラウス"
      ],
      "role": "supporting",
      "description": "The mother of [Sasha Blouse](https://anilist.co/character/45887/Sasha-Blouse) and wife of [Mr. Blouse](https://anilist.co/character/131281).",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b134952-DKs88MOSsIzE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 134952
      },
      "rarity": "epic"
    },
    {
      "id": "grisha-no-chichi-yeager",
      "name": "Grisha no Chichi Yeager",
      "alt_names": [
        "グリシャの父・イェーガー",
        "Grisha's Father Yeager",
        "Mr. Yeager"
      ],
      "role": "supporting",
      "description": "He is the father of [Fay](https://anilist.co/character/133214/) and [Grisha Yeager](https://anilist.co/character/62477/), as well as the grandfather of [Eren Yeager](https://anilist.co/character/40882/).",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140765-zkWt0zw1App6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140765
      },
      "rarity": "epic"
    },
    {
      "id": "grisha-no-haha-yeager",
      "name": "Grisha no Haha Yeager",
      "alt_names": [
        "グリシャの母・イェーガー",
        "Grisha's Mother Yeager"
      ],
      "role": "supporting",
      "description": "She is the mother of [Fay](https://anilist.co/character/133214/) and [Grisha Yeager](https://anilist.co/character/62477/), as well as the grandmother of [Eren Yeager](https://anilist.co/character/40882/).",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140851-gwlhPSYXcMVh.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140851
      },
      "rarity": "epic"
    },
    {
      "id": "tom-ksaver",
      "name": "Tom Ksaver",
      "alt_names": [
        "トム・クサヴァー",
        "Xaver"
      ],
      "role": "supporting",
      "description": "He is a man who knew Grisha Jaeger when he was growing up.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140852-TdGBEPLEJ2Mr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140852
      },
      "rarity": "epic"
    },
    {
      "id": "onyankopon",
      "name": "Onyankopon",
      "alt_names": [
        "オニャンコポン"
      ],
      "role": "supporting",
      "description": "Onyankopon is one of the Anti-Marleyan Volunteers and aids the Survey Corps during the Raid on Liberio. He pilots an airship following orders from [Hange](https://anilist.co/character/71121/) for the Corps to use during their retreat.\n\n(Source: Attack on Titan Fandom)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b192909-81EoCndP0uEH.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 192909
      },
      "rarity": "epic"
    },
    {
      "id": "koslow",
      "name": "Koslow",
      "alt_names": [
        "コスロ",
        "Koslo"
      ],
      "role": "supporting",
      "description": "He is a Marleyan officer who fought in the war against the Mid-East Allied Forces before Marley's victory.\n\n(Source: Attack on Titan Wiki)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b199549-ispr2ccdtGOw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199549
      },
      "rarity": "epic"
    },
    {
      "id": "karina-braun",
      "name": "Karina Braun",
      "alt_names": [
        "カリナ・ブラウン"
      ],
      "role": "supporting",
      "description": "Karina Braun is the mother of [Reiner Braun](https://anilist.co/character/46484/).",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b199712-YOV8LXBcQT1R.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199712
      },
      "rarity": "epic"
    },
    {
      "id": "calvi",
      "name": "Calvi",
      "alt_names": [
        "カルヴィ"
      ],
      "role": "supporting",
      "description": "Calvi is the general of the Marleyan military forces.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b199713-9pDztohZP0dA.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199713
      },
      "rarity": "epic"
    },
    {
      "id": "nambia",
      "name": "Nambia",
      "alt_names": [
        "ナンビア "
      ],
      "role": "supporting",
      "description": "is an ambassador from a foreign land and a childhood friend of Willy Tybur. She serves as one of several ambassadors for her nation during the Liberio festival following the Marley Mid-East War.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b202797-H0fiJVmfkAFI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 202797
      },
      "rarity": "epic"
    },
    {
      "id": "ogweno",
      "name": "Ogweno",
      "alt_names": [
        "オグウェノ"
      ],
      "role": "supporting",
      "description": "Ogweno is an ambassador from a foreign land and a friend of Willy Tybur. He serves as one of several ambassadors for his nation during the Liberio festival following the Marley Mid-East War.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b202798-Qbmf0QU02jks.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 202798
      },
      "rarity": "epic"
    },
    {
      "id": "kiyomi-azumabito",
      "name": "Kiyomi Azumabito",
      "alt_names": [
        "キヨミ・アズマビト"
      ],
      "role": "supporting",
      "description": "Kiyomi is an ambassador of Hizuru and an ally to the Eldians on Paradis Island.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b202799-WlK66SqrhzED.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 202799
      },
      "rarity": "epic"
    },
    {
      "id": "reiner-chichi",
      "name": "Reiner Chichi",
      "alt_names": [
        "ライナー父",
        "Reiner's Father"
      ],
      "role": "supporting",
      "description": "A Marleyan man who had an illegal relationship with the Eldian woman Karina Braun. He is the estranged father of Reiner Braun.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b203936-fKQtH4KkaK0F.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 203936
      },
      "rarity": "epic"
    },
    {
      "id": "lara-tybur",
      "name": "Lara Tybur",
      "alt_names": [
        "ラーラ・タイバー",
        "Willy's Sister",
        "Lady Tybur"
      ],
      "role": "supporting",
      "description": "She is Willy Tybur's sister. \n~!She was the previous inheritor of the War Hammer Titan.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205015-MgmgKmwFBbRA.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205015
      },
      "rarity": "epic"
    },
    {
      "id": "carlo",
      "name": "Carlo",
      "alt_names": [
        "カルロ"
      ],
      "role": "supporting",
      "description": "Carlo is a soldier of the Marleyan military and a member of the Panzer Unit.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205906-42ZSOfYXGfkJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205906
      },
      "rarity": "epic"
    },
    {
      "id": "louise",
      "name": "Louise",
      "alt_names": [
        "ルイーゼ"
      ],
      "role": "supporting",
      "description": "A young girl who was in Trost with her mother attempting to flee when the Titans invaded. After being saved by [Mikasa Ackerman](https://anilist.co/character/40881/Mikasa-Ackerman) and the other 104th Cadets, she was inspired by their heroic actions and later joins the military herself as a Survey Corps recruit, hoping to get closer to Mikasa, her idol.\n\nLouise believes that strength is the most important attribute one can have in the world, to the point that she almost seems to have a \"might equals right\" mentality. Much of this mindset stems from her experiences during the Battle of Trost District, where she claims to have learned from watching Mikasa Ackerman fight in the face of adversity to achieve victory. She believes that the ends justify the means, and has no qualms about breaking rules if she believes that disobeying others will get her what she wants.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209870-urk2Tf2nV0mQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209870
      },
      "rarity": "epic"
    },
    {
      "id": "fine-tybur",
      "name": "Fine Tybur",
      "alt_names": [
        "フィーネ・タイバー"
      ],
      "role": "supporting",
      "description": "is the oldest daughter of Willy Tybur.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209871-sO0QoKPJYa17.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209871
      },
      "rarity": "epic"
    },
    {
      "id": "lobov",
      "name": "Lobov",
      "alt_names": [
        "ロボフ"
      ],
      "role": "supporting",
      "description": "A Scout Regiment recruit and former commander of the garrison who participated in the Raid on Liberio.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209872-Q1oywyIDj05n.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209872
      },
      "rarity": "epic"
    },
    {
      "id": "greiz",
      "name": "Greiz",
      "alt_names": [
        "グリーズ"
      ],
      "role": "supporting",
      "description": "Former Marleyan soldier who served on Marley's Navy and is part of a survey fleet sent to Paradis Island after the failed Paradis Island Operation. After being taken captive on the island, he begins working as a waiter in a restaurant inside the Walls.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b210461-4STCAkxOLvA9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 210461
      },
      "rarity": "epic"
    },
    {
      "id": "roeg",
      "name": "Roeg",
      "alt_names": [
        "ローグ"
      ],
      "role": "supporting",
      "description": "High ranking Military Police Regiment soldier.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b210462-XYnFRAnXLAmK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 210462
      },
      "rarity": "epic"
    },
    {
      "id": "varis",
      "name": "Varis",
      "alt_names": [
        "バリス"
      ],
      "role": "supporting",
      "description": "Varis is a Scout Regiment soldier who participated in the Raid on Liberio. Varis is a very loyal and trusted member of the Scout Regiment, being one of the few members trusted to help Levi Ackermann guard Zeke Jaeger, and remaining loyal to his superiors even after other soldiers defected to become members of the Jaegerists.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b212204-R6jqQnVu0H5G.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 212204
      },
      "rarity": "epic"
    },
    {
      "id": "grice",
      "name": "Grice",
      "alt_names": [
        "グライス"
      ],
      "role": "supporting",
      "description": "He is a member of the Restorationists.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140764-HbMgfmYGSPFl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140764
      },
      "rarity": "epic"
    },
    {
      "id": "narrator",
      "name": "Narrator",
      "alt_names": [
        "ナレーター",
        "語り手",
        "ナレーション",
        "Narrador",
        "Rozprávač",
        "Vyprávěč",
        "Dış ses",
        "Narratore",
        "Pripovjedač",
        "Narradora",
        "Рассказчик",
        "Người dẫn chuyện",
        "Tagapagsalaysay",
        "내레이터",
        "Narratore",
        "Erzählperson",
        "מספר",
        "Narrátor",
        "讲述人",
        "راوي",
        "Forteller",
        "Berättare",
        "Αφηγητής",
        "Narrateur",
        "なれーしょん",
        "旁白",
        "Narrato"
      ],
      "role": "minor",
      "description": "This character page is set to represent and list all narrators, which haven't been given a visual representation of themselves in their respective work. \n\nPlease add other narrator characters, which were given a visual representation of themselves, separately from this narrator page.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36309-6KM0riV4lqfN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36309
      },
      "rarity": "rare"
    },
    {
      "id": "marco-bott",
      "name": "Marco Bott",
      "alt_names": [
        "マルコ・ボット",
        "Marco Bodt"
      ],
      "role": "minor",
      "description": "__Height__: 178 cm (5'9\")\n__Affiliations__: 104th Training Corps\n\nOriginally from Jinae District. Marco ranked 7th in the 104th Training Corps and is widely respected by other cadets of the 104th. Marco is a very kind, calm, and idealistic person, valuing the good of the group above his own interests, as well as understanding and coping with his own shortcomings and limitations. He is seen as a natural leader, and desires to join the Military Police to serve near the King. \n\n*Note: Marco Bott is the official English translation by Kodansha.*",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62479-mYcTkU1RXymL.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62479
      },
      "rarity": "rare"
    },
    {
      "id": "thomas-wagner",
      "name": "Thomas Wagner",
      "alt_names": [
        "トーマス・ワグナー"
      ],
      "role": "minor",
      "description": "Thomas Wagner was from Trost District. A member of the 104th Trainees Squad, he first met Eren Yeager while questioning him about the Colossal Titan. Later, he operated the training gear for the Three Dimensional Maneuver Gear during Eren's second attempt at his aptitude test. At Keith Shadis' orders, Thomas exchanged gear with Eren and it was discovered that Eren's gear was defective. After graduating, Thomas planned to join the Scouting Legion.   ~!After the second attack of the Colossal Titan, he was assigned to the middle guard along with Eren Yeager and Armin Arlert. Initially tasked with working under the training corps, they eventually were incorporated into the front guard due to the number of titans. Catching the group unaware, a titan lunged at the rooftop they were standing on. The group scattered but unfortunately, Thomas wasn't fast enough. He was caught and swallowed whole, while his teammate, Eren, looked on in terror.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62483-zpSlfucUEgwQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62483
      },
      "rarity": "rare"
    },
    {
      "id": "ymir",
      "name": "Ymir",
      "alt_names": [
        "ユミル",
        "Freckles",
        "Freckles Ymir"
      ],
      "role": "minor",
      "description": "__Height:__ 172 cm (5'7\")\n__Affiliations:__ 104th Trainees Squad, Scouting Legion\n\nMember of the Scouting Legion. She seems selfish, cynical, bossy, sly, uncooperative, exploitative, and confrontational, but she can apparently be kind, especially to [Krista](https://anilist.co/character/62481/Krista-Lenz).",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71479-huCD908XIdqv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71479
      },
      "rarity": "rare"
    },
    {
      "id": "djel-sannes",
      "name": "Djel Sannes",
      "alt_names": [
        "ジェル・サネス"
      ],
      "role": "minor",
      "description": "Djel Sannes is a member of the Military Police Regiment and part of the First Interior Squad.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n127702-qyCvQZuIUl1X.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127702
      },
      "rarity": "rare"
    },
    {
      "id": "kaya-no-haha",
      "name": "Kaya no Haha",
      "alt_names": [
        "カヤの母",
        "Kaya’s Mom"
      ],
      "role": "minor",
      "description": "~!During the Wall Rose invasion, she is left stranded in her town with her traumatized daughter as a Titan slowly eats her. Sasha Blouse arrives in the town to alert its citizens and finds the two women in the house they were left in. Sasha unsuccessfully attempts to cut the Titan's nape with an axe, and then notices the child in the room. Sasha apologizes to the mother as she decides to abandon her, and successfully takes her child to safety. The woman later dies from her wounds!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b132794-ZFi7VBN9RCxG.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 132794
      },
      "rarity": "rare"
    },
    {
      "id": "heishi",
      "name": "Heishi",
      "alt_names": [
        "兵士",
        "Soldier"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 198638
      },
      "rarity": "rare"
    },
    {
      "id": "gabi-no-haha",
      "name": "Gabi no Haha",
      "alt_names": [
        "ガビの母",
        "Gabi's Mother",
        "がビ母"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b199714-cAlR5ZRATDOc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199714
      },
      "rarity": "rare"
    },
    {
      "id": "colt-chichi",
      "name": "Colt Chichi",
      "alt_names": [
        "コルト父",
        "Colt's Father",
        "Falco Chichi (ファルコ父)"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b199715-lJcx7TnbuN5Q.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199715
      },
      "rarity": "rare"
    },
    {
      "id": "douryou",
      "name": "Douryou",
      "alt_names": [
        "同僚",
        "Colleague"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/default.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199716
      },
      "rarity": "rare"
    },
    {
      "id": "gabi-chichi",
      "name": "Gabi Chichi",
      "alt_names": [
        "ガビ父",
        "Gabi's Father"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b199717-CwA94ex4HICW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199717
      },
      "rarity": "rare"
    },
    {
      "id": "colt-haha",
      "name": "Colt Haha",
      "alt_names": [
        "コルト母",
        "Colt's Mother"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b199718-t8j3CmEDNONR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 199718
      },
      "rarity": "rare"
    },
    {
      "id": "karl-fritz",
      "name": "Karl Fritz",
      "alt_names": [
        "カール・フリッツ",
        "First King Reiss"
      ],
      "role": "minor",
      "description": "The first ruler of humanity inside the Walls and prior to that he ruled also as the 145th Fritz King of Eldia.\n~!He possessed the Founding Titan which he used to create the Walls and alter the memories of humanity inside.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b205914-J9T4M6sXAqGg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 205914
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-23T10:23:36.425Z"
}