{
  "work_id": "goblin-slayer",
  "count": 15,
  "characters": [
    {
      "id": "goblin-slayer",
      "name": "Goblin Slayer",
      "alt_names": [
        "ゴブリンスレイヤー",
        "Orcbolg",
        "Beard-cutter"
      ],
      "role": "protagonist",
      "description": "The series' main character, an experienced silver ranked adventurer who only concerns himself with hunting goblins. The jobs he takes merely involve goblins and he takes no interest in others. His appearance is not as glamorous or elegant due to using equipment that would seem lacking for an adventurer of his rank. He wears a gray suit of grubby leather armor, with chainmail underneath, a small buckler shield with a sharpened rim attached on his left forearm. His weapon is a sword of strange length, of cheap quality, which he carries in a makeshift scabbard, allowing him to place swords of any shape he salvages. Due to the excellent sense of smell goblins possess, Goblin Slayer has a habit of neglecting the cleanliness of his armor, as clean equipment would reek of metal, which would immediately alert his foes.\n\nStoic and calm, he seems not to mind the jeers the other adventurers rebuke him for his appearance which doesn't befit his rank. As he has little regard for matters that don't include goblins, he has difficulty socializing, since he lacks the ability to understand most basic social norms. Nonetheless, reserved as he might be, he does care about others, as evidenced by when he asks Guild Girl which other parties, usually entirely formed by rookies, have accepted goblin slaying quests, in order to judge if they might be able to handle the job or should he lend them a hand.\n\nHis style of combat favors more on pragmatism such as setting traps, using their own weapon against the user, and taking whatever advantage that may come. He even uses his own imagination of using a protection spell in order to kill all the goblins in a burning Elven fortress. The most defining trait of his is the hatred of goblins that fuels him and his actions. The reason behind this is how his family, which consisted of his parents and sister, and the entire village he lived in were cruelly massacred by goblins, which made him swear a vendetta against all goblins everywhere.\n\n~!He believes the Goblins come from the Green Moon, his older sister told him so. Since the moon is a desolate place formed entirely by rock, with no grass, trees or water, the goblins turned envious and jealous of what they did not have, which is why they decided to invade the lands of humankind. Townsfolk tend to say that if you turn envious, you become a goblin.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126458-wCulCEFEPZSK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126458
      },
      "rarity": "epic"
    },
    {
      "id": "onna-shinkan",
      "name": "Onna Shinkan",
      "alt_names": [
        "女神官",
        "Priestess"
      ],
      "role": "protagonist",
      "description": "__Race:__ Human \n__Rank:__ Obsidian (Previously), Porcelain (Previously), Steel (current rank)\n        \nThe main female protagonist. She is a porcelain rank adventurer, the lowest rank as she had just joined. Her personality consist of being young, kind, and a generally helpful person. She is capable of using healing magic and protective spells with a high amount of proficiency.\n\nAfter her first goblin hunt rapidly goes downhill and saved by Goblin Slayer, she joins with him as a new party. Even after the events of her first job, she still wishes to be an adventurer and helps her party however she can. As she fights along Goblin Slayer, she learns how to use spells alternatively, gaining new spells, and has started to wear armour as the story progresses. Her backstory is that of an orphan raised in a temple into priesthood along with other orphans like her. Since coming of age, she decided to leave the temple and help adventurers in need",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126483-NQuBqaXHUJO2.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126483
      },
      "rarity": "epic"
    },
    {
      "id": "yousei-yunde",
      "name": "Yousei Yunde",
      "alt_names": [
        "妖精弓手",
        "High Elf Archer",
        "Anvil Chest"
      ],
      "role": "supporting",
      "description": "A high elf adventurer. She came with Dwarf Shaman and Lizard Priest to find Goblin Slayer and recruit his help. They face some trouble earlier as they are unable to pronounce \"Goblin Slayer\" and refer to him in other names, until they find him. They revel their objective; due to the increase in other demon monsters, there are not enough people to deal with Goblins and the elf army cannot mobilize to attack goblins as it would create suspicion and panic, if the army were focusing only on taking out the weakest monsters. They wish to hire Goblin Slayer to help them kill goblins. Her party also joins him to help him. She initially looks down on Goblin Slayer, due to his unkempt and weak appearance, but later comes to respect him, when she sees him in battle. She is a light-weight when it comes to drinking. She is Silver Rank.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126457-leHoOLIOZy2a.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126457
      },
      "rarity": "common"
    },
    {
      "id": "ushikai-musume",
      "name": "Ushikai Musume",
      "alt_names": [
        "牛飼娘",
        "Cow Girl"
      ],
      "role": "supporting",
      "description": "Cow Girl is the childhood friend of [Goblin Slayer](https://anilist.co/character/126458) and a farm hand on her uncle's farm. \n~!Her uncle took her in on his farm after her family was massacred by goblins during her childhood.!~",
      "metadata": {
        "gender": "female",
        "age": "18-19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126484-izE4ON548jnn.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126484
      },
      "rarity": "common"
    },
    {
      "id": "uketsuke-jou",
      "name": "Uketsuke-jou",
      "alt_names": [
        "受付嬢",
        "Guild Girl"
      ],
      "role": "supporting",
      "description": "A young woman who runs the Guild's front office as a receptionist and hands out contracts to adventurers. She shows concern over the villages pleading for help against the goblins and is exasperated from how few experienced adventurers would take such jobs. This problem would leave inexperienced rookies to die from them or worse. She holds great amounts of respect for Goblin Slayer, due to his willingness to take on many goblin contracts others would not touch.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/126485-2zo57ux4EMeC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126485
      },
      "rarity": "common"
    },
    {
      "id": "majo",
      "name": "Majo",
      "alt_names": [
        "魔女",
        "Witch"
      ],
      "role": "supporting",
      "description": "Witch is a silver ranked adventurer who is in a party with Spearman. She is a beautiful spell-caster with long, purple hair who wears a revealing set of robes, dark colored with gold yellow outlining. She is usually shown as being rather seductive, acting in a rather amorous manner, often suggesting sexual undertones in otherwise normal conversation, which causes those she interacts with to become flustered or embarrassed. Despite her teasing, she is shown to be caring of those around her, offering advice and help to those who need it. She tends to speak in terse and paused sentences. \n\nAs a powerful spellcaster, she is known to posess at least the spells Inflammarae (burn), Magic Missile, and Missile Deflect. She is shown using her Inflammarae spell to light a smoking pipe, to which she herself admits is quite the waste.\n\nWitch is first shown helping Priestess get away from a pair of privy newbies who wanted to scout her for their own party. She also gives her advice on her current situation with Goblin Slayer, explaining she did him a favor by selling him a magic scroll not too long ago, but without entering into much more detail.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n126486-e0DjNT3rBOT7.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126486
      },
      "rarity": "common"
    },
    {
      "id": "tokage-souryo",
      "name": "Tokage Souryo",
      "alt_names": [
        "蜥蜴僧侶",
        "Lizard Priest"
      ],
      "role": "supporting",
      "description": "A lizardman adventurer who forms a party with High Elf Archer and Dwarf Shaman. They later team up with Goblin Slayer and Priestess. His rank is silver, the third highest rank.\nCalm and composed, he speaks to people politely and adresses them in a respectful manner. He seems to be the most soft-spoken, even-tempered, and sociable member of the party.\n\nLizard Priest has green skin and horns on his head. His intimidating visage and towering stature makes him come off as unnerving, even to his friends. He wears what is presumed to be the traditional garb among priests in his people. \n\nLizard Priest is a skilled close quarters combatant, proficient with his curved blades. By using a catalyst, he is able to summon a Dragon-Tooth Warrior, a bipedal draconian skeleton, as an ally. In addition, he is capable of using healing magic to a degree.\n\nWhen he tries out cheese, he instantly becomes enamored with the taste, and  often calls it \"sweet nectar\" or \"the nectar of the gods\", since he finds it extremely exotic as his people do not practice the art of raising livestock.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n126487-TErPQ7ADCryW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126487
      },
      "rarity": "common"
    },
    {
      "id": "yaritsukai",
      "name": "Yaritsukai",
      "alt_names": [
        "槍使い",
        "Lancer"
      ],
      "role": "supporting",
      "description": "Spearman is a silver-ranked adventurer based in the frontier. He is the partner of Witch. As a silver ranked adventurer, the third highest rank attainable, he induces the respect of his fellow adventurers, especially newbies, who look up to him.\n\nHe has brown spiky hair, and has light red earrings matching the color of his eyes. He wears a resplendent blue armor and is equipped with his singature weapon, a spear.\nExtremely confident in his abilities, he is keen on trying to impress other people in the Adventurer's Guild by boasting about his skills, and he can be often seen doing so at the desk in front of Guild Girl.\n\n~!It is quite apparent he has somewhat of a crush on Guild Girl, since he is always trying to show off in front of her.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n126488-fW2f7wryREzj.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126488
      },
      "rarity": "common"
    },
    {
      "id": "kouhito-doushi",
      "name": "Kouhito Doushi",
      "alt_names": [
        "鉱人道士",
        "Dwarf Shaman"
      ],
      "role": "supporting",
      "description": "A dwarf and a member of the party with Lizard Priest and High Elf Archer. They team up with Goblin Slayer and Priestess in order to infiltrate some ruins invaded by goblins. As a silver adventurer, he is an experienced spell caster. Well-built and with good physique despite his short stature, Dwarf Shaman's long hair is completely white, which he ties up in a ponytail, and the beard he often strokes is elaborately braided. His earlobes have been elongated and are pierced by earrings. His priest garment is completely white, which contrasts with his dark colored gloves and bracers and the piece of armor he wears on his lower torso. He is cheerful and happy most of the time and can be often seen arguing with High Elf Archer over the most trivial matters, but they do so without malice.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n128254-6x8qS52q9Q0n.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 128254
      },
      "rarity": "common"
    },
    {
      "id": "tsurugi-no-otome",
      "name": "Tsurugi no Otome",
      "alt_names": [
        "剣の乙女",
        "Sword Maiden"
      ],
      "role": "supporting",
      "description": "A former gold-ranked adventurer who currently serves as the Temple of Law's Archbishop of the Supreme God.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b129080-zTT3T3jUnBya.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 129080
      },
      "rarity": "common"
    },
    {
      "id": "minarai-seishoku-sha",
      "name": "Minarai seishoku-sha",
      "alt_names": [
        "見習い聖職者",
        "Apprentice Cleric"
      ],
      "role": "supporting",
      "description": "A porcelain ranked adventurer who is a two person party with Rookie Warrior",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n131808-oZTRwGOy7pqt.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131808
      },
      "rarity": "common"
    },
    {
      "id": "kajiya",
      "name": "Kajiya",
      "alt_names": [
        "鍛冶屋",
        "Blacksmith"
      ],
      "role": "supporting",
      "description": "He is the local blacksmith whose establishment is close to the Adventurer's Guild.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n131809-ItViBoLkdOMd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131809
      },
      "rarity": "common"
    },
    {
      "id": "yuusha",
      "name": "Yuusha",
      "alt_names": [
        "勇者",
        "Hero"
      ],
      "role": "supporting",
      "description": "Yuusha is a young girl who became a platinum-ranked adventurer after defeating the Demon Lord.\nAlong with her party, she battles the Demon Lord's forces and other powerful threats.\n\n- In the light novel Yuusha has dark cyan-colored eyes and long black hair, with a single strand pointed upward.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n131810-15s8G2ZXn6nj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131810
      },
      "rarity": "common"
    },
    {
      "id": "rhea-sekkou",
      "name": "Rhea Sekkou",
      "alt_names": [
        "圃人斥候",
        "Rhea Scout"
      ],
      "role": "supporting",
      "description": "An adventurer who was a member of a party of steel-ranked adventurers. He is a greedy and selfish individual who attempts to keep up a friendly facade. \n~!However, when he loses his composure, he is willing to kill people to vent his frustrations.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131811-IND0nu8rSyjR.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131811
      },
      "rarity": "common"
    },
    {
      "id": "omoi-kenshi",
      "name": "Omoi Kenshi",
      "alt_names": [
        "重い剣士",
        "Heavy Swordsman"
      ],
      "role": "supporting",
      "description": "Race: Human\nJob: Adventurer\nRank: Silver\nAffiliation: Adventurer's Guildis \n\nA silver ranked adventurer. He is currently acting as an instructor teaching new adventurers basic combat.",
      "metadata": {
        "gender": "male",
        "age": "22",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n131812-4mY1CxbvGqka.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131812
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-26T10:58:10.911Z"
}