{
  "work_id": "blue-exorcist-kyoto-saga",
  "count": 15,
  "characters": [
    {
      "id": "rin-okumura",
      "name": "Rin Okumura",
      "alt_names": [
        "奥村燐",
        "Son of Satan"
      ],
      "role": "protagonist",
      "description": "__Height:__ 173 cm (5'8\")\n\nThe fifteen-year-old protagonist of the story, Rin is the son of Satan born from a human woman and is the inheritor of Satan's powers. His powers were sealed at birth into the demon-slaying blade Kurikara, or Koumaken, by Mephisto Pheles, allowing him to live a normal human life for about 15 years.\n\n(Sources: Viz, Blue Exorcist volume one manga extras)",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": "1995-12-27"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24482-E6087V4uAVqL.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24482
      },
      "rarity": "epic"
    },
    {
      "id": "yukio-okumura",
      "name": "Yukio Okumura",
      "alt_names": [
        "奥村雪男",
        "Yuki-chan",
        "Scaredy Four-Eyes"
      ],
      "role": "protagonist",
      "description": "__Height:__ 180 cm (5'11\") \n\nYukio is Rin Okumura's twin and younger brother and Shiro Fujimoto's adopted son. He is a Middle First Class Exorcist who has started his training to become an Exorcist at seven by his father suggestion and, since then, gained the titles of Dragoon and Doctor at only fourteen, becoming the youngest Exorcist in the True Cross Order history. Yukio is also the youngest teacher of the True Cross' Exorcist Cram School, at which he teaches pharmacology. Before he was born, he has had a weak body that couldn't bear the power of the blue flames, causing the power of Satan to be fully inherited by Rin. He is seen as an ​example and prodigy by the ones who live together with him and is friends with Shiemi Moriyama, who calls him Yuki-chan.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": "1992-12-27"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24734-GgVZoNAPnxoc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24734
      },
      "rarity": "epic"
    },
    {
      "id": "ryuuji-suguro",
      "name": "Ryuuji Suguro",
      "alt_names": [
        "勝呂竜士",
        "Bon",
        "Ryu-chan"
      ],
      "role": "protagonist",
      "description": "__Height:__ 181 cm\n\nHe is Rin's rival and the prodigy in the class. He was the child of the Cursed Temple which was destroyed by Satan 16 years ago. Bon takes everything seriously and is trying his hardest in order to become an Exorcist powerful enough so he could one day defeat Satan ( a goal he claims Rin stole from him) and rebuild his Temple. Currently Bon is trying to acquire the title of Meister in both Aria (a person who recites holy texts to kill certain demons) and Dragoon (a person who fights with heavy artillery). He is currently an Exwire. He is good at memorization, cleaning and Zen meditation.\n\n(Sources: Wikipedia and the Blue Exorcist volume two manga extras)",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b30429-NmVCBSzm3GNY.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30429
      },
      "rarity": "epic"
    },
    {
      "id": "shiemi-moriyama",
      "name": "Shiemi Moriyama",
      "alt_names": [
        "杜山しえみ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 165 cm (5'4\")    \n\nSlightly allergic to pollen. Shiemi is Rin's classmate and friend. Before she met Rin, Shiemi tended her grandmother's garden while her mother ran an Exorcist only shop inside True Cross Academy. During her encounter with Rin and Yukio, they were able to discover that Shiemi was having her life force leached out by a Demon. After Yukio exorcised the demon, Shiemi finally decided to become an Exorcist and started to attend class. It was later revealed that Shiemi had talent in becoming a Tamer, as she was able to summon a Greenman Spirit during class. It is apparently a rare talent to possess amongst the Exorcists, where there are only a few who can control demons and fight.",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b30430-LwO3yM6dg0HF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30430
      },
      "rarity": "epic"
    },
    {
      "id": "izumo-kamiki",
      "name": "Izumo Kamiki",
      "alt_names": [
        "神木出雲",
        "Eyebrows"
      ],
      "role": "protagonist",
      "description": "__Height:__ 164 cm\n\nIzumo Kamiki is a top student at the Exorcism Cram School of True Cross Academy who comes from a long line of shrine maidens.",
      "metadata": {
        "gender": "female",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b32162-VQiwb6CHEv8K.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 32162
      },
      "rarity": "epic"
    },
    {
      "id": "renzou-shima",
      "name": "Renzou Shima",
      "alt_names": [
        "志摩廉造",
        "Erotic Demon"
      ],
      "role": "protagonist",
      "description": "__Height:__ 176 cm\n\nRenzou is a very carefree character, yet he has a fear of many things, mainly bugs. He's very loyal to Bon, his childhood friend. They grew up together along with Konekomaru in Kyoto. He is also has a big obsession with women. Plans to become a Meister in Aria He is the 5th and youngest son of his family, and tells Konekomaru he's glad of this because it means he has less responsibilities. His older brother Juuzou says he's the pervert out of the brothers. Renzou is a carefree character and was the first person to actually befriend Rin since the revealing of the blue flames, which shows Renzou is the friendly-type. He is also afraid of bugs, yet he is known as the pervert out of the Shima brothers.",
      "metadata": {
        "gender": "male",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b38983-NrEXYWsAzm68.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38983
      },
      "rarity": "epic"
    },
    {
      "id": "konekomaru-miwa",
      "name": "Konekomaru Miwa",
      "alt_names": [
        "三輪子猫丸",
        "Koneko",
        "Neko"
      ],
      "role": "protagonist",
      "description": "__Height:__ 155 cm\n\nKonekomaru Miwa hails from Kyoto along with Ryuji Suguro and Renzo Shima and is an Exwire of the True Cross Order, a student of the Exorcist Cram School, and the surviving head of the Miwa family.",
      "metadata": {
        "gender": "male",
        "age": "15",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b38984-nTBWABvnb24V.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38984
      },
      "rarity": "epic"
    },
    {
      "id": "shirou-fujimoto",
      "name": "Shirou Fujimoto",
      "alt_names": [
        "藤本獅郎"
      ],
      "role": "supporting",
      "description": "__Height:__ 177 cm (5'8\")\n\nShirou Fujimoto was Rin and Yukio's guardian and was also considered to be one of the most powerful Exorcists in the world. He was thought to be the only man in the world that was able to sustain possession by Satan himself and thus Satan was constantly after his body. Fujimoto had a familiar sith cat demon, which he called Kuro, that Rin had inherited. He was a confirmed Aria, Dragoon and tamer and could possibly have been a Knight and a Docter as two of those who have studied under him have become these. He was said to be the strongest exorcist on the planet and was the only one to gain the rank of Paladin, the highest rank of the exorcists.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b30431-l5NMqfM82w4q.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30431
      },
      "rarity": "rare"
    },
    {
      "id": "mephisto-pheles",
      "name": "Mephisto Pheles",
      "alt_names": [
        "メフィスト・フェレス",
        "Johann Faust V",
        "Samael"
      ],
      "role": "supporting",
      "description": "__Height:__ 195 cm (6'5\") \n\nPheles is the Chairman of True Cross Academy and also an Exorcist. After Fujimoto's death Pheles was ordered to kill Rin, however he accepted Rin's proposal in becoming an Exorcist and entered him into True Cross Academy. It has been heavily implied that he is the son of Satan along with his brother, the Earth King, Amaimon. He possesses the unique and peculiar ability of transforming into a small dog after counting down from three in German. How powerful he is has not been shown but he has mentioned that he is an honorary knight, the position two ranks below Paladin. He has been shown responsible for allowing several higher class demons onto campus. His name is an obvious pun on the word Mephistopheles, which is name for the another infamous devil, similar to his father Satan.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b30432-I4KwsegOrzfq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30432
      },
      "rarity": "rare"
    },
    {
      "id": "amaimon",
      "name": "Amaimon",
      "alt_names": [
        "アマイモン",
        "Earth King"
      ],
      "role": "supporting",
      "description": "__Race:__ Demons  \n__Height:__ 172 cm (5'7\") \n\nAlso known as the \"Earth King.\" Amaimon is supposedly the second son of Satan and another Demon Prince of Gehenna. Unlike his father and elder brother Mephisto, Amaimon had little interest in Rin after their first encounter.   He is a human-like demon. He has a spike of hair that is lightly colored compared to the rest of his dark green hair. He wears a jacket that has cross-bones as buttons. He also wears a long-sleeved green shirt under his jacket, which is ripped at the ends.   He appears to be calm and collected, but very confident in his powers. However, he shows great anger and annoyance when someone gets in the way of his fun. He is very playful and doesn't take things seriously when it comes to fighting strong combatants which hint that he is very skilled in combat.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b30433-8YHbgfkBTn8P.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30433
      },
      "rarity": "rare"
    },
    {
      "id": "shura-kirigakure",
      "name": "Shura Kirigakure",
      "alt_names": [
        "霧隠・シュラ",
        "Yamada"
      ],
      "role": "supporting",
      "description": "She reveals herself in chapter 9, before that she had her face hidden beneath a hooded sweater and was known as Yamada.   The only information received in the manga so far is that she is an upper first class exorcist and a senior inspector. She was dispatched by the True Cross Vatican Headquarters to investigate the Japanese Branch's \"risk factor\".  2 years before Rin was born, she was Fujimoto Shirou's student.  She claims to be 18, but in chapter 11 Yukio said that she already turned 26, and she seems sensitive about her age, as she threw a beer can at him claiming 'her hand slipped' shortly after",
      "metadata": {
        "gender": "female",
        "age": "26",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b32110-Ats6VvSZy300.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 32110
      },
      "rarity": "rare"
    },
    {
      "id": "tatsuma-suguro",
      "name": "Tatsuma Suguro",
      "alt_names": [
        "勝呂達磨"
      ],
      "role": "supporting",
      "description": "Ryuuji Suguro&#039;s father. Survivor of the Blue Night, when scores of clergymen were massacred by Satan. Known as the &quot;Priest of the Cursed Temple.&quot;  (source: BlueExorcist.com)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/43137.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43137
      },
      "rarity": "rare"
    },
    {
      "id": "kuro",
      "name": "Kuro",
      "alt_names": [
        "クロ",
        "Blacky"
      ],
      "role": "supporting",
      "description": "A two-tailed cat demon (nekomata).  Formerly Fujimoto's familiar but is now Rin's familiar.  Kuro is a Cat Sith who was once worshipped as a protective deity for silkworms.  He usually takes the appearance of a kitten, but he can reach an enormous size at will.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43187-uJySWMkmaWmZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43187
      },
      "rarity": "rare"
    },
    {
      "id": "juuzou-shima",
      "name": "Juuzou Shima",
      "alt_names": [
        "志摩柔造",
        "Juu-nii"
      ],
      "role": "supporting",
      "description": "Juuzou is the 2nd son of the Shima family, his younger brothers include Kinzou and Renzou. As the 2nd son, he has more responsibilities than his younger brothers. Since the 1st son of the Shima family was killed in the Blue Night incident 16 years ago, Juuzou is the successor of the Shima family. He and Houjou Mamushi are childhood friends and attended the Exorcist cramschool together.",
      "metadata": {
        "gender": "male",
        "age": "25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43383-BYanhVdQgXy8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43383
      },
      "rarity": "rare"
    },
    {
      "id": "mamushi-houjou",
      "name": "Mamushi Houjou",
      "alt_names": [
        "宝生蝮"
      ],
      "role": "supporting",
      "description": "Mamushi is a Middle First-Class Exorcist at the Kyoto Branch of the True Cross Order and Uwabami Houjou's daughter. Her sisters are Nishiki and Ao Houjou.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b43384-5AcxRSUzcW5g.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 43384
      },
      "rarity": "rare"
    }
  ],
  "updated_at": "2025-12-26T00:47:15.750Z"
}