{
  "work_id": "attack-on-titan",
  "count": 87,
  "characters": [
    {
      "id": "eren-yeager",
      "name": "Eren Yeager",
      "alt_names": [
        "エレン・イェーガー",
        "Eren Jaeger",
        "Eren Jäger",
        "Suicidal Maniac",
        "Shi ni Isogi Yarou (死に急ぎ野郎)"
      ],
      "role": "protagonist",
      "description": "__Initial Height__: 170 cm (5'7\")\n__Affiliation:__ 104th Trainees Squad, Survey Corps. \n\nEren was born to Carla and Grisha Yeager in Shiganshina District within the southern region of Wall Maria. He grew up in the town with his parents and foster sister [Mikasa](https://anilist.co/character/40881), who moved in with the Yeagers as a child. Eren spent most of his time with Mikasa and their mutual best friend [Armin Arlert](https://anilist.co/character/46494), whom the pair often defended from neighborhood bullies.  \n\nEren is a passionate, determined, hardheaded, and impulsive young man. When they were children, Armin showed him a book depicting the wonders of the outside world. Eren grew to share Armin's curiosity of the world beyond the Walls and resolved to see it for himself. This dream inspired his admiration of the Survey Corps and his desire to join their ranks as soon as he became eligible for enrollment. \n\nWhen the Titans suddenly broke through Wall Maria into Shiganshina, Eren was forced to watch on as his mother became trapped under the rubble of their house and eaten by a titan. Forever changed from this event, Eren vows to kill every last titan.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40882-dsj7IP943WFF.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40882
      },
      "rarity": "legendary"
    },
    {
      "id": "mikasa-ackerman",
      "name": "Mikasa Ackerman",
      "alt_names": [
        "ミカサ・アッカーマン"
      ],
      "role": "protagonist",
      "description": "__Height:__ 170 cm (5'7\") - 176 cm (5'9½\")\n__Position:__ 104th Training Corps, Survey Corps\n__Relatives:__ [Birth Mother](https://anilist.co/character/84341/Mikasa-no-Haha) (Deceased), [Birth Father](https://anilist.co/character/84339/Mikasa-no-Chichi) (Deceased), [Grisha Yaeger](https://anilist.co/character/62477/Grisha-Yeager) (Foster Father), [Carla Yaeger](https://anilist.co/character/62475/Carla-Yeager) (Foster Mother, Deceased), [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) (Foster Brother)\n\nMikasa is Eren Yaeger's foster sister and mutual childhood friend of [Armin Arlert](https://anilist.co/character/46494), living with the two of them in Shiganshina District within the southern region of Wall Maria. \n\nWhen she was young, her parents were killed by human traffickers, and she was kidnapped. Eren discovered this and helped her escape her captors. Later, Eren gave her his scarf, which she constantly wears and shares an emotional attachment to. She was adopted by the Yaeger family soon after. Because of these past events, Mikasa shares an unbreakable bond with Eren and lives to protect him, constantly worrying for Eren's well-being. After the Titans broke through Wall Maria and killed her and Eren's mother, she chose to follow Eren into the military to try and keep him safe from danger. \n\nEven as a child, Mikasa possessed impressive fighting skill and strength, and that skill was only honed further during her training.  Mikasa is considered a genius among all the army trainees and is incredibly skilled at combat and agility, to the point that she was known as the greatest soldier among the 104th Training Corps and graduated in first place. Though being among the best of the best, she remains humble and refrains from displaying arrogance. Ultimately, Mikasa's loyalty remains with Eren no matter the circumstance, with her only true desire being to live a peaceful life with him.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40881-F3gr1PkreDvj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40881
      },
      "rarity": "legendary"
    },
    {
      "id": "armin-arlert",
      "name": "Armin Arlert",
      "alt_names": [
        "アルミン・アルレルト",
        "Armin Arlelt"
      ],
      "role": "protagonist",
      "description": "__Height:__ 163 cm (5'4\")\n__Position:__ 104th Trainees Squad, Survey Corps\n__Relatives:__ [Grandfather](https://anilist.co/character/84313/Armin-no-Ojiisan)\n\nArmin is a young boy who was born and raised in the Shiganshina District within the walls, being childhood friends with both [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) and [Mikasa Ackerman](https://anilist.co/character/40881). After Wall Maria was breached, he chose to join Mikasa and Eren in joining the military, both to try to make a good and meaningful impact on the world, and to fulfill his dream of seeing the outside world.\n\nEven when he was young, the naturally curious Armin has always had a deep fascination with the world beyond the Walls. As a child, he found and studied an illegal book about the outside world that was owned by his grandfather. He often shared the book and information contained in it with Eren Yeager, his best friend, and his dreams of seeing the world outside the walls. Armin was branded a heretic by other children for his unusual interest in the outside world and was thus frequently picked on. Too timid to defend himself, Armin would often rely on his friends Eren and Mikasa Ackerman to protect him from local bullies. This, coupled with his frail physique, was a deep shame for Armin, leading him to have poor self-esteem and to believe that he is a burden to others. Because of this, Armin has always been very eager to prove his worth, especially towards his close friends. \n\nArmin is known to be exceptionally loyal and selfless. He constantly worries for the safety of his friends, and he is always prepared to throw himself into dangerous situations to save them. Alongside his kindhearted nature and emotionally intelligence, Armin is a very analytical person. He likes to think deeply about situations and solve problems using his mind. These personality traits, in conjunction with his intelligence, good judgment, level headedness, ability to plan ahead, come up with creative ideas and to think outside the box, are what make him a great tactician. Although he may appear among the physically weakest of the 104th Training Corps, his incredible intelligence and strategic genius makes him an invaluable asset to any team.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46494-g7xYYuBtYPnO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46494
      },
      "rarity": "legendary"
    },
    {
      "id": "levi",
      "name": "Levi",
      "alt_names": [
        "リヴァイ",
        "Levi Heichou (リヴァイ兵長)",
        "Captain Levi",
        "Jinrui Saikyou no Heishi (人類最強の兵士)",
        "Humanity's Strongest Soldier",
        "Heishichou (兵士長)"
      ],
      "role": "supporting",
      "description": "__Height:__ 160 cm (5'3\")\n\nSquad Captain of the Special Operations Squad (known as Squad Levi) within the Survey Corps. He is known as humanity's strongest soldier. \n\nLevi is abrasive, blunt, and has a strong respect for structure and discipline. He is a clean-freak, demanding spotless cleanliness of himself, his equipment, and his environment. Rumors say he was involved in underground crime in his life before coming a soldier. Despite his emotionless and unfriendly demeanor, Levi cares deeply for his squad and greatly values human life.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b45627-CR68RyZmddGG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 45627
      },
      "rarity": "epic"
    },
    {
      "id": "sasha-blouse",
      "name": "Sasha Blouse",
      "alt_names": [
        "サシャ・ブラウス",
        "Sasha Braus",
        "Imo Onna (芋女)",
        "Potato Girl"
      ],
      "role": "supporting",
      "description": "__Initial Height:__ 168cm\n__Affiliations__: 104th Cadet Corps, Survey Corps; Soldier\n__Relatives__: [Artur Blouse](https://anilist.co/character/131281/Artur-Blouse) (Father), [Lisa Blouse](https://anilist.co/character/134952/Lisa-Blouse) (Mother)\n\nOriginally from Dauper, a remote and scarcely populated village of hunters located in a mountain forest in the southern area of Wall Rose, Sasha joined the military as a cadet of the 104th Training Corps, where she ranked 9th upon graduation. After graduating, she'd choose to enlist in the Scouting Regiment. \n\nSasha is a friendly and fun-loving girl. She speaks with a local accent from her home village, but initially hid it out of embarrassment by using overly formal and polite speech. She is a constant food hoarder and is known to have an incredible appetite; eating provided her with considerable gratification and relief, especially during times of great stress, and food was often the only thing on her mind when at ease. Raised as an animal hunter, Sasha specializes in archery, horseback riding, and tracking, although her eccentricity and unconventional methods tend to make her a poor fit for group operations.\n\n~!She later saves a child named [Kaya](https://anilist.co/character/132738/Kaya) from a titan attack, who her family ends up adopting.!~",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b45887-QPtJH0KwqthW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 45887
      },
      "rarity": "epic"
    },
    {
      "id": "reiner-braun",
      "name": "Reiner Braun",
      "alt_names": [
        "ライナー・ブラウン"
      ],
      "role": "supporting",
      "description": "__Height__: 185 cm (6'1\")\n\nMember of the Survey Corps and former cadet of the 104th Training Corps. Reiner is a passionate and strong-willed young man with a strong sense of duty. He ranked 2nd in his training class upon graduation, finishing behind only [Mikasa](https://anilist.co/character/40881). His comrades have great trust in him, and he is stated to be the \"big brother\" of the 104th cadets.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46484-P6A2GjNQn49F.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46484
      },
      "rarity": "epic"
    },
    {
      "id": "connie-springer",
      "name": "Connie Springer",
      "alt_names": [
        "コニー・スプリンガー",
        "Conny"
      ],
      "role": "supporting",
      "description": "__Height__: 158 cm (5'2\")  \n__Relatives:__ [Mother](https://anilist.co/character/137287/Conny-no-Haha), Martin Springer (Brother), Sunny Springer (Sister)\n\nConnie Springer is a graduate of the 104th Training Corps, having ranked 8th in class. He is known to be one of the quickest soldiers while using ODM gear and is skilled at making very sharp turns. He hails from the rural Ragako Village within Wall Rose, his greatest ambition being to make his family and village proud of him. Upon graduation, he chose to join the Survey Corps. \n\nUpbeat and naive, Connie is rather unfocused outside of combat, and enjoys goofing around and messing with his friends, but can also be a bit dense at times, as he can have some difficulty comprehending new developments as they appear. Connie always tries to remain optimistic, consistently caring for the well-being of his friends, family and village, and being willing to help in any way he can. However, this soft spot and the struggles he goes through as a member of the Survey Corps takes a toll on him, as he often responds to grief and loss with anger, irritation and hatred, causing him to at times make rash, impulsive decisions. He will do anything to protect his family, whether it be his biological family or his closest friends.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n46486-izhPjzut6WCZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46486
      },
      "rarity": "epic"
    },
    {
      "id": "bertolt-hoover",
      "name": "Bertolt Hoover",
      "alt_names": [
        "ベルトルト・フーバー",
        "Bertholdt"
      ],
      "role": "supporting",
      "description": "__Height__: 192 cm (6'3\")  \n__Affiliation__: Survey Corps\n\nMember of the Survey Corps and former cadet of the 104th Training Corps. Bertoldt ranked 3rd in his training class upon graduation, finishing behind only [Mikasa](https://anilist.co/character/40881) and his hometown friend [Reiner](https://anilist.co/character/46484). He is a quiet young man who identifies himself as someone with a weak will that follows popular opinion. Despite ranking 3rd in his class, his training commandant noted him to be a person with great potential, but an utter lack of initiative. Bertoldt originally he enlisted in the military with aspirations of joining the Military Police and living in the safety of the inner wall, but after the Battle of Trost he instead decided to join the Survey Corps.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46488-wm6HvkdkHoZu.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46488
      },
      "rarity": "epic"
    },
    {
      "id": "annie-leonhart",
      "name": "Annie Leonhart",
      "alt_names": [
        "アニ・レオンハート"
      ],
      "role": "supporting",
      "description": "__Height__: 153 cm (5\")  \n\nA member of the 104th Southern Division in the Cadet Corps. After graduating from the 104th, ranked 4th place in the top 10, she ends up joining the Military Police. She is roommates with [Hitch Dreyse](https://anilist.co/character/86017).\n\nA stoic girl, Annie is considered to be an isolated, solitary type, being rarely seen smiling or socializing and often having an emotionless expression. She is apathetic and somnolent, with little desire to put in any effort into meaningless disciplines or activities. Nonetheless, what drives Annie more than anything is her desire for a normal life.",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46490-tan274Ifc1Jf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46490
      },
      "rarity": "epic"
    },
    {
      "id": "hannes",
      "name": "Hannes",
      "alt_names": [
        "ハンネス"
      ],
      "role": "supporting",
      "description": "A soldier who saves Eren and Mikasa during the prologue. He owes a debt to the Yeager family.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46492-5kRaMLDCVD0B.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46492
      },
      "rarity": "epic"
    },
    {
      "id": "erwin-smith",
      "name": "Erwin Smith",
      "alt_names": [
        "エルヴィン・スミス",
        "Eyebrow"
      ],
      "role": "supporting",
      "description": "**Height:** 188 cm\n**Position:** 13th Commander, Survey Corps\n\nDiscerning, intelligent, and widely respected, Erwin is the unshakable and calculated 13th commander of the Survey Corps. While he cares deeply for his men, he does not hesitate to sacrifice them for the good and prosperity of mankind, and his men have proven more than willing to stake their lives at his order. Erwin developed the Long-Distance Enemy Scouting Formation.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46496-Mu86MENd5wNB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46496
      },
      "rarity": "epic"
    },
    {
      "id": "jean-kirstein",
      "name": "Jean Kirstein",
      "alt_names": [
        "ジャン・キルシュタイン",
        "Jean Kirschtein",
        "Jeanie",
        "Horse Face"
      ],
      "role": "supporting",
      "description": "__Height__: 175 cm (5'8\")\n__Relatives__: [Mother](https://anilist.co/character/131444/Jean-no-Haha)\n\nJean Kirschtein is a graduate of the 104th Cadet Corps, among whom he ranked 6th for his skills with ODM gear and ability to look at things through a more tactical lense. Jean hails from Wall Rose's Trost District, and joined the military with hopes of living a peaceful life within the walls as part of the Military Police. However, he would later find himself joining the Survey Corps after being convinced both by his close friend [Marco Bott's](https://anilist.co/character/62479/Marco-Bott) words, and after witnessing the death of several of his comrades.\n\nJean has a blunt personality. He holds no restraint when it comes to speaking his mind, even when he knows it would not be wise to do so or when it could spark conflict. Jean is also pragmatic: he has a strong aversion to exposing himself to dangerous situations. During his time as a cadet, Jean was extremely hot-headed, easily becoming frustrated and quick to resort to violence when pushed. Jean was also very cynical about defeating the Titans, believing that humanity has no chance against them and openly mocking more idealistic individuals like [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager), and saw resisting the Titans as a hopeless cause. However, despite these things, and although he presents himself as self-centered, Jean places high value on the lives of his comrades, and is willing to risk his life to prevent countless more deaths from his comrades. Even with his shortcomings, Jean has shown himself to be a natural leader, being able to understand others and assess situations well because of his flaws, and proves capable of leading his fellow soldiers when they are left confused and without a plan.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46498-ritqAj9FW6jX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46498
      },
      "rarity": "epic"
    },
    {
      "id": "carla-yeager",
      "name": "Carla Yeager",
      "alt_names": [
        "カルラ・イェーガー"
      ],
      "role": "supporting",
      "description": "Eren's mother.   ~!She's eaten alive in the second chapter.!~ Note: Carla Yeager is the official English translation by Kodansha.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n62475-CExspVnLfweu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62475
      },
      "rarity": "epic"
    },
    {
      "id": "grisha-yeager",
      "name": "Grisha Yeager",
      "alt_names": [
        "グリシャ・イェーガー",
        "Grisha Jaeger"
      ],
      "role": "supporting",
      "description": "Father of [Eren Yaeger](https://anilist.co/character/40882/Eren-Yeager) and caretaker of [Mikasa Ackerman](https://anilist.co/character/40881/Mikasa-Ackerman). He is a renowned doctor who was well respected in the District of Shiganshina after he saved the village from a mysterious viral epidemic by developing vaccines. He also provides a medical house call service to the people of Shiganshina and to various towns in addition to having a network of contacts within the Corps of the Shiganshina District. He is married to [Carla Yaeger](https://anilist.co/character/62475).\n\n~!In the basement of the Yeager family house, he hides a secret which he refers to as the \"truth\". Upon finding Eren after the fall of Wall Maria, he injects him with a series of chemicals and amnesiacs and entrusts him with the key to the \"truth\", before mysteriously disappearing. This strange serum resulted in Eren gaining the ability to transform into a titan.!~",
      "metadata": {
        "gender": "male",
        "age": "39",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62477-3AHBGul9bXK8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62477
      },
      "rarity": "epic"
    },
    {
      "id": "marco-bott",
      "name": "Marco Bott",
      "alt_names": [
        "マルコ・ボット",
        "Marco Bodt"
      ],
      "role": "supporting",
      "description": "__Height__: 178 cm (5'9\")\n__Affiliations__: 104th Training Corps\n\nOriginally from Jinae District. Marco ranked 7th in the 104th Training Corps and is widely respected by other cadets of the 104th. Marco is a very kind, calm, and idealistic person, valuing the good of the group above his own interests, as well as understanding and coping with his own shortcomings and limitations. He is seen as a natural leader, and desires to join the Military Police to serve near the King. \n\n*Note: Marco Bott is the official English translation by Kodansha.*",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62479-mYcTkU1RXymL.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62479
      },
      "rarity": "epic"
    },
    {
      "id": "krista-lenz",
      "name": "Krista Lenz",
      "alt_names": [
        "クリスタ・レンズ",
        "Christa",
        "Cattle-Taming Goddess"
      ],
      "role": "supporting",
      "description": "__Height__: 145 cm (4'8\")\n__Affiliations__: 104th Trainees Squad, Survey Corps\n\nRanked tenth in the trainee class, Krista is a very shy and kind, caring person, often being described as a \"goddess\" or \"angel\" by her peers. She is good friends with [Ymir](https://anilist.co/character/71479/Ymir).",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62481-ZZDa7vn17lMU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62481
      },
      "rarity": "epic"
    },
    {
      "id": "thomas-wagner",
      "name": "Thomas Wagner",
      "alt_names": [
        "トーマス・ワグナー"
      ],
      "role": "supporting",
      "description": "Thomas Wagner was from Trost District. A member of the 104th Trainees Squad, he first met Eren Yeager while questioning him about the Colossal Titan. Later, he operated the training gear for the Three Dimensional Maneuver Gear during Eren's second attempt at his aptitude test. At Keith Shadis' orders, Thomas exchanged gear with Eren and it was discovered that Eren's gear was defective. After graduating, Thomas planned to join the Scouting Legion.   ~!After the second attack of the Colossal Titan, he was assigned to the middle guard along with Eren Yeager and Armin Arlert. Initially tasked with working under the training corps, they eventually were incorporated into the front guard due to the number of titans. Catching the group unaware, a titan lunged at the rooftop they were standing on. The group scattered but unfortunately, Thomas wasn't fast enough. He was caught and swallowed whole, while his teammate, Eren, looked on in terror.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62483-zpSlfucUEgwQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62483
      },
      "rarity": "epic"
    },
    {
      "id": "dot-pixis",
      "name": "Dot Pixis",
      "alt_names": [
        "ドット・ピクシス",
        "Dot Pyxis",
        "Commander Pyxis"
      ],
      "role": "supporting",
      "description": "The highest-ranked Administrator of the Southern Region. Head of the Garrison's Southern Territories, Pixis is a cunning leader with astute insights. However, he is also an alcoholic who is constantly watched over by his aid, [Anka](https://anilist.co/character/84331/Anka-Rheinberger), who constantly scolds him for sleeping and drinking during critical moments.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62485-I0U5Cat3z65K.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62485
      },
      "rarity": "epic"
    },
    {
      "id": "petra-ral",
      "name": "Petra Ral",
      "alt_names": [
        "ペトラ・ラル",
        "Petra Rall"
      ],
      "role": "supporting",
      "description": "__Height:__ 158 cm (5'2\")\n__Affiliation:__ Survey Corps; Soldier, Special Operations Squad.\n__Relatives:__ [Father](https://anilist.co/character/131987/Petra-no-Chichi)\n\nPetra Ral is a soldier of the Survey Corps hand-picked by [Captain Levi](https://anilist.co/character/45627/Levi) to join the Special Operations Squad.\n\nPetra is a very kind and caring woman, going out of her way to look after and guiding [Eren Yaeger](https://anilist.co/character/40882/Eren-Yeager) when he was first admitted to the squad. She seemed to have the most attachment to Eren among Levi Squad, as she was often the only one shown to actually worry about him and his wellbeing, at least at first. Although all of Levi's squad wished for Eren's unconditional trust, it was ultimately Petra who convinced him to do so. \n\nDespite her kind nature, Petra was a conditioned soldier with a quick reaction time against perceived danger. She displays extreme loyalty to her leaders, superiors and their orders, and cares deeply for her team, although she tends to be at odds with [Oluo Bozad](https://anilist.co/character/71687/Oluo-Bozard) due to his irritating tendency to try and imitate Levi. She greatly looks up to Levi as her superior and is deeply devoted to him, willing to completely dedicate her life to his cause. It is implied that she may harbor romantic feelings for her captain.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n62501-CfTtAAgs64nE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62501
      },
      "rarity": "epic"
    },
    {
      "id": "mike-zacharias",
      "name": "Mike Zacharias",
      "alt_names": [
        "マイク・ザカリアス",
        "Miche"
      ],
      "role": "supporting",
      "description": "Squad Captain of his own squad, Squad Mike, a major division within the Survey Corps. He has been described by others as \"humanity's second strongest soldier\", being only behind [Levi](https://anilist.co/character/45627/Levi).\n\nMike is an extremely strong and durable soldier and an acknowledged leader with a brave heart and a tactical mind. He also has a remarkably good sense of smell, which allows him to detect Titans from great distances. During times of ease, Mike is shown to be a quiet and reserved man, rarely speaking unless it concerned a more serious matter. He also has a bizarre habit of \"sniffing\" people when he meets them.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/71119.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71119
      },
      "rarity": "epic"
    },
    {
      "id": "hange-zoe",
      "name": "Hange Zoe",
      "alt_names": [
        "ハンジ・ゾエ",
        "Hange Zoë",
        "Hanji",
        "Hans"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7\")\n__Affiliation:__ Survey Corps; Section Commander, Squad Leader.\n\nLeader of the Survey Corps' Fourth Squad, Hange is also in charge of conducting research on Titans, and pursues this knowledge so passionately that they have become obsessed with Titans as a result. After originally holding a deep hatred for the creatures, Hange decided to take on a new outside-the-box approach to their research by letting go of their resentment towards Titans and approaching the test subjects with compassion. \n\nHange is an energetic, freethinking and quirky scientist, with a unique way of conducting both themselves and their work. Hange is a genius outside of just Titan research too, using their brain to create weapons, tactical plans, and inventions for the benefit of humanity. As a leader, Hange is thoughtful of their comrades, and can easily figure out complex problems in order to create plans for their teammates to carry out.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71121-7R7CnQd3lHgt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71121
      },
      "rarity": "epic"
    },
    {
      "id": "darius-zackly",
      "name": "Darius Zackly",
      "alt_names": [
        "ダリス・ザックレー"
      ],
      "role": "supporting",
      "description": "The head of all three divisions of the army.   \n\n__ _Note:___ Darius Zackly is the official English translation by Kodansha.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71125-XXymqijVoYzV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71125
      },
      "rarity": "epic"
    },
    {
      "id": "nick",
      "name": "Nick",
      "alt_names": [
        "ニック",
        "Minister Nick"
      ],
      "role": "supporting",
      "description": "Pastor Nick is a member of a religion that worships the Walls as holy.  He claims that he lost his family as a result of addiction to Vine.   As a religious leader, Pastor Nick used his influence to oppose any modification of the walls, be it permanently sealing the gates or even mounting cannons on the top. Though he claimed it was blasphemy for humans to \"maim\" the wall,  ~!the real reason was to reduce the risk of workers discovering the Titans within during renovations.!~ (Source: Shingeki no Kyojin Wikia)  Note: Minister Nick is the official English translation by Kodansha.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n71453-IxgKWV5eR1pw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71453
      },
      "rarity": "epic"
    },
    {
      "id": "keiji",
      "name": "Keiji",
      "alt_names": [],
      "role": "supporting",
      "description": "Member of the Scouting Legion.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n71455-Mvk4Pz3tWUuN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71455
      },
      "rarity": "epic"
    },
    {
      "id": "marlo-freudenberg",
      "name": "Marlo Freudenberg",
      "alt_names": [
        "マルロ・フロイデンベルク"
      ],
      "role": "supporting",
      "description": "__Affiliations:__ Military Police, 104th Cadet Corps.\n\nRecruit of the Military Police stationed in Stohess District.\n\nWhile most who join the Military Police Regiment do so because they want a safe position far from the danger of the Titans, Marlo did so because he claims to want \"to uphold justice and do what's right.\", much to the amusement of his fellow officer, [Hitch Dreyse](https://anilist.co/character/86017/Hitch-Dreyse), whom he often clashes with due to them being near complete opposites. His goal is to rise to the top of the organization so he can stop the pilfering of taxes and misappropriation of land. Though steadfast in his idealism, he could make moral compromises to achieve his goal, confessing a willingness to act like \"scum\" in order to move up in rank. Due to his passion towards his ideals, he had often been compared to [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) by people who know both of them.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71457-7H5bMZezo4ze.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71457
      },
      "rarity": "epic"
    },
    {
      "id": "dieter-ness",
      "name": "Dieter Ness",
      "alt_names": [
        "ディータ・ネス"
      ],
      "role": "supporting",
      "description": "A member of the Scout Regiment and a team leader in the 57th Exterior Scouting Mission.\n\n~!He encounters the Female Titan, who catches Ness's line and whips it to the ground, killing him instantly.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n71459-LTpcvj8aO6i2.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71459
      },
      "rarity": "epic"
    },
    {
      "id": "luke-siss",
      "name": "Luke Siss",
      "alt_names": [
        "ルーク・シス"
      ],
      "role": "supporting",
      "description": "Luke Siss  was a skilled member of the Survey Corps and a participant during the 57th Expedition Outside the Walls.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/71461.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71461
      },
      "rarity": "epic"
    },
    {
      "id": "ymir",
      "name": "Ymir",
      "alt_names": [
        "ユミル",
        "Freckles",
        "Freckles Ymir"
      ],
      "role": "supporting",
      "description": "__Height:__ 172 cm (5'7\")\n__Affiliations:__ 104th Trainees Squad, Scouting Legion\n\nMember of the Scouting Legion. She seems selfish, cynical, bossy, sly, uncooperative, exploitative, and confrontational, but she can apparently be kind, especially to [Krista](https://anilist.co/character/62481/Krista-Lenz).",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71479-huCD908XIdqv.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71479
      },
      "rarity": "epic"
    },
    {
      "id": "nanaba",
      "name": "Nanaba",
      "alt_names": [
        "ナナバ"
      ],
      "role": "supporting",
      "description": "__Height__: 172 cm\n__Affiliation__: Scouting Legion Survey Corps",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71481-q2pfKJRFiNUE.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71481
      },
      "rarity": "epic"
    },
    {
      "id": "oluo-bozard",
      "name": "Oluo Bozard",
      "alt_names": [
        "オルオ・ボザド",
        "Oruo Bozad"
      ],
      "role": "supporting",
      "description": "__Height:__ 173 cm (5'8\")\n__Affiliations:__ Survey Corps; Soldier, Special Operations Squad\n__Relatives:__ [Mother](https://anilist.co/character/131991/Oluo-no-Haha), [Father](https://anilist.co/character/131994/Oluo-no-Chichi), Several Siblings.\n\nOruo Bozad is a soldier of the Survey Corps hand-picked by [Captain Levi](https://anilist.co/character/45627/Levi) for the Special Operations Squad for his especially high Titan kill record.\n\nOruo is a very self-confident, outspoken individual, and enjoys boasting about his own prowess. Despite his obnoxious demeanor, he is admittedly one of the best out of Levi Squad; having the highest kill count out of his peers, bested only by Levi. This only helps fuel his haughty nature. Though Oruo tries to come across as self-important, his cockiness is rarely taken seriously, and he is also shown to be somewhat clumsy, frequently biting his own tongue on accident while riding horses. Oruo also frequently attempts to imitate Levi, such as his rough speech and confident attitude, much to the frustration of one of his fellow teammates, [Petra Ral](https://anilist.co/character/62501).",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71687-jd78w4orXonI.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71687
      },
      "rarity": "epic"
    },
    {
      "id": "eld-gin",
      "name": "Eld Gin",
      "alt_names": [
        "エルド・ジン"
      ],
      "role": "supporting",
      "description": "__Height:__ 182 cm (6'0\")\n\nEld Gin is an elite soldier in the Survey Corps. He was hand-picked by [Captain Levi](https://anilist.co/character/45627/Levi) and placed in the Special Operations Squad, of which he is second-in-command.\n\nEld is a responsible and firm leader with a strong sense of duty. He does not talk much, but when he does, he did so bluntly and in a straightforward manner. He also seems to have been a veteran of sorts as he teased [Petra Ral](https://anilist.co/character/62501) and [Oluo Bozad](https://anilist.co/character/71687/Oluo-Bozard) about how they acted during their first expedition. He also seems to hold some sort of belief of what makes a true soldier, saying that a kill record alone does not make a great soldier.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71689-AkkBVdgOWjFU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71689
      },
      "rarity": "epic"
    },
    {
      "id": "gunther-schultz",
      "name": "Gunther Schultz",
      "alt_names": [
        "グンタ・シュルツ"
      ],
      "role": "supporting",
      "description": "__Height:__ 183 cm (6'0\")\n__Relatives:__ [Mother](https://anilist.co/character/131990/Gunther-no-Haha), [Grandfather](https://anilist.co/character/131986/Gunther-no-Ojsan).\n\nGunther Schultz is one of the Survey Corps soldiers hand-picked by [Captain Levi](https://anilist.co/character/45627/Levi) to join the Special Operations Squad, both for his strength and his distrust for [Eren Yaeger](https://anilist.co/character/40882/Eren-Yeager).\n\nBeing a soldier of the Survey Corps who survived multiple encounters with Titans significantly affected Gunther's personality, making him deeply obedient and loyal to his superiors. Within the Special Operations Squad, Gunther seems to be the most reasonable one. However, he is shown to get irritated when his comrades joke around with one another, showing he also possesses a stern side and does not take kindly if a soldier doesn't focus on the task at hand.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71691-9xxv0NFB2CWm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71691
      },
      "rarity": "epic"
    },
    {
      "id": "mina-carolina",
      "name": "Mina Carolina",
      "alt_names": [
        "ミーナ・カロライナ"
      ],
      "role": "supporting",
      "description": "Mina appears in Ch. 3. When the Colossal Titan appears outside Trost District, the burst of steam from its body knocks a number of trainees off the Wall. She follows when Eren instructs the other trainees to attack the Colossal Titan. After the second attack of the Colossal Titan, she was assigned to the middle guard along with Eren Yeager and Armin Arlert. Initially tasked with working under the training corps, they eventually were incorporated into the front guard due to the number of titans. Catching the group unaware, a titan lunged at the roof top they were standing on.   When Eren was talking about how killing titans that got in Trost District will get their rank up high, she joined him indicating that she is also signing up for Scouting Legion.   ~! After Eren's leg got bitten off by one of the titans, She and the other two tries to kill the titan that is responible for biting off Eren's leg. However, her Three Dimensional Maneuver Gear's wire was caught by titan's hand and was knocked over to the wall. When she found out where she was, it was too late for her to escape. She was caught by another titan and her face got bitten off.  !~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b83181-EiVdjFn702Mc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 83181
      },
      "rarity": "epic"
    },
    {
      "id": "keith-shadis",
      "name": "Keith Shadis",
      "alt_names": [
        "キース・シャーディス"
      ],
      "role": "supporting",
      "description": "Keith Shadis was the head instructor of the 104th Trainees Squad. He seemed to be a friend or have some sort of relationship with Dr. Grisha, as he knew Eren is the son of the doctor and praised Eren for his effort.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n84305-15nngV5nTUp6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84305
      },
      "rarity": "epic"
    },
    {
      "id": "hugo",
      "name": "Hugo",
      "alt_names": [
        "フーゴ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84307-faKVhlw386q7.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84307
      },
      "rarity": "epic"
    },
    {
      "id": "moses",
      "name": "Moses",
      "alt_names": [
        "モーゼス",
        "Brown"
      ],
      "role": "supporting",
      "description": "He was a member of the Scouting Legion and was the first person killed by a Titan at the start of the series. When the Recon Corps squad returns to the District of Shiganshina, his mother starts asking for him, and the Squad leader, gives her all that remained of him- his right arm. In the manga his name is Brown (ブラウン), although it is changed to Moses in the anime. (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84309-ntK7TKP6RkPe.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84309
      },
      "rarity": "epic"
    },
    {
      "id": "moses-no-haha",
      "name": "Moses no Haha",
      "alt_names": [
        "モーゼスの母"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n84311-iVwsDOzTSyvJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84311
      },
      "rarity": "epic"
    },
    {
      "id": "armin-no-ojii-san",
      "name": "Armin no Ojii-san",
      "alt_names": [
        "アルミンのお祖父さん",
        "Armin’s Grandfather"
      ],
      "role": "supporting",
      "description": "The paternal grandfather of Armin Arlert. Before the fall of Wall Maria, He possessed a book containing illegal information about the world beyond the Walls. He gave this book to his grandson, Armin Arlert, who showed it to his best friend Eren, kindling his desire to see the outside world",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84313-kYfb2g4OR7je.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84313
      },
      "rarity": "epic"
    },
    {
      "id": "samuel-linke-jackson",
      "name": "Samuel Linke-Jackson ",
      "alt_names": [
        "サムエル・リンケ-ジャクソン"
      ],
      "role": "supporting",
      "description": "Samuel is a member of the 104th Trainees Squad.  He appears in Ch. 3. When the Colossal Titan appears outside Trost District, the burst of steam from its body knocks a number of trainees off the Wall. While most are able to switch to their Three Dimensional Maneuver Gear and anchor themselves to the Wall, Samuel is struck in the head by a piece of falling rock and stunned. Sasha saves him from falling to his death by firing one of her grappling hooks into his leg. Eren tells Sasha to take Samuel somewhere safe, then instructs the other trainees to attack the Colossal Titan.\n\n~!He is killed by Connie after being shot three times in the head.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84315-MwzNp8eSjg8v.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84315
      },
      "rarity": "epic"
    },
    {
      "id": "franz-kefka",
      "name": "Franz Kefka",
      "alt_names": [
        "フランツ・ケフカ"
      ],
      "role": "supporting",
      "description": "Franz is a member of the 104th Trainees Squad.  Franz first appears Ch.3 in walking through Trost District with Eren and Hannah. Eren refers to Hannah and Franz as a couple, which they both embarrassedly deny.    ~!At some point following the breach of the Wall by the Colossal Titan, Franz is attacked by a Titan. He is bitten in half and dies.   Armin finds Hannah futilely attempting CPR on what remains of Franz's corpse. He tells her it's useless, and advises her to retreat to the Wall before it's too late.!~\n\n(Source: Shingeki no Kyojin Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84317-mIg4hGXJKhQt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84317
      },
      "rarity": "epic"
    },
    {
      "id": "hannah-diament",
      "name": "Hannah Diament",
      "alt_names": [
        "ハンナ・ディアマント"
      ],
      "role": "supporting",
      "description": "Hannah is a member of the 104th Trainees Squad.  Hannah first appears in Ch. 3 walking through Trost District with Eren and Franz. Eren refers to Hannah and Franz as a couple, which they both embarrassedly deny.   ~!In the 5th chapter, Armin finds Hannah in the street attempting to administer CPR to the corpse of Franz. Her efforts to resuscitate him are futile, as he has been bitten in half. Armin advises her to give up and retreat back to Wall Rose; then, unable to bear the carnage any longer, flees.   As she has not appeared since, it is unknown whether or not she took his advice and survived or remained and perished.!~ \n\n(Source: Shingeki no Kyojin Wikia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84319-MkSqCC8JlYR3.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84319
      },
      "rarity": "epic"
    },
    {
      "id": "daz",
      "name": "Daz",
      "alt_names": [
        "ダズ"
      ],
      "role": "supporting",
      "description": "Daz is a member of the 104th Trainees Squad.   \n\n~!In Ch. 40, Ymir and Historia Reiss recount a story about Dazz from training. Wanting praise and recognition, Dazz undertook harsh physical training in the snowy mountains. However, he wasn't strong enough to endure it, and nearly died. Ymir told Krista to leave him behind or her own life would be endangered; when Krista refused, Ymir used her Titan shifter powers to bring Dazz back to the camp safely.  In Ch. 12, when Dot Pixis announces the plan to reconquer Trost District, Dazz has a breakdown and starts screaming that he doesn't want to die. Though Marco Bott tries to quiet him, a commanding officer overhears and threatens to execute him. Dazz replies that execution would be better then being eaten by a Titan. However, Dot Pixis then announces that all deserters will be pardoned -- but have to live with the guilt that they abandoned their families to the Titans. Dazz is unable to leave his family to that fate, and returns to participate in the operation to plug the breach.   After the mission, he briefly appears in Chapter 21 standing next to Sasha Blouse when Irvin Smith gives a speech urging the 104th Training Squad members to join the Scouting Legion. As he is not present in the group of trainees who join, he presumably opted for the Stationary Guard instead.!~ \n\n(Source: Shingeki no Kyojin Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84321-i4A69zVC6YMM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84321
      },
      "rarity": "epic"
    },
    {
      "id": "megane-no-kyoukan",
      "name": "Megane no Kyoukan",
      "alt_names": [
        "眼鏡の教官"
      ],
      "role": "supporting",
      "description": "Instructor with glasses that first appears in episode 3 and is later seen in episode 5 teaching the 104th Corps what is known about the Titans and their origins.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84323-zHWF3Z83EZ7U.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84323
      },
      "rarity": "epic"
    },
    {
      "id": "kitz-weilman",
      "name": "Kitz Weilman",
      "alt_names": [
        "キッツ・ヴェールマン"
      ],
      "role": "supporting",
      "description": "The Captain of the Garrison's 1st Division Elite Forces",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84325-RGWFyLMV6JZV.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84325
      },
      "rarity": "epic"
    },
    {
      "id": "bart",
      "name": "Bart",
      "alt_names": [
        "バルト",
        "Barto"
      ],
      "role": "supporting",
      "description": "Original anime character. He is a Noble in the District of Marquis and friend of Pixis, who challenges him to leisurely games of chess. In the anime, as Pixis makes to leave upon learning of the invasion of Trost in the year 850, he tries to prevent him from going to the battlefield and instead have Pixis and his men stay and protect him and his property, viewing the lowly commoners being attacked as trash.  \n\n(Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84327-Wg2P1FSDecGc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84327
      },
      "rarity": "epic"
    },
    {
      "id": "gustav",
      "name": "Gustav",
      "alt_names": [
        "グスタフ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84329-vLIxfAIYGPug.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84329
      },
      "rarity": "epic"
    },
    {
      "id": "anka-rheinberger",
      "name": "Anka Rheinberger",
      "alt_names": [
        "アンカ・ラインベルガー"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84331-9r0TU5kEFitO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84331
      },
      "rarity": "epic"
    },
    {
      "id": "ian-dietrich",
      "name": "Ian Dietrich",
      "alt_names": [
        "イアン・ディートリッヒ"
      ],
      "role": "supporting",
      "description": "Ian is a member of the Stationary Guard in Trost District.  Ian first appears in Ch. 5 after Trost District is breached by the Colossal Titan. He compliments Mikasa for killing a Titan that was attacking a group of evacuating civilians.    ~!In Ch. 12, a plan is formed for Eren to use his Titan powers to seal the breach with a boulder. Ian is placed in charge of the elite squad assigned to protect Eren on his mission.   When Eren loses control of his Titan form in Ch. 13, Mitabi and Rico advise Ian to abort the mission and retreat. However, Ian orders his soldiers to continue to defend Eren down to the last man, as Eren is their only hope against the Titans.   In Ch. 14, Eren regains his senses due to Armin's intervention, and Ian orders his soldiers to protect him until he reaches the breach even at the cost of their own lives. Ian uses himself as bait to lure Titans away from Eren, sacrificing his life in order to ensure the success of the mission.!~ \n\n(Source: Shingeki no Kyojin Wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84333-s7JjasoIYuLK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84333
      },
      "rarity": "epic"
    },
    {
      "id": "nack-tierce",
      "name": "Nack Tierce",
      "alt_names": [
        "ナック・ティアス"
      ],
      "role": "supporting",
      "description": "One of the graduates from the 104th Training Corps. He was a part of the 34th squad sent to support the rear vanguard during the invasion of Trost. He was killed after the squad was ambushed by a group of Titans.  \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84335-o4ECgCR70JoD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84335
      },
      "rarity": "epic"
    },
    {
      "id": "mylius-zeramuski",
      "name": "Mylius Zeramuski",
      "alt_names": [
        "ミリウス・ゼルムスキー"
      ],
      "role": "supporting",
      "description": "One of the graduates from the 104th Training Corps. He was a part of the 34th squad sent to support the rear vanguard during the invasion of Trost.   ~!He was killed after the squad was ambushed by a group of Titans.!~ \n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84337-qoU8Uea1oT9C.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84337
      },
      "rarity": "epic"
    },
    {
      "id": "mikasa-no-chichi",
      "name": "Mikasa no Chichi",
      "alt_names": [
        "ミカサの父"
      ],
      "role": "supporting",
      "description": "He and his family lived in a forest within the Shiganshina District.\nHe seemed to be a lighthearted but hard working man. When asked by Mikasa how babies were made, he jokingly claimed he did not know and suggested she ask Dr. Jaeger when he arrives.\n~!It is hinted that Mikasa's father, or a close relative of his, was driven into poverty due to their business failing. As such, Mikasa's father and his family lived in the woods within the Shiganshina District to avoid persecution from the government!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n84339-O2BcKvQoHT94.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84339
      },
      "rarity": "epic"
    },
    {
      "id": "mikasa-no-haha",
      "name": "Mikasa no Haha",
      "alt_names": [
        "ミカサの母"
      ],
      "role": "supporting",
      "description": "Mikasa's mother.  First Appearance Anime: Ep. 6\nA woman of Oriental heritage appearing to be in her mid thirties.\nShe appeared to be a kind and loving mother, holding value in keeping with tradition. When her and Mikasa's lives were threatened, she quickly turned into a fierce mother, trying to do whatever was necessary to protect Mikasa.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n84341-o3ojpfHhp7o8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84341
      },
      "rarity": "epic"
    },
    {
      "id": "rico-brzenska",
      "name": "Rico Brzenska",
      "alt_names": [
        "リコ・ブレツェンスカ"
      ],
      "role": "supporting",
      "description": "The Squad Leader of the 1st Division Elite Force of the Stationary Guard.    ~!She is the sole survivor of the elite squads assigned to protect Eren during the liberation of Trost District. She does not trust Eren and still views him as a traitor.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b84707-b43XdPG1SCRK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 84707
      },
      "rarity": "epic"
    },
    {
      "id": "tom",
      "name": "Tom",
      "alt_names": [
        "トム"
      ],
      "role": "supporting",
      "description": "One of the graduates from the 104th Training Corps. During the invasion of Trost in the year 850, he was part of the squad including Jean and Mikasa whose Maneuvering Gears start to run out of propulsion fuel. As his fuel finally depletes he becomes surrounded by a group of Titans and is killed. Jean, who was in charge of the squad, capitalized on the opportunity and used him as bait to distract the Titans while the rest of the squad made their way back to the Headquarters to resupply.  (Source: Wikipedia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85211-twgcd2ZHhi1D.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85211
      },
      "rarity": "epic"
    },
    {
      "id": "hitch-dreyse",
      "name": "Hitch Dreyse",
      "alt_names": [
        "ヒッチ・ドリス"
      ],
      "role": "supporting",
      "description": "**Height:** 168 cm\n__Affiliations:__ 104th Cadet Corps.\n\nRecruit of the Military Police stationed in Stohess District. She was roommates with [Annie Leonhart](https://anilist.co/character/46490/Annie-Leonhart).\n\nHitch acts immature in certain ways, she has a sarcastic, easygoing personality and seems to mischievously enjoy teasing and needling her fellow officers, especially [Marlo Freudenberg](https://anilist.co/character/71457/Marlo-Freudenberg). She claims she chose to join the Military Police out of laziness, as it is well known that the senior staff are incredibly corrupt and she wanted to benefit from the system herself; however, she did not take into account that, as a new recruit, her superiors would dump all their work on her. Though she may act a bit air-headed at times, Hitch is not selfish and cares about those around her, especially her fellow comrades.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b86017-m6vXFRKWMwUo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86017
      },
      "rarity": "epic"
    },
    {
      "id": "mitabi-jarnach",
      "name": "Mitabi Jarnach",
      "alt_names": [
        "ミタビ・ヤルナッハ"
      ],
      "role": "supporting",
      "description": "Mitabi Jarnach is a member of the Stationary Guard in Trost District.   ~!Mitabi first appears in Ch. 13 as the leader of one of the units assigned to protect Eren on his mission to plug the breach in Trost's Wall created by the Colossal Titan. When Eren loses control of his Titan form, Mitabi advises Ian to abort the mission and retreat to the safety of Wall Rose; however, Ian orders him to continue defending Eren.   In Ch. 14, Eren regains his senses and begins carrying a boulder to plug the breach in the Wall. As there are too many Titans to fight them all, Mitabi and his men instead use themselves as bait to lure the Titans away from Eren, sacrificing their lives to ensure the success of the mission.!~ First Appearance Manga: Ch. 13 Anime: Ep. 11  (Source: Shingeki no Kyojin Wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b87385-4vMsvdmAUlNe.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 87385
      },
      "rarity": "epic"
    },
    {
      "id": "boris-feulner",
      "name": "Boris Feulner",
      "alt_names": [
        "ボリス・フォイルナー"
      ],
      "role": "supporting",
      "description": "is a member of the Military Police stationed in Stohess District. \n\nBoris came to Annie's defense when she got late to her duty, telling others to give her a rest. He stated that being the only one to experience the actual combat (Defense of Trost district) among her squad, Annie must be still suffering trauma from it. \n\nWhen Marlo tells his colleagues of his ambition to reform the Military Police, Boris tells Marlo good luck, albeit with nonchalance",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n127568-nYT2K5sXb1Y8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127568
      },
      "rarity": "epic"
    },
    {
      "id": "dimo-reeves",
      "name": "Dimo Reeves",
      "alt_names": [
        "ディモ・リーブス"
      ],
      "role": "supporting",
      "description": "Dimo Reeves is a merchant that leads the company that's named after him. He's stationed in Trost District.\n~!After the Battle of Trost, his company was assigned a mission to kidnap Eren and Historia by the Military Police Brigade.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n127572-7jc4LF687Ifv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127572
      },
      "rarity": "epic"
    },
    {
      "id": "moblit-berner",
      "name": "Moblit Berner",
      "alt_names": [
        "モブリット・バーナー"
      ],
      "role": "supporting",
      "description": "__Height:__ 176 cm (5'9\")\n__Affiliation:__ Survey Corps; Executive Officer, Fourth Squad.\n\nA veteran member of the Survey Corps and [Hange Zoe](https://anilist.co/character/71121/Hange-Zoe)'s second-in-command within the Survey Corps' Fourth Squad. He also serves as Hanji's assistant and messenger.\n\nHe comes across as an intelligent and responsible person, which may be the reason he was tasked to keep his overzealous and eccentric superior out of trouble. Much of the time, this leaves him in a state of near-panic, having to constantly remind Hange to be more careful or yanking them to safety. That he remains at Hange's side constantly suggests he is a loyal person, and that he cares deeply for his superior's safety, regardless of the stress involved with being under their command. He is also able to show signs of a serious nature when it comes to missions, going out of his way to investigate problems and put himself in danger before others.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n127573-VSYSvQ1VK1c7.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127573
      },
      "rarity": "epic"
    },
    {
      "id": "abel",
      "name": "Abel",
      "alt_names": [
        "ゴーグル",
        "Goggles"
      ],
      "role": "supporting",
      "description": "Goggles is a soldier in the Scout Regiment fourth squad under the command of Hange Zoë, who is noted for his trademark glasses, or \"goggles\". He participated in the 57th Exterior Scouting Mission and often accompanies higher ups, such as Hange and Levi, on serious missions.\n\n(Source: Shingeki no Kyojin Wikia)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n127681-9Xhk8VzIuKQ4.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127681
      },
      "rarity": "epic"
    },
    {
      "id": "phil",
      "name": "Phil",
      "alt_names": [
        "フィル"
      ],
      "role": "supporting",
      "description": "A member of the Garrison.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130625-PpwqwuxgDr1A.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130625
      },
      "rarity": "epic"
    },
    {
      "id": "dennis-aiblinger",
      "name": "Dennis Aiblinger",
      "alt_names": [
        "デニス・アイブリンガー"
      ],
      "role": "supporting",
      "description": "Military Police Officer stationed in the Stohess District.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b130657-66AtdJLhzfSk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 130657
      },
      "rarity": "epic"
    },
    {
      "id": "waltz",
      "name": "Waltz",
      "alt_names": [
        "ヴァルツ"
      ],
      "role": "supporting",
      "description": "He is a member of the Military Police Regiment who serves as Nile Dawk's aide",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131208-5499RN17GQAw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131208
      },
      "rarity": "epic"
    },
    {
      "id": "jurgen",
      "name": "Jurgen",
      "alt_names": [
        "ユルゲン"
      ],
      "role": "supporting",
      "description": "A member of the Scout Regiment and a participant of the 57th Exterior Scouting Mission.\n~!Jurgen was a reckless man, who disobeyed his superiors and put his entire brigade in danger just to retrieve a body. This recklessness would prove to be the end of him. When his friend Ivan was killed, he showed more composure than his friend Dieter; but he still chose to disobey his superiors to retrieve his body. In his final moments, he expressed great fear and regret on his face as he was killed without even completing the task he had set out to do!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131455-8WPESzF24pcm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131455
      },
      "rarity": "epic"
    },
    {
      "id": "darius-baer-walbrunn",
      "name": "Darius  Baer Walbrunn",
      "alt_names": [
        "ダリウス・ベーア＝ヴァルブルン "
      ],
      "role": "supporting",
      "description": "A team leader of the Scout Regiment who participated in the 57th expedition beyond the Walls.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131456-QWlf8CJM1iib.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131456
      },
      "rarity": "epic"
    },
    {
      "id": "dieter",
      "name": "Dieter",
      "alt_names": [
        "ディター"
      ],
      "role": "supporting",
      "description": "A member of the Scout Regiment and participated in the 57th Exterior Scouting Mission.\n~!Dieter appears very unconditioned and mentally cracking. He shows great distress over the death of his friend Ivan, and disobeys his superiors when they refuse his request to retrieve his body; resulting in the death of his friend Jurgen. When confronted by Captain Levi, Dieter bursts into tears, cracking under the mental stress he had endured. Though he shows passion for his friends, this passion manifests itself in the form of recklessness resulting in comrades deaths!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131457-vXCilQkE0NxX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131457
      },
      "rarity": "epic"
    },
    {
      "id": "gunther-sofu",
      "name": "Gunther Sofu",
      "alt_names": [
        "グンタ祖父",
        "Gunther's Grandfather"
      ],
      "role": "supporting",
      "description": "[Gunther](https://anilist.co/character/71691)'s grandfather.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n131986-6Re0rJWtpeJe.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131986
      },
      "rarity": "epic"
    },
    {
      "id": "petra-no-chichi",
      "name": "Petra no Chichi",
      "alt_names": [
        "ペトラの父"
      ],
      "role": "supporting",
      "description": "The father of [Petra Rall](https://anilist.co/character/62501), a skilled female member of Levi's former Special Operations Squad.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131987-JYRTZAMvHL7U.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131987
      },
      "rarity": "epic"
    },
    {
      "id": "eld-no-haha",
      "name": "Eld no Haha",
      "alt_names": [
        "エルドの母"
      ],
      "role": "supporting",
      "description": "Eld's mother. Appears in episode 22.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n131988-XMa1skXV2E0L.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131988
      },
      "rarity": "epic"
    },
    {
      "id": "peer",
      "name": "Peer",
      "alt_names": [
        "ペール"
      ],
      "role": "supporting",
      "description": "A member of the Scout Regiment",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131989-FWaEoAayjB4N.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131989
      },
      "rarity": "epic"
    },
    {
      "id": "gunther-no-haha",
      "name": "Gunther no Haha",
      "alt_names": [
        "グンタの母"
      ],
      "role": "supporting",
      "description": "Gunter's mother. Appears in episode 22.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n131990-v6rILcgW9MQa.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131990
      },
      "rarity": "epic"
    },
    {
      "id": "oluo-no-haha",
      "name": "Oluo no Haha",
      "alt_names": [
        "オルオの母"
      ],
      "role": "supporting",
      "description": "Oluo's mother. Appears in episode 22.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n131991-nW7ztKNllB8z.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131991
      },
      "rarity": "epic"
    },
    {
      "id": "elds-lover",
      "name": "Eld's Lover",
      "alt_names": [
        "エルド恋人"
      ],
      "role": "supporting",
      "description": "Appears in episode 22.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n131992-isinQRQQHyec.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131992
      },
      "rarity": "epic"
    },
    {
      "id": "oluo-no-chichi",
      "name": "Oluo no Chichi",
      "alt_names": [
        "オルオの父"
      ],
      "role": "supporting",
      "description": "Oluo's father.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n131994-F0MLEE5rQ0Oy.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131994
      },
      "rarity": "epic"
    },
    {
      "id": "ellie",
      "name": "Ellie",
      "alt_names": [
        "エリー"
      ],
      "role": "supporting",
      "description": "She is a young girl from the Calaneth District. She and her brother witness the departure and comeback of the Scout Regiment on the 57th Exterior Scouting Mission.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137201-SLx9NWWjdE5g.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137201
      },
      "rarity": "epic"
    },
    {
      "id": "zoku-3",
      "name": "Zoku 3",
      "alt_names": [
        "賊３",
        "Bandit 3"
      ],
      "role": "supporting",
      "description": "He is one of a trio of men who killed [Mikasa's father](https://anilist.co/character/84339) and [mother](https://anilist.co/character/84341) before kidnapping their daughter [Mikasa Ackerman](https://anilist.co/character/40881) in the year 844.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137283-ykMUBMJq2OBx.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137283
      },
      "rarity": "epic"
    },
    {
      "id": "zoku-2",
      "name": "Zoku 2",
      "alt_names": [
        "賊２",
        "Bandit 2"
      ],
      "role": "supporting",
      "description": "He is one of a trio of men who killed [Mikasa's father](https://anilist.co/character/84339) and [mother](https://anilist.co/character/84341) before kidnapping their daughter [Mikasa Ackerman](https://anilist.co/character/40881) in the year 844.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137284-N6WzhrtSRLVL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137284
      },
      "rarity": "epic"
    },
    {
      "id": "zoku-1",
      "name": "Zoku 1",
      "alt_names": [
        "賊１",
        "Bandit 1"
      ],
      "role": "supporting",
      "description": "He is one of a trio of men who killed [Mikasa's father](https://anilist.co/character/84339) and [mother](https://anilist.co/character/84341) before kidnapping their daughter [Mikasa Ackerman](https://anilist.co/character/40881) in the year 844.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137286-K7DBiibnqjKq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137286
      },
      "rarity": "epic"
    },
    {
      "id": "nile-dok",
      "name": "Nile Dok",
      "alt_names": [
        "ナイル・ドーク"
      ],
      "role": "supporting",
      "description": "Chief of the Military Police.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71123-FswK9rrdbR9h.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71123
      },
      "rarity": "epic"
    },
    {
      "id": "lobov",
      "name": "Lobov",
      "alt_names": [
        "ロボフ"
      ],
      "role": "supporting",
      "description": "A Scout Regiment recruit and former commander of the garrison who participated in the Raid on Liberio.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209872-Q1oywyIDj05n.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209872
      },
      "rarity": "epic"
    },
    {
      "id": "narrator",
      "name": "Narrator",
      "alt_names": [
        "ナレーター",
        "語り手",
        "ナレーション",
        "Narrador",
        "Rozprávač",
        "Vyprávěč",
        "Dış ses",
        "Narratore",
        "Pripovjedač",
        "Narradora",
        "Рассказчик",
        "Người dẫn chuyện",
        "Tagapagsalaysay",
        "내레이터",
        "Erzählperson",
        "מספר",
        "Narrátor",
        "讲述人",
        "راوي",
        "Forteller",
        "Berättare",
        "Αφηγητής",
        "Narrateur",
        "なれーしょん",
        "旁白",
        "Narrato"
      ],
      "role": "minor",
      "description": "This character page is set to represent and list all narrators, which haven't been given a visual representation of themselves in their respective work. \n\nPlease add other narrator characters, which were given a visual representation of themselves, separately from this narrator page.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36309-6KM0riV4lqfN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36309
      },
      "rarity": "epic"
    },
    {
      "id": "annie-no-chichi",
      "name": "Annie no Chichi",
      "alt_names": [
        "アニの父",
        "Annie's Father",
        "Mr. Leonhart",
        "レオンハート"
      ],
      "role": "minor",
      "description": "Father and trainer of Annie Leonhart. He relentlessly trained Annie to fight, using mostly kicks and the attacker's weight against them.\n~!Memories of his pleas for forgiveness later create an opening for Annie to crystallize herself before Eren Jaeger has the chance to capture her!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b131257-EywhPQF0aqVU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131257
      },
      "rarity": "epic"
    },
    {
      "id": "ivan",
      "name": "Ivan",
      "alt_names": [
        "イヴァン"
      ],
      "role": "minor",
      "description": "A member of the Scout Regiment and a participant of the 57th Exterior Scouting Mission.\n~!Ivan was killed during the Scout Regiment's 57th Expedition. As the Corps was returning to Calaneth District, two of Ivan's friends, Dieter and Jurgen, tried, unsuccessfully, to retrieve his body to return to his family!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n131458-X7IACq1k4I7N.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 131458
      },
      "rarity": "epic"
    },
    {
      "id": "bean",
      "name": "Bean",
      "alt_names": [
        "ビーン"
      ],
      "role": "minor",
      "description": "Beane was the name given by Hange Zoë to a 7m Titan which was captured after the reconquest of Trost District.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n133211-aFP1NreETocM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133211
      },
      "rarity": "epic"
    },
    {
      "id": "sonny",
      "name": "Sonny",
      "alt_names": [
        "ソニー"
      ],
      "role": "minor",
      "description": "Sonny was the name given by Hange Zoë to a 4m Titan which was captured after the reconquest of Trost District.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n133212-236DUAUFEHPr.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 133212
      },
      "rarity": "epic"
    },
    {
      "id": "mitsumete-no-kyojin",
      "name": "Mitsumete no Kyojin",
      "alt_names": [
        "見つめての巨人",
        "Peering Titan"
      ],
      "role": "minor",
      "description": "",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b140903-arzkiU9S48ZZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 140903
      },
      "rarity": "epic"
    },
    {
      "id": "louise",
      "name": "Louise",
      "alt_names": [
        "ルイーゼ"
      ],
      "role": "minor",
      "description": "A young girl who was in Trost with her mother attempting to flee when the Titans invaded. After being saved by [Mikasa Ackerman](https://anilist.co/character/40881/Mikasa-Ackerman) and the other 104th Cadets, she was inspired by their heroic actions and later joins the military herself as a Survey Corps recruit, hoping to get closer to Mikasa, her idol.\n\nLouise believes that strength is the most important attribute one can have in the world, to the point that she almost seems to have a \"might equals right\" mentality. Much of this mindset stems from her experiences during the Battle of Trost District, where she claims to have learned from watching Mikasa Ackerman fight in the face of adversity to achieve victory. She believes that the ends justify the means, and has no qualms about breaking rules if she believes that disobeying others will get her what she wants.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b209870-urk2Tf2nV0mQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 209870
      },
      "rarity": "epic"
    }
  ],
  "updated_at": "2025-12-22T23:54:24.682Z"
}