{
  "work_id": "domestic-girlfriend",
  "count": 15,
  "characters": [
    {
      "id": "natsuo-fujii",
      "name": "Natsuo Fujii",
      "alt_names": [
        "藤井夏生",
        "Nacchan",
        "Nat-chan"
      ],
      "role": "protagonist",
      "description": "__Height:__ 178 cm (5'10\")\n\nNatsuo Fujii is the main male protagonist of [Domestic na Kanojo](https://anilist.co/anime/103139/Domestic-na-Kanojo/). He is introduced as a second-year high school student who loves writing novels, so he frequently heads to the rooftop during his lunch breaks to develop his passion. It is there that he meets the rookie English teacher named [Hina Tachibana](https://anilist.co/character/127595/Hina-Tachibana), who becomes his first crush. His current appearance is far different from his junior high days thanks to following the suggestion of [Fumiya Kurimoto](https://anilist.co/character/135349/Fumiya-Kurimoto) (Natsuo's best friend), who forced him to wear contact lenses instead of eye glasses and have his curly hair flattened daily.",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127594-HhC0gZYT2fkE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127594
      },
      "rarity": "epic"
    },
    {
      "id": "hina-tachibana",
      "name": "Hina Tachibana",
      "alt_names": [
        "橘陽菜",
        "Hina-sensei",
        "Nee"
      ],
      "role": "protagonist",
      "description": "__Sign:__ Aries\n__Height:__ 1.65 m (5'4\")\n__Occupation:__ Teacher\n\nHina Tachibana, is one of the main female protagonists of the series. She is the elder sister of [Rui Tachibana](https://anilist.co/character/127596/Rui-Tachibana), but soon after [Tsukiko Tachibana](https://anilist.co/character/135347/Tsukiko-Tachibana) (Hina's divorced mother) marries a widower named [Akihito Fujii](https://anilist.co/character/135352/Akihito-Fujii), Hina becomes the stepsister of [Natsuo Fujii](https://anilist.co/character/127594/Natsuo-Fujii).\n\n_Appearance:_ Hina is a young woman with waist-length dark brown hair that has trimmed bangs which are parted above her right eye, emerald eyes, she is described to be well endowed with a voluptuous figure where men unable to take their eyes off of her when she's in swimwear and her natural beauty combined with her friendly personality has made her an outcast in high school due to the jealousy of female classmates back in her high school years. Nowadays, she is in her early twenties, but she is used to dressing up formally wearing a suit, a blouse and a knee-length skirt with medium-height heels. But at home she wears tops and shorts, and when she goes out, she wears nice dresses. So even though she is endowed with a nice feminine body, it is not perceived at simple sight.\n\n_Personality:_ Hina is a gentle and pure-hearted young woman whose cheerful attitude mixed with her naiveness gives her an aura of tenderness impossible to go unnoticed, even though she is a little bit clumsy and helpless at cooking. That actually caused her some distress back in her second year of high school, when her female friends out of jealousy decided to shun her. That was the time back then when she met a third year Biology teacher named [Shuu Hagiwara](https://anilist.co/character/135346/Shuu-Hagiwara), who after noticing she was crying while eating left alone in the science lab, used a hand puppet and a trick on ventriloquy to take her out of her sadness. It turned out that she became a regular there, until the teacher left the school by the end of that year. That experience might have pushed her into pursuing the career of teaching.\n~! It is also pretty much likely that due to a necessity of a paternal figure added to the kindness of [Shuu](https://anilist.co/character/135346/Shuu-Hagiwara), she developed a crush on him, which led her to get involved into an affair with him time after they ran into each other as she was in her fourth year at the university. !~\nIt is not so clear if she feels becoming a teacher is her true call, even though she admits she has worked really hard to get her license. She is really into comedy shows. She does enjoy festivals in general, not only for the food but for the different attractions, especially the goldfish scooping. She is afraid of cockroaches to the point of running away from seeing them, without worrying if she is wearing something or not. She also freezes up with thunder storms.",
      "metadata": {
        "gender": "female",
        "age": "23-34",
        "dateOfBirth": "1991-04-06"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127595-c4TtXpbmIKoK.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127595
      },
      "rarity": "epic"
    },
    {
      "id": "rui-tachibana",
      "name": "Rui Tachibana",
      "alt_names": [
        "橘瑠衣"
      ],
      "role": "protagonist",
      "description": "__Height:__ 160 cm (5'3\")\n__Occupations:__ High school student, Apprentice Chef\n\nRui is the younger sister of [Hina Tachibana](https://anilist.co/character/127595/Hina-Tachibana), but soon after [Tsukiko Tachibana](https://anilist.co/character/135347/Tsukiko-Tachibana) (Rui's divorced mother) marries a widower named [Akihito Fujii](https://anilist.co/character/135352/Akihito-Fujii), Rui becomes [Natsuo Fujii](https://anilist.co/character/127594/Natsuo-Fujii)'s step-sister.\n\nAt first glance, Rui is an aloof and blunt girl who is hard to read emotionally. Her standoffish personality has made it difficult for her to socialize. As her first meeting at a mixer, she didn't do much to interact with the others. Once someone passes through her cold demeanor, Rui is actually a very kind and loving girl throughout the series. In spite of this, it can be hard for her to express her feelings towards someone she genuinely likes. She is very supportive of people she cares about, in spite of their flaws and even if their desires conflict with her own. Rui has a tendency to pout when things don't go her way, though [Natsuo](https://anilist.co/character/127594/Natsuo-Fujii) finds this feature of hers adorable. Rui is also surprisingly easy to embarrass in spite of her stoic personality. When [Natsuo](https://anilist.co/character/127594/Natsuo-Fujii) lists all of her behaviors he finds cute, especially to other people in front of her, she becomes overwhelmingly flustered.",
      "metadata": {
        "gender": "female",
        "age": "16-28",
        "dateOfBirth": "1997-09-05"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b127596-VJjQQk2uWrgM.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 127596
      },
      "rarity": "epic"
    },
    {
      "id": "shuu-hagiwara",
      "name": "Shuu Hagiwara",
      "alt_names": [
        "萩原柊"
      ],
      "role": "supporting",
      "description": "__Occupation:__ Biology researcher\n\nShuu Hagiwara is a teacher and the ex-boyfriend of [Hina Tachibana](https://anilist.co/character/127595/Hina-Tachibana) due to fact that Shuu is married, therefore his relationship with [Hina](https://anilist.co/character/127595/Hina-Tachibana) for the last two years is an illicit affair and he also seems to have a good friendship with [Reiji Kiriya](https://anilist.co/character/135462/Reiji-Kiriya).\n\nShuu is a friendly and thoughtful person who has a playful side to him, owing to his puppets and ventriloquism skills. According to [Reiji Kiriya](https://anilist.co/character/135462/Reiji-Kiriya), Shuu was constantly sad and fatigued with having to deal with his wife. Because of his unhappy marriage, Shu was ready to take risks with his affair with [Hina Tachibana](https://anilist.co/character/127595/Hina-Tachibana). Unfortunately, he has been indecisive on ending the marriage for some time. When he noticed that [Natsuo Fujii](https://anilist.co/character/127594/Natsuo-Fujii) was in love with her as well, Shuu was a bit vexed, but nonetheless let [Hina](https://anilist.co/character/127595/Hina-Tachibana) choose between him or [Natsuo](https://anilist.co/character/127594/Natsuo-Fujii).",
      "metadata": {
        "gender": "male",
        "age": "32",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135346-OCF0mBCz9w98.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135346
      },
      "rarity": "common"
    },
    {
      "id": "tsukiko-tachibana",
      "name": "Tsukiko Tachibana",
      "alt_names": [
        "橘都樹子"
      ],
      "role": "supporting",
      "description": "__Eye color:__ Cyan\n__Hair color:__ Light brown\n\nTsukiko Tachibana is the mother of [Hina](https://anilist.co/character/127595/Hina-Tachibana) and [Rui Tachibana](https://anilist.co/character/127596/Rui-Tachibana) who began to date [Akihito Fujii](https://anilist.co/character/135352/Akihito-Fujii) after Jou Mikimoto (Tsukiko's ex-husband) left her for another woman. Tsukiko becomes the stepmother of [Natsuo Fujii](https://anilist.co/character/127594/Natsuo-Fujii) after she got married to [Akihito](https://anilist.co/character/135352/Akihito-Fujii).\n\n_Appearance:_ Tsukiko has chest-length light brown to blondish hair that is cropped up with bangs hanging on the left side, small wrinkles here and there, but she tends to have a cheerful expression, but that expression changes into rage at the drop of a hat whenever Jou Mikimoto (Tsukiko's ex-husband) is mentioned.\n\n_Personality:_ Tsukiko is a kind and warm woman who is pleasant to be around that she tends to think of others before herself and almost divorces [Akihito Fujii](https://anilist.co/character/135352/Akihito-Fujii) because she thought their marriage put a strain on their children. Again, her cheerful can turn into anger immediately whenever mention of her ex-husband is involved. She has long spoken ill of him to her girls, which had a negative affect on [Rui Tachibana](https://anilist.co/character/127596/Rui-Tachibana). However, Tsukiko has since been full of joy after meeting [Akihito](https://anilist.co/character/135352/Akihito-Fujii).",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135347-RnnY7E3yZ0gi.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135347
      },
      "rarity": "common"
    },
    {
      "id": "momo-kashiwabara",
      "name": "Momo Kashiwabara",
      "alt_names": [
        "柏原もも"
      ],
      "role": "supporting",
      "description": "__Occupation:__ College student / Ob-gyn\n\nMomo Kashiwabara is a supporting character. She is a member of the Literature Club and a friend of [Rui Tachibana](https://anilist.co/character/127596/Rui-Tachibana).\n\nShe fits the 'Genki' female archetype in the manga as she is constantly an energetic girl with a bubbly personality who is also incredibly eccentric and overly friendly to some people as shown when she gave [Rui Tachibana](https://anilist.co/character/127596/Rui-Tachibana) a nickname and one of the dolls from her bag upon their first meeting. As noted by the girls in her class, Momo is also very flirtatious towards boys, flirtations that are rumored have evolved into sexual relations on more than one occasion. She also exhibits a childish side, as shown by her nicknames like \"Rui-Rui\" and calling sex \"making love-love\". She has a massive crush on [Natsuo Fujii](https://anilist.co/character/127594/Natsuo-Fujii), which has often gone to obsessive extremes like clinging to his arm and feeding him boxed lunches she made without his knowledge. However, beneath her flirtatious and bubbly nature lies deep vulnerability and a possible self-loathing. Her parents have a very bad relationship and they are almost always working, which leaves Momo by herself for nearly whole days on end.\n~! As a result of this and her poor relationships with her peers, she once began self-harming. One of the reasons she loves [Natsuo](https://anilist.co/character/127594/Natsuo-Fujii) is due to the fact that despite knowing about her self-harming and her attitudes towards boys, he is still nice to her. !~\n\n~! She has several overlapping scars on her wrist from her \"short phase\" of self-harm. Very few people, save for her sexual partners and Natsuo have seen them, with the latter being the only one who empathized with her. !~\n\n~! She later falls in love and marries Ritsu Osaka, and has an unnamed daughter by the end of the series. !~",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135348-IowwV47YPQpL.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135348
      },
      "rarity": "common"
    },
    {
      "id": "fumiya-kurimoto",
      "name": "Fumiya Kurimoto",
      "alt_names": [
        "栗本文哉"
      ],
      "role": "supporting",
      "description": "__Hair color:__ Brown\n__Occupation:__ Waiter at L'Amant\n\nFumiya Kurimoto is [Natsuo](https://anilist.co/character/127594/Natsuo-Fujii)'s best friend and confidant. He is a waiter at L'Amant along with [Masaki Kobayashi](https://anilist.co/character/135548/Masaki-Kobayashi) and Ayano. Kurimoto lives in an apartment with his mother and younger sister. Before high school, he used to attend the same class as [Natsuo](https://anilist.co/character/127594/Natsuo-Fujii) and lived in the same apartment building. He is currently attending Tokyo University with aspirations of becoming a lawyer.\n\n_Appearance:_ Kurimoto has a neatly trimmed professional haircut. He appears stocky, if not more portly compared to [Natsuo](https://anilist.co/character/127594/Natsuo-Fujii), though he is apparently stronger seeing as he tends to get the upper hand when they wrestle each other. He's almost never seen without his glasses.\n\n_Personality:_ Kurimoto cares for [Natsuo](https://anilist.co/character/127594/Natsuo-Fujii) and has his best interests at heart. Kurimoto will always help him out whenever he can, whether its to listen to his problems and offer solutions, or let him stay over in his room if he's having problems at home. Despite that, Kurimoto is envious of his encounters with women, and he will express his disdain verbally or by putting [Natsuo](https://anilist.co/character/127594/Natsuo-Fujii) in a wrestling hold. Though Kurimoto is older and in college, he longs to have romantic experiences with women. He is especially attracted to older women.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135349-E0p9qY1SMQ0P.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135349
      },
      "rarity": "common"
    },
    {
      "id": "kazuyaki-kine",
      "name": "Kazuyaki Kine",
      "alt_names": [
        "木根和志"
      ],
      "role": "supporting",
      "description": "[Natsuo Fujii's](https://anilist.co/character/127594) classmate.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135350-EdZKwbBrj6Q6.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135350
      },
      "rarity": "common"
    },
    {
      "id": "miu-ashihara",
      "name": "Miu Ashihara",
      "alt_names": [
        "葦原美雨"
      ],
      "role": "supporting",
      "description": "(at the beginning)\n__Eye color:__ Green\n__Hair color:__ Dark green\n__Occupation:__ College student\n__Debut:__ Chapter 17 / Episode 6\n\nMiu Ashihara is the former president of the Literature Club.\n\n_Appearance:_ Miu has dark green hair that is styled in a bobcut with her bangs covers much of her forehead and olive green eyes.\n\n_Personality:_ Miu has an innocent vibe who can be awkward at times, especially when she's with their adviser. Her bashfulness is more intense than [Rui Tachibana](https://anilist.co/character/127596/Rui-Tachibana)'s. Just like [Natsuo Fujii](https://anilist.co/character/127594/Natsuo-Fujii), Miu is a hardcore bookworm and an aspiring novelist. Miu is also one of the primary targets of [Momo Kashiwabara](https://anilist.co/character/135348/Momo-Kashiwabara)'s pranks.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135351-BiTe7N8VHIO3.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135351
      },
      "rarity": "common"
    },
    {
      "id": "akihito-fujii",
      "name": "Akihito Fujii",
      "alt_names": [
        "藤井昭人"
      ],
      "role": "supporting",
      "description": "__Hair color:__ Dark grey\n\nAkihito Fujii is the father of [Natsuo Fujii](https://anilist.co/character/127594/Natsuo-Fujii). He began to date [Tsukiko Tachibana](https://anilist.co/character/135347/Tsukiko-Tachibana), after Akihito's wife died and he becomes the stepfather of [Hina Tachibana](https://anilist.co/character/127595/Hina-Tachibana) and [Rui Tachibana](https://anilist.co/character/127596/Rui-Tachibana) after remarrying [Tsukiko](https://anilist.co/character/135347/Tsukiko-Tachibana).",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135352-111kWl5Gqj6N.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135352
      },
      "rarity": "common"
    },
    {
      "id": "reiji-kiriya",
      "name": "Reiji Kiriya",
      "alt_names": [
        "桐谷怜士",
        "Kiriya Sensei",
        "You Hasukawa",
        "蓮川要"
      ],
      "role": "supporting",
      "description": "__Eye color:__ Dark green\n__Hair color:__ Light purple\n__Occupation:__ Teacher / Novelist\n__Debut:__ Chapter 17 / Episode 6\n\nReiji Kiriya is a professional author and teacher who publishes under the pen name of You Hasukawa. He teaches Modern Japanese at [Natsuo Fujii](https://anilist.co/character/127594/Natsuo-Fujii)'s high school and the monitor of the Literature Club. Kiriya has a friendly relationship to [Shuu Hagiwara](https://anilist.co/character/135346/Shuu-Hagiwara), leading him to know [Hagiwara](https://anilist.co/character/135346/Shuu-Hagiwara)'s situation with [Hina Tachibana](https://anilist.co/character/127595/Hina-Tachibana).\n\n_Appearance:_ Kiriya is a handsome young man with shoulder-length light-purple hair that has a few strands hanging over his face and empty dark-colored eyes.\n\n_Personality:_ Kiriya has a cool and laid back demeanor who is considered an odd ball by other teachers, but his work as an educator is flawless. He is understanding of complicated relationships, and believes love can transcend age, gender, as well as social norms and status. Kiriya has a playful side to him, as he is known to tease his students. As mellow as he may be, he's not above strong-arming [Natsuo Fujii](https://anilist.co/character/127594/Natsuo-Fujii) into joining the Literature Club, especially after noticing he borrowed a book without permission.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135462-C4oYV7PlmXhC.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135462
      },
      "rarity": "common"
    },
    {
      "id": "masaki-kobayashi",
      "name": "Masaki Kobayashi",
      "alt_names": [
        "小林昌樹",
        "マリー",
        "Marie",
        "The Master",
        "Mari-san"
      ],
      "role": "supporting",
      "description": "__Eye color:__ Brown\n__Hair color:__ Black\n__Occupation:__ Owner of L'Amant restaurant\n__Debut:__ Chapter 5 / Episode 3\n\nMasaki Kobayashi is the owner of L'Amant (French for 'The Lover') restaurant and a former Yakuza. He's an openly gay man and prefers to be addressed as Marie, though he is often addressed as The Master or Mari-san by others. His coworkers are [Fumiya Kurimoto](https://anilist.co/character/135349/Fumiya-Kurimoto) and Ayano. Kobayashi tends to aid [Natsuo](https://anilist.co/character/127594/Natsuo-Fujii) and others by providing advice and consultation.\n\n_Appearance:_ Kobayashi is a strong and athletic individual, keeping himself in shape with various exercise, including yoga. He has long, curly black hair that is often tied in a ponytail, and sports a light trimmed mustache. He is very high maintenance, keeping his body hairless and well moisturized, and wears expensive cologne. Kobayashi has a typical Yakuza style tattoo that covers his back and parts of his chest. Although he can look quite intimidating when wearing his old Yakuza outfits, he often prefers to wear something more effeminate and/or revealing. His typical work attire includes a usual waiter's button shirt and bowtie, but he happens to wear very short trousers with leggings. He is also not opposed to dressing in drag, wearing a fundoshi, or even a leather thong.\n\n_Personality:_ Kobayashi is a bright, cheerful, and flamboyant person. He often speaks in an effeminate form of speech. Because of this, he can speak on the same level with the females of the series, and can even be quite snarky with them. Kobayashi insists that people call him Marie or Mari-san, and gets irked when people address him by his actual name. Kobayashi is an empathetic person, sensing when others are emotionally disturbed and offers whatever advice he can - though sometimes that can come with a consultation fee of having to buy a drink from him. Kobayashi is also flirtatious, often teasing [Natsuo](https://anilist.co/character/127594/Natsuo-Fujii) and asking any men he meets if they're single.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b135548-ThgGfhl0YJ2l.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 135548
      },
      "rarity": "common"
    },
    {
      "id": "saki-kusumoto",
      "name": "Saki Kusumoto",
      "alt_names": [
        "楠本沙希 "
      ],
      "role": "supporting",
      "description": "She is a former student of Reiji Kiriya.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137185-DqK3gOYlxDnr.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137185
      },
      "rarity": "common"
    },
    {
      "id": "alex-j-matsukawa",
      "name": "Alex J. Matsukawa",
      "alt_names": [
        "松川 ・J ・ アレックス",
        "Al"
      ],
      "role": "supporting",
      "description": "He is an American high school student and a member of the literature club. He is a bit careless and laid back.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137186-3SOaZROG9cWO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137186
      },
      "rarity": "common"
    },
    {
      "id": "miyabi-serizawa",
      "name": "Miyabi Serizawa",
      "alt_names": [
        "芹沢雅"
      ],
      "role": "supporting",
      "description": "Miyabi Serizawa is a college student and actress attending Meiji University, a prominent member of the college drama club Forester who has been the lead actress in many of its productions and the childhood friend of Yuka Kusanagi.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b137324-FXoVrPJmCeRs.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 137324
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-25T07:39:39.892Z"
}