{
  "work_id": "assassination-classroom",
  "count": 15,
  "characters": [
    {
      "id": "koro-sensei",
      "name": "Koro-sensei",
      "alt_names": [
        "殺せんせー ",
        "Prince of the Fateful Eternal Wind",
        "Octopus of Idiotic Perverted Chicken",
        "Quiz Show",
        "Octopus",
        "The Creature of Mass Destruction",
        "Guinea Pig",
        "Unkillable Teacher",
        "Demon King",
        "Octorazzi"
      ],
      "role": "protagonist",
      "description": "__Height:__ ~300cm (~9'10\")\n\nHe is a teacher for class 3-E of Kunugigaoka Junior High School and the main antihero of Ansatsu Kyoushitsu. He claims responsibility for blowing up the moon into a permanent crescent shape and plans to destroy the Earth in a year after teaching the students of class 3-E the art of assassination. His name comes from korosenai (殺せない), meaning \"cannot be killed\", and sensei (先生), meaning teacher. In this way, he is literally called the unkillable teacher.\n\n~!Later in the story he is revealed to have been original reaper named Ryushi Korogane.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65643-jimrOw0RGtoB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65643
      },
      "rarity": "epic"
    },
    {
      "id": "nagisa-shiota",
      "name": "Nagisa Shiota",
      "alt_names": [
        "潮田渚",
        "Androgynous",
        "Gender",
        "The Grim Reaper in Camo"
      ],
      "role": "protagonist",
      "description": "__Height:__ 159 cm (5'2.5\")\n__Class:__ Class 3-E \n\nHe is one of the students in Class 3-E. Nagisa is seen as one of the weakest students in the class due to his small stature and mediocre physical abilities that are comparable to a girl. However, he is actually the most talented to become an assassin out of all the students, something acknowledged by Korosensei and Karasuma. He is able to draw closer while hiding his bloodlust to make a surprise attack and able to make his opponents falter through his bloodlust alone.  Nagisa usually writes Korosensei's weaknesses that at first seen minor (since it doesn't look like major weaknesses), but eventually revealed to be useful since once they're able to almost kill Korosensei because of one of his weaknesses that is the same as the one that Nagisa has written down in his note.  Outwardly friendly and polite to his friends and everyone, he hides a somewhat darker side of him as an assassin that won't be able to be found out during daily classes and will only be shown during training and assassination time. According to Karasuma, whenever Nagisa unleashes his killing intent, he isn't training and truly goes for a kill.\n\n~!In the end, he kills [Koro-Sensei](https://anilist.co/character/65643/Korosensei).!~\n\n~!In the epilogue, 7 years later, Nagisa becomes a teacher of Paradise High School's Class 3-5, Deciding to follow in Koro-sensei's steps.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b65645-nWH4mBMW5lYw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 65645
      },
      "rarity": "epic"
    },
    {
      "id": "karma-akabane",
      "name": "Karma Akabane",
      "alt_names": [
        "赤羽カルマ",
        "Semi-Senioritis",
        "Cool 'n' Aloof",
        "Reddie Redhead",
        "Mr. Humiliated Failure in The First Semester",
        "Twisted Twit",
        "Knight",
        "Eternal Eighth Grader",
        "Buddy",
        "Ginger Shrimp"
      ],
      "role": "supporting",
      "description": "**Height:** 175 cm\n\nA student in Korosensei's class 3-E of Kunugigaoka Junior High School who had been suspended from school due to his violent behavior.  He excels at using weaponry and foul play and is the only student thus far to have successfully injured Korosensei. Despite this, he is actually rather smart and manages a perfect score on one of Korosensei's tests. He and Nagisa were in the same class during their 1st and 2nd years at Kunugigaoka.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71933-HQ1TSjlrJ8Hv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71933
      },
      "rarity": "uncommon"
    },
    {
      "id": "tadaomi-karasuma",
      "name": "Tadaomi Karasuma",
      "alt_names": [
        "烏間惟臣",
        "Da Densest"
      ],
      "role": "supporting",
      "description": "He is a government worker associated with the Ministry of Defense. He first appeared announcing Korosensei's deal with the government and their mission to assassinate him before the end of the year. He later became the assistant teacher and P.E. instructor of class 3-E, using his lessons to train the students in assassination techniques. He is well known among militaries for his outstanding reputation and is a powerful individual, which he has proven when he easily overpowered Irina's master, who is a retired professional hitman, and even Korosensei himself is afraid upon seeing his capability for the first time. He is strict, but kind man, though he keeps a distance between himself and the students due to his status as an agent and his own professionalism. He is one of a few who is very perceptive enough to see Nagisa's talent as an assassin. He seems to know Korosensei's past, though he has no intention to indulge into it further.",
      "metadata": {
        "gender": "male",
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/73881-Ukr6cBzK8dsi.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 73881
      },
      "rarity": "uncommon"
    },
    {
      "id": "irina-jelavic",
      "name": "Irina Jelavic",
      "alt_names": [
        "イリーナ・イェラビッチ",
        "Bitch-sensei",
        "Bitchy Vitchy",
        "Ирина Јелавић",
        "Bitchy Jelabitch",
        "Madame Pouffe",
        "Yellow Bitch"
      ],
      "role": "supporting",
      "description": "__Occupation:__ Professional Hitman, Part-time Foreign Language Teacher \n\nShe is a professional hitwoman who is hired to kill Korosensei by becoming a part-time foreign language teacher in class 3-E. She uses her charms to seduce Korosensei, making him at first obeys to whatever she asks. However, her first assassination attempt was foiled when Korosensei able to suppressed her 3-men's attacks, ending in her humiliation and swore revenge. She teaches the students how to seduce people from other countries, so that with this method, they can learn foreign languages, and usually would punish male students who failed answering her questions during her lesson by kissing them.    \n\nIrina is a deceitful, wily and beguiling individual; she frequently uses her charm to influence and manipulate her targets. She can easily befriend people, if she so chooses, and entice them to let down their defenses and become vulnerable to her.Seduction is primarily the technique she employs, and it is her area of expertise. Irina is a professional assassin who excels at handling infiltration and approaching targets. She possesses strong conversational skills in ten languages, and a proven track record of eleven jobs in countries all over the world.",
      "metadata": {
        "gender": "female",
        "age": "20",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b73883-ajlj28kkjxlb.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 73883
      },
      "rarity": "uncommon"
    },
    {
      "id": "ritsu",
      "name": "Ritsu",
      "alt_names": [
        "律",
        "Fixed Autonomously Thinking Artillery",
        "Box o' Moe",
        "自律思考固定砲台"
      ],
      "role": "supporting",
      "description": "An artificial intelligence developed in Norway and sent to Class 3-E as a transfer student to dispose of Korosensei, able to learn his movement patterns and perfect her shooting skills in order to eventually kill him. After receiving a few modifications from Korosensei, she develops a conscience and becomes friends with the rest of class 3-E, who give her her shortened nickname. Thanks to her processing power, she frequently helps with Intel gathering and communications and usually interacts with others via a smartphone application developed by her classmates.\n\nShe is portrayed by Kanna Hashimoto in the live action movie.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/74832-88SvstxVuDGn.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74832
      },
      "rarity": "uncommon"
    },
    {
      "id": "kaede-kayano",
      "name": "Kaede Kayano",
      "alt_names": [
        "茅野カエデ",
        "Forever 0",
        "Princess"
      ],
      "role": "supporting",
      "description": "She is one of Nagisa's classmates and close friends, being the one who is mostly seen with him. She hasn't shown any capabilities during her training to become an assassin, and so far has only been shown to discuss Korosensei's weaknesses along with Nagisa. She experiences a slight inferiority complex when it comes to sex appeal, resulting her to get angry whenever there's a woman with big breasts and readily protest.\n\n~!it's revealed later in the story that she's [Aguri Yukimura's](https://anilist.co/character/207936/Aguri-Yukimura) younger sister, Akari Yukimura and her real birthday is on November 9.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/85291-io7X60xBW1LK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85291
      },
      "rarity": "uncommon"
    },
    {
      "id": "itona-horibe",
      "name": "Itona Horibe",
      "alt_names": [
        "堀部イトナ",
        "Picture Book Graduate"
      ],
      "role": "supporting",
      "description": "Transfer student who aims to kill Koro-sensei. He is the second assassin transfer student to arrive at Class 3-E, following the previous assassin, Ritsu. He initially served as the secondary antagonist, before ultimately joining Class E for good. After being abandoned by Shiro and befriending Terasaka and his gang, Itona has since become more mellow and humble, and is now able to admit people are stronger than him, while still retaining his brutal honesty. He has also shown to be a very observant and creative individual.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85293-VJJa4wciJTcl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85293
      },
      "rarity": "uncommon"
    },
    {
      "id": "manami-okuda",
      "name": "Manami Okuda",
      "alt_names": [
        "奥田愛美"
      ],
      "role": "supporting",
      "description": "She is a student in class 3-E of Kunugigaoka Junior High School, taught by Korosensei.   Okuda is shy and rather introverted. She admits that she isn't really good with surprise attacks and expressing things in language. She excels in chemistry and capable of making poisons for assassinations.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85297-8OfrLDyEL7Su.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85297
      },
      "rarity": "uncommon"
    },
    {
      "id": "tomohito-sugino",
      "name": "Tomohito Sugino",
      "alt_names": [
        "杉野友人",
        "Justice",
        "Baseball Geek"
      ],
      "role": "supporting",
      "description": "He is one of the students and Nagisa's close friends. He used to be a basketball player in their school's basketball club until he was assigned into class 3-E, making him kicked out from the club. He dreams to become a professional baseball player like his idol, Arita, and emulates his techniques to improve his own performance in baseball and is shown to very dedicated to it. He also sometimes used his baseball techniques in his attempts to kill Korosensei. He has a crush on Yukiko.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85299-2dScCDdb30uf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85299
      },
      "rarity": "uncommon"
    },
    {
      "id": "megu-kataoka",
      "name": "Megu Kataoka",
      "alt_names": [
        "片岡メグ",
        "Motivated Meg",
        "Meg-meg"
      ],
      "role": "supporting",
      "description": "She is a student of Kunugigaoka Junior High School. She is assigned to Class 3-E, where she trains to become a professional assassin, with her teacher as the target. She is one of the two class representatives of Class 3-E, with the other being Yūma Isogai.  (Source: Ansatsu Kyoushitsu Wikia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/85799-z6SKUG1Zf1lo.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85799
      },
      "rarity": "uncommon"
    },
    {
      "id": "yuma-isogai",
      "name": "Yuma Isogai",
      "alt_names": [
        "磯貝悠馬",
        "Mr. Handsome"
      ],
      "role": "supporting",
      "description": "He is a student and class rep in class 3-E of Kunugigaoka Junior High School, taught by Korosensei.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85801-g9riqQUgVilK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85801
      },
      "rarity": "uncommon"
    },
    {
      "id": "yukiko-kanzaki",
      "name": "Yukiko Kanzaki",
      "alt_names": [
        "神崎由紀子",
        "Mistress Kanzaki",
        "Wife"
      ],
      "role": "supporting",
      "description": "She is a student of Kunugigaoka Junior High School. She is assigned to Class 3-E, where she trains to become a professional assassin, with her teacher as the target.   Yukiko is diligent, ladylike, and cordial; although she does not particularly stand out, she is popular with her classmates. A very considerate individual, she had, on one occasion, volunteered to buy drinks for everyone in her class. Yukiko is deliberative and an excellent organizer. She was responsible for structuring the schedule for Class 3-E's trip to Kyoto, and her work had impressed Korosensei. Furthermore, she is adept in considering all factors before making a decision, which is why she had chosen the virtually unoccupied Gion District as the ideal setting for the assassination to take place.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/85803-bsBxjH7Z9wqc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85803
      },
      "rarity": "uncommon"
    },
    {
      "id": "takuya-muramatsu",
      "name": "Takuya Muramatsu",
      "alt_names": [
        "村松卓也",
        "Loofah"
      ],
      "role": "supporting",
      "description": "Takuya Muramatsu is a student of Kunugigaoka Junior High School. He is assigned to Class 3-E, where he trains to become a professional assassin, with his teacher as the target. His partners are Ryōma Terasaka and Taiji Yoshida.   Muramatsu is an inconsiderate individual, unmindful to the consequences of his actions. He is willing to resort to any means in order to escape contemptible circumstances. He collaborates with Ryōma Terasaka and Taiji Yoshida, and together they pressure others to act according to their bidding.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85805-tFGjVCo8ob3w.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85805
      },
      "rarity": "uncommon"
    },
    {
      "id": "sousuke-sugaya",
      "name": "Sousuke Sugaya",
      "alt_names": [
        "菅谷宗介"
      ],
      "role": "supporting",
      "description": "He is a student of Kunugigaoka Junior High School. He is assigned to Class 3-E, where he trains to become a professional assassin, with his teacher as the target.  Sousuke is exceptionally skilled at drawing and sculpting. His proficiency ranges from posters to disguise masks; he can make them with relative ease. He is also strongly individualistic, and launches attacks against Korosensei in a capricious, unpredictable manner; for instance, he offers to draw a Henna tattoo on Korosensei, but secretly had the Anti-Sensei bullets grounded into a fine powder and then mixed with the Henna paint.  (Source: Assassination Classroom wikia)",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85807-mOgdYvQ0zlDD.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85807
      },
      "rarity": "uncommon"
    }
  ],
  "updated_at": "2025-12-24T19:04:07.736Z"
}