{
  "work_id": "kaguya-sama-love-is-war-ultra-romantic",
  "count": 15,
  "characters": [
    {
      "id": "kaguya-shinomiya",
      "name": "Kaguya Shinomiya",
      "alt_names": [
        "四宮かぐや",
        "Muscle Queen",
        "Auntie",
        "Princess",
        "Demon",
        "Mistress Kaguya",
        "Vice President"
      ],
      "role": "protagonist",
      "description": "__Height:__ 158 cm\n\nThe vice president of the student council of Shuchiin Academy, member of the wealthy Shinomiya family, she is a multi-talented genius who can do anything if she sets her mind to it. Due to the way she was raised, she instinctively looks down on others and thinks of ways to use them for her own benefit. Kaguya rarely interacted with other people before she joined the student council, but that has begun to change. She is an incredibly sheltered girl, resulting in her lacking in several pieces of what might be considered common sense. She still doesn’t understand love very well, and her main objective is to make [Miyuki Shirogane](https://anilist.co/character/121101) fall in love and confess to her.\n\nLater in the series: ~!She confesses her love to Miyuki Shirogane and they start dating.!~\n\n ~!In a Oshi no Ko special chapter, it was revealed that she married Miyuki and changed her surname to Kaguya Shirogane!~",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": "2003-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b120649-NPaWaIpWy60E.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 120649
      },
      "rarity": "legendary"
    },
    {
      "id": "miyuki-shirogane",
      "name": "Miyuki Shirogane",
      "alt_names": [
        "白銀御行",
        "Kaichou (会長)",
        "Prez",
        "Myuu"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm\n\nHe is a second year student at Shuchi'in Academy and the president of the student council.\n\nMiyuki is a handsome young man with blond hair and blue eyes. Due to his constant sleep deprivation and nearsightedness, his eyes appear to glare. He usually wears the regular Shuchi'in Academy black male uniform adorned with the Aiguilette, the golden chain-like accessory around his neck. The Aiguilette symbolizes his authority as student council president.\n\nShirogane is a diligent student who, despite his underprivileged background, climbed his way to the top of his class through hard work and determination. Shirogane holds himself in high regard, consistently working to maintain his perfect image. He is textbook workaholic, enjoying his part-time job and often putting his own health at risk for the sake of his work. Due to his poor background, Shirogane values money greatly and goes to great lengths to not be wasteful, and generally dislikes expensive gifts.\n\n~!Miyuki's mother left his family when he was a child. Miyuki's father's factory was shut down and currently has no stable employment. They live in an apartment that costs ￥50,000 (Approx $450) a month. Due to this grisly past, he has been led to a lifestyle of part time jobs and hard work. He passed the Level 2 Kanji Kentei exam and has passed Grade Pre 1 on Eiken. He has also got second place on the National mock exam.!~\n\n~!Miyuki transferred into Shuchi'in Academy during his first year of high school on a scholarship. His first week was a disappointment in that a great majority of his peers were condescending to him because of transferring in. Miyuki was being recruited to serve as the new student council general affairs officer by the Previous Student Council President and helped clean up a swamp. There, he saw Kaguya Shinomiya saving a girl from drowning. It was at that moment where he was truly charmed by Kaguya. At the advice of fellow student council member Momo Ryuju, he adopted the confident genius personality he is shown to have at the story's beginning in order to attract her.!~\n\nEven though he is obviously in love with Kaguya Shinomiya, her wealth and talents greatly intimidates him, leaving him utterly terrified at the idea of confessing to her. He fears that all of his actions will lead Kaguya to look down him, causing him to overthink in many situations. Shirogane has never had a girlfriend and thus is actually quite clueless when it comes to romance, though his dignified demeanor leaves most of the students to think otherwise. Although he excels at studying, Shirogane has proven to be painfully talentless in a variety of other activities, such as sports, singing, dancing and more.\n\nDespite this, Shirogane is unwaveringly kind and virtuous, never putting any of his goals above the well-being of others. He is extremely supportive and generous, willing to help any students with their problems, and will put aside his quest to get Kaguya to confess if it even has a chance of hurting someone else.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": "2002-09-09"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b121101-Q8HzKP15At2d.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 121101
      },
      "rarity": "legendary"
    },
    {
      "id": "yuu-ishigami",
      "name": "Yuu Ishigami",
      "alt_names": [
        "石上優",
        "Captain",
        "Treasurer Ishigami",
        "Yu-kun",
        "Yu-chin"
      ],
      "role": "protagonist",
      "description": "The treasurer of the student council of the Shuchiin Academy. He's extremely valued by [Miyuki](https://anilist.co/character/121101), given that he single-handedly manages all the school's funds. He's also terrified of [Kaguya](https://anilist.co/character/120649), though no one else is sure why that is. Yuu keeps to himself and rarely speaks up, often getting into trouble when he does. He has a depressed outlook on life while having an inferiority complex. In contrast to his attitude, he is willing to help those in need and will sacrifice his pride if need be. Unlike his high school self, he had a much different outlook and demeanor during middle school.\n\nLater in the series: \n~!Ishigami develops a crush on Tsubame that he inadvertently confesses his feelings for her at the school's cultural festival. Ishigami does not realize that his actions were perceived as a confession by the rest of the student body and is therefore oblivious to the implications of having given Tsubame a heart-shaped gift (considered akin to a confession in Shuchiin tradition). After some convincing by Kaguya, Tsubame decides to seriously consider Ishigami's confession, with her original intention being to let him down as gently as possible. It isn't until Ishigami watches Tsubame's performance of the traditional play that gave rise to the aforementioned tradition that he realizes his actions had unintended meaning. Even then, Ishigami's thickheaded nature prevented him from recognizing the full meaning of his actions: a straight confession!~\n\n~!On the day of the third years' graduation ceremony, Tsubame finally has an answer for Ishigami's proposal. Despite Ishigami doing his best to convince Tsubame to accept him, Tsubame ultimately rejects Ishigami. Tsubame promises Ishigami that the two of them will remain friends and Ishigami sees her off with a smile and a gift of flowers. Afterwards, Ishigami breaks into tears, finally learning what heartbreak is like.!~",
      "metadata": {
        "gender": "male",
        "age": "15-16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b121102-tiQFxnSEIAwm.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 121102
      },
      "rarity": "legendary"
    },
    {
      "id": "chika-fujiwara",
      "name": "Chika Fujiwara",
      "alt_names": [
        "藤原千花",
        "Subject F",
        "Love Detective Chika",
        "Fortune Teller Chika",
        "Secretary Fujiwara"
      ],
      "role": "protagonist",
      "description": "The secretary of the Shuchiin Academy student council. She could not be predicted, her thoughts could not be read. A natural disaster who unconsciously threw everything into chaos simply by being present, also known as __Subject F__.\n\n~!In chapter 222 of the manga, Chika reveals that she played piano because she wanted to be perfect, and she becomes a prodigy at the piano. The expectations of her family and her fans rose, forcing her to practice more. She quit piano after Kaguya told her to just quit if she didn't like the piano. Soon after Chika challenged Kaguya to a game battle and if she won, she would get to become Kaguya's friend. In the end, she becomes Kaguya's first friend.!~",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b121103-UGLxT8utLPnq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 121103
      },
      "rarity": "legendary"
    },
    {
      "id": "miko-iino",
      "name": "Miko Iino",
      "alt_names": [
        "伊井野ミコ"
      ],
      "role": "protagonist",
      "description": "__Height:__ 147 cm (4'7\")\n\nShe is a freshman at Shuchiin Private Academy and the Auditor of the Student Council. Miko has a strong sense of justice and will correct others on what's right and wrong. Unfortunately, this led to her being bullied, though she still continues to uphold her idea of \"right\". She idolizes [Chika Fujiwara](https://anilist.co/character/121103), listening to anything she says, even if it's for Chika's enjoyment.",
      "metadata": {
        "gender": "female",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b125886-TQbmqAaSgBLS.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 125886
      },
      "rarity": "legendary"
    },
    {
      "id": "narrator",
      "name": "Narrator",
      "alt_names": [
        "ナレーター",
        "語り手",
        "ナレーション",
        "Narrador",
        "Rozprávač",
        "Vyprávěč",
        "Dış ses",
        "Narratore",
        "Pripovjedač",
        "Narradora",
        "Рассказчик",
        "Người dẫn chuyện",
        "Tagapagsalaysay",
        "내레이터",
        "Narratore",
        "Erzählperson",
        "מספר",
        "Narrátor",
        "讲述人",
        "راوي",
        "Forteller",
        "Berättare",
        "Αφηγητής",
        "Narrateur",
        "なれーしょん",
        "旁白",
        "Narrato"
      ],
      "role": "supporting",
      "description": "This character page is set to represent and list all narrators, which haven't been given a visual representation of themselves in their respective work. \n\nPlease add other narrator characters, which were given a visual representation of themselves, separately from this narrator page.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b36309-6KM0riV4lqfN.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 36309
      },
      "rarity": "epic"
    },
    {
      "id": "ai-hayasaka",
      "name": "Ai Hayasaka",
      "alt_names": [
        "早坂愛",
        "Haysaca A. Smith",
        "Haysaca A. Smithee",
        "Herthaka",
        "Smithee A.",
        "Rat"
      ],
      "role": "supporting",
      "description": "Ai Hayasaka is a second-year student at Shuchiin Academy and a valet of the Shinomiya family. She is a member of the Hayasaka family, who have served the Shinomiya family for generations, gaining their trust.\n\nHaving been personally assigned to enter Shuchiin Academy with her, Ai supports [Kaguya Shinomiya](https://anilist.co/character/120649) in her high school life and has been a part of Kaguya's life for ten years. Because of their close relationship, Ai is one of the few people around to which Kaguya's amiability is not an act.\n\nEven if she demonstrates maturity as a valet, Ai still has the concerns of a young girl, such as caring to be in fashion and going out with friends, even if she does not have much time for herself due to work.\n\nAi helps Kaguya with the struggles about her feelings for [Shirogane](https://anilist.co/character/121101).\n\n~!She later leaves her job as a maid to Kaguya but still continues her friendship.!~\n\n~!In the Doujin-ban universe, she starts dating and later gets engaged to Shirogane!~",
      "metadata": {
        "gender": "female",
        "age": "17-18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b121104-7TYRl3EEsDYU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 121104
      },
      "rarity": "epic"
    },
    {
      "id": "kei-shirogane",
      "name": "Kei Shirogane",
      "alt_names": [
        "白銀圭"
      ],
      "role": "supporting",
      "description": "Kei Shirogane is [Miyuki Shirogane](https://anilist.co/character/121101)'s little sister. She attends Shuchiin middle school and is the treasurer for the middle school student council.\n\nShe is a hard worker just like her brother and can be very prideful at times. She also inherited his sense of righteousness and hates it when someone doesn't do the right thing in a given situation. Like her brother, she likes helping out those who are in trouble even if it means going out of her way to do it. Since she grew up in a family that places emphasis on saving money, she normally carries coupons and works hard for the things she wants to buy. \n\nShe developed a prickly attitude towards her brother due to his over protectiveness. She's also entered a rebellious phase and due to her pride and she cannot get herself to have a lighthearted conversation with Miyuki, leading into the similar mind games that Miyuki and [Kaguya](https://anilist.co/character/120649) play against each other, but her objective is to talk to Miyuki without making it look like she has a brother complex. She rarely speaks and most of the time it is only when she exchanges formalities at school or when she hurls abuses at her brother.",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126144-4fc2sYUVFKOJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126144
      },
      "rarity": "epic"
    },
    {
      "id": "erika-kose",
      "name": "Erika Kose",
      "alt_names": [
        "巨瀬工リカ"
      ],
      "role": "supporting",
      "description": "She is a member of the mass media club at Shuchi'in Academy.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126986-Pcspig2orfPq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126986
      },
      "rarity": "epic"
    },
    {
      "id": "karen-kino",
      "name": "Karen Kino",
      "alt_names": [
        "紀かれん"
      ],
      "role": "supporting",
      "description": "She is a member of the mass media club at Shuchi'in Academy.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126987-sWw4vqsdHNWe.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126987
      },
      "rarity": "epic"
    },
    {
      "id": "tsubame-koyasu",
      "name": "Tsubame Koyasu",
      "alt_names": [
        "子安つばめ"
      ],
      "role": "supporting",
      "description": "Tsubame is a third-year student who is vice-captain of the cheer squad and a rhythmic gymnast. She is very popular. She encourages [Yuu](https://anilist.co/character/121102) in the cheering activities.",
      "metadata": {
        "gender": "female",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b134326-GOZE06QSlJSb.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 134326
      },
      "rarity": "epic"
    },
    {
      "id": "tsubasa-tanuma",
      "name": "Tsubasa Tanuma ",
      "alt_names": [
        "田沼翼",
        "Kashiwagi's Boyfriend"
      ],
      "role": "supporting",
      "description": "He is a student in Shuchi'in highschool and always asks [Miyuki Shirogane](https://anilist.co/character/121101) for advice about love. [Kashiwagi](https://anilist.co/character/134330)'s boyfriend.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b134327-5tqYKvBaqRe2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 134327
      },
      "rarity": "epic"
    },
    {
      "id": "maki-shijo",
      "name": "Maki Shijo",
      "alt_names": [
        "四条眞妃",
        "Tsundere-senpai"
      ],
      "role": "supporting",
      "description": "Maki is a classmate and friend of [Nagisa](https://anilist.co/character/134330). She has short hair styled in short pigtails. She is friends with Nagisa and is secretly jealous of Nagisa's relationship with her boyfriend, as she too liked Kashiwagi's Boyfriend, but could not confess before. As a branch member of the Shinomiya clan, she is [Kaguya](https://anilist.co/character/120649)'s second cousin twice removed so she sometimes refers to Kaguya as \"Auntie\". [Miyuki](https://anilist.co/character/121101) and [Yuu](https://anilist.co/character/121102/Yuu-Ishigami) observe she acts very tsundere (cold on the outside but wanting to be affectionate), and similar to Kaguya in personality. She declares Yuu and Miyuki as her friends, due to their support in helping her process her failed romance, much to Kaguya's horror",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b134328-s3cEgqb5MEbh.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 134328
      },
      "rarity": "epic"
    },
    {
      "id": "moeha-fujiwara",
      "name": "Moeha Fujiwara",
      "alt_names": [
        "藤原萌葉"
      ],
      "role": "supporting",
      "description": "Moeha is [Chika](https://anilist.co/character/121103)'s little sister who is in junior high. She is the student council vice-president at the junior high. She admires [Miyuki](https://anilist.co/character/121101) as well and hopes to confess someday. She has a habit of voicing dark ideas, which unnerve [Kaguya](https://anilist.co/character/120649) a great deal.",
      "metadata": {
        "gender": "female",
        "age": "14",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b134329-cRdrf5BqmIVk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 134329
      },
      "rarity": "epic"
    },
    {
      "id": "nagisa-kashiwagi",
      "name": "Nagisa Kashiwagi",
      "alt_names": [
        "柏木渚"
      ],
      "role": "supporting",
      "description": "Nagisa is a classmate who occasionally asks [Kaguya](https://anilist.co/character/120649) about what to do in her relationships. [Tsubasa](https://anilist.co/character/134327)'s girlfriend.",
      "metadata": {
        "gender": "female",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b134330-2b7ad7GPw1Wl.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 134330
      },
      "rarity": "epic"
    }
  ],
  "updated_at": "2025-12-23T23:00:24.639Z"
}