{
  "work_id": "20th-century-boys",
  "count": 31,
  "characters": [
    {
      "id": "kenji-endou",
      "name": "Kenji Endou",
      "alt_names": [
        "遠藤健児",
        "Bob Lennon"
      ],
      "role": "protagonist",
      "description": "Endo Kenji grew up in late-1960s/early-1970s Japan, at a time when American phenomena, notably the space race and the era of Woodstock, were resounding around the world.  An avid reader of manga who often saw apocalyptic scenarios playing out, he always responded with the cry of \"I would fight\".  During this time, he and his friends made up a scenario for world conquest in order to play heroes.  Flash forward to 1997, when Kenji has taken charge of his family liquor shop, and turned it into a convenience store.  He is now raising the daughter of his sister, Kiriko (who disappeared immediately after leaving her daughter to Kenji), and living a fairly ordinary life.  However, after events from the prophecy he made up earlier begin to come true, he learns of an evil organization, led by a masked man called \"Friend\", which is using his plans to conquer the world.  As the organization's hold on the government strengthens, he becomes a wanted man and lives on the streets, continuing to (covertly) oppose Friend on the streets, partially through terrorism and partially through a protest song he wrote (named \"Bob Lennon\"), until  ~!he apparently dies trying to stop an exploding giant robot, just after seeing Friend's unmasked face.!~   ~!He survives however, although we do not know of any of his actions prior to meeting Damian Yoshida, gutarist of the Thriller band the Eroim Esseims, in 2014 at a crossroads and subsequently teaching him how to play \"Bob Lennon\".  It appears that he may have been suffering from amnesia at this time, as he identified himself as the devil (in a reference to the real life Blues  legend of Robert Johnson, said to have influenced rock 'n' roll.)  He then continued to wander Japan until the third year of Friend era (era in which Friend was declared president of the world), when a sudden surge of memory causes him to recall his identity.  While heading to Tokyo, he meets up with old friend Konichi, now a radio DJ, who, oblivious to Kenji's true identity, records his song  (a version of \"Bob Lennon\" with modified lyrics) and subsequently broadcasts it on radio.  As Kenji makes his way past border guards now under Friend's control, using charisma and song, he gains more and more of a following.  Once he reaches Tokyo, he confronts Friend and watches him and another old friend, Sada Kiyoshi, die together in an explosion.  Finally, he reunites with his old friends and niece, and there the story ends. !~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b3442-QdMHJOKv2Xos.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3442
      },
      "rarity": "epic"
    },
    {
      "id": "chouji-ochiai",
      "name": "Chouji Ochiai",
      "alt_names": [
        "落合長治",
        "Otcho",
        "Shogun"
      ],
      "role": "protagonist",
      "description": "A childhood friend of Kenji's who created the \"Friend\" symbol and became a salaryman. Later traveled to Tibet and Thailand after his son died, at which point he gets involved in the dealings of the \"Friend\" group.  長治 is sometimes misread as \"Nagaharu\" but his first name is Chouji.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6004-wCseNjnRhze8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6004
      },
      "rarity": "epic"
    },
    {
      "id": "kanna-endou",
      "name": "Kanna Endou",
      "alt_names": [
        "遠藤カンナ",
        "Child of Destiny"
      ],
      "role": "protagonist",
      "description": "Kenji's niece, she serves as the protagonist for the events in the aftermath of the \"Bloody New Year's Eve\". She is shown to have ESP at an advanced level, and is capable of predicting the future (To a small extent), bend spoons with her mind, and even once strangled a woman without touching her (in a fit of emotional rage). She loves rock&amp;roll, due to Kenji's obsession with it. She idolizes Kenji despite what the rest of the world thinks of him, and is also quite skilled at the guitar. She lives by herself in a low-rent apartment and works part-time at a small noodle shop in the middle of Thai/ Chinese Mafia territorium.\n\n~!She is daughter of [Kiriko Endou](https://anilist.co/character/29789/Kiriko-Endo) and \"Friend\" [(Fukubei Hattori)](https://anilist.co/character/21461/Fukubei-Hattori).!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": "1997-01-01"
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b9730-TxluI1UEBU7z.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 9730
      },
      "rarity": "epic"
    },
    {
      "id": "tomodachi",
      "name": "Tomodachi",
      "alt_names": [
        "ともだち",
        "Friend"
      ],
      "role": "protagonist",
      "description": "The main antagonist of the series. An enigmatic cult leader who, in 1997, began using the symbol Kenji and his friends put together in the 1970s. His followers have filled venues such as the Budokan.One of his goals is to take over the world. His face is hidden in shadow throughout the series; he even confronts Kenji by wearing a mask. His true identity is one of the driving mysteries of the series. As of 2000, the Friendship Democratic Party (FDP) is established as a political group with government representatives such as Manjome Inshu.   \n\n~!Over the course of the series, two people assume the identity of Friend: Fukubei, who is one of Kenji's schoolmates, initially appears to be one of Kenji's allies, and Katsumata, another of Kenji's schoolmates, the latter of whom possesses special powers.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/14314.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14314
      },
      "rarity": "epic"
    },
    {
      "id": "yukiji-setoguchi",
      "name": "Yukiji Setoguchi",
      "alt_names": [
        "瀬戸口ユキジ"
      ],
      "role": "supporting",
      "description": "The only female member of Kenji's original group of friends, and also the strongest physically.  Yukiji currently (at the beginning of the story) serves as a drug dog handler for Narita Airport.  Takes care of Kanna in the year 2014.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b7271-KUHwm99LY43L.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 7271
      },
      "rarity": "uncommon"
    },
    {
      "id": "kyuutarou-kaminaga",
      "name": "Kyuutarou Kaminaga",
      "alt_names": [
        "神永球太郎",
        "Kamisama (神様)",
        "God"
      ],
      "role": "supporting",
      "description": "Kamisama is the nickname of a homeless old man who is bent on the return of ten-pin bowling as a major sport in Japan. Kamisama has the power of foresight and can see what will happen before it comes to pass.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8116-O9ZZj9EYrEFq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8116
      },
      "rarity": "uncommon"
    },
    {
      "id": "yoshitsune-minamoto",
      "name": "Yoshitsune Minamoto",
      "alt_names": [
        "皆本ヨシツネ",
        "Genji Ippa (ゲンジ一派)"
      ],
      "role": "supporting",
      "description": "Yoshitsune is a childhood friend of [Kenji Endou](https://anilist.co/character/3442/Kenji-Endou). He was part of Kenji's Youth Group and later Kenji's Group.\n\nAs a child, Yoshitsune was very shy and often forgot about by his friends. During adulthood, for his job, he made the mistake of ordering 1000 printer cartridges when he only needed four, and while wondering what he was supposed to do, he received a text from Kenji asking him to come fight against Friend.\n\n~!He managed to survive the Bloody New Year's Eve and from there lived as a custodian at Tomodachi Land, trying to learn more about it and eventually coming to help [Kyoko Koizumi](https://anilist.co/character/38517/Kyoko-Koizumi) escape where he again gets himself involved with his former colleagues.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b20072-XbBJ07We3l6t.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 20072
      },
      "rarity": "uncommon"
    },
    {
      "id": "fukubei-hattori",
      "name": "Fukubei Hattori",
      "alt_names": [
        "服部フクベエ"
      ],
      "role": "supporting",
      "description": "Fukubei is one of Kenji's childhood friends, but he barely remembers him at the class reunion. He lives with his three children and wife, who happens to be the member of the \"Friend's\" cult. Later, he decides to join Kenji to save the world    ~! It is revealed that Fukubei was the first \"Friend.\"!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b21461-g4aMXr9l12QD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 21461
      },
      "rarity": "uncommon"
    },
    {
      "id": "maruo",
      "name": "Maruo",
      "alt_names": [
        "マルオ",
        "Maruko Bashi",
        "丸尾"
      ],
      "role": "supporting",
      "description": "Childhood friend of Kenji's, stays bests friends with him even as an adult. As a child he was part of the founding members of the secret base group. As an adult he is married with a son and manages \"The Fancy Shop\" a store for high school girls.  Source: 1st chapter of 20th century boys",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b26415-UscLxuyXVpbD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 26415
      },
      "rarity": "uncommon"
    },
    {
      "id": "sada-kiyoshi",
      "name": "Sada Kiyoshi",
      "alt_names": [
        "佐田清志"
      ],
      "role": "supporting",
      "description": "Kenji's classmate who wasn't part of the original gang. As a child, he often wears a mask, but was bullied a lot in school and eventually left after a semester, thus his face remains unknown to most of the gang.    ~!However, Fukubei meets with him and Sadakiyo asks if he can be his friend. He later joins the Friends and is the caretaker of Friend's replica childhood home. He becomes the English teacher of Kyoko Koizumi and takes her to the Friend's home, where he begins to realize that maybe he wasn't doing the right thing after all, and ends up burning the home, and taking Kyoko to meet his old teacher at the senior center. He supposedly dies in a fiery car crash while Kyoko and the gang escape, but appears in 3FE with his mask on as he tries to hold off Friend. !~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27225-QpEecsXnRXN9.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27225
      },
      "rarity": "uncommon"
    },
    {
      "id": "kiriko-endou",
      "name": "Kiriko Endou",
      "alt_names": [
        "遠藤貴理子",
        "キリコ"
      ],
      "role": "supporting",
      "description": "Kiriko is Kenji's older sister and Kanna's mother. For the vast majority of the manga, Kiriko is only seen in flashbacks, where she is shown to have a strong sense of justice and an interest in biology. She was also an important mother figure for Kenji during his youth, often taking him places or getting him presents and helping him out (like when he was hospitalized due to a motorcycle accident or when she got him an electric guitar).   \n\n~!Fukubei researched Kiriko's romance with Moroboshi and after he had him killed, began courting Kiriko in the same way as Moroboshi (i.e. using his words). His goal appeared to be to encourage her to fulfill her dream of studying microbiology and use her expertise to create the deadly virus. When Kiriko realized that Fukubei was creating a cult around himself, she gave the police everything she knew about him and left her child, Kanna with Kenji and their mother. Unfortunately, the detective she gave it to was Yama and he had already defected to friend at the time, so her evidence was destroyed. Kiriko then went to see Yamane and convinced him about Fukubei's true intentions. Upon realizing how deadly the new virus that Yamane made was, she decided to spend all her time and effort making a vaccine.  Kiriko feels extremely guilty over her involvement in the creation of the virus, as such she has spend most of her time trying to out-maneuver Friend and create a vaccine that would be distributed to everyone. As a last gamble in Friend year 3, Kiriko exposes herself to the next generation of the virus to test out her own vaccine. Fortunately the vaccine works and Kiriko survives.!~\n\n~!In 21st Century Boys, Kiriko seems to be working in some African country as a volunteer doctor. Kanna and Chouno come to see her, and daughter and mother finally reunite.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29789-cOM1CFMGaF0I.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29789
      },
      "rarity": "uncommon"
    },
    {
      "id": "shouhei-chouno",
      "name": "Shouhei Chouno",
      "alt_names": [
        "蝶野将平",
        "Cho"
      ],
      "role": "supporting",
      "description": "Chono is the grand-son of the \"legendary\" Inspector Cho. The latter was murdered by his colleague, Yama, in 1997, because he had discovered the identity of his friend and projects.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b34846-z2KDwk96BZ1g.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 34846
      },
      "rarity": "uncommon"
    },
    {
      "id": "manjoume-inshuu",
      "name": "Manjoume Inshuu",
      "alt_names": [
        "万丈目胤舟"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b38515-sTwTG2KY7jkL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38515
      },
      "rarity": "uncommon"
    },
    {
      "id": "kyoko-koizumi",
      "name": "Kyoko Koizumi",
      "alt_names": [
        "小泉響子"
      ],
      "role": "supporting",
      "description": "Kyoko is a high school girl that attends the same school as Kanna. For a history assignment, she impulsively picks Bloody New Year's Eve, but when she starts doing some research, she meets [Kamisama](https://anilist.co/character/8116/Kyuutarou-Kaminaga)'s and learns the truth of what happened that night.\n\n~!She is suddenly recruited to participate in Tomodachi Land where she must abide by the Friend's cult activities or risk being sent to Tomodachi Land. She struggles with her survival until she meets [Yoshitsune](https://anilist.co/character/20072), who helps her get through the exam in exchange for uncovering more information on the identity of Friend. In 3 FE, Kyoko discovers that she has a talent for bowling and is heavily recruited by Kamisama.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b38517-n5kpQXOpS9md.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38517
      },
      "rarity": "uncommon"
    },
    {
      "id": "sanae",
      "name": "Sanae",
      "alt_names": [],
      "role": "supporting",
      "description": "A strong mind young woman of the age of Friend Era. Sanae&#039;s skeptical about &quot;friend&quot; and the whole conspiracy. She along with her brother saved Otcho.     Source: Classic Manga",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/38519.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 38519
      },
      "rarity": "uncommon"
    },
    {
      "id": "masaaki-shimon",
      "name": "Masaaki Shimon",
      "alt_names": [
        "子門真明",
        "Mon-chan (モンちゃん)"
      ],
      "role": "supporting",
      "description": "Masaaki Shimon, also known as Mon-chan was part of [Kenji](https://anilist.co/character/3442/Kenji-Endou)'s circle of friends during his childhood. In 1969, he and his friends built their own secret base. They built this on a large field.\n\nHe moved to Germany and became a rugby player before retiring to take care of his ailing mother. After her passing, he started his own business with a partner.\n\n~!He returns to Japan to attend [Donkey](https://anilist.co/character/82557/Sabur-Kido)'s funeral, and later answers Kenji's call to arms on Bloody New Year's Eve. Mon-chan survives the event, but prior to this, he was diagnosed with a terminal illness. He is later seen hospitalized in 2002 due to his disease.!~\n\n~!In 2002, Mon-chan was already seriously ill and in the hospital. He was visited by [Yukiji](https://anilist.co/character/7271/Yukiji-Setoguchi), to whom he showed the information he has collected while investigating the Friend. Shortly after, Mon-chan suddenly leaves the hospital with no warning and disappears, which is later revealed to have been to contact [Sadakiyo](https://anilist.co/character/27225/Sada-Kiyoshi) in an attempt to investigate further, not knowing Sadakiyo's involvement with Friend. Sadakiyo kills him on behalf of the Friend, taking the information he has gathered.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82553-MSRT1WSnqc1k.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82553
      },
      "rarity": "uncommon"
    },
    {
      "id": "yuuichi-imano",
      "name": "Yuuichi Imano",
      "alt_names": [
        "今野裕一",
        "Konchi"
      ],
      "role": "supporting",
      "description": "Childhood friend of Kenji and his band, Konchi is a character who is very present in the flashbacks of the 70s, but which is secondary because we never see adulthood. We know he was part of the band child and he was close to Kenji and others. However, he moved in his last year at primary school and went to live in Hokkaido, that is what explains why one sees so little.  In 2000, he received a letter of Kenji who asked for his help but Konchi does not meet his childhood friend ... and it seems to regret in the year 3 Ami. It is indeed this year we (re) discover this character, which broadcasts the song Kenji loop on the radio from his position of Hokkaido.   ~!It appears to us under the identity of a mysterious DJ, and we discover in Volume 21 his real identity. He lives alone since 2015 and let go of the second virus is obviously look reminiscent of the 1970s and the peace and love movement. We know that Kenji met during this trip through Japan. It is also at this meeting that he heard the song and decided to spread. But he did not recognize Kenji this time, which is understandable since they had not seen since childhood ...!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82555-ffR6IFQFdYmC.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82555
      },
      "rarity": "uncommon"
    },
    {
      "id": "saburo-kido",
      "name": "Saburô Kido",
      "alt_names": [
        "木戸三郎",
        "Donkey"
      ],
      "role": "supporting",
      "description": "In 1997, Donkey became a teacher in a technical school. Married and father of a boy, he lost almost all contact with his old friends. It investigates a little too close to Friend, and sends letters to Kenji about it and it will lead to his assassination by Masao and another henchman of Friend. His death is the starting point for the investigation of Kenji, equally shocked and saddened his friends Donkey's death.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82557-0KGD3637dTj6.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82557
      },
      "rarity": "uncommon"
    },
    {
      "id": "keitarou-fukuda",
      "name": "Keitarou Fukuda",
      "alt_names": [
        "福田啓太郎",
        "Keroyon (ケロヨン)"
      ],
      "role": "supporting",
      "description": "[Kenji](https://anilist.co/character/3442/Kenji-Endou)'s childhood friend nicknamed Froggy. He has been hiding out in America when he discovers that Kanna's mother has gone there to try to manufacture the vaccine for the outbreak of 2015.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82559-3AGaNU5c7bFu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82559
      },
      "rarity": "uncommon"
    },
    {
      "id": "yamane",
      "name": "Yamane",
      "alt_names": [
        "山根"
      ],
      "role": "supporting",
      "description": "[Kenji](https://anilist.co/character/3442/Kenji-Endou)'s classmate and friend of [Fukubei](https://anilist.co/character/21461/Fukubei-Hattori) and [Sadakiyo](https://anilist.co/character/27225/Sada-Kiyoshi). He became a bacteriologist that worked with [Kiriko](https://anilist.co/character/29789/Kiriko-Endou).\n\n~!He was responsible for developing the deadly viruses that are unleashed by Friend, while [Kiriko](https://anilist.co/character/29789/Kiriko-Endou) was tasked with developing their vaccines.!~\n\n~!Feeling guilty for his actions after being visited by [Kiriko](https://anilist.co/character/29789/Kiriko-Endou), he decided to kill [Fukubei](https://anilist.co/character/21461/Fukubei-Hattori).!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82563-BWW81QEgpjx8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82563
      },
      "rarity": "uncommon"
    },
    {
      "id": "masao-tamura",
      "name": "Masao Tamura",
      "alt_names": [
        "田村マサオ",
        "Number 13"
      ],
      "role": "supporting",
      "description": "In 1997, Masao was a passionate member of Friend's cult since its early days. He was first shown dancing in his underpants, performing his \"morning healing aerobics\" while listening to Friend's \"healing CD\"; his room was also seen with various Friend posters, and he owns Friend t-shirts. Later on, he \"purified\" Pierre Ichimonji, a leader of a rival cult, once again showing his fanaticism and obsession towards Friend.\n\n~!It is discovered later that Masao was an alumni of Musashiyama Technical School, the institution [Donkey](https://anilist.co/character/82557/Sabur-Kido) teached at. He was also shown to be an accomplice in Donkey's murder.!~\n\n~!In 2014, Masao was incarcerated for an unknown reason in Umihotaru Prison, the same place that held [Otcho](https://anilist.co/character/6004/Chouji-Ochiai), under the registration number \"13\". He acted as a preacher in the prison. Later he was released and became Friend's top hitman.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82565-qQb9X1OotjfD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82565
      },
      "rarity": "uncommon"
    },
    {
      "id": "the-assassin",
      "name": "The Assassin",
      "alt_names": [
        "殺し屋",
        "The Killer"
      ],
      "role": "supporting",
      "description": "The Assassin (real name unrevealed) is one of Friend's assistants.\n\n~!He is the one who pushed Moroboshi, [Kiriko](https://anilist.co/character/29789/Kiriko-Endo)'s beloved one, in front of a train and caused his death to let the \"Friend\" [(Fukubei Hattori)](https://anilist.co/character/21461/Fukubei-Hattori) be with her. He also lured [Dr. Shikishima](https://anilist.co/character/82577/Shikishima)'s daughter, [Lena Shikishima](https://anilist.co/character/82575/Lena-Shikishima), into being his girlfriend and to be under Friend's command, so that Dr. Shikishima would create the first Robot for him.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82571-YVcJ0KSEORGq.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82571
      },
      "rarity": "uncommon"
    },
    {
      "id": "yanbo-and-mabo",
      "name": "Yanbo and Mabo",
      "alt_names": [
        "ヤン坊・マー坊"
      ],
      "role": "supporting",
      "description": "Children, twins Yanbo and Mabo martyred Kenji and his friends. Being overweight and strength gave them the advantage. The only person able to defeat was Yukiji; twins were green with rage to be beaten, let alone a girl ... These are Yanbo and Mabo Maruo forced to destroy the secret base, they knew the terms of predictions.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82573-0D37ohnLdEvL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82573
      },
      "rarity": "uncommon"
    },
    {
      "id": "lena-shikishima",
      "name": "Lena Shikishima",
      "alt_names": [
        "敷島教授の娘"
      ],
      "role": "supporting",
      "description": "[Dr. Shikishima](https://anilist.co/character/82577/Shikishima)’s daughter.\n\n~![The Assassin](https://anilist.co/character/82571/The-Assassin) lured her into being his girlfriend and to be under Friend's command, so that Dr. Shikishima would create the first Robot for him.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82575-qCqr1ilIa6n2.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82575
      },
      "rarity": "uncommon"
    },
    {
      "id": "hiroshi-shikishima",
      "name": "Hiroshi Shikishima",
      "alt_names": [
        "敷島",
        "敷島教授",
        "Professor Shikishima"
      ],
      "role": "supporting",
      "description": "Hiroshi Shikishima is [Lena](https://anilist.co/character/82575)'s father and a professor. He is knowledgeable in the field of robotics.\n\n~!Because The Assassin \"dated\" his daughter, [Lena](https://anilist.co/character/82575)'s, Friend's cult has the leverage to get the professor to do so against his will. Shikishima however, seems attached to his creation, calling it his child, his son.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82577-hAULp1ThEsmU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82577
      },
      "rarity": "uncommon"
    },
    {
      "id": "katsumata-tadanobu",
      "name": "Katsumata Tadanobu",
      "alt_names": [
        "勝俣忠信",
        "カツマタ"
      ],
      "role": "supporting",
      "description": "A friend of [Fukubei](https://anilist.co/character/21461/Fukubei-Hattori)'s who often wore a double of the same mask [Sadakiyo](https://anilist.co/character/27225/Sada-Kiyoshi) wore.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b82589-3Ae4Qf3wDqQ5.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 82589
      },
      "rarity": "uncommon"
    },
    {
      "id": "haru-namio",
      "name": "Haru Namio",
      "alt_names": [
        "春波夫",
        "Haru-Namio",
        "Charlie"
      ],
      "role": "supporting",
      "description": "A singer who became the best known national artist of Japan after composing the massive hit song «Hello- Hello». He is famous for endorsing Friend's figure and political party with the messages​ of his music. Could there be anything else to his lyrics, hidden beneath their cheerful surface?",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b144088-rUBZ5f182dDt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 144088
      },
      "rarity": "uncommon"
    },
    {
      "id": "mitsuyo-takasu",
      "name": "Mitsuyo Takasu",
      "alt_names": [
        "高須光代"
      ],
      "role": "supporting",
      "description": "Takasu is the authoritarian leader of the Dream Navigators from Tomodachi Land.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b263499-DRgUPt6ZrPo8.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 263499
      },
      "rarity": "uncommon"
    },
    {
      "id": "kakuta",
      "name": "Kakuta",
      "alt_names": [
        "角田"
      ],
      "role": "supporting",
      "description": "A manga artist who got arrested for violation of the \"New Youth Protection Guidelines\".\n~!Later escapes from the prison together with [Otcho](https://anilist.co/character/6004/Chouji-Ochiai).!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b300419-vOIKhfRyRUvO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 300419
      },
      "rarity": "uncommon"
    },
    {
      "id": "chousuke-igarashi",
      "name": "Chousuke Igarashi",
      "alt_names": [
        "五十嵐長介",
        "Chou-san",
        "Cho"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b319486-jpG289HJE8qX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 319486
      },
      "rarity": "uncommon"
    },
    {
      "id": "moroboshi",
      "name": "Moroboshi",
      "alt_names": [],
      "role": "minor",
      "description": "Moroboshi was [Kiriko's](https://anilist.co/character/29789/Kiriko-Endo) beloved one. He had to travel to work in another country, but also left a plane ticket for Kiriko so that she can come and meet him.\n\n~!Unfortunately, when he waited for a train to travel to the airport, [The Assasin](https://anilist.co/character/82571) pushed him against a train, cause him to be hit by a train and died. After that, the [first Friend](https://anilist.co/character/21461/Fukubei-Hattori) came into Kiriko's life and then be her husband.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b326603-a3ZO2q3Wi9MT.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 326603
      },
      "rarity": "common"
    }
  ],
  "updated_at": "2025-12-23T21:58:47.387Z"
}